[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Fantastic Employer", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "31 May 2023", "job_title": "Administration in Tucson, AZ", "duration": "N/A", "pros": "I appreciate Pima so much! 2022 was a hard year, but we are working hard behind the scenes to get everything back on track, and it's working! My co-workers are my family, and I truly love coming to work every day.", "cons": "No real cons, just be prepared to work hard!"}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": "N/A", "review_title": "PMI Clinical Director", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "12 May 2023", "job_title": "Clinical Director in Las Vegas, NV", "duration": "N/A", "pros": "Supportive administration, thorough regulatory support, generally a great place to work as long as your program is succeeding and enrollments are high. PMI contributes to employee HSAs (max of $40/month), an uncommon practice for most employers.", "cons": "Health benefits are marginal at best and rather expensive. Insurance premiums increased by 14% this year. (HDHP with HSA plan, for reference.) Pharmacy benefits are absolutely useless - I'd save more money being uninsured. With PMI's 2022 pharmacy benefit manager I paid ~$50/month for my prescription. 2023 pharmacy benefit manager switched to CVS Caremark to \"lower costs\", and my prescription now costs $108/month for a medication with a retail price of $131 - total of a whopping $23 savings, despite it being a generic medication provided by CVS (obviously an in-network pharmacy.) I will never meet my $2500 deductible to benefit from any potential savings unless I experience an emergency. Communication was sparse regarding this change when it came time for open enrollment; employees were told to simply \"check the pharmacy formulary\" which provides misleading and inaccurate pricing estimates without specific plan and membership information, making it impossible to actually make a decision on benefits enrollment that would save money at the end of the day. I went from paying $600/year in prescriptions now to $1300/year with the exact same insurance plan, at a 14% increase in premium cost."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Bad Experience", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Jun 2023", "job_title": "Medical Assistant Instructor in Houston, TX", "duration": "N/A", "pros": "The students were open minded and very willing to learn", "cons": "The staff was disengaged. The staff did not have the students best interest in mind and were very unorganized. The students were not being taught correctly. and were being rushed through. It was not a good environment as the current staff did not want to assist the incoming new hires."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 4, "Diversity and Inclusion": 0, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "2023 will be a transition year for PMI", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "2 Feb 2023", "job_title": "Human Resources Coordinator in Tucson, AZ", "duration": "N/A", "pros": "In my time working here, I met some of the most amazing people I have ever worked with. The majority of the staff and faculty truly care about the students and each other and want to make Pima Medical a great place to be. A lot of the traditional values from the Luebke family are still there. The more the company grows, the more the culture has to adjust for that large of a business. This is an adjustment period. There will be some growing pains, but PMI has a strong foundation of 50 successful years! The new CEO is going to do wonderful things in due time.", "cons": "Top heavy current senior management is non inclusive to line level employees. Old fashioned business model. The world has changed since the pandemic, PMI leadership needs to progress in the area of work/life balance. As with any company, the location you work at will determine your experience."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "31 May 2023", "job_title": "Instructor in Chula Vista, CA", "duration": "N/A", "pros": "Love to be able to impact the lives of many, the institution has great values and treat employees with respect and appretiation.", "cons": "I don't have any cons at this time"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Growing Pains", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "14 May 2023", "job_title": "Instructor in Albuquerque, NM", "duration": "N/A", "pros": "Encouragement of diversity in both staff and students Great efforts to ensure that all students feel safe at school", "cons": "Leadership is hands off and doesn't show much initiative to understand how education works. Recent loss of previously well staffed departments with little communication around efforts to restaff such critical resources. Growing sense of sales"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Currently restructuring", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "5 May 2023", "job_title": "Program Director in Tucson, AZ", "duration": "N/A", "pros": "ESOP and very knowledgeable co-workers. Some of the top management have been in there jobs for years and can help you in a variety of ways.", "cons": "They still use BlackBoard along with tons of outdated systems. Has not moved fast enough to keep up with competition."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "It has been a great experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 Nov 2022", "job_title": "Anonymous Employee in Albuquerque, NM", "duration": "N/A", "pros": "Leadership is supportive and encourages growth. The campus environment is fun and colleagues are pleasant and keep each other's morale up. Times can be tough (just like in any job) but I have always felt safe to express when something isn't working. Our campus leadership makes me felt heard, but I also understand that they too have limits to what they can \"fix\" and how quickly. In reviewing some of the comments made previously I think it's ridiculous to try and hold one person accountable for company-wide issues. We are a TEAM and I recognize that as a campus/corporation, we can either make it happen, or break it. Tough times make tough people. You work in an employee owned company, then take ownership for your part.", "cons": "Cons- I can't think of any. In a perfect world we would be able to have endless funds. In the meantime, I will keep being creative and do my part to keep our classrooms alive with fun ways of learning."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Trusted. Respected. Preferred.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Nov 2022", "job_title": "Clinical Director in Albuquerque, NM", "duration": "N/A", "pros": "Amazing faculty and staff. ESOP benefits are outstanding. Communication between programs is second to none. Great, updated facilities. Too many to list.", "cons": "The only con I see is the way the community views Pima. Yes, we are a for profit school, but because of that, we make sure to go above and beyond what is expected of your typical community college. Examples: offering open labs and review sessions to students during free time, volunteering our time to assist with other program's skills competencies, etc. I have lots of Pima pride, and I want the community to recognize that we produce the highest quality students/employees. So again, we are for profit, but we are also for our students, for our patients, and for improving the lives of those who decide to walk through our doors."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Adjunct instructor", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "7 May 2023", "job_title": "Adjunct Instructor in Las Vegas, NV", "duration": "N/A", "pros": "Flexible work hours, no administrative duties", "cons": "No health benefits, or PTO"}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Losing great staff - company going down hill", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "24 Mar 2023", "job_title": "Administrative in Tucson, AZ", "duration": "N/A", "pros": "There were a lot of pros at one time, but now I struggle to find them.", "cons": "Was once a great company with strong family values, is no more. Losing great employees left and right because of favoritism and failure to look at the bigger picture. Training is terrible. Appreciate is almost non existent anymore. Peers are allowed to bully because of length of service. I can go on and on."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Dec 2022", "job_title": "Faculty in Albuquerque, NM", "duration": "N/A", "pros": "It’s been a great experience. Faculty is supported by program directors and management. Benefits are great. Even in hard times the company still works hard to do fun things for employees. The faculty and staff are amazing. Everyone works hard to make sure our students, regardless of department, are set up for success. And at the end of the day I thoroughly enjoy the people I work with.", "cons": "Education pays less than working in your chosen field. That is true of every higher education environment, so not a Pima problem. There is not a ton of time for course prep as contact hours are high. Overall though, the positives far outweigh the negatives."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "do it for the students", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Mar 2023", "job_title": "Instructor in Denver, CO", "duration": "N/A", "pros": "Opportunity to shape minds and help make a difference.", "cons": "Need consistent messenging for students. Program is expensive."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "If you want a job that gives you purpose and great pay, then you may want to change your life by working here.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "5 Dec 2022", "job_title": "Administrative in Tucson, AZ", "duration": "N/A", "pros": "The staff and instructors are excellent. You will never find a group of fantastic folks who strive to make a difference in thier student's life and education. If you find that working at your current job leaves you sad at the end of the day, then find your purpose with us.", "cons": "Every company has issues, but when it all comes down to it, we all work together to help our graduates find a pathway to thier purpose."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Interesting company but...", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 Aug 2022", "job_title": "Anonymous Employee in Renton, WA", "duration": "N/A", "pros": "This company the people who work here genuinely work really hard for the students and to provide them with quality care. On a coworker to coworker level some of the staff is nice to work with and the Campus Director is a wonderful person.", "cons": "There is so much lack of communication not just our campus but the whole company. The main manager is terrible, he has no manger skills and doesn't know how to talk to people about issues, and I firmly believe he promotes gossip. There is a huge gossip problem, you can't trust anyone and it effects a lot of people. The managers/company isn't very open about changes or problems. A lot of the teachers have a bad attitude to the rest of the staff. They try to make it seem like there isn't a problem by doing things like once a month the managers walk around give out something pima labeled for free. When I started here it seemed like they were trying to boost morale but definitely not anymore. There's lots of building problems with maintenance almost constantly and it makes it frustrating to just exist in this building."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "It’s all that and a bag of chips!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Oct 2022", "job_title": "Instructor in Colorado Springs, CO", "duration": "N/A", "pros": "Supportive and caring management. My team, my students, local management and corporate really make me feel valued and appreciated in so many ways from staff meetings asking my opinion to the department team helping each other out to cover shifts so I can take PTO. Students come first which is so important to me because that is why I am at Pima!!! BTW amazing benefits and ESOP!", "cons": "I would love to work overtime but no opportunity for that(ie pick up occasional extra shift )."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Accountability", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Nov 2022", "job_title": "Faculty in Albuquerque, NM", "duration": "N/A", "pros": "It's refreshing to work in an environment of accountability. The team here leans on each other and supports all students. Management has been great to work with because they hold people responsible for their outcomes. You can also give feedback and work on new ideas that could improve the campus and student experience. I like being heard.", "cons": "This isn't a con but some employees are afraid of accountability and resort to negativity. This is such a drag on our morale. Employees shouldn't be able to skate by with no effort and then become upset when they're held accountable."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "New Management Desperately Needed", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Nov 2022", "job_title": "Teacher in Albuquerque, NM", "duration": "N/A", "pros": "Dedicated student who are trying to turn their lives around.", "cons": "The management at this campus is absolutely terrible. Campus leadership fosters a mean girl culture, has their favorites while treating the rest of the employees terribly, not to mention the immense chip of pride on their shoulders. Morale at this campus is terribly low as a consequence. The administration do do not support the instructors and instead side with the students no matter how bad their behavior. I hope corporate sees the high turnover and makes the right decision to put people in management who are humble, kind, and supportive of their staff instead of hostile, passive aggressive, or dismissive. I wouldn’t recommend working here unless there is new management."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "a", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "2 Feb 2023", "job_title": "Instructor in El Paso, TX", "duration": "N/A", "pros": "great job working in pima", "cons": "non applicable until now w"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "The Quality of Work Life Depends on the Manager You Have", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "13 Oct 2022", "job_title": "Administrative Staff in Albuquerque, NM", "duration": "N/A", "pros": "PMI has core values that make this a great company to work for, such as ESOP, PTO, and being family-owned. They truly care about students and take education seriously. They do a lot to ensure graduates are prepared to be healthcare professionals and the Career Services team has been phenomenal when working with students to find them employment.", "cons": "I have had positive and negative experiences at this company and it's unfortunate, but much of those experiences and the quality of work life centers around the manager you have. Current campus management is a horror to work for. We are bleeding good people and it's a wonder that corporate doesn't see how many people are leaving or still think management is doing a good job. It is mind-boggling, for sure. They are all  about appearances so  a great show is executed  when visitors are here but the employees here do not support management because management does not support us. Every time some one quits we are fed a line about them wanting a new experience or wanting to be with family when we all know that many people find it difficult to work in this environment for people who believe they know everything and allow input from no one. Who wants to go to work every day and stay motivated under these circumstances? It is becoming more and more difficult. With layoffs coming, I am wondering if this is the time to bail and just call it a wash."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "PMI culture changed", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "8 Nov 2022", "job_title": "Anonymous Employee in Albuquerque, NM", "duration": "N/A", "pros": "ESOP, Great educators, accredited, two week vacation at Christmas and use to the best place.", "cons": "Toxic environment, Micro-aggression, Micromanagement, narcissistic environment, special treatment favoritism. Shift over last 3 years now.  Leadership campus level  that ego reaches an unhealthy level.  One opinion matters."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Watch OUT", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "27 May 2022", "job_title": "Student Services Coordinator in Tucson, AZ", "duration": "N/A", "pros": "Fair Pay\nBenefits are good", "cons": "The company truly believes they have good company culture but the truth is, the \"culture\" you experience is truly dependent on the department you are in. You think you can go to HR but they only believe those in leadership, and you're pretty much forced to leave or wait around to be fired. I was isolated, belittled in meetings (by others in other departments) and because I made a few mistakes early on they took away my ability to do anything and then asked \"why aren't you doing anything?\" \nInstead of just saying things outright and being honest, they play games and try to scare you/intimidate you/blindside you. The only reason it didn't work with me was because by the time they were really trying to push me out, I had already signed another offer a week before they tried to fire me. \nSeriously, watch out! They think they are good and it's sad that they have departments that are literally bullying/isolating people into silence. \nI was even asked by a Manager if I was pregnant. She literally never spoke to me and then out of nowhere \"Hey I got a feeling you're pregnant. Are you?\" Who does that?!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Workplace Environment", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Dec 2022", "job_title": "Anonymous Employee in Albuquerque, NM", "duration": "N/A", "pros": "- Supportive Campus Director - Meaningful work - Employee owned company - Communication between departments", "cons": "- Workload can be heavy at times"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "I would not recommend", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Sept 2022", "job_title": "Instructor in Albuquerque, NM", "duration": "N/A", "pros": "Offers direct deposit for paychecks, if you like pancakes you might enjoy the occasional pancake breakfasts, if you enjoy direct sales marketing you might enjoy participating in marketing tactics (Google review competitions, raffles, etc.)", "cons": "All decisions are made by 1 administrator who does not take into account other expertise or suggestions. Immense level of micromanaging occurs daily. Intellectual property rights are not recognized/respected. Business practices align with direct sales marketing strategies."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": "N/A", "review_title": "Low campus morale", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Apr 2022", "job_title": "Anonymous Employee in Colorado Springs, CO", "duration": "N/A", "pros": "Family owned, great medical education with great outcomes, decent pay", "cons": "Pima as a whole is a great company. The Colorado Springs campus used to be a great place to work as well but since new management took over the campus morale is bad! Majority of employees are looking for new jobs. The overall culture is a tattle tell mentality. It’s frowned upon to be visiting with coworkers unless you are willing to share the conversation with management. You are not to have a voice because if you do then you now have a target on your back and will be pushed to quit if not fired. Everything is very micromanaged and there is no trust. Coworkers are pitted against each other by management which makes it very hostile.The thoughtful, caring, and genuine workplace atmosphere is no longer within this campus."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A unique healthcare school", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "16 Oct 2022", "job_title": "Instructor in Tucson, AZ", "duration": "N/A", "pros": "Unique opportunities to share healthcare knowledge", "cons": "Few opportunities to advance within the company"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Micromanagement", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Oct 2022", "job_title": "Instructor in Albuquerque, NM", "duration": "N/A", "pros": "The benefits are great but not worth the stress.", "cons": "You will be micromanaged by campus administration and overworked within your department: Their only concern is the profit they are making. They do not care about education. They will continue to have you accept/ push through students that are under qualified for programs, unethical, or failing."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "An Amazing Organization", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "15 Mar 2022", "job_title": "Program Director in El Paso, TX", "duration": "N/A", "pros": "This company is unique, there is a strong culture of belonging and taking care of employees and students. I am 45 years old, and I hope I can retire, many years from now, as an employee-owner at Pima. The benefits are awesome, including the ESOP. The management is, mostly, respectful, professional, and supportive. Solid company, 50 years in the market, and growing steadily.\nJust an example of how incredible this company is, a 2% salary adjustment across the board was announced today, in addition to annual performance increases, to help employees face the effects of inflation and the current negative economic situation.", "cons": "While not a perfect company, it is as close to perfection as it gets. Just to say something, the health insurance could be better."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Best Company to work for, family away from home environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "18 Mar 2022", "job_title": "Medical Career Specialist in San Marcos, CA", "duration": "N/A", "pros": "Amazing company to work for. Loyal, passionate, respectful and most of all not only they Care about their employees and their students, they go above and beyond to help others. Work with so many amazing people who take their job to the hart and care about their students. I never worked for a company who is so generous like PIMA. Every one of us juggles unique responsibilities within our jobs and personal lives, what makes PIMA perfect is that we all spend the most time at work with love, respect, passion for one another which makes finding a healthy balance. I love my students and Co Worker AND all upper managements for making me feel welcome for the last 5yrs and still counting for many years to come....", "cons": "NO Cons, proud PIMA employee"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Love Working Here", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Sept 2022", "job_title": "Anonymous Employee in Tucson, AZ", "duration": "N/A", "pros": "PMI is a wonderful place to work -- great culture - employee owners - excellent support from administration - more than fair compensation - great mission being part of changing lives.", "cons": "Communication has been weak but is improving."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Awesome Company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Mar 2022", "job_title": "Degree Program Assistant in San Marcos, CA", "duration": "N/A", "pros": "The company culture is conducive to personal and professional growth. I love the flexibility of my schedule while being given the freedom to prioritize my work to get everything done efficiently. My Program and Clinical Directors are all a pleasure to work with and there is never a dull day. Nothing becomes too routine as all programs are run differently, so my daily tasks are always a fun challenge. A big bonus, is we have both Vet Assistant and Vet Technician programs so once in a while we have fur or scale babies that visit us.", "cons": "I honestly can't think of any cons to working here. Out of all the places I've worked (and I've worked at many) this is one I look forward to coming to on Mondays."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Pima has exceeded all expectations for ethics, professionalism and kindness as an employer.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 Mar 2022", "job_title": "Dental Assistant Instructor in San Diego, CA", "duration": "N/A", "pros": "I feel extremely honored to work for PIMA. Fred Freedman and those that assist him in leadership are blessed with depth of character and skilled leadership abilities that I have seldom witnessed. Ethical truth telling right from the start from Mary and Mindy is what potential students encounter. Every employee that interfaces with students at PIMA truly care about students and the outcomes that lead to successful carriers and happy lives.", "cons": "As far as I have experienced there are no cons. If you do decide to go to PIMA you will need to study. The work is a lot, but the level of education that is achieved will make you successful in the field."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not employee focused", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Nov 2022", "job_title": "Teacher in Albuquerque, NM", "duration": "N/A", "pros": "Lots of talented faculty in medical programs", "cons": "Administration are impossible to work with"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "19 Apr 2022", "job_title": "Faculty Coordinator in Colorado Springs, CO", "duration": "N/A", "pros": "Working at Pima Medical Institute on the Colorado Springs campus has been an excellent experience for the past eight years of working in this institution. The culture of PIMA is friendly as all employees positively engage with one another throughout the workday. Pima's culture also encourages employees to explore the full potential of its employee's administrative and teaching techniques by helping everyone who works here to grow through the job experience and offering stipends for continued education.\r\nPima also offers excellent benefits, and everyone who works at Pima becomes an employee-owner. I love it.\r\nThanks", "cons": "Overall I have no complains\r\nGreat place to be and work."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "11 Sept 2022", "job_title": "Instructor, College Or University in Phoenix, AZ", "duration": "N/A", "pros": "Flexible, comparable salary, cares for employees", "cons": "None that I can really think of"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "29 Aug 2022", "job_title": "Campus Director in Denver, CO", "duration": "N/A", "pros": "Pima cares about its employees! It's a great place to work!", "cons": "I have no cons to add."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Valued & Appreciated", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Mar 2022", "job_title": "Anonymous Employee in San Marcos, CA", "duration": "N/A", "pros": "As an employee owned company, leadership proved more than ever during the pandemic and the return from the pandemic that regardless of your title, you and your opinion are valuable. Pima continually works to ensure we have the resources we need to be successful as employees and continue our professional development. At my campus in particular, we now have a very strong team in place and I truly enjoy coming to work every day. I am looking forward to how we grow over the next year with a new campus director as well!", "cons": "Not really a con..... while I love my co-workers, I do miss working from home - especially with current gas prices."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "WONDERFUL PLACE TO WORK", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "29 Apr 2022", "job_title": "Certified Medical Assistant in Chula Vista, CA", "duration": "N/A", "pros": "An honest, ethical company that cares about its students AND its employees. The students get a great education and the teachers work hard to make sure they have the skills they need to start work.", "cons": "Our campus is too small - we really need to expand!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Worst job experience I’ve ever had", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "11 Jul 2022", "job_title": "Instructor in San Marcos, CA", "duration": "N/A", "pros": "High pay rate, higher than most schools.", "cons": "No better than any other predatory vocational school out there. Students and instructors aren’t put first. Management cares more about PMI’s image and budget than keeping staff. Zero room for growth and backstabbing among peers, especially when handing students off for externship. Little to no time to complete necessary training since the higher pay rate means there are no prep hours for instructors."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "At all levels, Pima is a a great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "18 Mar 2022", "job_title": "Program Director in San Marcos, CA", "duration": "N/A", "pros": "I love working with the staff, fellow faculty and the administration her at Pima San Marcos. People share the commitment to the students. I feel that I am a valued member of the team! Pima has added resources for students, such as the All One mental health program. They also treat employees very well. We all just received a 2% pay adjustment, in response to this recent inflation! Talk about feeling valued!", "cons": "Work/life balance could be better. It is sometimes difficult to take off a chuck of time due to the year-round school schedule."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Pima Medical Institute is a wonderful place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Mar 2022", "job_title": "Clinical Director in El Paso, TX", "duration": "N/A", "pros": "Pima Medical Institute cares about it's employees. In a time when most companies are not giving their employees a, usually well earned pay increase, PMI is giving a company wide 2% pay adjustment. This adjustment shows how much PMI cares about their employees as it's to help with current soaring gas/grocery etc. prices. Employees at PMI are employee owners, which is something I'd never experienced.", "cons": "Located on a very busy four lane road near the freeway. It feels a little dicey sometimes when leaving from work as you're hoping to avoid being hit by a speeding vehicle."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing Company to work for!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Mar 2022", "job_title": "Lead Dental Assistant Instructor in San Marcos, CA", "duration": "N/A", "pros": "Pima offers students the best education in their chosen careers. They give our students such great support and guidance throughout their journey. Also treating their faculty so well, I have never worked for a company that takes such great care of their staff. I feel truly blessed to work for Pima.", "cons": "I do not have any cons. Pima is the best place work!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "When you have a job you love,  you will never have to work a day in your life", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Mar 2022", "job_title": "OTA Program Lab Assistant in El Paso, TX", "duration": "N/A", "pros": "Working at PIMA Medical Institute has brought greater joy to my life. I have the most amazing co-workers that inspire and encourage me to be my best. We have such a cohesive team with the same goals in mind. Our leaders only solidify that with modeling the expectations set. I truly love it here!", "cons": "I can't think of any at this moment."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 0, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Employee owned", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "22 Jun 2022", "job_title": "Administration in Mesa, AZ", "duration": "N/A", "pros": "Investment of company in each individual employee", "cons": "Salary\nSupport equipment\nFlexibility\nCertificate systems framework"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Mar 2022", "job_title": "Instructor in Albuquerque, NM", "duration": "N/A", "pros": "Pima is THE best company I have ever worked for. Coming into work everyday almost doesn't feel like work. It feels amazing to know I have such strong and knowledgeable peers I can go to for assistance.", "cons": "I cant really think of any Cons with working for Pima at the top of my head. If I were to really think about it, I assume I'd only be nit picking about how maybe the floors aren't pristine all day, which of course is not practical."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Pima Proud", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "18 Mar 2022", "job_title": "Career Services Coordinator in San Marcos, CA", "duration": "N/A", "pros": "I have worked for Pima Medical Institute going on 6 years and, I still love my job! I wanted to take a minute and say, Thank you Pima, for allowing me to work for a company that embraces the kind of work culture that makes you feel valued and heard as an employee. I truly enjoy coming to work everyday.", "cons": "No real cons to speak of."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "We are one cohesive group dedicated to improving the lives of each student we teach.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Mar 2022", "job_title": "Faculty in El Paso, TX", "duration": "N/A", "pros": "Overall company goals that focus on employees and students needs as their top priority.", "cons": "There is absolutely no cons."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Happy Camper", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Jul 2021", "job_title": "Office Assistant in Albuquerque, NM", "duration": "N/A", "pros": "Pima Medical Institute has offered me a wide array of tasks and projects, never leading to a dull moment. I am a very happy camper that loves the environment that the Campus Director (Yurianna Lancaster) has created. Her teaming with Jenn Gallegos has lead to innovative ways of accomplishing tasks and projects that really benefit our employee ownership. Pima is an Employee Owned company and knowing that there is an extra little something at the end of my time with Pima helps me make better decisions with my time and resources. The support I receive from my manager, Jenn Gallegos, is second to none. She has coached me through tough situations and has always had an open door to any concerns that I have. The management team here has gone above and beyond to make this employee a happy camper.", "cons": "The lack of training resources available for a 50 year old company is frustrating at times. However, the C-Suite has recognized the issue and is working towards a solution."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Management needs help", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "19 May 2022", "job_title": "Faculty Member in Chula Vista, CA", "duration": "N/A", "pros": "They offered me competitive pay and an outstanding training course.", "cons": "Unprofessional supervisors resulting in constant miscommunication and inconsiderate confusion."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A Company that Cares about their Employees", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Mar 2022", "job_title": "Campus Director in San Marcos, CA", "duration": "N/A", "pros": "On top of the nearly 50 years of industry presence changing people's lives through specialized, medical education--and being nearly 60% employee owned, our company recently added an additional 2% to everyone's pay to help counter the current state of inflationary increases. PMI cares about its people.", "cons": "I've not encountered any cons at this time."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "15 Mar 2022", "job_title": "Front Desk in Tucson, AZ", "duration": "N/A", "pros": "I have worked with this company for several years and I am so happy to be with this amazing company. The company not only cares about the students, but the employees as well.", "cons": "Only negative will be when I retire."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": "N/A", "review_title": "A company that feels like family", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Mar 2022", "job_title": "Anonymous Employee in San Marcos, CA", "duration": "N/A", "pros": "The atmosphere is warm and inviting towards students, guests, and employees- it feels like a family! Employees are highly valued and efforts recognized frequently. In response to rising prices in the economy, the company gifted us an unexpected increase. So grateful.", "cons": "I have none at this time."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing Workplace", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "5 Apr 2022", "job_title": "Instructor in Las Vegas, NV", "duration": "N/A", "pros": "I have been working in Pima for 10 years now. This company is family-owned, and they care so much for all employees. I see myself retiring in this place. Pima proud!", "cons": "I can't think of any cons."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Pretty Good Benefits!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "15 Mar 2022", "job_title": "Anonymous Employee in Chula Vista, CA", "duration": "N/A", "pros": "While the the Medical and Dental benefits are not great, the overall benefits package it great, especially if you are with the company long term. Their retirement package can't be beat!", "cons": "Sometimes takes a long time to get answers but that can be many companies."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Taking Care of Its People!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Mar 2022", "job_title": "Program Director in Tucson, AZ", "duration": "N/A", "pros": "PMI, Tucson campus, is such a blessing to work for!!! It really knows how to take care of its people. It is the BEST school in town!", "cons": "There are no cons to share."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Campus culture", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "20 Apr 2022", "job_title": "Anonymous Employee in Colorado Springs, CO", "duration": "N/A", "pros": "Positive environment, proactive communication, incentives, family owned, employee shares", "cons": "All companies have their opportunities."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Employee Centric", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Mar 2022", "job_title": "Faculty Member in San Marcos, CA", "duration": "N/A", "pros": "-Supportive staff\r\n-Friendliness of other staff\r\n-Benefits\r\n-Flexibility", "cons": "My only real dislike is the parking situation and structure, since it is a structure that is used for the nearby shopping area, the nearby apartments, Scripps, and for PMI. It gets crowded and people drive terribly."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Your forever job is here!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Mar 2022", "job_title": "Faculty in San Marcos, CA", "duration": "N/A", "pros": "ESOP company with a culture that supports employee ownership.\r\nAmazing group of highly talented and like-minded individuals.\r\nCompetitive compensation and bonuses.\r\nDefinitely a forever home!", "cons": "few to none, none to speak of here."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Hands Down, Best Employer Ever!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "15 Mar 2022", "job_title": "Front Desk Receptionist in Albuquerque, NM", "duration": "N/A", "pros": "Pima is a family founded and employee owned company. From top management down, very caring and generous to employees and students with an extremely supportive culture.", "cons": "No cons to report at this time"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best Company I've ever worked for!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Mar 2022", "job_title": "Dental Instructor in San Marcos, CA", "duration": "N/A", "pros": "They truly value their employees!\r\nGive praise and show appreciation to faculty daily!\r\nPay keeps getting better and better!", "cons": "I haven't found there to be a downside."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Eh", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 Apr 2022", "job_title": "Admissions Support in Mesa, AZ", "duration": "N/A", "pros": "Regular 9-5 \r\nRegular 9-5\r\nRegular 9-5 \r\nRegular 9-5", "cons": "working weekends\r\nworking weekends \r\nworking weekends"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "An excellent place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Mar 2022", "job_title": "Pharmacy Technician Instructor in San Marcos, CA", "duration": "N/A", "pros": "Awesome support from administrations, great hours, a good work environment", "cons": "We need more space since the program is growing."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "More than just a job, truly understand the meaning of family", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Jul 2021", "job_title": "Office Assistant in Phoenix, AZ", "duration": "N/A", "pros": "Pima has some of the most caring/loving staff, I always felt right at home at work. Had an AMAZING campus director in Stacey Nottingham, who I still stay in contact with to this day. Whether I was having a bad day and needed a moment, she would always check in with me, cover for me, whatever she could do, she would. Stacey truly cares about each and every employee and student, and her incredible leadership is just an extension of how Pima operates as a whole. Staff are very open and friendly, no work drama, and working for the company itself is very fulfilling. Already looking forward to visiting my Pima family!", "cons": "I have no cons, Pima is a great company to work for!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "An incredible culture here, amazing place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Aug 2021", "job_title": "Program Director in Seattle, WA", "duration": "N/A", "pros": "I can’t say enough about this company. I love my team and campus and the students. This is really like no other place I’ve worked as far as collaboration and communication amongst employees and upper management. It truly is a team atmosphere with freedom to grow and develop professionally. The quality of the education we provide is outstanding. I’m very proud to work here.\r\nBenefits are awesome— we are gifted holidays, in the winter, there is 401k and ESOP, the company pays for licensure/ professional association membership, continuing education and related travel expenses.", "cons": "None at this time, I appreciate that we have freedom and support from our management. It’s a good balance"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "More interested in money than health", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "18 Jan 2022", "job_title": "Anonymous Employee in Seattle, WA", "duration": "N/A", "pros": "This place pays well but treats its teachers like trash", "cons": "This company is more invested in getting money than they are in keeping faculty and staff safe. They refuse to require the COVID vaccine even though they are a healthcare school"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great Company", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Mar 2022", "job_title": "Instructor in Denver, CO", "duration": "N/A", "pros": "ESOP, Good 401K match, 4.5 day work week, No real advancements", "cons": "Middle-of-the-road insurance, lack of work-life balance."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Finally!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Dec 2020", "job_title": "MDA Instructor in Colorado Springs, CO", "duration": "N/A", "pros": "Majority employee owned\r\nGreat benefits\r\nCompetitive pay scales\r\nCompetent Management \r\nOpportunities for advancement\r\nTrue appreciation and acknowledgment.\r\n\r\nBeing in the medical field for 10 years, I’ve seen the good and a lot of the bad companies out there. I’ve worked in CO for 20 years in different fields and I can honestly say that Pima is the best company I’ve ever worked for. They take care of and truly value their employees. The support and open communication from management is refreshing. The benefits are great and the 401K options are unheard of. The CEO is involved and has actually participated in company meetings and get togethers (via zoom) to introduce himself and connect with everyone. I have finally found a company I am proud and happy to say I am a part of!", "cons": "The only con I have is, my training when I started was lacking but it was due to COVID and 5 staff left because they didn’t want to teach online. The one staff person that knew my position was one of them. But my manager stepped up and connected me with resources at other sites and did whatever she could to help me."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Jan 2022", "job_title": "Career Services Advisor in Tucson, AZ", "duration": "N/A", "pros": "Very innovative and forward-thinking. Big team mentality.", "cons": "Fast company/student growth can sometimes lead to staffing shortages, but those tend to be fixed relatively quickly."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": "N/A", "review_title": "Teamwork", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Dec 2021", "job_title": "Student Finance Officer in Houston, TX", "duration": "N/A", "pros": "The staff & faculty work really well together. The work environment is always positive and motivating.", "cons": "The work life balance is depleting more & more. The foundation of this school was based on family and I'm not quite sure if that's still a focus."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Positive Company Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 Jan 2022", "job_title": "Student Success Advisor in Tucson, AZ", "duration": "N/A", "pros": "Caring, supportive team members. Positive growth mindset.", "cons": "Hybrid work environment, office is uncomfortable,"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Place to Work!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Jan 2022", "job_title": "Manager in Colorado Springs, CO", "duration": "N/A", "pros": "Employee and student focused with great benefits.", "cons": "A relatively flat organization; workloads can be heavy but highly rewarding."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A company that does things the right way", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "19 Jan 2021", "job_title": "Instructor in Tucson, AZ", "duration": "N/A", "pros": "They provide an excellent compensation \"package\". Potential employees should really take time to understand the full benefit package and not just the stated hourly rate. The HR department is excellent and upper management is very pro-employee. This family-style, employee-focused culture has remained steady since the early days of PMI. The founders of this company established this culture. The instructors I interact with in other departments are talented professionals who work very hard for their students.", "cons": "This is not really a con, but be prepared to work hard in a different kind of way if you are used to working in a clinical environment. This is not an auto-pilot kind of job. Even seasoned instructors have to keep learning, growing and improving. It's constant. There's no other option if your intent is to be of service to our students."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Good place to be", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "7 Jan 2022", "job_title": "Anonymous Employee in Phoenix, AZ", "duration": "N/A", "pros": "The people I work with are family", "cons": "Nothing is perfect, not even PMI"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Marketing Team Review", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Apr 2021", "job_title": "Digital Marketing Manager in Phoenix, AZ", "duration": "N/A", "pros": "- Great pay and benefits\r\n- ESOP employee ownership program with a 5-year vesting\r\n- Lots of opportunity to be successful (because things are a mess)", "cons": "- No structure, organization, or accountability\r\n- Everything moves SO SLOW -- bottleneck of workflow that prohibits collaboration, agility, or progress\r\n- Poor communication -- all employees/departments work in silos, all communication flows through one funnel\r\n- No planning or forecasting, reporting or analysis, or focused strategy of any kind \r\n- The culture does not value teamwork, logic, or knowledge \r\n- Many employees been in positions for 10-20 years -- no innovation, understanding of market, or drive"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Pima", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Dec 2021", "job_title": "Instructor in Seattle, WA", "duration": "N/A", "pros": "Good benefit lots of food during meeting", "cons": "Inadequate training and difficult and not practical procedure"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": "N/A", "Compensation and Benefits": 1, "Senior Management": "N/A", "review_title": "Toxic, hostile and racist", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Oct 2021", "job_title": "Anonymous Employee in Colorado Springs, CO", "duration": "N/A", "pros": "Higher pay than public education", "cons": "This campus used to be great until new leadership took over. Since then, it has been hostile, toxic and racist. People feel very micromanaged and coworkers are not only encouraged to report the comings and goings of each other, this information is shared by leads, essentially destroying trust in the team. Several people have left and probably more will follow. Money is the bottom line, no concern about doing what is right for the students."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "For Profit School is for profit only", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "1 Jul 2021", "job_title": "Allied Health Instructor in Chula Vista, CA", "duration": "N/A", "pros": "I like teaching and I liked most of the students", "cons": "Many, but the worst is not listening to instructors. I don't know why, but instructors are looked down upon and work a lot of over time with no pay and they also make you do things that aren't the best for the students. This is the 4th for profit school I've worked for. And the last... because although I love teaching and they said they were \"different\", they aren't ethical at all."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Best Employer in NM", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Jul 2021", "job_title": "Instructor in Albuquerque, NM", "duration": "N/A", "pros": "In over 30 years of working in the ABQ metro area, Pima is by far the best organization I have ever worked with. Not only is the environment positive and professional, but it is a true family! I also appreciate the recent push to becoming a 'green campus'. Our campus director and corporate supports are marvelous to work with. I cannot say enough about my experience with this organization.", "cons": "There are no cons at this time."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Hybrid Health care Administration Certificate Instructor", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Nov 2021", "job_title": "Hybrid Health Care Administration Certificate Instructor in Tucson, AZ", "duration": "N/A", "pros": "I enjoy working on campus and online.", "cons": "There are no cons working on campus and online"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Don't fall for it - standard corporate machine", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Sept 2021", "job_title": "Respiratory Therapy Instructor in San Marcos, CA", "duration": "N/A", "pros": "None, this company is all smoke and mirrors", "cons": "They use their supposed \"reputation\" and ESOP program to lure in suckers and push a maximal work with minimal compensation model. Don't be fooled, this is the Walmart of for-profit education."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "None", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Jan 2022", "job_title": "Career Services Advisor in Renton, WA", "duration": "N/A", "pros": "None none none none none", "cons": "Bad bad bad bad bad"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "6 Jul 2021", "job_title": "Faculty Coordinator in Denver, CO", "duration": "N/A", "pros": "ESOP means we all work towards a common goal as employee owners. Employees are heard and supported at the campus level. A culture of teamwork is emphasized and makes coming to work every day a joy. Students and their success in their chosen careers are our top priority.", "cons": "There are no cons to working at Pima Medical Institute!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Oct 2021", "job_title": "Instructor in Albuquerque, NM", "duration": "N/A", "pros": "Amazing benefits wonderful atmosphere great students", "cons": "I can’t say anything negative"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Where has PMI been all my life?!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Dec 2020", "job_title": "Corporate Education in Tucson, AZ", "duration": "N/A", "pros": "I LOVE working for PMI. This organization makes you feel truly valued. The employees are caring, considerate, supportive, and professional. Communication is very important to PMI, so you never feel like you're out of the loop. Whenever there is a project, everyone helps each other and it really feels like a team environment. My supervisor is kind and provides excellent guidance. PMI makes me feel like they are actually invested in me as an employee AND as a person. They want you to succeed! The work environment is very positive, even while working remotely through these strange times. I have never been happier. If you're on the fence about applying or accepting a position, go for it! You won't be disappointed.", "cons": "I haven't experienced any cons!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great employee owned company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Aug 2021", "job_title": "Anonymous Employee in Mesa, AZ", "duration": "N/A", "pros": "Great employee owned company. Wonderful culture with driven and like minded individuals who value student success!", "cons": "There are no cons that I can think of at this time. Pima Medical Institute is a great company with a promising future!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "I would recommend this as a place of employment", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Dec 2020", "job_title": "Administrative Assistant in Albuquerque, NM", "duration": "N/A", "pros": "I am new to the company as an employee. I am very happy to be starting this new chapter. \r\n\r\nPros:\r\nGreat Co-Workers\r\nGreat Location - easy to get to work, centralized to shops and resturants as well.\r\nLots of opportunty to learn new things. \r\nIt is nice to help other get started in their careers. \r\nIt's not unsual to see pets walking the hallways too.", "cons": "I'm still new here so I am in the honeymoon phase. The only one that comes to mind is that it is cold in my area but I have been provided a portable heater. Problem solved!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Pima Review", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "15 Sept 2021", "job_title": "Instructor in Renton, WA", "duration": "N/A", "pros": "Employee owned. Good people. Nice atmosphere.", "cons": "Little opportunity. Forward movement happens rarely."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Always treating clients and employees right!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 Dec 2020", "job_title": "Full Time Faculty in Chula Vista, CA", "duration": "N/A", "pros": "Pima provides the best education for students desiring to enter the medical field - across the nation! Pima has corporate and local leaders that provide constant support for their staff and faculty. 2020 has been a difficult year for so many companies, but Pima Medical Institute continues to give their students what they need, to help them become the best professionals possible, while demonstrating gratitude and respect for all of their employees. It's the best company I have ever worked for.", "cons": "I cannot think of any negative aspects of working for Pima Medical Institute."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great place to work.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "20 May 2021", "job_title": "Career Service Advisor in Mesa, AZ", "duration": "N/A", "pros": "Getting to work with young people and giving them the guidance they require to get to that next level in their career. This is such a rewarding opportunity when you are able help students and give them a path to take in life.", "cons": "There is some disappointment when you are unable to fulfill the students needs."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Pima Proud and Grateful", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "22 Dec 2020", "job_title": "Career Services Coordinator in San Marcos, CA", "duration": "N/A", "pros": "Many years ago, I had to make a decision to either stay with my old company or take a chance on a new school that was moving into the area called Pima Medical Institute.  After much research and consideration, I took the chance and made the move.  Almost 5 years later I am so grateful that I made the decision to come work for Pima.  What really amazes me is the integrity of our company.  I love the open book management style and I always feel that I am part of something bigger.", "cons": "None that I can list."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Awesome place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Jul 2021", "job_title": "Student Services Coordinator in Albuquerque, NM", "duration": "N/A", "pros": "Pima values employees; fun and upbeat work environment; Campus Director communicates directives clearly and is very easy to talk to.", "cons": "I can't really think of any."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Receptionist", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Aug 2021", "job_title": "Front Desk Receptionist in Chula Vista, CA", "duration": "N/A", "pros": "Good environment and good pay", "cons": "Miscommunication and unrealistic expectations for employees"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Jul 2021", "job_title": "Program Director in Phoenix, AZ", "duration": "N/A", "pros": "Employee ownership, advancement, caring, quality education", "cons": "There are no cons regarding working for PMI."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Wonderful Place to Work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 Apr 2021", "job_title": "ASC Coordinator in Mesa, AZ", "duration": "N/A", "pros": "Supportive management, lots of opportunities for career growth, an employee-owned company. I feel like I've found a \"family\" at Pima Medical Institute and would recommend working here to anyone.", "cons": "There is literally no downside to working at Pima Medical Institute."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Place to Work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Dec 2020", "job_title": "Associate Program Director in Tucson, AZ", "duration": "N/A", "pros": "I strongly feel that the benefits and salary are competitive in the field. The company's professional attitude and individuals are some of the best I've worked for in my professional career. The company culture is unique in an enjoyable way. My contribution to enhancing a better organization is well received.", "cons": "In thinking about a \"con,\" I don't have any. Working in the online environment is hard work. I'm still learning the art of 'work-life' balance."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "I LOVE PIMA!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "6 Jan 2021", "job_title": "Instructor in Albuquerque, NM", "duration": "N/A", "pros": "Collaboration, freedom to teach and build classes, open door policy across the system, genuine care and compassion from the bottom up and top down for all! Always changing to meet or exceed Best Practices!", "cons": "Of the company - NONE! But I sure can't wait to be back in a classroom with our students face to face -dang COVID!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A solid employee-owned company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "26 Mar 2021", "job_title": "Medical Assistant Instructor in Tucson, AZ", "duration": "N/A", "pros": "Very transparnt with employees about financial reports", "cons": "A bit slow to innovate and adopt modern practices. Pay is also slightly imbalanced between certificate and degree programs."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "BEST PLACE TO WORK", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 Apr 2021", "job_title": "Admission Support Center Specialist in Mesa, AZ", "duration": "N/A", "pros": "Management is the best. No micromanaging!", "cons": "I don't have any cons, I love my job, management and coworkers!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great Interview Process", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 Jun 2021", "job_title": "Candidate in Tucson, AZ", "duration": "N/A", "pros": "Professional, Transparent, Friendly, Courteous, Polite, Nice", "cons": "Long process for interview unfortunately"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Pima Medical Company Review. The best!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "21 Dec 2020", "job_title": "Program Director in Phoenix, AZ", "duration": "N/A", "pros": "Integrity and honest senior leadership. The company always has the best interest for every employee. Truly treated like a family member. Promotes growth and development. Best place I have ever worked. Innovative and organized transition during the pandemic. Approachable leadership at every level.", "cons": "As simple as it sounds, not being able to be on campus at this time. at times. Faculty members can display unhappiness with things that are out of our control."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Working For Pima Medical Institute", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Dec 2020", "job_title": "Admissions Representative in Mesa, AZ", "duration": "N/A", "pros": "Working for Pima Medical Institute is like working with one big family. Everyone is very welcoming and eager to help. I have been with the company for a year and a half now and after working numerous different jobs/careers, I know this is where I will be until I retire. I love my Pima family!", "cons": "I truly cannot find any cons with working for Pima Medical Institute."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Very Welcoming", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "24 May 2021", "job_title": "Student Finance Officer in El Paso, TX", "duration": "N/A", "pros": "They are very welcoming and kind", "cons": "The hours aren’t all that"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "PMI Seattle, WA", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "15 May 2021", "job_title": "Coordinator in Seattle, WA", "duration": "N/A", "pros": "Nice people to work with", "cons": "Will work you until you bleed PMI"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great Teamwork", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Apr 2021", "job_title": "Instructor, College Or University in Phoenix, AZ", "duration": "N/A", "pros": "Pima cares about their employees and the success of their students.", "cons": "Their technology for their employees is lacking."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "100% Student-Centered Vocational School", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "9 Feb 2021", "job_title": "Faculty Coordinator in Albuquerque, NM", "duration": "N/A", "pros": "401K Match, ESOP, Accrued PTO, Tuition Reimbursement, Collaborative Culture, Driven & Motivated Staff/Faculty", "cons": "None I can think of"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Working at PIMA", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 Dec 2020", "job_title": "PCT Lead Instructor/PHL Lead Instructor/NA Instrucor in Houston, TX", "duration": "N/A", "pros": "Career Advancement/Growth within the Company, Salary, Supportive Management, Great Supervisor, Great Co-Workers, Meaningful Displays of Appreciation, and most importantly \"Exceptional Mission and Values\" and being a part of an ESOP company.", "cons": "My con was only commuting but not an issue for me to work for PIMA."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Student Centered-Employee Focused", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "28 Dec 2020", "job_title": "Clinical Director in Tucson, AZ", "duration": "N/A", "pros": "This is one of the best companies I've ever worked for. They are focused on student success, and are very supportive of their employees with a generous benefit package.", "cons": "There are none that i can think of."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Love PMI", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Jan 2021", "job_title": "Career Services Advisor in San Antonio, TX", "duration": "N/A", "pros": "Best company. The transparency and open door policy. Really feels like a family. Working with students is my passion and PMI gives me the best opportunities to do it.", "cons": "Nothing I don't like about working with PMI"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "LOOK NO FURTHER!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Dec 2018", "job_title": "Supporting Cast in Mesa, AZ", "duration": "N/A", "pros": "Pima Medical Institute is the real deal in so many ways that it's almost impossible to list in this brief review!  I have been in the private school sector for most of my 20+ year career and can say unequivocally that NO ONE even comes close to PMI!  From the genuine caring for every student who attends the schools to the graduates and even those who have left prior to completion, PMI walks the walk!  Students ARE what this organization is about - not just some cheap catch phrases about caring - this place is the real deal!  Employees are treated with dignity and respect throughout the organization.   The leadership of the organization genuinely cares about the success of the students and everyone who supports them on their journey...bar none!  I have never experienced this level of caring for everyone that is part of the PMI family!  And I don't say this lightly as I have worked for a Fortune 50 and others who were held in high esteem in our sector (which isn't easy to do these days).  If you are looking to find a home with professionals who truly care about what they do and who they do it for, check out the positions available at PMI - come play for a winning team...a team that is genuinely proud of what they do and who they do it for!", "cons": "The only con I can share is not about PMI - it's that it took me this long to find my dream organization!  It was worth trekking the broken road though!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Company To Work For", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "22 Dec 2020", "job_title": "Alumni Coordinator in Tucson, AZ", "duration": "N/A", "pros": "Great compensation - Employee Stock Ownership Program - You are supported, respected and well cared for.", "cons": "As with any growing company, there's always a need for better communication. Other than that there are just not many downsides. I would highly recommend this company to others."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Family oriented", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Mar 2021", "job_title": "Admissions Representative in Albuquerque, NM", "duration": "N/A", "pros": "It is a family oriented job that has strong values.", "cons": "Slow moving towards planning and"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Love My Job!!!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "29 Dec 2020", "job_title": "Admissions Assistant in Denver, CO", "duration": "N/A", "pros": "My peers at PIMA have always made me feel like family from the first day I started working there. My bosses make me feel valued and an important asset to the company.", "cons": "There are no downsides to working at PIMA"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "PMI Is a Home Away From Home", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "21 Dec 2020", "job_title": "Campus Director in Las Vegas, NV", "duration": "N/A", "pros": "Pima is like no other technical college. It's primary focus is a quality education for its students and a professional, congenial and happy work atmosphere for the employees.", "cons": "There are no disadvantages when working for this family oriented company."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Feeling blessed!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Dec 2020", "job_title": "Faculty PN Instructor in Albuquerque, NM", "duration": "N/A", "pros": "This company is transparent, fun & supportive. I love the mentoring that is always happening here. It is a great place to work with awesome people.", "cons": "I have nothing that I feel is a \"con\" about this company."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Wonderful company to work with", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Jan 2021", "job_title": "Student Finance Officer in Albuquerque, NM", "duration": "N/A", "pros": "Great staff, faculty and admin! On-going training for all positions. ESOP and other retirement plans available. Wellness program available for discounted insurance.", "cons": "Non profit and nationally accredited."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Awesome place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Jan 2021", "job_title": "Faculty Instructor in Denver, CO", "duration": "N/A", "pros": "education students\r\nbenefits are great\r\ncoworkers are helpful\r\nmanagers down to earth\r\natmosphere friendly", "cons": "....if you look for something(pos or neg), you will find it."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Proud to be an employee-owner at Pima for 8 years.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Dec 2020", "job_title": "Veterinary Technician Program Director in Mesa, AZ", "duration": "N/A", "pros": "ESOP company, family values, in business for the right reasons which is based on putting students' needs first and providing quality education. Great benefits and support from upper management!", "cons": "I have no complaints about my job!"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Micromanaging to the fullest.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Apr 2021", "job_title": "Administration Officer in Albuquerque, NM", "duration": "N/A", "pros": "Really enjoyed my job in the beginning.", "cons": "Impossible expectations from management. I departed from Pima due to high anxiety caused by management."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "review", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Mar 2021", "job_title": "Surgical Technology Instructor in Phoenix, AZ", "duration": "N/A", "pros": "good pay for the job", "cons": "incredibly poor management- entry-level and executive level"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Leadership Listens to Employees", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Dec 2020", "job_title": "Instructor in Mesa, AZ", "duration": "N/A", "pros": "Growth potential, Independence, Dedicated staff & faculty, Weekends & holidays off", "cons": "Demanding workload, dealing with student's feelings of entitlement."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "An Outstanding Career College", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Dec 2020", "job_title": "Full Time Faculty in Colorado Springs, CO", "duration": "N/A", "pros": "High level of dedication to students. All levels of management very supportive to all staff and faculty", "cons": "Pima is the very best company I have every worked for!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great company!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "9 Feb 2021", "job_title": "Director in Renton, WA", "duration": "N/A", "pros": "Great leadership, mission, employee owned!", "cons": "Could use a bit more development"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Working at PIMA", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Dec 2020", "job_title": "MA Instructor in Houston, TX", "duration": "N/A", "pros": "Professionally Sound Company who cares about their employees. The training is beyond comprehension, intense but well worth it in the end. Training never ceases so get ready .", "cons": "I do not have any."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Dec 2020", "job_title": "Lead Dental Assistant Instructor in San Marcos, CA", "duration": "N/A", "pros": "PIMA is an excellent company to work for. They take care of their employees. They recognize all the hard work that employees put into their jobs.", "cons": "I have not one con for this company."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A warm and friendly place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "21 Dec 2020", "job_title": "Instructor in Tucson, AZ", "duration": "N/A", "pros": "Positively motivated instructors. Help is available from the folks working at PMI.", "cons": "Learning about online - however, getting better at it."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Pima is a amazing. Warm place to work for- I call it home", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Dec 2020", "job_title": "Admsissions in Denver, CO", "duration": "N/A", "pros": "amazing! caring, understanding- will do for each other", "cons": "Pima has no cons in my book"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A great place to work at", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Dec 2020", "job_title": "Maintenance Technician in Mesa, AZ", "duration": "N/A", "pros": "Low-stress friendly environment, and excellent benefits", "cons": "I have not found any cons In the three months that I have worked for PMI."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "You've Just Reached The Height of Higher Education", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "19 May 2019", "job_title": "Instructor in Las Vegas, NV", "duration": "N/A", "pros": "I've worked at my share of companies, and I tend to stay, but after 2 years, I feel it's time to move on. I've been here almost 10 years! Here's why...\r\n1. It's rewarding: I feel that I'm changing lives everyday in my role as a high-level educator. \r\n2. Pima Medical is thinking about my retirement more than I am: We have 401K, employee match, stock-ownership, and one hell of a management team. \r\n3. No micromanagement! At least not in my position. This institute trusts me to do my work. I can appreciate that. \r\n4. It's stable: Other schools in the same category continue to fall while Pima Medical keeps surviving AND THRIVING into the future. It's wonderful to see a school doing things the right way.", "cons": "If there are any negatives to this career, they are ones present anywhere you work with people. Here are the ones I've seen...\r\n1. Office politics.\r\n2. Taking to long to fire people who don't fit the culture. It's toxic! \r\n\r\nThat's about it. I know there are students who will complain from time to time because they are not satisfied with something, and I've found they will be the same ones who complain no matter where they attend. So, take those with a grain of salt. Make your own decisions."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Pima Proud, Pima Strong", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Dec 2020", "job_title": "Education Purchasing Coordinator in Tucson, AZ", "duration": "N/A", "pros": "Teamwork, Internal Support, Respectful, Growth rate manageable", "cons": "Campuses fragmented, needs streamlining, lacks processes"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "PMI Cares", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Dec 2020", "job_title": "Faculty Member in Tucson, AZ", "duration": "N/A", "pros": "Family Oriented, Puts Employees First", "cons": "Lack of Communication sometimes between corporate and campus"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "26 Dec 2020", "job_title": "Instructor, College Or University in Renton, WA", "duration": "N/A", "pros": "Small staff, very proactive and forward thinking", "cons": "Nothing I'm unhappy with at this time"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best Company to Work For", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Dec 2020", "job_title": "Instructor in Las Vegas, NV", "duration": "N/A", "pros": "PIMA Medical Institute takes care of their employees very well! What more could you ask....", "cons": "I do not see any."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 Dec 2020", "job_title": "Student Finance Officer in Mesa, AZ", "duration": "N/A", "pros": "Great leadership, excellent pay and benefits", "cons": "None that are worth mentioning"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company with a family atmosphere", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Dec 2020", "job_title": "Program Director in Denver, CO", "duration": "N/A", "pros": "benefits, comradery, feels like family atmosphere, engaging relationships", "cons": "always something to do, hard to have a work-life balance at times"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "employees and the way they treat each other", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "21 Dec 2020", "job_title": "Instructor in El Paso, TX", "duration": "N/A", "pros": "The people are friendly and curteous", "cons": "The hours are long and constant"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best Company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Dec 2020", "job_title": "Admission Support Center Specialist in Mesa, AZ", "duration": "N/A", "pros": "Great atmosphere! Wonderful, caring management. Excellent benefits", "cons": "I have no cons. This is an excellent company to work for"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Dec 2020", "job_title": "Student Services Advisor in Tucson, AZ", "duration": "N/A", "pros": "Supportive, collaborative and positive work environment.", "cons": "Lack of training materials for specific positions."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Respect for employees", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Dec 2020", "job_title": "Faculty in Denver, CO", "duration": "N/A", "pros": "Like a family\r\nRecognize loyalty\r\nAware of the need for team building for optimal performance", "cons": "The company has high productivity standards"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Good place to work", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "20 Nov 2020", "job_title": "Career Services Advisor in Seattle, WA", "duration": "N/A", "pros": "I enjoy working here and I will continue to work her for sometime.", "cons": "I have no downsides that I would like to discuss."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Pima Medical Institute", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Dec 2020", "job_title": "Full Time Faculty in Tucson, AZ", "duration": "N/A", "pros": "Employee owned and provides 401k, pto, health insurance", "cons": "Health insurance expensive, ESOP pays only once per year"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "An Amazing Privilege!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Dec 2014", "job_title": "Medical Career Specialist in Seattle, WA", "duration": "N/A", "pros": "I have had the opportunity to work with PMI for 9 years in an admissions capacity.  I can honestly say that I look forward to coming to work everyday.  One reason for that is that I truly enjoy the people I work with but mainly it is the fact that people who come to us for training are never disappointed.  They actually get what I tell them they can count on us to get...a new career in a well respected sector of the community.  I have the privilege of watching these student become better versions of themselves and soaring to heights they never thought possible.  Having worked for other vocational schools, I can tell you that Pima is like no other organization I have ever been associated with.  I have never felt pressured to enroll students that were not ready to take on a training program in order to satisfy the \"bottom line\".  That in itself is amazingly refreshing and I'm sure has more than a little to do with why our students are as successful as they are.  I hope to retire (one day) from Pima Medical Institute.  If you have the opportunity to join our very special team, don't think twice about it.  You will never be sorry.", "cons": "I can't really think of anything."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing Company!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Dec 2020", "job_title": "Medical Assistant Instructor in Denver, CO", "duration": "N/A", "pros": "Leadership, flexibility, salary, work environment, fun", "cons": "None, I love my job"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Great Company", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Oct 2020", "job_title": "Student Finance Officer in Houston, TX", "duration": "N/A", "pros": "Family oriented, school has an excellent reputation", "cons": "Bring ppl in from different for-profit schools that are starting to bring the company down"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "company review", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "21 Dec 2020", "job_title": "Front Desk Receptionist in Albuquerque, NM", "duration": "N/A", "pros": "Family Oriented, Successful, Proud, Strong, Great benefits, Caring", "cons": "There are no cons to working here."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "PIMA MEDICAL INSTITUTE  Trusted, Respected, Preferred", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "8 Apr 2015", "job_title": "School Secretary in Denver, CO", "duration": "N/A", "pros": "I am an Alumni of the Medical Secretary program\r\nAnd current Secretary of the Denver Campus for nearly 13 years\r\nPros: As I have said for many years Pima is Trusted, Respected, Preferred as a former student of Pima (PMI) ,  I found that I could trust PMI  to teach me the skills I would need to work in the front office\r\nof a Medical practice.  \r\nThe respect that was shown to me by all the staff and faculty, made me feel good  about myself and build my confidence always  to do the best job I can.\r\n After graduating and becoming an Alumni of PMI I understood the reason why so many\r\n Preferred PMI and it is because they really care about helping you to succeed and reach the goal you set for yourself and your future. \r\nThat is why I feel it is a privilege to work for Pima Medical Institute for nearly 13 years.\r\n PMI has set high standards and we demonstrate high ethical conduct and values with all Staff and Faculty and our students.\r\nOnce again another reason why we at PMI have the most outstanding results of thousand of graduates working in our medical communities today and for over 40 years.\r\nOur PMI employers treat all employees as if they are the most important parts of being a valued team.\r\nThat is a great feeling.", "cons": "No cons Pima Medical Institute Is a wonderful place to work and go to school"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent Employer", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Oct 2020", "job_title": "Instructor in Mesa, AZ", "duration": "N/A", "pros": "Excellent benefits, great support, great on hands training, well written curriculum, ESOP, feel valued and appreciated", "cons": "Older building with maintenance issues"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great Company With a Great Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "27 Feb 2017", "job_title": "Faculty Coordinator in Albuquerque, NM", "duration": "N/A", "pros": "A culture of collegiality and mutual respect exists at this institution. Students and employees are equally valued but we always ensure that the decisions that are made are done so with the best interest of the students. PMI is owned by both the employees and the Luebkes. As an ESOP company, we work with the mindset that we are not just employees but employee owners. This culture helps to ensure that everyone goes above and beyond to meet and exceed our standards of maintaining student success. Our main and primary focus is to provide high-quality education, prepare students to sit for their national certification/licensure exams, prepare students to be high functioning clinicians, and assist them with career placement. Bottom line is, if the students succeed, we all succeed. Likewise, if the faculty and staff are happy and motivated, they will then do their part in delivering the promise of our mission.", "cons": "At times there is an issue of follow through with projects."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Pima Medical Institute is an outstanding company to work for in every sense.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Dec 2014", "job_title": "Program Director in Houston, TX", "duration": "N/A", "pros": "I have never worked for a company that cares so much about employees.  I genuinely feel blessed to be a part of such a honorable company.  I have felt this way since shortly after being hired.  Everyone is very helpful on our campus and on the corporate level.  I always feel supported and valued.  I also must mention that we are blessed to have the most caring and supportive Campus Director here in Houston.  Phil is an extraordinary leader who has always been willing to offer guidance and direction when I have needed it.  One thing that I especially value about PMI is that there is no cutting corners or sweeping things under the rug.  I love that I work for a company with integrity that is genuinely honest and truly strives to meet and exceed the expectations of accrediting associations and comply with regulatory bodies.  I plan to continue working for PMI until retirement as a proud employee who is honored to be a part of such an outstanding group of individuals.", "cons": "I honestly have no complaints about the company."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Overall Company AMAZING - local campus NIGHTMARE", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Feb 2019", "job_title": "Instructor in Phoenix, AZ", "duration": "N/A", "pros": "Retirement and Benefits for employees is unheard of in this day and age.  Corporate culture and leadership.  PIMA truly cares about students and outcomes. It's not about making money with them. The founder of the school's integrity is still the foundation of the company today.", "cons": "Local campus is a hostile and toxic work environment with a fake front. No support or leadership for educational staff.  Employees will not speak up for fear of losing their job or backlash.  People walk on eggshells. Management has dysfunctional personal relationships with each other which make them unable and unwilling to be effective leaders. All to be part of the mean girls club."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Medical Career Specialist", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 Dec 2014", "job_title": "Career Services Advisor in Albuquerque, NM", "duration": "N/A", "pros": "Employee owned and student focused company which allows for plenty of growth and opportunity as an employee.  I go home every night feeling good about what we do, what I do and how I can make the lives' of students better.  I like working at the \"place to be.\"  Everyone is happy to be here and proud of what we do to in education and job placement of our graduates.", "cons": "Staying up-to-date on current Healthcare restructuring is always a challenge but not one that I would call a \"con\" of working here.  I feel proud to know that Pima does all that it can to ensure that the education we provide is current and in-demand for our students and our community.  This requires hard work behind the scenes and involving.  But, again, not a real \"con.\""}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Nursing Instructor", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Nov 2016", "job_title": "Nursing Instructor in Albuquerque, NM", "duration": "N/A", "pros": "PIMA provides a family-like yet professional working environment which allows me every day to get up in the morning and WANT to go to work - something I had not felt for a long time prior to my employment here. I highly appreciate my colleagues, have an excellent working relation which every single one - and love my students. I thoroughly enjoy teaching and realized only later that this is the field, I should have turned to long ago - and the fact that I came to PIMA (which was almost accidental) was more than good fortune! I enjoy being a member of an exceptional team which impacts the lives of the students in a positive way and gives them hope - and the tools - for a better future by guiding them through the individual programs. I love being an instructor at PIMA Medical Institute!", "cons": "I have yet to find a \"con\" ..."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "I have the best job in the world with the greatest company ever!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Feb 2020", "job_title": "Education Coordinator in San Marcos, CA", "duration": "N/A", "pros": "Working for Pima has been a life changing experience. Being hired over a year ago, I have been exposed to so many different facets of the healthcare industry and the world of career colleges in post-secondary education. I have learned that everything Pima Medical Institute does is intentional and carefully thought out: from their processes, to their feedback, to their willingness to expand and venture out into unknown territory. The culture is driven by an employee-owned mindset and on all of the campuses that I've been to, you feel the sense of family and teamwork. I am so grateful to work for a company that truly values my opinions, recognizes my efforts, and consistently provides me with the highest quality of support and encouragement. I come to work grateful and privileged to have such a fun job surrounded by truly unique coworkers!", "cons": "There are no cons to working at Pima. It's that amazing."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Wonderful people and Management", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 May 2016", "job_title": " in Tucson, AZ", "duration": "N/A", "pros": "The culture at Pima is that people truly care about each other and the students. From the CEO to the administrative assistants, there is team work and comradery throughout the Company. I am so glad I made the decision to leave the job I had been at for the past 4 years and come here. The fact that the company is an ESOP means that the employees have partial ownership and will be rewarded with stock shares just for being a great employee. I no longer have to worry as much about about my retirement because of my stock options and their generous 401K match. The benefits are great, the generosity of management is unheard of in today's workforce. This company has allowed me to have less stress and a healthier work life balance.", "cons": "The pay tends to be on the low side for certain positions."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Proud to be a part of this Organization", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "16 Apr 2020", "job_title": "Instructor, College Or University in Mesa, AZ", "duration": "N/A", "pros": "The pros of working here are almost endless. I cannot say enough good things about how fair and diplomatic everyone is. From the janitor to the CEO - we are a family. We treat each other as family. Corporate office has always done what is fair with their employees. Even doing things that weren't their responsibility, they still \"do the right thing.\" If it is for a student, or for an employee.  Everyone looks out for one another and if something happens to one, it happens to all. Can't say enough - I love going to work - We do have stresses but we take them on together and work together until it is resolved.", "cons": "Don't we all wish we made more money? I really cannot complain there either, just thought of a negative everyone says...."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 May 2015", "job_title": "Program Director in Houston, TX", "duration": "N/A", "pros": "I have been with Pima for three years.  I came to Pima from another proprietary school and the difference between the two is tremendous.  The people at Pima, whether on campus or at corporate, really care for the employees AND the students.  This is not the case with my previous employer.  Pima is all about recognition and rewards for employees and student who do well.  This creates a wonderful atmosphere to work in.  I am very happy that I made the move to Pima.", "cons": "I would love to have some online options for attending educational methodology courses, not just the ones on campus.  It is difficult to make it to these sessions when they are typically held at times when me and my faculty are instructing students."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Program Director", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "23 Apr 2015", "job_title": "Program Director in Las Vegas, NV", "duration": "N/A", "pros": "I love working at and for Pima! My boss is the bomb, and the associate campus director is down-to-earth and approachable! There are so many companies and schools out there which are solely financial based, but Pima is employee and student based. This is the best place I've ever worked! I've been in the medical field for 20+ years, and have worked for the past 35 years, and Pima Medical Institute is without question my dream job!", "cons": "Although I know there are faults and cons with all companies and jobs, I have not yet found any at the campus I work at, nor have I found any with the corporate office which I am in constant communication with."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Pima is great!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "14 May 2015", "job_title": "Office Assistant in Renton, WA", "duration": "N/A", "pros": "I've been with Pima for 6 years, and it is an amazing company.  What I am impressed is that Pima started as a family business, very small, but even today as a big company, they carry that warm, caring environment where everyone cares about each other.  When you have that safe and healthy work place where employer cares about employee, the employee cares about coworkers (staff/faculty) and students, then students respect instructors back, and we appreciate each other.  It’s like a chain reaction of love.   The support I get from work is one of the main reasons that I love my work and make me want to be good at what I do each day.  I haven’t had a day that I didn’t want to come to work.  The team work is very important and Pima has that kind of support and good environment to grow. I am so thankful and fortunate to be working at Pima.", "cons": "It's really hard to come up with the cons.."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "18 Dec 2013", "job_title": "Anonymous Employee in Tucson, AZ", "duration": "N/A", "pros": "Huge compassion and great family values in terms of what they are trying to accomplish.  Yes, they are for profit, but most successful companies are.  Wouldn't you want to get an education from a company that is successful?  Mission statement says profit is only by-product of helping students succeed in quality education.  Yes they realize students come first and they have natural passion for that.  Your not around for 40+ years if you are not helping people and that's what they are good at.", "cons": "No cons.  All I need to do is visit one of the campuses and talk to the students to know we are changing peoples lives in a positive way. That is what is important to me and why I love my job."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Life is good!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "29 Oct 2015", "job_title": "Regulatory Affairs Coordinator in Denver, CO", "duration": "N/A", "pros": "My supervisor is my advocate. She values me and recognizes my work when it is extraordinary. I need to be challenged and she continues to provide me with projects that increase my knowledge and skills. She is an honest and ethical leader and her leadership instincts are impeccable.", "cons": "I really do not have any cons. I have worked for PMI for 11 years and I still love coming to work every day. I appreciate that PMI is an employee stock owned company. The ESOP not only provides the employees with a stock benefit, it creates a culture of a big family who owns a business. Companies with ESOPs and other broad-based employee ownership plans account for well over half of Fortune Magazine's \"100 Best Companies to Work for in America\". PMI's ESOP is a return on sweat equity - the harder we work, the more the company increases in value, and the higher the stock value."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "PIMA Stands Strong Against COVID-19", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Apr 2020", "job_title": "Faculty Member in Houston, TX", "duration": "N/A", "pros": "It is a crazy time out there with the COVID-19 pandemic, but without a doubt PIMA stands strong.  I have never been more impressed with how the leadership and the instructors  have come together to ensure that our students remained successful during these trying times.  There was no hesitation to ensure our students would continue their education from the Faculty and no hesitation that our Faculty would continue to be paid from our leadership.  Without a doubt, this makes a strong statement, and I am glad that PIMA is allowing us to work from home and protect ourselves and our families.", "cons": "Changing to an online platform overnight does not come easy for any organization but PIMA made it look easy.  We were provided guidelines and regulations to assist us in managing our transition, and we began this while we were on campus."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "There aren't many schools like Pima left.", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Mar 2015", "job_title": "Medical Career Specialist in Mesa, AZ", "duration": "N/A", "pros": "The owner seems to be down to earth. I've met the CEO several occasions. Overall got along with everyone even at other campuses. Pima has a very positive working environment.  It felt like one big family. The pay and benefits was above average in my opinion. If you do well and your hard work will be recognized.", "cons": "No job isn't going to be perfect. Had a few bad apples here and there. There are some employees who clearly struggle to their jobs. Some personality would clash with departments."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": "N/A", "review_title": "Quality Education, Quality Employer", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Apr 2020", "job_title": "Instructor, College Or University in San Marcos, CA", "duration": "N/A", "pros": "The Pima organization, from the top down, demonstrates a commitment to deliver what they promise- a great value in medical career education.  Every employee  I have encountered demonstrates professionalism, enthusiasm and a desire to contribute to developing outstanding medical technicians. Having started just before our current Covid-19 crisis, I have seen first hand how the instructors and administration have sought to support each other and the students through a very challenging transition to on-line learning.  It has not been easy, but there has been camaraderie and encouragement all around.  The corporate staff have provided excellent training and direction and have maintained high expectations for quality education to be delivered.", "cons": "It has not been an issue for me, but hours are varied due to different class schedules."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "The Best Company I have Ever Worked For", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Jun 2017", "job_title": "Program Diector in El Paso, TX", "duration": "N/A", "pros": "The culture of this company is simply amazing. Everyone, and I mean everyone, makes you feel like part of the family since day 1. I just started working for PMI less than two months ago, and I really hope I can retire here (I am 40 years old). The benefits, the interest for the welfare of the employee, the constant and never-ending assistance to all students (before they start, during the program, and after graduation is something I never experienced before.", "cons": "I have not experience anything negative in my short time at PMI. I have spoken to many employees who have been working 10, 15, 20 years in the company, and all of them LOVE Pima. I am extremely excited to be part of this great family."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Apr 2018", "job_title": "DA Program Lead in Phoenix, AZ", "duration": "N/A", "pros": "Its a blessing to work for such a great company that cares about its employee's as well as the students success. Having an awesome director here at our Phoenix Campus who empowers her staff makes the job all that much better. Our CEO Fred, makes sure he gets to know all his employees at all 17 campuses making sure we each feel that special bond. We have amazing benefits and to top it all off a fantastic ESOP program which all full time employees get to be apart of.", "cons": "Salary for faculty could be higher, however Arizona is ranked 48th in the U.S.  when it comes to an educators salary. On the other hand, being an educator is not about the salary, its about changing lives and this is what we do at Pima Medical Institute."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A overall great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Aug 2018", "job_title": "Career Services Advisor in Phoenix, AZ", "duration": "N/A", "pros": "We are a team, we work as a team and we meet the students needs as a team.  All of the departments here come together to work with the students.  My favorite part is celebrating student success!  The atmosphere is comfortable, student centered and goal oriented.  We are encouraged to continue learning and focusing on professional development.", "cons": "There really isn't any.  We are a team and we have fun!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Company Review", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "28 Jan 2020", "job_title": "Program Director in Seattle, WA", "duration": "N/A", "pros": "The company has ethics and high standards.  Deeply cares about it's mission and it's impact on the community.  Appreciates the work and dedication from it's employees.", "cons": "Need to be \"uniform\" across all campuses.  Changing entire processes that work because a other do not follow rules.  Decisions to terminate employees when they are not doing their job drags on or never happens which puts a strain on other team members.  Minimal development opportunities available within the company."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Very Family Oriented; Takes care of their employees", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Dec 2018", "job_title": "Anonymous Employee in Chula Vista, CA", "duration": "N/A", "pros": "I am one of the newer employees and 100% of the days I have worked we have had some kind of baked good provided for us. The team here campus wide is very friendly, helpful, and welcoming even the higher ups. We are well taken care of here.", "cons": "We eat... a lot! We have had lunch provided for us at least once a week and again some kind of baked good almost everyday so it's hard to say no to goodness and any new years resolution of losing weight or cutting out sugar may not work well for you."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Absolutely LOVE this school!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "27 Feb 2017", "job_title": "Medical Career Specialist in Tucson, AZ", "duration": "N/A", "pros": "We are a family owned company, but more importantly because of our ESOP program, we're a majority employee owned company! Having this really helps with not only feeling like you have a say in how things go, but your peers are more apt to contribute better because of having ownership. Management is great, our CEO is fantastic, we really hire some great people. Our instructors are invested in the school and students. I just love this place, and will hopefully retire with this school.", "cons": "It's hard to get promoted in this school because no-one leaves! This isn't necessarily a \"con\" per se - because that's a good thing. However, we are growing, so opportunities should arise."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Company with Integrity, Heart and promise for a bright future.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "17 Apr 2020", "job_title": "Student Accounts Manager in Tucson, AZ", "duration": "N/A", "pros": "1. Open door policy.\r\n2. Participates in an Employee Stock Ownership Program.\r\n3. Works to maintain the philosophy  of the founders which, among other practices, included the idea of giving back to our communities and  the brilliant idea of \"people  first\"(students, community and employees). 'When you put people first, company profits will follow. \"\r\n4. Leadership that any company would be proud of, on all levels.", "cons": "Some employee owners would like to be brought into conversations regarding  changes and growth of our company.  There is some of that but could be a lot more."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Love Pima but need good management", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Aug 2016", "job_title": "Anonymous Employee in Mesa, AZ", "duration": "N/A", "pros": "I have worked at Pima for several years and it has been my favorite job! I love the people I see in the hallways each day. It has always been a positive environment and simply family. Seeing students succeed and helping them change their lives for the better makes a rewarding career.", "cons": "Not many cons besides 1 department I am concerned about. They had all been a great team until recently with new management. It's sad to see what they get put thru and how they are treated by the boss. I have seen Co workers in tears. They are all great people and here for the students."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent Culture and Support", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Apr 2017", "job_title": "Faculty Coordinator in Renton, WA", "duration": "N/A", "pros": "Pima is one of those companies that truly lives up to their mission and family-oriented  roots. I read these reviews before being hired in the hopes that the reality was somewhat close, but now have the privilege of being a part of changing lives and am provided all of the tools to thrive in that mission. I'm very happy to work here and have enjoyed the culture shift from my last position in vocational education.", "cons": "There are no real cons or limitations. Education has its challenges, but we are provided the resources and trust to solve problems."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Jul 2016", "job_title": " in Tucson, AZ", "duration": "N/A", "pros": "Since coming to PMI a year ago, I have felt nothing but supported and appreciated by my boss and other faculty members.  This is the most positive place to work!  The stress levels are low (most of the time) but it is truly a fun place to work and I am proud to be here.", "cons": "The only con here is the sense of isolation between programs since the campus is in different locations.  That will change once we move to our new location"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Radiography Program Faculty", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "1 Mar 2017", "job_title": "Radiography Faculty in Chula Vista, CA", "duration": "N/A", "pros": "We produce high-quality graduates who are sought-after in the local healthcare workforce and have established an extremely favorable reputation for us. It is intrinsically rewarding to be a part of changing people's lives in a positive way. Our campus team is always helpful and supportive, and we have become a sort of a family.", "cons": "Although rare, dealing with academic failure and disciplinary issues is not my favorite undertaking. Moreover, the administrative demands of the job sometimes make it a bit tedious, yet that is more than compensated for by our student success rate."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "14 Feb 2019", "job_title": "General Counsel in Tucson, AZ", "duration": "N/A", "pros": "Pima succeeds in a tough sector because it stays focused on what matters: educating students and helping them gain employment in their field of study. The same commitment to core values supports a great workplace. Employees own a majority of the company. We work hard and get paid well, and receive plenty of positive affirmations.", "cons": "I can think of no negative attributes. (Having represented Pima as as its attorney for 35 years (part-time GC for the past almost 4), I'm sure I'm biased. However, I have represented dozens of businesses over 37 years, and this one's great!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Lead Dental Assistant Instructor", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Oct 2017", "job_title": "Lead Dental Assistant Instructor in Renton, WA", "duration": "N/A", "pros": "Completely blown away by the warm reception by the current faculty,  management, and students.  The training and expectations were explained and facilitated wonderfully by management. This is a family oriented learning institute I am beyond excited to start my new journey with my colleagues. I look forward to being a positive influence to the new present and future dental assistants.", "cons": "Wish more people knew how great PIMA is and all the courses they have to offer. The great support staff they have in place in career services to help them a long the way."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Love this company and my coworkers!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "25 Aug 2018", "job_title": "Student Services Coordinator in Phoenix, AZ", "duration": "N/A", "pros": "Great bunch of folks working together sharing the goal of student success in a family atmosphere. Instructors, staff and management all are passionate about making sure the students get the resources they need to succeed. Campus pride is evident when you walk in the door.  Employee ownership shows! Proud to work here with this great group of professionals. Corporate support is consistent and the benefits are great.", "cons": "The only thing I can say is a con is that I didn't work here sooner.  You get out what you put in."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Best Company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 May 2015", "job_title": "Lead Pharmacy Technician in Colorado Springs, CO", "duration": "N/A", "pros": "Pima Medical Institute is by far the best company I have ever worked for. It is very rare to find a company that truly values their employees and their hard work. Despite the companies growth and expansion, PIMA still makes the effort to make every employee part of the family. The curriculum is the best I have ever seen and student satisfaction is high. PIMA cares about the success of each student that walks through the door. Support for faculty is outstanding in every way.", "cons": "I have no complaints about working for PIMA, I just wish I had found PIMA sooner."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Instructor", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "20 Jun 2016", "job_title": "Instructor in Las Vegas, NV", "duration": "N/A", "pros": "Employee focused company. Best retirement plan I've ever seen! A very hands off approach from management allowing you to do what you need to get your job done. Honestly if your manager is talking to here your not doing your job! Great environment to be in.", "cons": "Some of the paper work associated with the job is a little redundant. Sometimes a little to many channels to go through to get the things you need."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Working at Pima Medical Institute is like winning the job lottery!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Mar 2018", "job_title": "Anonymous Employee in Phoenix, AZ", "duration": "N/A", "pros": "PMI is an employee owned company that genuinely values every member of the team. The corporate management and support staff come along side campus staff to assist rather than direct. During employee orientation one of the things that struck me was that the students were at the top of the org chart and top leadership was at the bottom of the org chart. Since 2014 I have evidenced this day after day, decision after decision. :)", "cons": "While it may be hard for some to believe... There are no cons being an Employee Owner at Pima Medical Institute!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Career Services", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "10 Apr 2018", "job_title": "Anonymous Employee in Renton, WA", "duration": "N/A", "pros": "Pima Medical Institute is true to its mission, “to improve the quality of people’s lives by providing the best value in medical career education.” The leadership at Pima Medical Institute listens to its students, employees and community partners to constantly improve process and procedure efficacy. The organization as a whole is dedicated to developing and encouraging its employees.", "cons": "It is hard for me to articulate a con, as my experience has been so good. But perhaps the fact that Pima Medical Institute is a smaller organization and it therefore limits upward mobility. They do however offer a substantial amount of skills development and continued education."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "I have been working at Pima Medical Institute for over 8 years", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "18 Dec 2013", "job_title": "Anonymous Employee in Las Vegas, NV", "duration": "N/A", "pros": "A very caring, giving, family oriented company with employee ownership through ESOP.  A school that cares about it's students and employees.  This is not a money hungry school out to rip people off, but a school that is out there to help those people that want to better their lives.", "cons": "None!  I've been with enough companys to know that PMI is special & I'm proud to be a part of it."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Progressive company with a terrific customer-first, people-first attitude!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "30 Dec 2013", "job_title": "Campus Director in Houston, TX", "duration": "N/A", "pros": "1. Pima is a company that provides outstanding opportunities for professionals with excellent people skills.\r\n2.  Pima is a very rewarding place to work as the company fully supports its Mission Statement of improving lives by providing the best value in medical career education.\r\n3.  Pima has outstanding upper management leadership that has family values, values of high integrity and values that provide excellence in service delivery.\r\n4.  Pima has a great sense of teamwork with its intra service delivery between its employees at the Corporate level and the campuses.\r\n5.  Pima is a company that allows you to \"knock yourself out\" with your passion!  You can give all that you want!\r\n6.  Pima has a very promising future with phenomenal metrics, an impressive rising financial picture and a strong demand for services offered.\r\n7.  Pima provides a professional and productive and safe work environment.  It is fun to work at Pima. I look forward to go to work every morning as soon as my feet hit the floor!", "cons": "This is actually a good thing, but don't apply to Pima if you just want to put in your time.  Everyone works hard and stays on task.\r\n\r\nSome of the pay ranges could be somewhat higher, but there is an excellent retirement plan that more than makes the difference."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Pima has changed my life.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 May 2019", "job_title": "Career Services in Mesa, AZ", "duration": "N/A", "pros": "I have been employed by Pima Medical Institute for 18 months and I have found a new family. I have felt nothing but love and respect from everyone within the company as well as the students that attend our school. With the assistance of Pima's tuition assistance reimbursement benefit, I was able to finish my associate degree, and I will complete my bachelor degree in business management by August 2019. Pima treats their staff with admiration and continually shows its appreciation for its employees with annual and holiday bonuses. I also had the privilege of being selected by my peer’s to be a peak performer in 2018. Pima has 18 different campuses and they take the time to recognize two people from each campus annually as peak performers. As a peak performer Pima sent us and a guest on an all-expense paid trip to Huntington Beach, California at an amazing resort for four full days. Prior to my career at Pima I was a military officer in the United States Army for 25 years, and the respect and patriotism that I have felt since I started working has been amazing as well as humbling.  \nPima is an Employee Stock Owned Company (ESOP); as an employee owner I am committed to Pima Medical Institute and feel an immense sense of pride being part of such a strong, successful institution. The legacy and tradition passed on to us from our founders to operate with integrity and grace will always be ingrained in my leadership style. I see an extremely bright future for PMI and look forward to being a part of that realization.", "cons": "I cannot ever get enough of the respect and admiration I receive from all of the employees and students here at Pima Medical Institute."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "5 Jan 2016", "job_title": "Faculty Coordinator in Renton, WA", "duration": "N/A", "pros": "The staff and faculty are dedicated to student learning as well as making the work environment fun and collaborative. \r\n\r\nThe leadership does \"the right thing\" for students and employees. It's not about the money - it's about education.\r\n\r\nThere are lots of benefits for employees that keeps the retention of personnel high (Employee Stock Options, Open Book Management, educational scholarships, matching 401K) but the biggest reason people stay is because we treat each other with respect.\r\n\r\nPima Medical Institute is a great place to work and go to school.", "cons": "Whatever the cons are they get worked out."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Be Very Careful On Accepting ANY Job", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "30 Jan 2017", "job_title": "Instructor in Chula Vista, CA", "duration": "N/A", "pros": "The employee stock plan is pretty good. Teaching online is lucrative when also teaching classes on the ground", "cons": "Management is only out to make sure as many students as possible get through. I was asked to change grades to pass students. Was told FLAT OUT to make the curriculum easier even if the student wouldn't be functional in the job field. Management after I left asked externship site to falsify paperwork to pass a student rejected for the 3rd time at an externship site. Management also falsifies reports against instructors if an instructor won't comply with passing students"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Jun 2016", "job_title": "Anonymous Employee in Tucson, AZ", "duration": "N/A", "pros": "This company is amazing!  It truly cares for its employees and more importantly its students.  I have worked for PMI almost 8 years and love getting up in the morning knowing I am going to see my PMI family!!!!!  Our Employee Stock Option Plan is the best in the business.", "cons": "I don't see many cons with PMI, however would like to see assistants for the various coordinators and the campus directors especially at the larger campuses."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "I'm a happy faculty instructor!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Aug 2016", "job_title": "Instructor in Aurora, CO", "duration": "N/A", "pros": "By far the best! I have worked at our competitor & Pima exceeds everything. I especially love the ESOP! I have a say in how we move forward. Also, the fact that I impact the lives of our students everyday!", "cons": "Honestly the only thing that springs to mind, is that some of the meetings (i.e. with our fitness guru) happens during the day and I have my other job and can't attend."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Director, Instructor, Faculty Coordinator", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "25 Jul 2018", "job_title": "Anonymous Employee in San Marcos, CA", "duration": "N/A", "pros": "Family owned, ESOP, great people to work with, competitive salaries, other possible bonuses, free turkey!, incredible support from our Mother Ship! AMAZING Director of Education!", "cons": "Some management not in the healthcare field, training and onboarding may not be sufficient for everyone but that is quickly changing; occasional breakdown in communication to all levels"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": "N/A", "review_title": "Love what you do!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "4 Jun 2019", "job_title": "General Education Teacher in Albuquerque, NM", "duration": "N/A", "pros": "PIMA Medical Institute is the right place to work for you if:\r\n- you are a devoted and enthusiastic employee\r\n- you are loyal and patient with your customers/students/coworkers\r\n- you want to build a long-term relationship with the company\r\n- you possess life-giving energy and believe in second chance\r\n- you are inspired to change other people's lives and create a positive ripple effect in your community\r\n- you have the company ownership mentality and leadership qualities", "cons": "As anywhere in the medical world, there are long work hours and potential burnout"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "PMI is the best company that I have ever worked for!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Apr 2020", "job_title": "Physical Therapist Assistant Instructor in Mesa, AZ", "duration": "N/A", "pros": "PMI shows how much they care and support both their staff and students in a variety of ways. They provide necessary tools and resources to promote individual and program success. During the COVID-19 outbreak, staff were given resources and assistance to be able to transition their classrooms to the online learning environment in a smooth manner.  I definitely feel equipped and confident to continue to be successful during this weird period of time.", "cons": "I honestly cannot think of anything."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Solid Company with solid values", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Mar 2016", "job_title": "Faculty Coordinator in Las Vegas, NV", "duration": "N/A", "pros": "This company puts their students first, regardless.  I love the honesty and adherence to solid values that makes this company the leader in private education.  I've been here 8 years.  It's been the best place I've worked at in my life.", "cons": "No company is perfect, but there is nothing of any significance to complain about.  If issues arise, they are normally resolved to everyone's satisfaction at the campus level."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Wish all companies operated like PMI", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "26 Mar 2016", "job_title": "Faculty Member in Seattle, WA", "duration": "N/A", "pros": "PMI has a deserved reputation of quality and student centered education. The faculty, seems to genuinely care about training qualified medical professionals to begin a career, not just get a job. All colleges should approach education this way!", "cons": "Many of the millennial  students seems to wait for things to be delivered on a platter, rather than working for it. This isn't a reflection on PMI, but perhaps try to attract more mature students and everyone wins."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Work Study", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "28 Apr 2016", "job_title": "Federal Work Study Student in Seattle, WA", "duration": "N/A", "pros": "Good for resume.\r\n If your a student looking to make some extra cash it will pay.\\\r\nIts inside a office setting;no harsh weather conditions.", "cons": "Being an outsider to the organization, limits understanding and there is a under tone of condescending attitudes. Limited networking possibilities. The Staff has a very two faced approach to interactions with students and contracted companies that take on the schools Interns. Flirting with students demoralizes and shows disrespect to students-Professional conduct is not exemplified every member in this small office."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Career Services Adviser", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Aug 2017", "job_title": "Career Services Advisor in Colorado Springs, CO", "duration": "N/A", "pros": "Working for Pima has been so incredible! The people are so supportive and inspiring.  They are making a difference in people's lives and have enabled me to do the same. The benefits are unheard of and really show that they truly value their employees. I fell blessed to work for this organization.", "cons": "the only con is that i am ruined for any other job. Best job I have ever had!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Student Services", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "9 Jan 2017", "job_title": "Anonymous Employee in Albuquerque, NM", "duration": "N/A", "pros": "I Worked at PMI for 19 years, the time there I was treated with respect and as a valued employee.  PMI has great benefits which is a huge plus.\r\n\r\nThe best reward of all was seeing how many people became successful by choosing to attend PMI.  They now had new careers which enriched their lives professionally and financially.  It gave me satisfaction to see the increase in pride that each of these individuals exhibited.", "cons": "Because of my dedication I wored to many hours."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "The company's philosophy remains the same since 1972", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Jun 2016", "job_title": " in Las Vegas, NV", "duration": "N/A", "pros": "The managers are always approachable not only at the local campus level, but also at the corporate level. The VP knows every employees name which is impressive. The company is student focused and they value the ideas of the employees. It is important to the company that they treat each employee with respect and with value. This makes the employment turn over rate very low", "cons": "Would like to see the regional directors have more time to spend with employees and not just with management team"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Director", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "24 Apr 2015", "job_title": "Anonymous Employee in Mesa, AZ", "duration": "N/A", "pros": "Mission and Philosophy of Owners truly lived\r\nOutstanding lateral teams\r\nFun environment in which to work\r\nBonus system\r\nAmazing retirement program - all paid by employer\r\nGood 401K employer matching contribution\r\nGood reputation in service sector\r\nResponsive upper management", "cons": "Salary way below market\r\nHierarchical communication poor - started as small close knit company and communication still assumes that intimate level, which doesn't suit the growth of the company\r\nPhysical environment doesn't compare to other market sectors\r\nNo flexible scheduling considered or allowed\r\nTechnology support outdated and slow to respond to changes"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing! A for-profit school that takes its mission seriously.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Dec 2013", "job_title": "Accountant in Tucson, AZ", "duration": "N/A", "pros": "Student-first: PMI is the epitome of none left behind in the education process (unless the individual chooses it).  \r\n\r\nESOP:  PMI rewards the efforts of their staff with an ESOP for employees to take ownership in their work and retirement.", "cons": "Cons are consistent with most employers - it depends on the viewpoint of the individual."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "It doesn't get any better!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Jul 2016", "job_title": "Admissions Advisor in Mesa, AZ", "duration": "N/A", "pros": "Fully supportive staff, a genuine concern and support for each student, outstanding leadership and just all-around good people, from students to staff. This organization is one of the few good ones left.", "cons": "No cons at all. I have enjoyed working for this school from day one."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Faculty", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Dec 2016", "job_title": "Faculty in Tucson, AZ", "duration": "N/A", "pros": "The entire organization seems to have a student centered perspective. Students are what drives the success of PMI, and their importance is apparent.", "cons": "Limited growth opportunities. But I think that's the result of a flat organization and part of the company's long term formula."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Excellent Company with a Family Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "13 Mar 2014", "job_title": "Instructor in Albuquerque, NM", "duration": "N/A", "pros": "As an instructor we are given the autonomy to design our lesson plans as we see fit with a lot of encouragement from everyone. Very upbeat, positive people at all levels.", "cons": "Equipment access was a bit hit or miss but has gotten better."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Great Company, Not so great campus leadership", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "5 Sept 2019", "job_title": "Anonymous Employee in Houston, TX", "duration": "N/A", "pros": "Employee owned\r\nOpen Door policy\r\nStudent Focused", "cons": "Campus leadership is questionable at best. Too much focus on student enrollment numbers is leading to poor quality of students.This campus starting to become a \"diploma mill\" \r\nCompensation at this campus isn't that great either"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "I enjoy coming to work each day", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 Feb 2020", "job_title": "Full Time Faculty in Albuquerque, NM", "duration": "N/A", "pros": "Supportive environment between management, faculty, and staff.  ESOP company so we all have a stake in Pima's success.   We change peoples lives!", "cons": "Student high school preparation in New Mexico is abysmal in regards to study skills, math, and writing.  This makes it time consuming working with underprepared students.  All that said, when these students find success in our Program, it is deeply gratifying as an instructor."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "PMI is the \"Hotel California\" of EDU;s .... You will check in but never leave.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "23 Aug 2014", "job_title": "Anonymous Employee in Mesa, AZ", "duration": "N/A", "pros": "Pima Medical Institute is a wonderful place to work, it's a family/employee owned company which allows everyone to benefit from successful outcomes.  The org chart is flipped (the students are on the top) which helps us remember why we go to work each day.  We are changing lives, preparing medical professionals for fantastic futures and helping our local communities It's a \"feel good\" organization.", "cons": "As with many organizations, communication could improve."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Truly feels like family!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "14 Apr 2020", "job_title": "Program Director in Mesa, AZ", "duration": "N/A", "pros": "Clear mission, trust, empowerment, support, compassion. The words I think of when describing this organization - I attended PMI as a student, and came back to teach here. With their support I continued my education and grew into my current position as program director. I speak from the heart when I say that I love this institution, and feel blessed to work with such amazing human beings.", "cons": "I don't have any cons to report."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Pima Life", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Apr 2018", "job_title": "Career Services Coordinator in Colorado Springs, CO", "duration": "N/A", "pros": "I enjoy working at Pima because the company truly lives up to the mission. I enjoy having a part in assisting graduates in meeting their goals and watching them succeed for themselves and their families.  I like that there is variety in the daily grind to keep me on my toes!", "cons": "The only downside is that I rarely get to see my counterparts and would like to have time to celebrate successes, get best practices, etc."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Career Services Coordinator", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Jul 2015", "job_title": "Career Services Coordinator in Phoenix, AZ", "duration": "N/A", "pros": "I love my job !! I am happy to come into work everyday! I feel like part of a team. I can not wait to grow with this company. Exciting changes to come soon.", "cons": "Utilize more ideas to keep our student ahead when it comes to technology."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Working here is best case scenario!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Jun 2016", "job_title": "Intructor in Phoenix, AZ", "duration": "N/A", "pros": "It is nice to feel appreciated by your campus director. All the instructors and admin staff help each other and the atmosphere is family like. I love my job and the management allows you to be autonomous but still has guidelines to follow. Structure without tying your hands. Benefits are great also. ESOP also!!", "cons": "Insurance is a little pricey, but it is good coverage."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Big corporate-like solutions by a family-like organization", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Apr 2020", "job_title": "Instructor, College Or University in Las Vegas, NV", "duration": "N/A", "pros": "Family-like, close knit environment with supportive staff and faculty. Demonstrated a proactive approach centered on students well before others during the current pandemic crisis. Voiced appreciation of faculty, awareness of efforts and provided a myriad of resources and structured guidance for instructors. Top notch.", "cons": "Only the growing pains of transitioning from a small family owner organization to an employee owned company"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "31 Jul 2016", "job_title": " in Mesa, AZ", "duration": "N/A", "pros": "Have been there more than 5 years.  Love the idea of being an employee owner (ESOP).   Management does listen to new ideas.  Definitely a team approach!", "cons": "Like any company there are growing pains at times, but management listens and changes are made over time"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Blessed", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Dec 2017", "job_title": "Admissions in Chula Vista, CA", "duration": "N/A", "pros": "The \"higher ups\" are humans with beautiful hearts. They are not your typical money hungry bosses. They actually laugh with you and smile at you.  You get fed a lot. You do not work on weekends. Bosses are flexible and understanding. Everyone is family in the WHOLE company.", "cons": "You will never take another opportunity, because you'd be stupid to leave :). No one ever quits"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Still pleased after six years", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Sept 2019", "job_title": "Director of Clinical Education in Denver, CO", "duration": "N/A", "pros": "Pima has consistently supported students, faculty and staff. They have recently partnered with Franklin Covey to provide high-level in-services and ongoing resources to nurture a culture of trust and professionalism. I particularly appreciate that they pay for my annual professional dues and the cost of one conference each year.", "cons": "Sometimes it feels difficult to take time off, due to the year-round curriculum schedule."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "There is NO ONE that compares to Pima Medical Institute!  If integrity matters to you, this is the place!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Apr 2020", "job_title": "Campus Director in Mesa, AZ", "duration": "N/A", "pros": "Amazing place to work!  Employee owned company!  The most caring professionals when it comes to students and their success!  You truly cannot ask for a better place for your career!", "cons": "I truly cannot think of anything!"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Pima pride runs deep throughout the entire organization.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 Jul 2019", "job_title": "Administrative in Phoenix, AZ", "duration": "N/A", "pros": "The phoenix campus continues to innovate while keeping student and employee satisfaction at the forefront always. We work with dedicated professionals who are authentic and driven to see our students turn into graduates who ultimately work in their field.", "cons": "There are cons with every organization but at PMI You have to look very hard to find them."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Ethical company with family values", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "29 Mar 2019", "job_title": "Faculty Coordinator in Tucson, AZ", "duration": "N/A", "pros": "Ethical and transparent, always doing the right thing because it's the right thing to do, not because a regulatory agency is looking in. People are treated as people, not as numbers or revenue.", "cons": "I've worked at PMI for 6 years and have yet to hit a con of working there."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A Company You'll Never Leave", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "6 Jul 2015", "job_title": "Administration in Colorado Springs, CO", "duration": "N/A", "pros": "Amazing company with stable and proactive leadership. Doing the right thing for the student is always the number one priority and is reflected onto the employees as well.", "cons": "There has never been a time during my 7+ years so far that I have found a con with Pima."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Clinical Instructor- Great place to work. Great nursing program.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Jul 2013", "job_title": "Nursing Educator in Tucson, AZ", "duration": "N/A", "pros": "Pay is above average. Clinical dates are flexible. Class sizes are small; never more than six students in each class. Students are knowledgeable and prepared by classroom instruction for clinical practice.", "cons": "Schedules for clinical dates/sites are sometimes released very late making it difficult to make your schedule for other jobs."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Amazing Company!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "10 Jan 2016", "job_title": "Admissions Assistant in Mesa, AZ", "duration": "N/A", "pros": "An employer where management truly cares about their employees and makes them feel valued. It doesn't end with just the employees though, once I was able to move from a corporate position to a campus position I was really able to see how student focused Pima is. Just made me even more grateful too work for this company.", "cons": "There have been some downs, but they always get resolved and it just becomes a learning experience."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "A great place to grow and help others.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Mar 2017", "job_title": " in Denver, CO", "duration": "N/A", "pros": "Great opportunities if you apply yourself.  \r\nWhat you do every day directly impacts a student's life and career.\r\nThe only company in the sector I would work for.", "cons": "Extremely top-down management approach.\r\nThe Ed Department is not easy to deal with.  They are dictatorial and don't appreciate feedback."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Positive work environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Mar 2016", "job_title": "Career Services Advisor in Albuquerque, NM", "duration": "N/A", "pros": "Pima is a positive and well balanced environment where learning is not only encouraged for those students attending but also for their staff members.  I have never seen a group of staff and facility members more dedicated to their student’s success!  Pima Medical Institute understands and encourages staff members to have a balanced work and life style.", "cons": "There are no cons at Pima"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Pima is a great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 Aug 2018", "job_title": "Career Services Coordinator in San Marcos, CA", "duration": "N/A", "pros": "A very transparent and family oriented company, that is also employee owned.  Our CEO Mr. Fred Freedman is very visible in the daily running of every campus which is fabulous.", "cons": "No real down side but, I would love to see more campuses here in California."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great Work Environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Jun 2020", "job_title": "Instructor in Mesa, AZ", "duration": "N/A", "pros": "Working here gives you the opportunity to make a difference in the life of your students while being part of an amazing team. Pima Medical Institute genuinely expresses care regarding their employees and their students. The leadership at the Mesa campus provides their instructors with support, direction and encouragement to the point that I always feel heard and valued.", "cons": "I have no cons to express."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "I currently work for Pima Medical Institute.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Dec 2013", "job_title": "Anonymous Employee in Tucson, AZ", "duration": "N/A", "pros": "This is the most amazing place to work. Dick Jr. is generous, caring, and unselfish. I'm proud to say I work for the PMI team and that is exactly what working here feels like......a TEAM!", "cons": "There is nothing that needs to be changed."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Pima Medical Institute is phenomenal!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "31 May 2019", "job_title": "Campus Director in Mesa, AZ", "duration": "N/A", "pros": "The perfect combination of family and employee ownership. PMI focuses on what  is best for people rather than being guided solely on financial impact. The culture of the company is second to none.", "cons": "Really, it's hard to think of any."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "We are set up for success!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "4 Apr 2018", "job_title": "Career Services in Denver, CO", "duration": "N/A", "pros": "I have held two positions within the organization, and both of my supervisors have set me up for success. Not something that  has always happened with other companies. They develop their talent, which means there is always room to grow. There are little perks all over the place, too many to list.", "cons": "Nothing that outweighs the pros."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company to work for!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Dec 2018", "job_title": "Software Developer in Tucson, AZ", "duration": "N/A", "pros": "Pima Medical Institute has a bright future. All corporate staff members are easy to work with. The company has many self-motivated individuals. Supervisors are trusting and trustworthy. With all the investments in cutting edge technology, this company has no limits.", "cons": "There are no downsides of working for Pima Medical Institute that are worth mentioning."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "San Marcos is the WORST campus", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "9 Jul 2018", "job_title": "Lead Pharmacy Technician Instructor in San Marcos, CA", "duration": "N/A", "pros": "Lots of employee benefits, employee stock, yearly cruise.", "cons": "Lack of training, lack of support when student issues arise, lack  of professionalism among faculty, most instructors are thrown in at the last minute without enough time to prepare for 6 week classes, classrooms and labs weren’t planned out for how they would actually be used, labs and classrooms under construction after class begins"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "VERY HAPPY", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Dec 2018", "job_title": "Admissions Support Center in Mesa, AZ", "duration": "N/A", "pros": "Management is awesome! Best experience as a new hire, didn't have to wait for anything, everything was setup and running correctly. Changes that affect my job are updated immediately you never have to wait or hear it from a co-worker.", "cons": "I can't think of any for now"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Online Instructor", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 Dec 2017", "job_title": "Online Teacher in Tucson, AZ", "duration": "N/A", "pros": "This is a wonderful company that keeps the student at the center of all that we do. We are an  employee owned company where we take pride in keeping our costs as low as possible while delivering the highest quality education to the students we serve.", "cons": "More higher education institutions, both for-profit and non-profit should use PMI's model."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best Place to Work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "9 Jun 2019", "job_title": "Associate Campus Director in Mesa, AZ", "duration": "N/A", "pros": "The President/CEO, Vice President, and all members of Senior Management are first-class! The culture feels like a supportive family environment. Though it is a large company, employees and students are valued/appreciated as individuals, which screams quality.", "cons": "No cons! This is a fantastic company!"}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Instructor", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Jan 2018", "job_title": "Instructor in Houston, TX", "duration": "N/A", "pros": "Adult students are very rewarding to work with. Students are held to a high standard. Instructors are given teaching techniques to help transition from industry to education professional.", "cons": "Nepotism in the Veterinary Technology program. Students are not allowed to pass or fail on their on merit. High turnover for instructors in this program."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "This is a great place to work because the people are freiendly and management is understanding", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Apr 2012", "job_title": "Computer Monitor in Denver, CO", "duration": "N/A", "pros": "It fits into my schedule as a student, they are very understanding when I need to study or leave for school related reasons", "cons": "The pay is low but it is a work study job so can't complain too much."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 May 2019", "job_title": "Career Services Coordinator in Colorado Springs, CO", "duration": "N/A", "pros": "I  enjoy being  part of a company that encourages us to acknowledge each other for our hard work and efforts. I think it is important to celebrate a common goal with other people who share a culture of gratitude.", "cons": "None at the management level."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Jul 2019", "job_title": "Physical Therapist Assistant Instructor in Houston, TX", "duration": "N/A", "pros": "PMI is employee owned.\r\nPMI is focused on the student.\r\nPMI is conservative, caring, and compassionate.\r\nPMI allows freedom to be creative.", "cons": "Does not have the \"feel\" of a traditional college campus."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Place to Work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "14 Apr 2020", "job_title": "Program Director in Renton, WA", "duration": "N/A", "pros": "You make a difference in a student's life. Pima cares about employees and their students. You are an employee-owner and what you say is listened to by administrators.", "cons": "I have no cons to write about at this time."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A Company Worth Retiring With", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "9 Sept 2016", "job_title": "Faculty in Colorado Springs, CO", "duration": "N/A", "pros": "The employees and our input is valued. Every employee has a relationship with Corporate Directors, no matter their job. Employees understand we're in this for the students. Not only do I feel valued, but my family feels valued.", "cons": "There are no cons to working at PMI."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Fair, honest and student centered", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "1 Jul 2013", "job_title": "Quality Assurance in Mesa, AZ", "duration": "N/A", "pros": "Great Pay, students feel connected, employees are part owners through in house ESOP. Their approach is being the best, not concentrating on being the biggest. Family owned, operated and oriented for over 40 years!", "cons": "Need more Locations throughout the U.S.- 14 currently and growing."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A Corporation with Family Values", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Dec 2013", "job_title": "Anonymous Employee in Colorado Springs, CO", "duration": "N/A", "pros": "Pima cares about its employees and their families.\r\nLarge corporation with a small business culture.\r\nStudent and employee diversity embraced.", "cons": "Nothing that can't be addressed."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Jun 2017", "job_title": "Student Services Coordinator in El Paso, TX", "duration": "N/A", "pros": "Family oriented, great pay, beautiful building, great moral building, lots of compensatory gifts, ESOP, 401K, bonus at Christmas time .", "cons": "My drive to work is about 1 hour away, perhaps they will open a PMI in Las Cruces, New Mexico sometime soon.  .. keeping fingers crossed!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Love what I do!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "31 Jan 2020", "job_title": "Associate Campus Director in Albuquerque, NM", "duration": "N/A", "pros": "We are an ESOP Company.  The culture at my campus is family like.  PMI offers amazing benefits.  We have great community partners and have built trust with them.", "cons": "I have not encountered any cons thus far during my time at PMI."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Career Services", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Apr 2018", "job_title": "Career Services Advisor in Phoenix, AZ", "duration": "N/A", "pros": "A positive  team approach to every aspect of your education ,  no student left behind methodologies, I love the opportunity for growth at this campus and the mentoring type of attitude that encompassed me when i joined the team.", "cons": "more training for new employee's"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "22 May 2015", "job_title": "Instructor in Tucson, AZ", "duration": "N/A", "pros": "Management is good, They care about the people and students", "cons": "Insurance is not the best. However they seem to cared about their employees"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great job and school", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "27 Oct 2019", "job_title": "Anonymous Employee in Renton, WA", "duration": "N/A", "pros": "Get to work side by side with financial aid, campus director and more. Works great with my school schedule", "cons": "Need more Washington state locations because I drive up to 2 hours one way for a fun and rewarding job and excellent schooling"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Never felt more appreciated", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "10 May 2019", "job_title": "Lead Instructor in Renton, WA", "duration": "N/A", "pros": "Pima cares about their employees.  I always feel well supported.  As an employee owner I feel like my imput is heard and welcomed.", "cons": "As an instructor I get attached to my student,then in a few short month I have to let them go."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Instructor", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Apr 2020", "job_title": "Instructor in Denver, CO", "duration": "N/A", "pros": "Great staff and management, committed to the students and the job they do. Great benefits. A nice place to work, the staff is very collaborative. Lot's of resources to do your job well.", "cons": "More training when it comes to on boarding, maybe more hands on training of the computer platform systems they use."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "The best experience you could ever imagine is at Pima Medical Institute", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "18 Dec 2013", "job_title": "Faculty in Seattle, WA", "duration": "N/A", "pros": "Amazing staff, great atmosphere to work in, supportive leadership team, the place to be!", "cons": "None that I can think of"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": "N/A", "review_title": "Great Company", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "21 May 2015", "job_title": "Anonymous Employee in Tucson, AZ", "duration": "N/A", "pros": "Employees are truly recognized for their achievements and rewarded, there is definitely opportunity for advancement if you want to move up, very understanding and caring employer", "cons": "Training processes can be difficult, getting answers can be difficult at times, some processes are outdated"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Where the Students Come First", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 May 2019", "job_title": "PCT Instructor in Mesa, AZ", "duration": "N/A", "pros": "I love how we take care of the students needs and follow them on their journey of growth and development.", "cons": "none, Mark is Wonderful! There are no cons"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "I ❤️ PMI", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Apr 2020", "job_title": "Instructor in Phoenix, AZ", "duration": "N/A", "pros": "For Phoenix campus. Very well organized. No lack of communication. Awesome team! Stacey is phenomenal and a great leader.", "cons": "It's so far from my house."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "AMAZING company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "3 Mar 2016", "job_title": "Anonymous Employee in Albuquerque, NM", "duration": "N/A", "pros": "The staff and faculty are wonderful, it's like a giant family at Pima. The benefits aren't so bad either. The great instruction for the students make the quality of graduates top notch.", "cons": "There are no cons when working at Pima"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Honesty, Integrety and Great Culture!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Apr 2018", "job_title": "Career Services Coordinator in Chula Vista, CA", "duration": "N/A", "pros": "- Pima does truly care about the success of each student\r\n- They care about their employees future\r\n- Great management and support system", "cons": "- Yes, we eat too much! but we love it! :)"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "PMI is the BEST!!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Apr 2020", "job_title": "Clinical Director in Phoenix, AZ", "duration": "N/A", "pros": "I love working at PMI! We are like a big family from different walks of life. I have never felt more appreciated for the work I do.", "cons": "No cons to list."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Career Services Advisor", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "4 Apr 2018", "job_title": "Career Services Advisor in Renton, WA", "duration": "N/A", "pros": "Great team to work with.  Feel motivated daily to do my very best with our students and graduates.", "cons": "More emphasis on hearing from  individual employee's in a faculty meeting"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great career college", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Feb 2020", "job_title": "Instructor, College Or University in Albuquerque, NM", "duration": "N/A", "pros": "Employee ownership\r\nCaring leadership\r\nFair wages\r\nFair expectations\r\nGreat community involvement\r\nEmpowering to students seeking change or growth\r\nStrong and appropriate education\r\nConsistently meets goals set for supporting students\r\nStudent education focused", "cons": "The campus could benefit from additional transparency from all leadership or better communication about upcoming changes or needs of the campus."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Seattle Faculty Member", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Nov 2014", "job_title": "Manager in Seattle, WA", "duration": "N/A", "pros": "The company is very fair with regard to employment expectations, salary and benefits. The culture couldn't be more motivating.", "cons": "If there are any negatives, I would say that upward mobility is sometimes limited to relocation. If willing to relocate, opportunities seem to be there."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Apr 2015", "job_title": " in Colorado Springs, CO", "duration": "N/A", "pros": "Family owned business with great values.  ESOP and 401k match to 20%.  Relevant curriculum with a review every two years to keep it industry current.  Genuinely cares about students.", "cons": "I have yet to find any."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "I hope to retire from PMI!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "16 Jun 2015", "job_title": "Medical Career Specialist in Tucson, AZ", "duration": "N/A", "pros": "PMI is a family owned operation that's been in business for 43 years.  They not only provide quality medical training but, support students and employees in many ways.", "cons": "Not enough space at the Tucson Campus."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "6 Jul 2017", "job_title": "Program Director in Tucson, AZ", "duration": "N/A", "pros": "The mission of the institute is to improve the quality of people's lives by providing the best value in medical career education.", "cons": "No Cons. ESOP company. up to 20% contribution to 401K!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Awesome place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "20 Jun 2016", "job_title": "Financial Aid in Las Vegas, NV", "duration": "N/A", "pros": "I have worked in this industry for over 30 years and never have I been so proud to be a part of such a company.", "cons": "None at this time...cannot think of any"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Financial Aid Officer", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Apr 2018", "job_title": "Financial Aid Officer in Phoenix, AZ", "duration": "N/A", "pros": "Great company to work for! Management values their employees and all employees value the students that attend PMI.  The workplace has a family feel that makes me wake up every morning happy to come to work!", "cons": "There are no cons for PMI."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Janice Lewis", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "13 May 2015", "job_title": "Lead Dental Assistant Instructor in Houston, TX", "duration": "N/A", "pros": "The company has many opportunities to grow and make sure everything is given to the instructor so the students can achieve their goals.", "cons": "I have found nothing worry with working for this company"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "So many great things about teaching at Pima", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "7 Oct 2016", "job_title": "Anonymous Employee in Houston, TX", "duration": "N/A", "pros": "Employee owned company with fair compensation and a true desire to serve the students.", "cons": "Passing students can be given more emphasis than student competence. Nepotism created a hostile working environment."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing Colleagues", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "4 Feb 2020", "job_title": "Anonymous Employee in Albuquerque, NM", "duration": "N/A", "pros": "Employees here make this one of the best schools in Albuquerque! Supportive leadership team, engaged staff members and passionate instructors making magic every day for the benefit of our students.", "cons": "The toilet paper is too thin but tolerable."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Family oriented company with good family values", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Nov 2015", "job_title": "Lead Faculty/Medical Assisting Instructor in Aurora, CO", "duration": "N/A", "pros": "The company prides itself on family values. ESOP company that listens and values its employees.", "cons": "Training for new employees lacks but you are expected to have the skills and initiative to learn quickly and using your own skills."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Great place to work at the time", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Apr 2017", "job_title": "Anonymous Employee in Mesa, AZ", "duration": "N/A", "pros": "Good benefits and good people to work with at the time", "cons": "New management caused everyone positive to leave"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Positive environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Jun 2020", "job_title": "Instructor in Mesa, AZ", "duration": "N/A", "pros": "Supportive team members, opportunities for continuing education/training, flexibility to teach in the best way that supports students and using evidence based techniques", "cons": "Sometimes I feel like I don't get a lot of communication from upper management but I am also part time"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great place to get experience teaching.", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "13 Apr 2016", "job_title": "Adjunct Faculty in Lake Stevens, WA", "duration": "N/A", "pros": "Great place to get experience teaching.", "cons": "The reason I didn't stay on longer was because they didn't have classes for me to teach at times I could teach them.  Not really a con on their part."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Review", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Apr 2020", "job_title": "Lead Teacher in El Paso, TX", "duration": "N/A", "pros": "-Employee owned   -Yearly raise   - Company Shares  -Faithful to workers\r\nGreat company to work for during this time COVID-19 - Great support", "cons": "- I truly have nothing to say negative about the company."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Family Owned Technical School - Good benefits, overall a nice place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Aug 2014", "job_title": "Instructor in Tucson, AZ", "duration": "N/A", "pros": "Good benefits and love the students!", "cons": "Family owned so there are some issues with favoritism."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Fantastic company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Apr 2020", "job_title": "Instructor in Renton, WA", "duration": "N/A", "pros": "Workplace culture is positive, amazing colleagues and management and benefits are  better than most companies", "cons": "none, the salary started low but raises each year are significant"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "PIMA -Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Apr 2020", "job_title": "Career Services in San Antonio, TX", "duration": "N/A", "pros": "Great company to work with. Management listens and responds quickly. You are treated with fairness and respect.", "cons": "None,  company is doing a good job!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Title of \"Receptionist\" locks in minimum wage for a year.", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "29 Aug 2020", "job_title": "Front Desk Receptionist in Seattle, WA", "duration": "N/A", "pros": "Excellent instructors, very good Career Services, positive experience for students.", "cons": "Inconsistent management. Poor communication within management. Confusion over responsibilities."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Family", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "5 Apr 2018", "job_title": "Admissions in Denver, CO", "duration": "N/A", "pros": "Love working at PIMA! We are like family, employees are treated very well. I was just sent on a cruise for being a peak performer.", "cons": "There are no cons that I can think of:)"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Dental Assistant Instructor", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "16 Aug 2018", "job_title": "Dental Assistant Instructor in Albuquerque, NM", "duration": "N/A", "pros": "The benefits are out of this world! ESOP, 401K ,\r\nHealth Insurance, Health Club, PTO, amazing supervisors and best co-workers.", "cons": "The normal day to day problems that arise, but these are seen in all jobs everywhere. No cons."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Medical Assistant Instructor, CCMA", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Oct 2017", "job_title": "MDA Instructor in Denver, CO", "duration": "N/A", "pros": "Pima embraces and encourages you to perform and advance in your knowledge for  students.", "cons": "Holiday pay is not granted for part-time employees."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great Place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "13 Apr 2020", "job_title": "Instructor in Tucson, AZ", "duration": "N/A", "pros": "The job is very fulfilling. It is amazing to see your students accomplish so much and, in the end, change their lives for the better.", "cons": "Same as other companies in basic cons"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Money is prime", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "2 Jun 2016", "job_title": "Instructor in Renton, WA", "duration": "N/A", "pros": "Generally friendly, helpful staff\r\nAdequate parking", "cons": "Students are viewed as stupid\r\nCampus director not interested in customer service"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Career Service", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Dec 2016", "job_title": "Anonymous Employee in Erie, CO", "duration": "N/A", "pros": "Incredibly fulfilling job, head of department is one of the best leaders you could ever hope to work for.", "cons": "Nobody leaves, pay is low, no room for advancement"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best Place to work.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Jul 2018", "job_title": "Admissions Assistant in Mesa, AZ", "duration": "N/A", "pros": "Great Organization with a 1 mission in mind, \"Students Success\", one student at the time. Great Place to work, From Director to staff and faculty... Amazing place.", "cons": "There is nothing negative about this place."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Unimpressed", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "3 Oct 2019", "job_title": "Anonymous Employee in Albuquerque, NM", "duration": "N/A", "pros": "ESOP,  PTO, great instructors who care", "cons": "Bad behavior is rewarded, management doesn’t listen, bullying a huge problem at the Main campus."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great Place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "8 Jun 2020", "job_title": "Assistant Phlebotomy Instructor in Renton, WA", "duration": "N/A", "pros": "Very supportive company. Great people", "cons": "Working evenings or nights. Not a lot of other staff in the building at that time of day."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Corporate", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Jun 2015", "job_title": "Corporate in Tucson, AZ", "duration": "N/A", "pros": "Pima Medical Institute is a place of Integrity.  I'm prod to work at a company who truly cares about their employees.", "cons": "There are no cons to working at PMI"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Office Assistant", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Jul 2016", "job_title": "Office Assistant in Chula Vista, CA", "duration": "N/A", "pros": "very friendly staff, family orientated and welcoming.", "cons": "no cons what so ever."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent Place to Work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Aug 2020", "job_title": "Veterinary Technician Instructor in El Paso, TX", "duration": "N/A", "pros": "Accommodating, Excellent Pay and Benefits, Great Team Dynamic, Consistent Hours", "cons": "It is a corporation, for-profit school"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Campus Leadership", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Nov 2016", "job_title": "Anonymous Employee in Houston, TX", "duration": "N/A", "pros": "The company is great. As a whole Pima values its employees.", "cons": "Houston campus leadership is lacking a true leader. A factor in turnover rate."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great career and hope to be at PIMA until I retire.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Feb 2020", "job_title": "Student Finance Advisor in Seattle, WA", "duration": "N/A", "pros": "Great culture and atmosphere. Great teamwork environment to ensure the success of our Students.", "cons": "Parking can be challenging and a little stressful."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Career Services Advisor", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Apr 2018", "job_title": "Career Services Advisor in Chula Vista, CA", "duration": "N/A", "pros": "Pima has an excellent company culture.", "cons": "A health conscious environment but.....you can't  stay on a diet here because we love to eat and we love our pot lucks!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best workplace ever!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Apr 2020", "job_title": "Patient Care Coordinator in Albuquerque, NM", "duration": "N/A", "pros": "Excellent employee benefits, tuition reimbursement and great leadership.", "cons": "There is not weekend job option"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Pima is a great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Apr 2020", "job_title": "Instructor in Albuquerque, NM", "duration": "N/A", "pros": "Great team work, helpful and reliable coworkers, always has your back.", "cons": "This job is very time consuming. A lot must be done from home."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "24 Jan 2020", "job_title": "Administrative in Seattle, WA", "duration": "N/A", "pros": "The company is very employee centric, is employee owned, and has an excellent culture.", "cons": "There are no \"cons\" at this time."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Excellent Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "4 Feb 2020", "job_title": "Anonymous Employee in Seattle, WA", "duration": "N/A", "pros": "Passion for working with students, Fun Environment, ESOP", "cons": "there is not enough parking at this location"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Family Owned Company--and feels like it!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "16 Apr 2020", "job_title": "Instructor in Mesa, AZ", "duration": "N/A", "pros": "Great management at all levels\r\nFair benefits package\r\nEmployee stock ownership plan", "cons": "Not a lot of room for upward movement"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Fantastic", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "13 Apr 2020", "job_title": "Student Finance Representative in Las Vegas, NV", "duration": "N/A", "pros": "A company that cares for it's employees as well as the welfare of it's students.", "cons": "There are none at this time"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "NA", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "24 Nov 2015", "job_title": "ACHIEVEMENTS in San Rafael, NM", "duration": "N/A", "pros": "Good company nice people good benefits would recommend toot hrs", "cons": "Location training is needed to help with new hires and would benefit the company to cross train"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Medical Adminstrative Assistant Instructor Lead", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "5 Sept 2017", "job_title": "Medical Administrative Assistant Instructor Lead in Aurora, CO", "duration": "N/A", "pros": "It is great to work for Pima. I love my job.", "cons": "Just that is a small campus"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "24 Jan 2020", "job_title": "Medical Career Specialist in Seattle, WA", "duration": "N/A", "pros": "ESOP\r\nPositive Enviroment \r\nGrowth potential \r\nTeam oriented", "cons": "There are no negatives to work for this company"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Teamwork at its finest", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "25 Jan 2020", "job_title": "Administrative in Seattle, WA", "duration": "N/A", "pros": "Positive, supportive, professional, environment. Excellent teamwork and dedication to the students and within departments. Respectful, engaged management.", "cons": "As an employee, no cons"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "The best value for technical Education", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "14 Oct 2013", "job_title": "Med Career Spec in Denver, CO", "duration": "N/A", "pros": "Great company great value for education", "cons": "I di not have anything negative to say"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Admissions Assistant", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "23 Dec 2017", "job_title": "Admissions Assistant in Mesa, AZ", "duration": "N/A", "pros": "A  company that I am proud to work for. They truly care about their students.", "cons": "Communication from corporate to campus is often lacking."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great College to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "7 May 2019", "job_title": "Campus Director in Denver, CO", "duration": "N/A", "pros": "Culture, promotions, employee ownership, teamwork, co-workers", "cons": "Only has locations in the western half of the U.S."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Office Administration", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Dec 2018", "job_title": "Office Administrator in Mesa, AZ", "duration": "N/A", "pros": "ESOP \r\nChanging Lives of Students", "cons": "Part time has no paid holidays off"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Employee Owned", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Jun 2020", "job_title": "OTA Clinical Director in Mesa, AZ", "duration": "N/A", "pros": "Team atmosphere, supportive, family oriented, employee owned", "cons": "health benefit package, same as anywhere you may work"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Nov 2015", "job_title": " in Tucson, AZ", "duration": "N/A", "pros": "My experience has been an unexpected blessing.", "cons": "I have not found any thus far"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Pima Pride!!!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "30 Sept 2020", "job_title": "Medical Career Specialist in Las Vegas, NV", "duration": "N/A", "pros": "Best company I have ever worked for! Family culture with a positive vibe.", "cons": "They aren't in every state... yet."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Pima Medical Institute is a good company to work for.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Apr 2020", "job_title": "DA Laboratory Instructor in El Paso, TX", "duration": "N/A", "pros": "Everyone is a team player", "cons": "No days off like a regular school"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Administrative Assistant", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Mar 2016", "job_title": "Nursing Program Office Assistant in Albuquerque, NM", "duration": "N/A", "pros": "great team to work for", "cons": "not a lot of full time positions"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Jan 2020", "job_title": "Career Services Coordinator in Seattle, WA", "duration": "N/A", "pros": "They really care about the students and their employees!!", "cons": "Having to get up early, Lol"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Instructor", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "30 Nov 2019", "job_title": "Career Prep Instructor in Chula Vista, CA", "duration": "N/A", "pros": "Schedule is really good for someone with kids", "cons": "Pay is low. Instructors don’t have freedom"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Instructor", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Oct 2016", "job_title": " in Orange, CA", "duration": "N/A", "pros": "Tons of support throughout time.", "cons": "None, everything was great when I was there."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Veterinary Technician Clinical Director", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 May 2017", "job_title": "Veterinary Technician Clinical Director in Colorado Springs, CO", "duration": "N/A", "pros": "Mission, pay rate, schedule, career", "cons": "Work life balance, pay rate"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Company Review", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "24 Dec 2017", "job_title": "Medical Administrative Assistant in Renton, WA", "duration": "N/A", "pros": "Great company to work for!!", "cons": "I have no complaints about the company!!"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "review", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Apr 2020", "job_title": "Educator in Albuquerque, NM", "duration": "N/A", "pros": "Employee stock option plan is good", "cons": "no paid sick leave is bad"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Leadership at the campus level is a joke", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "31 Aug 2019", "job_title": "Faculty in Albuquerque, NM", "duration": "N/A", "pros": "ESOP, Peak Performers. Nothing else", "cons": "Exclusionary behavior is allowed to thrive,  management plays favorites. Not all employees are valued."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great  family owned company!!.", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Dec 2014", "job_title": "Clinical Director in Seattle, WA", "duration": "N/A", "pros": "Excellent leadership with putting students first and excellent benefits.", "cons": "Would like to have more classroom space."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Reconsider twice before applying a job", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Apr 2015", "job_title": "Instructor in Albuquerque, NM", "duration": "N/A", "pros": "Hard to describe one. Bad management, constant change of management, hypocrisy, bad environment to work.", "cons": "Too many to negative things to enumerate."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "be careful", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "2 Oct 2020", "job_title": "Instructor in Phoenix, AZ", "duration": "N/A", "pros": "Some of the people there were great to work with", "cons": "When evaluations are given for the school, admin watches over your shoulder, thus better reviews."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Financial Aid", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Dec 2018", "job_title": "Anonymous Employee in Albuquerque, NM", "duration": "N/A", "pros": "Great faculty and student focus", "cons": "Upper management does not listen to managers, little support"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Instructor", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "28 Sept 2019", "job_title": "Anonymous Employee in Houston, TX", "duration": "N/A", "pros": "Great Company / esop", "cons": "Horrible uneducated racist registrar at this campus and still employed"}]]