[[{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good experience", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 May 2022", "job_title": "Anonymous Employee in Berlin", "duration": "N/A", "pros": "Good team, interesting content and work", "cons": "Not a lot to say"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good employer", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Apr 2023", "job_title": "Research Assistant in Berlin", "duration": "N/A", "pros": "Interesting work and passionate staff", "cons": "None i can think of"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "-", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Oct 2022", "job_title": "Administrative Assistant in Berlin", "duration": "N/A", "pros": "Great, very experienced colleagues to learn from.", "cons": "Low salaries, high staff turnover, lack of proper processes and feedback culture."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Good learning", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Jun 2022", "job_title": "Programmer/Analyst in Berlin", "duration": "N/A", "pros": "Good learning space \r\nAdvocacy is great", "cons": "Little pay \r\nIssues related to diversity"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "high turnover", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Jan 2022", "job_title": "High Turnover Problems in Berlin", "duration": "N/A", "pros": "global mission and passionate coworkers", "cons": "high number of staff turnover and lack of clear programmatic direction"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good experience overall", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "21 Jan 2021", "job_title": "Project Coordinator in Berlin", "duration": "N/A", "pros": "You will get to meet amazing and passionate people from around the world. You will enjoy flexible working hours and will have overall attentive management to the needs of staff.", "cons": "It is challenging to grow in an environment that does not assess performance, which in turn makes the experience somewhat frustrating. Organizational challenges from the past continue to sometimes disrupt work but it has been getting much better."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great people, great cause, not always great management", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Mar 2021", "job_title": "Communications in Berlin", "duration": "N/A", "pros": "International team, inspiring people, working on interesting and relevant issue", "cons": "Difficult to progress internally, with internal application processes; lack of regard for organisational values in former management"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "not posting not posting", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Mar 2021", "job_title": "Director in Berlin", "duration": "N/A", "pros": "work with a mission that's all I will say", "cons": "this is a long term mission indeed"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": "N/A", "review_title": "Important mission undermined by unethical and incompetent management", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "15 Nov 2019", "job_title": "Anonymous Employee in Berlin", "duration": "N/A", "pros": "TI's global mission remains important and relevant. The international network of national chapters are, for the most part, hardworking and determined in their work to fight corruption on the ground.", "cons": "The International Secretariat in Berlin is unfortunately faltering. It's not a nice place to work, with morale very low among the mostly lovely and hard-working colleagues. With the departure of the old senior management team in 2017 (who were no angels, but compare favourably to the current crop), a new MD was brought on board. Unfortunately TI was not able to attract someone with commensurate skills and experience required for the role. She is neither a strong advocate for the cause, nor a strong internal manager. In fact, she appears to be weak on both fronts and therefore is very insecure in her position and does not trust anyone, particularly longstanding, knowledgeable staff, who she seems to see as a threat. Therefore the organisational culture has become one  where mistrust of staff reigns and favouritism is the order of the day. The MD has surrounded herself with 'yes men and women' who do not dare to challenge her, even in the face of incompetence. In the wake of accusations of bullying and harrassment, the international oversight board has done little or nothing to address the ongoing issues. The future does not seem bright unless there is a change of leadership both at executive management level and at the level of the international board."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Great principles and idea, poor management, overrated impact", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Jan 2017", "job_title": "Programmer Coordinator in Berlin", "duration": "N/A", "pros": "Very skillful professionals, creative individuals and light-minded anti-corruption experts. The movement is fed by national chapters who provide experience from the ground and are well rooted in the local realm of good governance and anti-corruption themes. Working in Berlin is also very attractive, low-budget city with great cultural amenities.", "cons": "Transparency International has gone through a major reshaping of its internal management, to try and diminish the bureaucracy and get the well-paid senior levels to provide less bla bla bla and more hands - on contribution. Despite the effort, the organization is still poorly managed and the senior management is totally unfit to keep the pace of more structured international NGOs. Personnell is recruited withour a clear idea of how to benefit from it, sometimes to fill in urgent needs for project implementation and offering poor career perspectives. Additionally, despite transparency and ethics shall be important internally as well as externally, former employees reported several cases of unfair treatements, non-transparent hiring processes, and few cases of work harrassment."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "So much potential, so little delivery", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Dec 2014", "job_title": "Coordinator in Berlin", "duration": "N/A", "pros": "Its a global organisation with a lot of brilliant motivated colleagues, with national chapters all over the world. Sometimes you get to work on interesting issues. Staff are definitely treated better than at companies, and there is a desire among leadership to do well by staff.", "cons": "In practise, however, the organisation has failed to act on the big issues of the day. Its silent on contoversial issues like wikileaks, because the movement is still being run by a small group of old rich white men who created TI 20 years ago. Most of the work is actually very bureaucratic: meetings, budgets etc. the leadership are constantly revisiting the strategy, without anything ever really changing except for a small group of people getting promoted over and over again. Which is the biggest problem: too many \"yes men\", and too many workshops and meetings, but not enough doers. If you dont fit into a \"clique\" and have someone high up on your side, you wont go far. New ideas are often not welcome. Management are Unaccountable and very defensive about criticism and complaints.  moral of midlevel staff is extremely low."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Transparency International - great: but could be greater.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Sept 2008", "job_title": "Manager in Berlin", "duration": "N/A", "pros": "Good, committed people on the whole. Important mission. A young staff with energy. Some Senior Management are  poor, but at the time of wiritng (Sept 08), new, experienced and capable people are coming in. In general, good projects and programmes keep you interested and engaged. A very good social life to be had with colleagues.", "cons": "Oftentimes a reliance on the reputation and perception of TI. Overly reliant on som eof the major tools and methodologies that have been artound for a while. Communication inside the organisation can be intermittent. Lack of real forward looking startegy that understands the major changes that new technologies are bringing to the mission area."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Run like the Communist Party", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Nov 2015", "job_title": "Anonymous Employee in Berlin", "duration": "N/A", "pros": "Has a good reputation so looks good on your CV - for now. \r\nGood pay compared to Berlin average so you can live well in the city.\r\nThe national chapters that ignore the secretariat get things done.", "cons": "Run by a Politburu-style Management Group. You can work yourself into the ground for the organization but if you fail to suck up to (or flirt with) these people, you are going nowhere. They keep their own records on who they like and who they don't. This means managers tend to tow the party line because they know persons who speak their minds are getting blacklisted. This wouldnt be so different from other places if it was not from the fact that these people are neither good managers nor good activists. They are only good at holding meetings and designing incomprehensible bureaucratic procedures. As a result, most of the daily work of the organization is removed from the outside world. Experts are not welcome (they make the bosses insecure): the less you know about corruption, the better. There is an incredible turnover that sees staff either leave within 6 months, or stay forever because they dont want to leave Berlin. Are you a misogynist and a bully, you will fit right in. Otherwise, steer clear."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "A well intentioned NGO working like a heavy 1970s public administration", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "17 Aug 2015", "job_title": "Programmer Coordinator in Berlin", "duration": "N/A", "pros": "Access to a great international network of local branches throughout the world. Reputable name. Lots of opportunities to travel to international events and conferences. Competitive salary for the sector and location (but see below).", "cons": "Overbearing hierarchy that stiffles innovation and tends to micro-manage. Lack of clear priorities for the organisation, resulting in financial and human resources being spread too thin. Opaque budgetting process. \r\n\r\nPossibly attractive salaries for the sector and location, but carreer development within the organisation tends to be based on friendships and cosying up to management rather than on actual performance. Negotiate your salary well before entering, because it won't go up much more after that."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Interesting work with a struggling leadership  and management", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Apr 2019", "job_title": "Anonymous Employee in Berlin", "duration": "N/A", "pros": "Being less than one  year since  I joined TI. Have seen many negative comments  about the organisation.  But  the staff is friendly and  the work gives you a purpose. May be not the  best time to  join TI. Give it a  time.  I  am sure  with a  help of a  good leadership it will  bounce  back one day.", "cons": "Neither  the leadership nor the  management are  good communicators.  They  don't  seem to interact  with the staff or not being consultative. I have  witnessed one senior management team member bad mouthing  about other staff members openly. That was disturbing. Many senior staff members are leaving  the organisation.  I  am  worried."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Micromanagement from the top", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "10 Apr 2019", "job_title": "Anonymous Employee in Berlin", "duration": "N/A", "pros": "An interesting, important cause  - you cannot make the world a better place if corruption is rampant. \r\nThe staff - really smart and committed staff.", "cons": "Although the Secretariat is said to be stabalizing from the change process, chaos prevails. There are no clear decision-making processes, important information is not coherently communicated from management and the Secretariat is lacking a sense of vision and mission.\r\nIn terms values and principles (transparency, accountability and participation) the organisation does not at all practice what they preach - this puts staff in a moral dilemma when they explain and defend anticorruption work to external stakeholders."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Management is killing TI", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Mar 2019", "job_title": "Project Manager in Berlin", "duration": "N/A", "pros": "Great colleagues, who are sadly leaving in large numbers.", "cons": "The very engaged long term staff are being aggressively pushed out by management. The under-appreciation and micro-management, the poisonous working environment, the way management has put its head in the sand about this, is driving TI down."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "intern", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "30 Sept 2015", "job_title": "Intern in Berlin", "duration": "N/A", "pros": "The best thing at TI in my opinion is the cause for which they work and the people who you work with. You get to interact with people from around the world and you learn a lot about what other teams do within the Secretariat.", "cons": "The lack of career opportunities is definitely a negative aspect. Due to their funding, they have a lot of limitations and can not hire many people, even if you do great work and they are happy with you."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Changing radically for the better!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "19 Aug 2016", "job_title": "Anonymous Employee in Berlin", "duration": "N/A", "pros": "Adopting holacracy, the whole Secretariat now works in self-managing teams. They actually got rid of hierarchy (well, most of it)", "cons": "Some confusion as fellow employees learn to take power and be self-starters, rather than wait for orders from above. Less chance for advancement, though."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Disturbingly Unethical and Unfortunate Place", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "25 Jun 2019", "job_title": "Manager in Berlin", "duration": "N/A", "pros": "A global network with strong presence in developing countries. Quite dedicated staff but many of them are  either leaving or already left. Berlin is an unassuming place to live!", "cons": "TI’s downfall started in 2016 with its restructuring process. Efforts to recover the institution since then keep failing as personal agendas and incompetencies take a lead over institutional interests and real priorities. Present executive leadership is clearly not cut out to lead an advocacy NGO. She is out of depth,  extremely old school in her approaches and disturbingly unethical. Despite being an organisation promoting transparency and accountability, the senior management team (SMT) was selected without due process or having terms of reference. When the managers were appointed the favourites of the leadership were told before the process that they were  earmarked for the positions. Some potential candidates were even reprimanded and told not to apply for any managerial positions within the organisation. Favouritism at its best paving the way for command and control. So much for the meritocracy  that TI preaches about! \r\n\r\nAll these resulted in a few incompetent and inexperience staff members getting appointed to the SMT. Their lack of skills, unprofessional and unethical conduct unfortunately are ruining this organisation. The relatively younger female SMT member even carries no uneasiness to air her racial prejudices  or bad mouth about other staff members. The only way to survive within the organisation is to declare unwavering support to the SMT. Then you will be rewarded despite lack of performances in the past or serious allegations against ethical conduct within the organisation. So for a very few this is the way to survive.  There is no institutional performance evaluation in the organisation at present. \r\n\r\nSome staff members questioned the leadership about their conduct in staff meetings. They were simply told - leave the organisation if you are unhappy.\r\n\r\nCurrently there  is no institutional or leadership vision for TI. Despite a strategy approved by its membership running up to 2020, SMT turns around priorities placing personal agendas at the forefront beyond institutional interests. \r\n\r\nA horde of competent and experience staff members have left in the recent past or in the process of leaving. It is a public secret within the organisation that every other person is looking for a job to leave. \r\n\r\nWhat is happening within TI at present is truly unbelievable.\r\n\r\nI doubt that the international board of this organisation cares. A classic example of how ambitions of politics and small privileges could take precedence over what is expected from  an oversight body. \r\n\r\nA recent BBC article revealed what was happening  within Amnesty International Secretariat. The content of the article resounds precisely what is happening  at Transparency International currently."}], [{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Spring internship", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Jul 2015", "job_title": " in Berlin", "duration": "N/A", "pros": "Solid office culture, open floor concept and easy access to senior staff for mentorship and guidance. Assignments are project based and require you to assume credible responsibility, fast.", "cons": "Pay can be somewhat better, however it is an NGO. Feed back can be limited at times, given lack of staff and overwhelming number of projects."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "TI-S is in trouble", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "30 Dec 2016", "job_title": "Anonymous Employee in Berlin", "duration": "N/A", "pros": "Great professional colleagues, making a real difference in the fight against corruption.", "cons": "Hideously incompetent managing director; no strategic direction, embraces each passing management fad hoping it will work. Doesn't understand people as individuals."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "“Pitch up! Pitch up!”", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Apr 2019", "job_title": "Anonymous Employee in Berlin", "duration": "N/A", "pros": "Hard Working co-workers; courageous local presences around the world", "cons": "Like a Boeing 737 Max, this NGO is in a nosedive. Disdainful disrespectful crony mismanagement at the top is driving talent out of the Organisation. Intransparent, Playing personal favourites and threatened by questions, the “tone from the top” is to demand unquestioning loyalty."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Working at the Transparency International Secretariat", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Jun 2013", "job_title": "Anonymous Employee in Berlin", "duration": "N/A", "pros": "Great city to be in, multi-cultural working environment, great to deal with the national chapters from around the world", "cons": "Heavy on the admin, somewhat chaotic as an organisation, difficult to suggest new ideas"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "incompetence and lack of transparency", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "20 Jan 2015", "job_title": "Senior Programmer Coordinator in Berlin", "duration": "N/A", "pros": "- great life-work balance\r\n- good salary for being an NGO", "cons": "- extreme lack of accountability withing the office and in decision-making\r\n- corporate strategy is captured by private and vested interests \r\n- no leadership or people management\r\n- no results \r\n- ad hoc and hectic solutions and priorities\r\n- interns are hired not to be trained but to be admin/secretaries"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Rocky shoals ahead", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Jun 2015", "job_title": " in Berlin", "duration": "N/A", "pros": "An amazing federation of national NGOs; some dynamic colleagues with great ideas; a cause that is fundamental to many other important social issues.", "cons": "Terribly slow decision-making created by political in-fighting among senior management as an arrogant hierarchy that wants to micro-manage everything."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Senior Web Developer", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "22 May 2017", "job_title": " in Berlin", "duration": "N/A", "pros": "- Great benefit plans\r\n- Flexible work hours\r\n- Relocation allowance", "cons": "- Projects are not defined adequately.\r\n- Cross departmental conflicts.\r\n- Sudden termination of work contracts and layoffs."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Review", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Feb 2016", "job_title": "Project Accountant in Berlin", "duration": "N/A", "pros": "Great atmosphere;most people are very engaged;working with stakeholders from all over the world.", "cons": "Very poor management, no possibility for career development, mediocre salaries and no bonuses"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Top heavy organization with poor HR management", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Oct 2016", "job_title": "Programmer Coordinator in Berlin", "duration": "N/A", "pros": "Nice people, interesting work, high reputation", "cons": "HR management is poor, there is a need for better strategic management as well."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great Experience", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "7 Sept 2016", "job_title": "External Consultant in Berlin", "duration": "N/A", "pros": "Innovative with research and cooperative", "cons": "High level professionals might be intimidating at first but easy to cooperate with later on"}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Quickly going south", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "5 Mar 2017", "job_title": "Manager in Berlin", "duration": "N/A", "pros": "Very \"easy\" environment (no pressure), relatively good salaries and a nice international mix of staff", "cons": "Poor quality of outputs, a lot of politics, a lot of gossip, confused and ever-changing strategy. Suffering financial challenges, which are going to grow in the future."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Interesting work topics/bad working environment", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Sept 2019", "job_title": "Program Coordinator in Berlin", "duration": "N/A", "pros": "Meaningful work, interesting projects, small number of sincere and devoted employees.", "cons": "Lack of strategic thinking and efficiency. Overly competitive environment between employees, micromanaging and bullying from managers. High workload and no recognition. Lack of expertise and professionalism. No possibilities for career development."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "It's OK", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Oct 2016", "job_title": "Anonymous Employee in Berlin", "duration": "N/A", "pros": "good work life balance at transparency International berlin", "cons": "Possibilities of progression very limited"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Don't apply the ship is going down", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Nov 2016", "job_title": "Anonymous Employee in Berlin", "duration": "N/A", "pros": "The brand\r\nThe location\r\nThe international exposure", "cons": "All the rest\r\nNot a place for young talented people\r\nFull of incometent bureaucrats"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not good at all", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Jul 2020", "job_title": "Senior Researcher in Berlin", "duration": "N/A", "pros": "Possibility to apply for a better job.", "cons": "Low salary;\r\nUnprofessional management;\r\nRude attitude to employees;\r\nExtra hours without any compensation."}]][[{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good experience", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 May 2022", "job_title": "Anonymous Employee in Berlin", "duration": "N/A", "pros": "Good team, interesting content and work", "cons": "Not a lot to say"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good employer", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Apr 2023", "job_title": "Research Assistant in Berlin", "duration": "N/A", "pros": "Interesting work and passionate staff", "cons": "None i can think of"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "-", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Oct 2022", "job_title": "Administrative Assistant in Berlin", "duration": "N/A", "pros": "Great, very experienced colleagues to learn from.", "cons": "Low salaries, high staff turnover, lack of proper processes and feedback culture."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Good learning", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Jun 2022", "job_title": "Programmer/Analyst in Berlin", "duration": "N/A", "pros": "Good learning space \r\nAdvocacy is great", "cons": "Little pay \r\nIssues related to diversity"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "high turnover", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Jan 2022", "job_title": "High Turnover Problems in Berlin", "duration": "N/A", "pros": "global mission and passionate coworkers", "cons": "high number of staff turnover and lack of clear programmatic direction"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good experience overall", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "21 Jan 2021", "job_title": "Project Coordinator in Berlin", "duration": "N/A", "pros": "You will get to meet amazing and passionate people from around the world. You will enjoy flexible working hours and will have overall attentive management to the needs of staff.", "cons": "It is challenging to grow in an environment that does not assess performance, which in turn makes the experience somewhat frustrating. Organizational challenges from the past continue to sometimes disrupt work but it has been getting much better."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great people, great cause, not always great management", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Mar 2021", "job_title": "Communications in Berlin", "duration": "N/A", "pros": "International team, inspiring people, working on interesting and relevant issue", "cons": "Difficult to progress internally, with internal application processes; lack of regard for organisational values in former management"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "not posting not posting", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Mar 2021", "job_title": "Director in Berlin", "duration": "N/A", "pros": "work with a mission that's all I will say", "cons": "this is a long term mission indeed"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": "N/A", "review_title": "Important mission undermined by unethical and incompetent management", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "15 Nov 2019", "job_title": "Anonymous Employee in Berlin", "duration": "N/A", "pros": "TI's global mission remains important and relevant. The international network of national chapters are, for the most part, hardworking and determined in their work to fight corruption on the ground.", "cons": "The International Secretariat in Berlin is unfortunately faltering. It's not a nice place to work, with morale very low among the mostly lovely and hard-working colleagues. With the departure of the old senior management team in 2017 (who were no angels, but compare favourably to the current crop), a new MD was brought on board. Unfortunately TI was not able to attract someone with commensurate skills and experience required for the role. She is neither a strong advocate for the cause, nor a strong internal manager. In fact, she appears to be weak on both fronts and therefore is very insecure in her position and does not trust anyone, particularly longstanding, knowledgeable staff, who she seems to see as a threat. Therefore the organisational culture has become one  where mistrust of staff reigns and favouritism is the order of the day. The MD has surrounded herself with 'yes men and women' who do not dare to challenge her, even in the face of incompetence. In the wake of accusations of bullying and harrassment, the international oversight board has done little or nothing to address the ongoing issues. The future does not seem bright unless there is a change of leadership both at executive management level and at the level of the international board."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Great principles and idea, poor management, overrated impact", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Jan 2017", "job_title": "Programmer Coordinator in Berlin", "duration": "N/A", "pros": "Very skillful professionals, creative individuals and light-minded anti-corruption experts. The movement is fed by national chapters who provide experience from the ground and are well rooted in the local realm of good governance and anti-corruption themes. Working in Berlin is also very attractive, low-budget city with great cultural amenities.", "cons": "Transparency International has gone through a major reshaping of its internal management, to try and diminish the bureaucracy and get the well-paid senior levels to provide less bla bla bla and more hands - on contribution. Despite the effort, the organization is still poorly managed and the senior management is totally unfit to keep the pace of more structured international NGOs. Personnell is recruited withour a clear idea of how to benefit from it, sometimes to fill in urgent needs for project implementation and offering poor career perspectives. Additionally, despite transparency and ethics shall be important internally as well as externally, former employees reported several cases of unfair treatements, non-transparent hiring processes, and few cases of work harrassment."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "So much potential, so little delivery", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Dec 2014", "job_title": "Coordinator in Berlin", "duration": "N/A", "pros": "Its a global organisation with a lot of brilliant motivated colleagues, with national chapters all over the world. Sometimes you get to work on interesting issues. Staff are definitely treated better than at companies, and there is a desire among leadership to do well by staff.", "cons": "In practise, however, the organisation has failed to act on the big issues of the day. Its silent on contoversial issues like wikileaks, because the movement is still being run by a small group of old rich white men who created TI 20 years ago. Most of the work is actually very bureaucratic: meetings, budgets etc. the leadership are constantly revisiting the strategy, without anything ever really changing except for a small group of people getting promoted over and over again. Which is the biggest problem: too many \"yes men\", and too many workshops and meetings, but not enough doers. If you dont fit into a \"clique\" and have someone high up on your side, you wont go far. New ideas are often not welcome. Management are Unaccountable and very defensive about criticism and complaints.  moral of midlevel staff is extremely low."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Transparency International - great: but could be greater.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Sept 2008", "job_title": "Manager in Berlin", "duration": "N/A", "pros": "Good, committed people on the whole. Important mission. A young staff with energy. Some Senior Management are  poor, but at the time of wiritng (Sept 08), new, experienced and capable people are coming in. In general, good projects and programmes keep you interested and engaged. A very good social life to be had with colleagues.", "cons": "Oftentimes a reliance on the reputation and perception of TI. Overly reliant on som eof the major tools and methodologies that have been artound for a while. Communication inside the organisation can be intermittent. Lack of real forward looking startegy that understands the major changes that new technologies are bringing to the mission area."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Run like the Communist Party", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Nov 2015", "job_title": "Anonymous Employee in Berlin", "duration": "N/A", "pros": "Has a good reputation so looks good on your CV - for now. \r\nGood pay compared to Berlin average so you can live well in the city.\r\nThe national chapters that ignore the secretariat get things done.", "cons": "Run by a Politburu-style Management Group. You can work yourself into the ground for the organization but if you fail to suck up to (or flirt with) these people, you are going nowhere. They keep their own records on who they like and who they don't. This means managers tend to tow the party line because they know persons who speak their minds are getting blacklisted. This wouldnt be so different from other places if it was not from the fact that these people are neither good managers nor good activists. They are only good at holding meetings and designing incomprehensible bureaucratic procedures. As a result, most of the daily work of the organization is removed from the outside world. Experts are not welcome (they make the bosses insecure): the less you know about corruption, the better. There is an incredible turnover that sees staff either leave within 6 months, or stay forever because they dont want to leave Berlin. Are you a misogynist and a bully, you will fit right in. Otherwise, steer clear."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "A well intentioned NGO working like a heavy 1970s public administration", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "17 Aug 2015", "job_title": "Programmer Coordinator in Berlin", "duration": "N/A", "pros": "Access to a great international network of local branches throughout the world. Reputable name. Lots of opportunities to travel to international events and conferences. Competitive salary for the sector and location (but see below).", "cons": "Overbearing hierarchy that stiffles innovation and tends to micro-manage. Lack of clear priorities for the organisation, resulting in financial and human resources being spread too thin. Opaque budgetting process. \r\n\r\nPossibly attractive salaries for the sector and location, but carreer development within the organisation tends to be based on friendships and cosying up to management rather than on actual performance. Negotiate your salary well before entering, because it won't go up much more after that."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Interesting work with a struggling leadership  and management", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Apr 2019", "job_title": "Anonymous Employee in Berlin", "duration": "N/A", "pros": "Being less than one  year since  I joined TI. Have seen many negative comments  about the organisation.  But  the staff is friendly and  the work gives you a purpose. May be not the  best time to  join TI. Give it a  time.  I  am sure  with a  help of a  good leadership it will  bounce  back one day.", "cons": "Neither  the leadership nor the  management are  good communicators.  They  don't  seem to interact  with the staff or not being consultative. I have  witnessed one senior management team member bad mouthing  about other staff members openly. That was disturbing. Many senior staff members are leaving  the organisation.  I  am  worried."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Micromanagement from the top", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "10 Apr 2019", "job_title": "Anonymous Employee in Berlin", "duration": "N/A", "pros": "An interesting, important cause  - you cannot make the world a better place if corruption is rampant. \r\nThe staff - really smart and committed staff.", "cons": "Although the Secretariat is said to be stabalizing from the change process, chaos prevails. There are no clear decision-making processes, important information is not coherently communicated from management and the Secretariat is lacking a sense of vision and mission.\r\nIn terms values and principles (transparency, accountability and participation) the organisation does not at all practice what they preach - this puts staff in a moral dilemma when they explain and defend anticorruption work to external stakeholders."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Management is killing TI", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Mar 2019", "job_title": "Project Manager in Berlin", "duration": "N/A", "pros": "Great colleagues, who are sadly leaving in large numbers.", "cons": "The very engaged long term staff are being aggressively pushed out by management. The under-appreciation and micro-management, the poisonous working environment, the way management has put its head in the sand about this, is driving TI down."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "intern", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "30 Sept 2015", "job_title": "Intern in Berlin", "duration": "N/A", "pros": "The best thing at TI in my opinion is the cause for which they work and the people who you work with. You get to interact with people from around the world and you learn a lot about what other teams do within the Secretariat.", "cons": "The lack of career opportunities is definitely a negative aspect. Due to their funding, they have a lot of limitations and can not hire many people, even if you do great work and they are happy with you."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Changing radically for the better!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "19 Aug 2016", "job_title": "Anonymous Employee in Berlin", "duration": "N/A", "pros": "Adopting holacracy, the whole Secretariat now works in self-managing teams. They actually got rid of hierarchy (well, most of it)", "cons": "Some confusion as fellow employees learn to take power and be self-starters, rather than wait for orders from above. Less chance for advancement, though."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Disturbingly Unethical and Unfortunate Place", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "25 Jun 2019", "job_title": "Manager in Berlin", "duration": "N/A", "pros": "A global network with strong presence in developing countries. Quite dedicated staff but many of them are  either leaving or already left. Berlin is an unassuming place to live!", "cons": "TI’s downfall started in 2016 with its restructuring process. Efforts to recover the institution since then keep failing as personal agendas and incompetencies take a lead over institutional interests and real priorities. Present executive leadership is clearly not cut out to lead an advocacy NGO. She is out of depth,  extremely old school in her approaches and disturbingly unethical. Despite being an organisation promoting transparency and accountability, the senior management team (SMT) was selected without due process or having terms of reference. When the managers were appointed the favourites of the leadership were told before the process that they were  earmarked for the positions. Some potential candidates were even reprimanded and told not to apply for any managerial positions within the organisation. Favouritism at its best paving the way for command and control. So much for the meritocracy  that TI preaches about! \r\n\r\nAll these resulted in a few incompetent and inexperience staff members getting appointed to the SMT. Their lack of skills, unprofessional and unethical conduct unfortunately are ruining this organisation. The relatively younger female SMT member even carries no uneasiness to air her racial prejudices  or bad mouth about other staff members. The only way to survive within the organisation is to declare unwavering support to the SMT. Then you will be rewarded despite lack of performances in the past or serious allegations against ethical conduct within the organisation. So for a very few this is the way to survive.  There is no institutional performance evaluation in the organisation at present. \r\n\r\nSome staff members questioned the leadership about their conduct in staff meetings. They were simply told - leave the organisation if you are unhappy.\r\n\r\nCurrently there  is no institutional or leadership vision for TI. Despite a strategy approved by its membership running up to 2020, SMT turns around priorities placing personal agendas at the forefront beyond institutional interests. \r\n\r\nA horde of competent and experience staff members have left in the recent past or in the process of leaving. It is a public secret within the organisation that every other person is looking for a job to leave. \r\n\r\nWhat is happening within TI at present is truly unbelievable.\r\n\r\nI doubt that the international board of this organisation cares. A classic example of how ambitions of politics and small privileges could take precedence over what is expected from  an oversight body. \r\n\r\nA recent BBC article revealed what was happening  within Amnesty International Secretariat. The content of the article resounds precisely what is happening  at Transparency International currently."}], [{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Spring internship", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Jul 2015", "job_title": " in Berlin", "duration": "N/A", "pros": "Solid office culture, open floor concept and easy access to senior staff for mentorship and guidance. Assignments are project based and require you to assume credible responsibility, fast.", "cons": "Pay can be somewhat better, however it is an NGO. Feed back can be limited at times, given lack of staff and overwhelming number of projects."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "TI-S is in trouble", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "30 Dec 2016", "job_title": "Anonymous Employee in Berlin", "duration": "N/A", "pros": "Great professional colleagues, making a real difference in the fight against corruption.", "cons": "Hideously incompetent managing director; no strategic direction, embraces each passing management fad hoping it will work. Doesn't understand people as individuals."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "“Pitch up! Pitch up!”", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Apr 2019", "job_title": "Anonymous Employee in Berlin", "duration": "N/A", "pros": "Hard Working co-workers; courageous local presences around the world", "cons": "Like a Boeing 737 Max, this NGO is in a nosedive. Disdainful disrespectful crony mismanagement at the top is driving talent out of the Organisation. Intransparent, Playing personal favourites and threatened by questions, the “tone from the top” is to demand unquestioning loyalty."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Working at the Transparency International Secretariat", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Jun 2013", "job_title": "Anonymous Employee in Berlin", "duration": "N/A", "pros": "Great city to be in, multi-cultural working environment, great to deal with the national chapters from around the world", "cons": "Heavy on the admin, somewhat chaotic as an organisation, difficult to suggest new ideas"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "incompetence and lack of transparency", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "20 Jan 2015", "job_title": "Senior Programmer Coordinator in Berlin", "duration": "N/A", "pros": "- great life-work balance\r\n- good salary for being an NGO", "cons": "- extreme lack of accountability withing the office and in decision-making\r\n- corporate strategy is captured by private and vested interests \r\n- no leadership or people management\r\n- no results \r\n- ad hoc and hectic solutions and priorities\r\n- interns are hired not to be trained but to be admin/secretaries"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Rocky shoals ahead", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Jun 2015", "job_title": " in Berlin", "duration": "N/A", "pros": "An amazing federation of national NGOs; some dynamic colleagues with great ideas; a cause that is fundamental to many other important social issues.", "cons": "Terribly slow decision-making created by political in-fighting among senior management as an arrogant hierarchy that wants to micro-manage everything."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Senior Web Developer", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "22 May 2017", "job_title": " in Berlin", "duration": "N/A", "pros": "- Great benefit plans\r\n- Flexible work hours\r\n- Relocation allowance", "cons": "- Projects are not defined adequately.\r\n- Cross departmental conflicts.\r\n- Sudden termination of work contracts and layoffs."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Review", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Feb 2016", "job_title": "Project Accountant in Berlin", "duration": "N/A", "pros": "Great atmosphere;most people are very engaged;working with stakeholders from all over the world.", "cons": "Very poor management, no possibility for career development, mediocre salaries and no bonuses"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Top heavy organization with poor HR management", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Oct 2016", "job_title": "Programmer Coordinator in Berlin", "duration": "N/A", "pros": "Nice people, interesting work, high reputation", "cons": "HR management is poor, there is a need for better strategic management as well."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great Experience", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "7 Sept 2016", "job_title": "External Consultant in Berlin", "duration": "N/A", "pros": "Innovative with research and cooperative", "cons": "High level professionals might be intimidating at first but easy to cooperate with later on"}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Quickly going south", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "5 Mar 2017", "job_title": "Manager in Berlin", "duration": "N/A", "pros": "Very \"easy\" environment (no pressure), relatively good salaries and a nice international mix of staff", "cons": "Poor quality of outputs, a lot of politics, a lot of gossip, confused and ever-changing strategy. Suffering financial challenges, which are going to grow in the future."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Interesting work topics/bad working environment", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Sept 2019", "job_title": "Program Coordinator in Berlin", "duration": "N/A", "pros": "Meaningful work, interesting projects, small number of sincere and devoted employees.", "cons": "Lack of strategic thinking and efficiency. Overly competitive environment between employees, micromanaging and bullying from managers. High workload and no recognition. Lack of expertise and professionalism. No possibilities for career development."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "It's OK", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Oct 2016", "job_title": "Anonymous Employee in Berlin", "duration": "N/A", "pros": "good work life balance at transparency International berlin", "cons": "Possibilities of progression very limited"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Don't apply the ship is going down", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Nov 2016", "job_title": "Anonymous Employee in Berlin", "duration": "N/A", "pros": "The brand\r\nThe location\r\nThe international exposure", "cons": "All the rest\r\nNot a place for young talented people\r\nFull of incometent bureaucrats"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not good at all", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Jul 2020", "job_title": "Senior Researcher in Berlin", "duration": "N/A", "pros": "Possibility to apply for a better job.", "cons": "Low salary;\r\nUnprofessional management;\r\nRude attitude to employees;\r\nExtra hours without any compensation."}]]