[[{"date": "2 Jun 2023", "title": "Senior Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Waterford.org (Houston, TX) in May 2023", "Interview Descriptions": "From start to finish, the interview process was second to none. The journey was rigorous with interviews. However, each interview was very intentional, informative and intriguing to learn more about the organization. Special kudos to Myranda for her consistent communication and follow through during the process making it a smooth overall experience. I’m excited for the opportunity to become a part of the Waterford family! I look forward to the journey!", "Interview Questions": "Paraphrase: In this period of your life, how does Waterford’s mission and goals align with you?"}, {"date": "5 Jun 2023", "title": "Sr. Director of Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Waterford.org (Memphis, TN) in Apr 2023", "Interview Descriptions": "I will be joining the Waterford team later this month and wanted to take a moment to compliment, specifically, the Director of Talent Acquistion & Development. From start to finish, she was a consummate professional. She consistently ensured that all my questions were answered regarding next steps, along with any other questions that I had. It is obvious that she cares about the 'applicant experience' and engages accordingly. Whether I received a job offer or not, I can say with confidence that I had a great UX!", "Interview Questions": "In general, questions were mostly behavior based; requiring you to connect your experience to that of the role you're apply for."}, {"date": "21 Mar 2023", "title": "UX Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Waterford.org", "Interview Descriptions": "There were several rounds of interviews, up to 4. A bit lengthy, but they scheduled them quickly and I don't think I spent more than 2 weeks total doing the process.", "Interview Questions": "What experience do you have designing or working with games?"}, {"date": "16 Mar 2023", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Waterford.org in Nov 2022", "Interview Descriptions": "I applied online in late December 2022, and two days later I got an online assessment, basically two parts, one was creating a data visualization using provided sample viz and data, second was critique a research plan about their new early child education program. In mid January 2023, I had the initial screening interview with recruiter, then had the hiring manager interview 10 days later. The overall experience of interview was weird, I felt the recruiter was working so hard selling this position, but the hiring manager was very strict, inpatient and showing no respect towards a candidate, by throwing questions on me and try to end the interview as soon as possible.", "Interview Questions": "The hiring manager asked a question related to previous take home research plan critique about how to improve the evaluation approach of their research plan. Also asked a research design related question. Finished the interview by quickly asking about my strength, weakness."}, {"date": "28 Feb 2023", "title": "Senior Engagement Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Waterford.org in Oct 2022", "Interview Descriptions": "The interview was conducted virtually with 2 people asking questions. They were super nice but intense. I met first with the talent acquision and she was amazing and made you want to work there.", "Interview Questions": "describe a time you had to overcome adversity."}, {"date": "2 Sept 2022", "title": "Coach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Waterford.org", "Interview Descriptions": "A few interviews after sending resumes . Not too easy or too hard. HR does pre screening. Questions are standard . Manager interview is ok. If applying for management you’ll have more interviews. DEI is very important.", "Interview Questions": "Tell me about yourself abs your previous experience?"}, {"date": "9 Dec 2021", "title": "Program Coach Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Waterford.org (Phoenix, AZ) in Nov 2021", "Interview Descriptions": "Ashley was amazing and so helpful throughout the interview process. My other interviewers were really nice also. I had a screening call with Ashley. Then, I had a interview with two of the program coach team leads.", "Interview Questions": "Why do you want to work for Waterford? What is your experience with marginalized youth? "}, {"date": "2 Dec 2021", "title": "Director of Employee Benefits Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Waterford.org in Oct 2021", "Interview Descriptions": "The review process was smooth and timely. I never felt like I had been waiting for too long before hearing back about the process. I had a total of 3 interviews with different people in the organization, but that I would be working directly with each day.", "Interview Questions": "In each interview I felt like they were really targeted in the questions to ensure that I would be able to do the job.  A major part of the job is dealing with self-funded health plans, and they asked about my experience with this."}, {"date": "1 Dec 2021", "title": "Program Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Waterford.org in Oct 2021", "Interview Descriptions": "After submitting my application I was contacted by a recruiter to set up a time to talk to see if I would be a great fit. After talking with the recruiter we were able to set up an interview time for the following week. The interview process went very smoothly. I am normally pretty nervous during interviews but the hiring managers (Also program coach team leads) made me feel very comfortable. They told me they would follow up with me within the next day or so and actually sent scenario questions that same night. After the interview process, the recruiter kept an open line of communication each step of the way when it came to the next steps. Best interview process I've had in a long time!", "Interview Questions": "How do you feel about having a structured schedule and staying organized?"}, {"date": "20 Oct 2021", "title": "Implementation Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Waterford.org (Allentown, PA) in Sept 2021", "Interview Descriptions": "Received a phone call to set up a zoom interview. Follow-up emails of zoom links and necessary paperwork. Then moved to a presentation to the team and then an independent reference survey.", "Interview Questions": "Why do you want to work for Waterford.org?\n"}], [{"date": "21 Oct 2021", "title": "Senior Implementation Process Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Waterford.org (Midwest City, OK) in Sept 2021", "Interview Descriptions": "I met with HR to determine if I would be a good fit for the position and make sure that I was interested in continuing through the hiring process based on the information provided. I then met virtually with supervisors who would be responsible for my training and performance outcomes. I was asked to do a presentation on another date after a successful outcome of this interview.", "Interview Questions": "How do you see your role in working with teachers?"}, {"date": "18 Aug 2021", "title": "Enrollment Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Waterford.org (Salt Lake City, UT)", "Interview Descriptions": "For phase one of an interview there is a phone screening with a recruiter. If they believe you are a good match they will set you up with a interview with that departments leads.", "Interview Questions": "What is your background in education?"}, {"date": "6 Aug 2021", "title": "Family Education Liaison Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Waterford.org (Salt Lake City, UT) in Aug 2021", "Interview Descriptions": "I had the pleasure to talk to Ashley Janke and she was beyond professional.\r\n She took the time to explain the benefits and what the job offer was all about giving me time to write notes and ask questions.\r\nShe was super friendly, and a kindness tone throughout the process.", "Interview Questions": "Tell me a time you felt you helped out a family/ students? And what did you do?"}, {"date": "19 Aug 2021", "title": "Program Coach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Waterford.org (Charleston, SC) in Aug 2021", "Interview Descriptions": "Ashley contacted me via telephone, we spoke for 40 minutes about the company and asked me questions to gauge qualifications. A few days later I met with two program coaches out of Utah via Zoom.", "Interview Questions": "I was asked about how I would handle difficult customers and how accustomed I was talking on the phone for extended amounts of time."}, {"date": "1 Dec 2021", "title": "Director of School Relationships Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Waterford.org in Aug 2021", "Interview Descriptions": "I met with the head of HR, my potential boss and the VP of School Relationships followed by a presentation which was outlined clearly beforehand. The process was very comfortable, clearly outlined and speaking with everyone was organic.", "Interview Questions": "There were a number of 'typical' interview questions and they came up by way of our organic conversation. "}, {"date": "13 Jul 2021", "title": "Curriculum Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 days. I interviewed at Waterford.org (New York, NY)", "Interview Descriptions": "Had 2 good interviews and was asked to give references for the selection. Then I was ghosted. No email if I was chosen or not. Just ghosted. Not professional at all so it was a negative experience.", "Interview Questions": "Tell me about yourself"}, {"date": "20 Oct 2021", "title": "Program Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Waterford.org in Jul 2021", "Interview Descriptions": "1. Phone interview with a recruiter. \n2. Zoom interview with two of the Coach Team Leads.\n3. Respond to the email prompts  & complete an Internet Speed Testing\n4. Reference Check through email", "Interview Questions": "Describe a time where I had control over my daily schedule, how did I prioritize my work? "}, {"date": "19 Oct 2021", "title": "Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Waterford.org (West Valley City, UT) in Jul 2021", "Interview Descriptions": "I was initially interviewed by a single hiring person, it was easy and fun.  Then I had a second interview with several supervisors, which was informative and relaxed.  During this time I received lots of e-mails and personal support to continue with and complete the hiring process.", "Interview Questions": "I can't remember exactly.  Mostly questions about my work experience, and how I might act in different scenarios."}, {"date": "30 Aug 2021", "title": "Program Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Waterford.org (Kansas City, MO) in Jul 2021", "Interview Descriptions": "The interview process began with a phone call from a Waterford recruiter.  If you were chosen to move forward, you received an invitation to a zoom interview with the program supervisors.  You filled out a form for your references and a week later I received a call with an offer.  All staff was super nice, very accommodating and friendly!!", "Interview Questions": "What is one thing about you that not everyone knows? "}, {"date": "26 Oct 2021", "title": "Partner Success Advocate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Waterford.org (Taylorsville, UT) in Jul 2021", "Interview Descriptions": "3-Step Interview Process that consisted of meeting first with the Human Resources recruiter. At the end of that interview she scheduled an interview with the Partner Success Advocate Manager. It was very enjoyable and we covered a variety of subjects related to the position. A short time later they reached out to schedule another interview with the School Relations Director. They were all very genuine people and really interested in my skillset and what I could bring to Waterford.", "Interview Questions": "Tell me a little about yourself.\nWhat interests you about this job opening?\nWhat do you know about Waterford?  Early Literacy Skills?\nGive me an example of an important goal you have set in the past and about your success in reaching it.\nIf you were to describe your top three qualities in working with others, what would they be?\nDescribe the most difficult problem you had to solve last year.\nHow do you handle people that are very emotional or angry?\nTell me about a time you had to go above and beyond to get the job done.\nIs there anything else you would like me to know about you?\nWhat  questions do you have for me?"}], [{"date": "20 Oct 2021", "title": "Operations Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Waterford.org (Cedar City, UT) in Jul 2021", "Interview Descriptions": "Fairly standard interview process with a couple of steps missing from a typical for-profit business but that's unsurprising. The people were super friendly and responsive to questions. Overall, very stress free interview process.", "Interview Questions": "The questions were typical; essentially asking why we should hire you, though there was a portion that delved into personal thoughts/feelings/etc. "}, {"date": "29 Jul 2021", "title": "Product Owner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Waterford.org (Seattle, WA) in Jun 2021", "Interview Descriptions": "A recruiter from Waterford reached out to me on LinkedIn and then I filled out the online application. \n\nI had a video screening (5/21) , an interview with the VP of Product (5/26) and then a 3 person panel interview (6/8). All of them went well and I was invited to submit 4 references as the final phase of the process. Then I was ghosted, didn't hear back from them at all. The last communication I received was over 1.5 months ago.\n\nEven if I wasn't getting an offer, some feedback or even basic correspondence that I didn't get the job would have been nice.", "Interview Questions": "Standard PM questions, Scrum/Agile questions etc. Nothing too crazy but it does make you think about your answers. "}, {"date": "6 Dec 2021", "title": "Product Owner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Waterford.org in Jun 2021", "Interview Descriptions": "The interview process was extremely smooth, well communicated, and a great opportunity to learn about the role.  The initial discussion with the Internal Recruiter was helpful and thorough.  I learned a lot about the company. The following meeting was with the hiring manager where we discussed job expectations and the role in general.  The third interview was with members of the team.  All three sessions were very informative and cordial.  All were conversation oriented.", "Interview Questions": "What were the most difficult aspects of your current role?  \nHow do you deal with conflicting priorities and initiatives.  "}, {"date": "20 Oct 2021", "title": "Product Owner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Waterford.org (North Charleston, SC) in Jun 2021", "Interview Descriptions": "Overall it was a good experience. The HR team was very communicative throughout the process, and Myranda provided a great roadmap for what the interview process would entail. I feel like everyone in the organization that I met with throughout the interview stages was courteous, professional, and gave really good vibes altogether. To put simply, I felt like I was able to quickly tell that the organization had good people and culture before ever joining Waterford.", "Interview Questions": "Describe your thought process when planning and communicating requirement for a new feature within the software. I can't remember the exact scenario, but they gave an example feature and wanted to talk through how I would begin the software development lifecycle. "}, {"date": "12 May 2021", "title": "Partnership Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Waterford.org in May 2021", "Interview Descriptions": "The interview process was really thoughtful, clear expectations and next steps, and the questions were asked to know more about my qualifications and if I was a good fit for the role.", "Interview Questions": "What is your education background and why you chose it."}, {"date": "21 May 2021", "title": "Bilingual Program Coach Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Waterford.org in May 2021", "Interview Descriptions": "Start with a human resources phone screening, then met with two program managers and interview in both Spanish and English, provide at least four references at least two being supervisors", "Interview Questions": "What is something on your resume you would like to highlight?"}, {"date": "19 May 2021", "title": "Support Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Waterford.org in May 2021", "Interview Descriptions": "After applying, I received a call about setting up an interview. After the time was confirmed, I received a phonecall. We discussed the company, benefits and position and responsibilities. Also discussed the salary and availability for starting.", "Interview Questions": "How many years of experience with said technologies?"}, {"date": "12 Apr 2021", "title": "Software QA Tester Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Waterford.org", "Interview Descriptions": "Panel interview with three people- two team managers and one HR manager. Asked normal interview questions (strengths/weaknesses, how to handle stress) and required a written test to prove English proficiency. Needed to explain how to change a lightbulb, step-by-step.", "Interview Questions": "How do you handle stress?"}, {"date": "12 May 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Waterford.org in Apr 2021", "Interview Descriptions": "After applying online, I was contacted after about one week to be interviewed by HR and then I was interviewed by a Vice President. The interview with HR was approximately 30 minutes and the VP about an hour. Both were very friendly, professional and direct in their questions and explanations.", "Interview Questions": "What is interesting for you about the organization? About this role specifically?"}, {"date": "30 May 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Waterford.org", "Interview Descriptions": "I emailed my application to HR. A VP interviewed me and then gave me a technical assessment. After turning in the assessment, I never heard back either way. It was very unprofessional to not at least give an affirmation that the assessment was received, not to mention giving notice that they moved forward with other candidates.", "Interview Questions": "How I would design a study to test new curriculum. Basically looking for things like validity threats."}], [{"date": "21 Jul 2020", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Waterford.org in Jun 2020", "Interview Descriptions": "I applied and after a few days was sent an assessment to complete. The assessment took a couple hours to complete and included developing a program charter, identifying and outlining roles, and constructing an initial work breakdown and success criteria. After turning it in, I heard from their recruiter within 48. We had a 30 minute call and at the end I was told that the hiring manager was out for the week, but that I would hear from them the following week to schedule an interview with her. I never heard from them again.", "Interview Questions": "Nothing unique - about project management experience, why I wanted to work there, etc"}, {"date": "4 Feb 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Waterford.org (Taylorsville, UT) in Jan 2020", "Interview Descriptions": "Interviewed first with the team that works directly with summer interns, then later on with the events manager. They asked questions and had me give a presentation to assess my public speaking skills.", "Interview Questions": "How confident are you in your abilities to learn new computer systems? "}, {"date": "12 Aug 2019", "title": "Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Waterford.org", "Interview Descriptions": "Great interview! Enjoyed speaking to the employees. We discussed my previous work experience and how that would transfer into this role. Only downfall was I was never contacted back after the conversation.", "Interview Questions": "Do you have experience with utilizing data in a classroom?"}, {"date": "8 May 2019", "title": "Team Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Waterford.org (Taylorsville, UT) in Feb 2016", "Interview Descriptions": "They called and set up a time for the interview.  I meet with two people from the company and they asked questions.  They asked some personality based questions as well as technical questions for the job.", "Interview Questions": "What is your type of leadership? "}, {"date": "22 Dec 2014", "title": "Product Owner Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1+ week. I interviewed at Waterford.org (Sandy, UT)", "Interview Descriptions": "Phone screen then in person interview. The in person interview consisted of the manager and a co-worker. The interview consisted of question addressing product management experience from work history. Good to have some questions to ask the manager and co-worker.", "Interview Questions": "Don't recall the most difficult question. Felt like this was too easy."}, {"date": "26 May 2014", "title": "Product Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Waterford.org", "Interview Descriptions": "It took a while between my resume submission and when I got the interview. I had a phone interview and then an on site interview. The questions weren't too hard. the interview included an hr person and my potential supervisor. Very professional interview.", "Interview Questions": "How would you prioritize?"}, {"date": "14 Jun 2013", "title": "User Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Waterford.org (Salt Lake City, UT)", "Interview Descriptions": "The hiring and the interview process is actually quite easy.  You submit an application and then you might do either a phone or in person interview - sometimes both.  The interview was actually one of the easiest I had gone to.", "Interview Questions": "The what would you do if questions"}, {"date": "24 Jul 2011", "title": "Software Test Engineer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Waterford.org in Jan 2011", "Interview Descriptions": "The position was for  Software Test Engineer .i was asked to write test cases  after which i had to give 2 technical interview rounds and one  HR round . i flunked in the  HR round . I would liek to know Questions and answers   that are asked  by HR  people to  Software Test Engineers .so i have better luck next time .\r\nThanx for going through and providing info .Thanx in advance .CHeers", "Interview Questions": "to many  questions were asked , so cant pinpoint on one particular "}, {"date": "19 Dec 2012", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Waterford.org (Salt Lake City, UT) in Jul 2008", "Interview Descriptions": "Cursory, keyword screening by HR. Personal interview with direct manager. No exam.", "Interview Questions": "Nothing unusual, just discussion of past experience with questions to identify experience and knowledge level of specific topics and skills they are seeking."}]]