[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A supportive workplace and impactful organization", "rating": "5.0", "reviewer_affiliation": "Former Contractor, less than 1 year", "job_date": "22 Jan 2020", "job_title": " in Edinburgh, Scotland", "duration": "N/A", "pros": "I had an incredible time working to improve the environment and get young people to take climate action. It was really rewarding to feel like you were contributing to something bigger than yourself. It is run by young people for young people so I feel like there isn't that nasty bureaucracy you experience in some workplaces. It was a fresh and very exciting place to work. There was a lot of room to be heard and voice your concerns. I was allowed complete creativity as long as it aligned with the organisations mission and vision. The manager would continually check in and offer support and advice as needed. The staff and volunteers were extremely understanding and I felt like I was truly valued and respected. Best of all, I got to meet and work with an amazing, caring and super smart group of people that care about one other and the planet.", "cons": "While there was a healthy work life balance (4 day week), I felt as though I really had to cram a lot into each day in order to achieve what was needing done. Also, I get that it is a non-profit and funding is limited but I was disappointed to learn that adjustments couldn't be made to create a permanent post for my role. I felt as though my position was central to growing the charity's engagement and constituency which is much needed given the urgency of climate change. This is beyond their reach though and dependent upon their annual funding so it's understood. However, I'd happily return to Edinburgh and work with 2050 Climate Group if they are looking to grow again! If you're reading this and are thinking about working for them– don't miss out on the opportunity!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great place for a step up in your career", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "27 Jun 2019", "job_title": "Engagement and Information Assistant in Edinburgh, Scotland", "duration": "N/A", "pros": "The unusual experience of working with a predominantly volunteer organisation with a youth focus meant I was able to take on a lot of tasks that you wouldn’t normally be able to at entry level. Also very supportive management, encouraging me to take on development opportunities. I wouldn’t be in the job I am now without having worked with this inspiring organisation. Great development opportunity, and a great network of people associated with the charity.", "cons": "Working with volunteers who mostly have full-time jobs can be challenging. Irregular hours sometimes required (evenings / weekends)"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "I worked at 2050 Climate Group for 8 months part time (4 days/week)", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "26 Jun 2019", "job_title": "Engagement & Information Assistant in Edinburgh, Scotland", "duration": "N/A", "pros": "- Very welcoming and inspiring team\r\n- A 'try it and learn' attitude to new tasks/experiences\r\n- Great management and personal/professional development opportunities\r\n- Part of a force for good - makes a real difference to the world.", "cons": "- No long term job guaruntee due to relying on annual funding (but this is typical of charity sector)\r\n- Wage"}]]