[[{"date": "20 Dec 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at TWR", "Interview Descriptions": "The interview process was extremely straightforward. I had two rounds of questions, and then I received an offer to join the internship program. I felt wanted and heard.I’m so excited that I had to be a part of the company, and they gave me the opportunity to excel my career", "Interview Questions": "Tell us of your prior experience?"}, {"date": "20 Jul 2016", "title": "Missionary Support Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at TWR (Cary, NC) in May 2016", "Interview Descriptions": "I applied online for this position upon the recommendation of a friend.  It was a very simple initial application.  I was called by an HR lady about two days later and was scheduled for an interview in about another two days.  Although I was exceptionally qualified, I did not get the position.  I believe that there was another person who was \"spotted and assessed\" previously for the job who got the position.  I was to be the first of five persons to be interviewed, so it is certainly possible that others were actually more qualified than I am. I certainly don't feel like I was discriminated against because of my age.", "Interview Questions": "How much money are you expecting?"}, {"date": "5 Jun 2014", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at TWR", "Interview Descriptions": "Was referred by a friend as there was a vacancy available.  I was given an application form to complete.  I submitted the application form and my resume and was subsequently invited for an interview.", "Interview Questions": "N/A"}], []]