[[{"date": "20 Mar 2023", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Victim Support", "Interview Descriptions": "the application process is mainly online, very effective and easy enough to do. The interview is laid back, but you still need to know your stuff Results are sent online to you all online and practical, the time to start depends on the references and DBS", "Interview Questions": "what have you done in other roles around abuse"}, {"date": "8 Mar 2023", "title": "Caseworker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Victim Support", "Interview Descriptions": "Very straight forward interview, Standard interview questions. There was a Panel of 2 managers and staff took in turns answering questions. Welcoming and friendly environment and interview room. Informed via email of interview request and called with verbal offer.", "Interview Questions": "How to address EDI in community"}, {"date": "6 Mar 2023", "title": "Learning and Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Victim Support", "Interview Descriptions": "One interview with two directive roles in the organisation. Instructions to prepare and present some content based on instructions and topics sent in advance. Space to ask questions to the interviewers including anyone that is observing the interview for development reasons.", "Interview Questions": "Questions about knowledge of Data Protection Questions about Safeguarding principles and how to put them in practice in different scenarios Questions about Equality, Diversity and Inclusion Questions about previous experience and values"}, {"date": "8 Dec 2022", "title": "IDVA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Victim Support (London, England)", "Interview Descriptions": "2 week process from applying for the job waited 3 days to be shortlisted and then interview. I got Declined for not having enough experience in the same field. Even so they said they will provide with training", "Interview Questions": "What experience do you have"}, {"date": "25 Jan 2023", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Victim Support in Dec 2022", "Interview Descriptions": "Panel competency based interview with 3 members of staff. Meeting was on Skype for Business which I thought had been phased out. The interviewers were great and made me feel at ease. I found the wording of the questions difficult to understand what was being asked.", "Interview Questions": "How would you go about explaining something complex and technical to a non technical audience?"}, {"date": "16 Dec 2022", "title": "Caseworker Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Victim Support in Nov 2022", "Interview Descriptions": "Interview via Skype was efficient and both managers were approachable. I made it clear that of the 3 jobs advertised, (full time, 4 days or 2 days) I was only available for 2 days due to childcare responsibilities. In addition I wrote this info on the application form", "Interview Questions": "I was offered a 4-day post in writing, which I declined."}, {"date": "14 May 2022", "title": "Case Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Victim Support (London, England) in Apr 2022", "Interview Descriptions": "Applied on website. When the position closed got asked for an interview a day later. I booked it in and had the interview within the week.  It was a 2 part interview.", "Interview Questions": "Why do you want this job role "}, {"date": "10 Apr 2022", "title": "Head of Digital Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Victim Support in Mar 2022", "Interview Descriptions": "The interview and whole application process was positive and the interviewers made me feel at ease. They also gave detailed and in depth feedback which was very helpful for me.", "Interview Questions": "Why are you applying for this job."}, {"date": "14 Sept 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Victim Support in Aug 2021", "Interview Descriptions": "The interview process was split into two, a phone call and Zoom interview. The questions were relatively simple and straightforward. Not much experience is necessary as this is a volunteering position.", "Interview Questions": "Tell us something you did not include on the application form."}, {"date": "4 Jul 2021", "title": "INbound Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Victim Support", "Interview Descriptions": "Well set out online form through the website, easy to understand and access, invitation to book interview through the website, interview held on zoom with two members. Really friendly and easy to talk to, made you feel at ease.", "Interview Questions": "Could you define empathy in your own words"}], [{"date": "3 Jun 2020", "title": "Community Engagement Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Victim Support in May 2020", "Interview Descriptions": "Completed application form, invited to interview where I had to prepare a presentation then they asked me 10 questions. Did not give adequate information on presentation, role very unclear and they asked multiple questions at a time, so it was more than 10 questions in the end.", "Interview Questions": "How would you ensure safeguarding protocols were followed"}, {"date": "13 Feb 2020", "title": "Victim and Witness Care Support Officer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Victim Support", "Interview Descriptions": "Applied for the job and got a call back a few days later then booked an interview slot. Interview was in different office to the job I applied for. Questions were hard but staff were nice", "Interview Questions": "When have you shown good customer service"}, {"date": "27 Nov 2022", "title": "CYP caseworker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Victim Support (London, England) in Sept 2019", "Interview Descriptions": "The interview started with a case study where I was asked what I would do to support the young person. I was then asked about my relevant experience and knowledge.", "Interview Questions": "Safeguarding, barriers to support, GDPR, cultural differences."}, {"date": "23 Mar 2023", "title": "Data Quality Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Victim Support (London, England) in Mar 2019", "Interview Descriptions": "Originally applied as a volunteer but was offered an interview for a paid role. 30 min interview with team leader senior manager. Was called back in a couple of days. Really easy process!", "Interview Questions": "What do you know about victim support"}, {"date": "7 May 2018", "title": "INbound Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "The process took 3 weeks. I interviewed at Victim Support (London, England)", "Interview Descriptions": "Applied online and was invited for interview. The whole process took roughly 3-4weeks. \nArrived at interview and was asked to complete a short task. I was then interviewed by a panel who were very friendly and encouraging.", "Interview Questions": "Can you describe a time you showed empathy."}, {"date": "4 Dec 2017", "title": "Victim and Witness Care Support Volunteer Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Victim Support", "Interview Descriptions": "I Applied on line and wthin one week the volunteer coordinator had  asked me to come for an informal Interview. \r\nInterview took place two weeks later. \r\nThe interview was relaxed, the two ladies made me feel at ease straight away I genuinely answered there questions and they had told me I must meet their essential criteria. \r\nBy the end of the interview I knew more about the role and what was expected of me and was asked is this role for me which I said yes. \r\nI was expected a week later by email \r\nAnd month later I started my  induction training", "Interview Questions": "Tell me about a time when you provided emotional support to someone friend \\family members when they were in crisis"}, {"date": "27 Jan 2021", "title": "Customer Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Victim Support (London, England) in Nov 2017", "Interview Descriptions": "It was really good they guided you through the process and the application was really straight forward, i used on an online portal to reply and got a response quite quickly. The telephone interview was about 15 mins long so it was more about rapport building than anything else. They were also very welcoming so you felt at ease during the process.", "Interview Questions": "Have you dealt with difficult situations in the past?"}, {"date": "30 Sept 2017", "title": "Domestic Violence Caseworker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Victim Support (Dagenham, England) in Aug 2017", "Interview Descriptions": "Online application process and then was contacted over the phone to be invited down to interview. Interview consisted of questions and database task. I was interviewed by a panel of two who were very friendly and made me feel at ease.", "Interview Questions": "Scenario questions"}, {"date": "25 Apr 2019", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Victim Support (Dudley, England) in May 2017", "Interview Descriptions": "Fairly easy, I was able to prepare well therefore the answers came naturally. Felt really comfortable as I had met the interviewers previously to this during the selection process and built a good rapport with them.", "Interview Questions": "How would you deal with confrontation"}, {"date": "2 Mar 2017", "title": "Victim Care Advocate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Victim Support in Feb 2017", "Interview Descriptions": "Online application form via Victim Support website, asking for all the usual stuff.  Decent amount of space for your self-statement i.e. describing how your skills match the person spec.\r\nCompetency-based Interview, with two VS staff.  Fairly informal and friendly tone to the interview.  Interview took place only 3 days after the advert closed, not leaving much time to re-arrange work commitments etc!", "Interview Questions": "What jobs have you done relevant to this role?"}], [{"date": "3 Feb 2017", "title": "Volunteer Community Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Victim Support (London, England)", "Interview Descriptions": "I applied and they got back to me quickly. They do their interviews through another company and had the wrong time listed for me. I felt the questions were weirdly worded and I found it difficult to express my skills. I also asked for feedback, twice, after I found out I didn't get the job but never received it. There was a task to do before the interview started which you were given ten minutes to complete.", "Interview Questions": "On a scale of one to ten how good are you with computers? "}, {"date": "10 Feb 2017", "title": "Support Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Victim Support (Bicester, England) in May 2016", "Interview Descriptions": "Met with two people (one line manager + one admin). They were very friendly, the interview was casual. Met in the office in Bicester. They asked me what I expect from working with Victim Support. Told me what the training process entails and that there will be a lot of support from within the team to deal with the pressures that come with this line of work.", "Interview Questions": "How do you think victims of crime respond to their victimisation?\r\nWhat do you think about diversity?"}, {"date": "14 Jan 2019", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Victim Support (London, England) in Apr 2016", "Interview Descriptions": "There were 2 panel members, both friendly. The questions were fairly difficult, especially the scenario questions, however they are understanding that you may not know everything straight away and prompt you for answers.", "Interview Questions": "what to do in a safeguarding situation"}]]