[[{"date": "8 Mar 2023", "title": "Teacher Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Evangelical Lutheran Good Samaritan Society", "Interview Descriptions": "In the process of interview with a school that I have been interested in. I hope I get the job. I have difficulty sometimes understanding questions but I hope I do good", "Interview Questions": "Tell us about the time you ?"}, {"date": "8 Feb 2023", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Evangelical Lutheran Good Samaritan Society", "Interview Descriptions": "The interview process was quick and friendly. They make you feel comfortable and appreciated. Reasonable offer made. There is levels of training were provided and benefits. Leadership was nice and the company's mission is good", "Interview Questions": "What are your Strengths and Weaknesses"}, {"date": "12 Oct 2022", "title": "Certified Medication Aide Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Evangelical Lutheran Good Samaritan Society (Windom, MN)", "Interview Descriptions": "Basically, they will hire ANYONE because they really need the help. They will pay for schooling as well. The D.O.N. that hired me has retired . I don't have thirty words to say", "Interview Questions": "what shift can you work do you have a car"}, {"date": "3 Aug 2022", "title": "Dietary Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Evangelical Lutheran Good Samaritan Society", "Interview Descriptions": "They scheduled a 30 min interview after I submitted an online application—easy questions, mostly personality based e.g how you get along with others. Two people sat in on interview. Call came less than a week after the interview.", "Interview Questions": "Give an example of a time you faced adversity and how you got through it. "}, {"date": "27 Aug 2021", "title": "Dietary Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Evangelical Lutheran Good Samaritan Society", "Interview Descriptions": "Awesome and friendly receptionist.  The dietary director gave such a positive vibe. Questions were straightforward and a lot of sharing the benefits you could bring to the team.  Immediately toured me the kitchen.", "Interview Questions": "Can you Tell me about yourself?"}, {"date": "17 Jun 2021", "title": "Barback Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Evangelical Lutheran Good Samaritan Society", "Interview Descriptions": "Great interview process really made you want to take the job  I did no though because it was weird I also do not like to work nights so I declined I would also like to add that I am not a night person so no thanks yoy how are you today", "Interview Questions": "How would you like to be pain"}, {"date": "7 Jan 2021", "title": "Dietary Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Evangelical Lutheran Good Samaritan Society", "Interview Descriptions": "Just be calm and ask questions so you can get the understanding of your job and the job title. Don’t be scared, just know how u answering questions. A lot of questions will be ask upon you and time in your life questions too. Honestly just answer them truthfully, but if you done like volunteering say that, anything with helping people say that", "Interview Questions": "Why should we pick you as an worker"}, {"date": "8 Aug 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Evangelical Lutheran Good Samaritan Society", "Interview Descriptions": "Questions telling them about yourself  as well as your background. Then on to situational, what would you do questions, tell me about a time when, and why do you want to work here.", "Interview Questions": "What patient would you see first out of 5 patients? 2 assessments, labs, surgery, and family member. "}, {"date": "24 Apr 2020", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Evangelical Lutheran Good Samaritan Society", "Interview Descriptions": "Average interview questions and situations given and asked how you would respond to them.  Very simple interview with them also reviewing your resume with you. Asking about your duties and situations that arises", "Interview Questions": "Basic interview questions"}, {"date": "23 Mar 2021", "title": "Case Mangr Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Evangelical Lutheran Good Samaritan Society (Sioux Falls, SD) in Feb 2020", "Interview Descriptions": "The interviewing team was quick to respond to my application and the interview process was easy! I wish it would have been a Zoom interview instead of just a phone call.", "Interview Questions": "What was one time you used problem-solving skills? "}], [{"date": "10 Mar 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Evangelical Lutheran Good Samaritan Society (Daytona Beach, FL) in Jan 2020", "Interview Descriptions": "It was over zoom and basic nursing questions were asked. You meet with the DON and maybe the administrator and a unit manager. Then they get back to you in a few days or a week. Hiring process is straight forward", "Interview Questions": "Tell us about yourself\r\nThey ask nursing application questions "}, {"date": "1 Mar 2019", "title": "CNA Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Evangelical Lutheran Good Samaritan Society (Fargo, ND)", "Interview Descriptions": "Had an interview over the phone that didn’t even last 15 minutes. Was told they’d get back to me by the end of the day. Still waiting. I understand if I did not get the position, but it would be nice to be told either way so I can start pursuing other offers.", "Interview Questions": "How would your current supervisor describe you?"}, {"date": "13 Mar 2019", "title": "Director of Nursing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Evangelical Lutheran Good Samaritan Society (Silverton, ID) in Jan 2019", "Interview Descriptions": "Several initial phone interviews, application process online, and in person interview with Administrator and Director of Human Resources. Since I was arriving from out of town, the Administrator was very accommodating and offered to do a virtual \" Skype type\" interview with the director of HR but I was so excited about the position and wanted to visit the area, that I traveled from several states away to greet them in person. The interview was appropriate and professional. I felt welcome and comfortable during the entire process and knew that this was the perfect fit for me.", "Interview Questions": "Why do you want to work at the Good Samaritan Society?"}, {"date": "21 Feb 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Evangelical Lutheran Good Samaritan Society (Ottumwa, IA) in Sept 2018", "Interview Descriptions": "Met with ADON and answered basic questions about care, plus what are my strengths and weaknesses. I was also asked about what my schedule would be and how I work with others and if I am a team player", "Interview Questions": "What is one of my strengths as a CNA?"}, {"date": "23 Nov 2018", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Evangelical Lutheran Good Samaritan Society (Alma, NE) in Sept 2018", "Interview Descriptions": "The interviewer had a set of pre-required questions that they have to ask. She was very friendly and easy going. Overall it was a pleasant interview and made me want to work there more.", "Interview Questions": "Why do you feel like this workplace would be a good fit for you?"}, {"date": "6 Sept 2018", "title": "Human Resources Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1+ week. I interviewed at Evangelical Lutheran Good Samaritan Society (Minneapolis, MN) in Jul 2018", "Interview Descriptions": "Replied to HRC add, only to see the same position the next day with far more additional duties for the same amount of pay.  Not very professional, let alone ethical considering the pay rate was the exact same.  Two job duties description with the same pay as HRC.  Shady.", "Interview Questions": "Changing the job description without notice. "}, {"date": "20 Apr 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Evangelical Lutheran Good Samaritan Society (Redwood Falls, MN) in Oct 2017", "Interview Descriptions": "Basic interview questions that can easily be prepared for. I got hired on the spot because they were so short staffed. It seems like they would hire pretty much anyone", "Interview Questions": "What’s a time when you had a conflict with someone and how did you resolve it?"}, {"date": "16 Jun 2020", "title": "Food and Nutrition Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Evangelical Lutheran Good Samaritan Society (Fort Collins, CO) in May 2017", "Interview Descriptions": "I applied via the job listing. I then received an email from HR to schedule an interview. The interview was in-person with one of the bosses from the dining department. It was pretty easy and laid-back.", "Interview Questions": "What would you do if you brought a resident the wrong food?"}, {"date": "18 Apr 2017", "title": "Prep Cook Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Evangelical Lutheran Good Samaritan Society (Olathe, KS)", "Interview Descriptions": "They'll ask the usual interview questions like \"Tell me about a time there was a stressful or difficult problem at work and how did you overcome it?\" and \"How to you handle conflict with coworkers?\" So be prepared for behavioral/situational questions. I even got asked \"Which celebrity do you look up to and why?\" Not sure if they were trying to get a feel for my values or goals, or just to throw me off and see how I handle the unexpected, but be sure to think of specific examples to answer these types of questions. You might be interviewed by more than one person, depending on the department, so be prepared to be tag teamed.", "Interview Questions": "One question that stood out was \"What's the maximum amount of times an employee should miss work?\" I feel like this may have been a trick question. Ideally, it should be zero, but in reality, emergencies happen and they do allow up to so many call-ins a year (can't remember how many), but say two or less for absolute emergencies."}, {"date": "1 May 2018", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Evangelical Lutheran Good Samaritan Society (New Hope, MN) in Apr 2017", "Interview Descriptions": "I applied online, got a call the next day or so, went into new hope location, 1:1 interview with manager, I was then offered position either later that day or a day later.", "Interview Questions": "Why I wanted to work there"}], [{"date": "19 Aug 2018", "title": "Certified Nursing Assistant CNA Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Evangelical Lutheran Good Samaritan Society (Sioux Falls, SD) in Feb 2017", "Interview Descriptions": "Scripted questions asked by local department managers.  Had a tour of the building and the hiring process was explained.  Then went through the hiring process.  Long training programs.", "Interview Questions": "Lots of team building and previous scenario questions"}, {"date": "20 Sept 2017", "title": "Staff Development Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 6 days. I interviewed at Evangelical Lutheran Good Samaritan Society (Ottumwa, IA) in Jan 2017", "Interview Descriptions": "It was weird. I showed up a few minutes early to make sure I found where I was going. The Administrator sent me to wait on the couch and then called on a radio that \"the interview is SO early\" and I was immediately annoyed. I was less than 10 minutes early. She had a conference call, fine, but sent me to interview with someone else. It was 20 minutes of pre-written questions that I don't believe got my full story. The woman interviewing me did not write down what I said accurately and I felt very misrepresented. I was displeased overall. Frankly I am not very upset I wasn't offered the position.", "Interview Questions": "Name a time you have had attendance issues."}, {"date": "7 Jan 2017", "title": "CNA Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Evangelical Lutheran Good Samaritan Society (Meridian, ID) in Dec 2016", "Interview Descriptions": "asked why I had been let go of my last jobs, and why I thought that he should hire me.  My mistake as I told  the truth, and then said, \"I dont know to why he should hire me\"!  That was it for the interview.", "Interview Questions": "Explain why I was Let go on my last few jobs.  Then why I thought that he should hire me."}, {"date": "4 Sept 2016", "title": "Universal Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Evangelical Lutheran Good Samaritan Society (Fairfield Glade, TN)", "Interview Descriptions": "I appplied online. Then it was about 6 weeks before I ever heard from them.  When I finally got the call, I came in for a one on one interview.", "Interview Questions": "What is my previous work experience?"}, {"date": "21 Apr 2020", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Evangelical Lutheran Good Samaritan Society (Greeley, CO) in Aug 2016", "Interview Descriptions": "Very inviting and calm environment. Didn't feel pressure. One on one interview and she was very kind and caring and took her time. I didn't feel rushed on put on the spot.", "Interview Questions": "What's one of your best and worst qualities?"}, {"date": "21 Jun 2016", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Evangelical Lutheran Good Samaritan Society (Kissimmee, FL)", "Interview Descriptions": "I was interviewed by the Administrator, she was very professional. She asked me many situational questions, such as what would you do if the state was with you for a home visit and you were doing wound care? How do you document this type of visit? etc...", "Interview Questions": "How much experience do you have with wound care?"}, {"date": "12 Jul 2016", "title": "PR-Social Media Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Evangelical Lutheran Good Samaritan Society (Sioux Falls, SD) in Mar 2016", "Interview Descriptions": "Process started with a phone interview with Human resources. Within a a week, set up a 30-minute in-person interview. \r\n\r\nUpon arrival, I was given a brief tour by an HR representative and got a glimpse of the company culture. It seemed kind of like a startup with lots of people working publicly in groups, and I saw what appeared to be a walking meeting on an in-building walkway that doubles as a track of sort. Cool culture. The meeting opened with a prayer, which is standard. \r\n\r\nThat was followed by a 60-minute 2-1 interview with the department director and my direct supervisor. Interview was casual, and questions were standard procedure for an interview for a mid-level position.", "Interview Questions": "Tell us about your experience with social media."}, {"date": "28 Dec 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Evangelical Lutheran Good Samaritan Society (Prescott, AZ) in Jan 2016", "Interview Descriptions": "Very brief. The questions manager was asking were written down and seemed standard. They verified what was in my resume and didn't ask any generic interview questions, such as tell me about yourself or what your weaknesses or strengths are. And then just explained about the company a little and told me what shifts were available. and about the orientation process", "Interview Questions": "Have you ever been arrested?"}, {"date": "3 Mar 2017", "title": "Sales Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at Evangelical Lutheran Good Samaritan Society (Roseville, MN) in Sept 2015", "Interview Descriptions": "Had an interview with HR Manager and Sales Consultant. Later a second interview with the Executive Manager. The Sales Consultant asked most of the questions with the HR manager adding thoughts if she deemed necessary. Questions were very wordy and hard to follow, sometimes going on for minutes without an actual question being asked. Sales Consultant seemed condescending rather than helpful or inquisitive. Second interview with Executive Manager went well, short and sweet. She did an overview of what the job was and the qualifications. I was offered the job on the spot at second interview.", "Interview Questions": "Would you consider this job a step down from your current position? "}, {"date": "20 Aug 2015", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Evangelical Lutheran Good Samaritan Society (Prescott Valley, AZ)", "Interview Descriptions": "hiring process was great, nothing hard. Upper management were eager for new employees and i felt welcomed. This is a great place to start as a CNA to get experience. the DON at the time was very open, and mad the interview process easy. We went through general things basically on what to expect if I would start working such as policy and procedures", "Interview Questions": "basic questions on how long i been working in the field"}], [{"date": "18 Mar 2015", "title": "Valet Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Evangelical Lutheran Good Samaritan Society in Dec 2014", "Interview Descriptions": "arrived 15 min early, waited another 45 min to get the process started. Interview was quick. DON had asked repetitive questions, which made it frustrating since it was almost impossible to answer it any differently.", "Interview Questions": "Do you think elderly should be disciplined"}, {"date": "5 Jun 2015", "title": "Marketing Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Evangelical Lutheran Good Samaritan Society (Sioux Falls, SD) in Sept 2014", "Interview Descriptions": "Over the phone:  I was told that only current employees of the Society that had  marketing experience need only apply.  (I came from a business accounting division)  I had inquired if teleworkers were allowed, and the answer was no.  ( I was aware that some of the marketers were allowed to work out of their homes, so perhaps they hiring supervisor did not want to hire additional teleworkers.", "Interview Questions": "Did I have marketing experience at the Society?  Did I have marketing experience elsewhere?"}, {"date": "21 Jun 2014", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Evangelical Lutheran Good Samaritan Society", "Interview Descriptions": "Applied online. Took about 4 days before I got a phone call to set up an interview. Had the interview. Offered the job at the interview. I wasn't real impressed with the person who called me. He let me set up the time for the interview but then called me back the day before and rescheduled because he was having a meeting with the administrator.", "Interview Questions": "How do you feel about working for a Christian organization?"}, {"date": "30 May 2014", "title": "Communications Project Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Evangelical Lutheran Good Samaritan Society (Sioux Falls, SD)", "Interview Descriptions": "Applied online, called in for an interview and was shown the premises right away. I was welcomed by the hiring director and also visited with hr director that same day to discuss benefits. Invited to attend devotions that day and given a tour of the facility. Received an offer within one week. Start date was 3 weeks after that time.", "Interview Questions": "N/A"}, {"date": "5 Sept 2015", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Evangelical Lutheran Good Samaritan Society in May 2014", "Interview Descriptions": "Super easy and fast. I spoke with Patti from HR. She is very nice. Out of any staff there she is the Best! She is very professional! She's honest and will help you with any question.", "Interview Questions": "Background check"}, {"date": "27 Dec 2013", "title": "Staffing Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Evangelical Lutheran Good Samaritan Society (Greeley, CO) in Dec 2013", "Interview Descriptions": "A lady called and left a message with one date and one time to interview.  Did not say who I would be interviewing with and said to call back to make sure I could make it.  I called back and left a message saying I could make that time and ask if the location I found on the website is where the interview was going to be.  I also asked if there is anything specific for me to bring to the interview.  Never got a call back and I showed up on the date and time at the location I found on the internet.\r\nI told the receptionist that I was here for the Staffing Coordinator interview and she shoved a clipboard in my face and said \"fill this out.\"  The paperwork I filled out was basics (address, phone, etc.) which was annoying because I filled out all this on the application online.  It also asked for my SSN which I found discomforting writing my SSN on this paper that had all of my information for a company that has never even seen me.\r\n\r\nThe Director of Nursing came and we went to a conference room.  On the way to the conference room he told me he hasn't looked at my application yet.  I asked if he would like a copy of my resume and he said I don't think so, I think it is on the application you filled out.  We sat down and asked me to go over my resume.  I went over my history, then he asked me how my computer skills are.  I told him all the systems I have worked with before and he wrote on his piece of paper \"OK,\" under the question about my computer skills.\r\n\r\nHe asked me what would I do on a Friday afternoon if a CNA or Nurse called in sick.  I answered, ask people to do a double, call PRN, call other people that might want an extra shift, and then call an agency.  \r\n\r\nAfter the last question he told me he doesn't want to be involved in the schedulers duties and he doesn't want phone calls on the weekends.  After that I asked some questions and the interview was over.\r\n\r\nShortest interview I have ever had.  I felt that they were required to interview a certain number of outsiders for this position and I was just a number.  The director of nursing gave me the feeling that he didn't care.  I practiced and researched before the interview but was never given the opportunity to shine.  Overall, it was a very awkward and I got the feeling that they didn't care.  If I am offered this job I will not accept because I want to work somewhere that has more heart then the feeling I got.", "Interview Questions": "Only two questions were asked by the Director of Nursing and they are easy answers.\r\n1.  Are you good with computers?\r\n2.  If it is Friday and a nurse or CNA call in sick what do you do?"}, {"date": "8 Feb 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Evangelical Lutheran Good Samaritan Society (Loveland, CO) in Sept 2013", "Interview Descriptions": "I was contacted by the HR Director, with whom I met first to talk about the broad position description. She then set up an interview with the Director of Nursing, with whom I had a more formalinterview about my nursing and personal experiences..", "Interview Questions": "What are your alternative approaches to conventional nursing concerns?"}, {"date": "13 May 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Evangelical Lutheran Good Samaritan Society (Liberal, KS) in Sept 2013", "Interview Descriptions": "Was asked if I enjoyed working with people. How many years of experience I had. If I planned on continuing my education in the field.  If I was available weekends and holidays.  I was giving a test to see if I could walk around the block and climb stairs.  Standard.  A drug test. and a physical from a physician and also standard for Kansas is a yearly 2 part TB test.", "Interview Questions": "If I enjoyed working with people."}, {"date": "26 Sept 2017", "title": "Dietary Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Evangelical Lutheran Good Samaritan Society (Olathe, KS) in Sept 2013", "Interview Descriptions": "First, they will give a paper have some question on it and you need to answer, then there are two people will start asking you question. Questions are focus on how you work with others and do you have the experience to take care the elderly person.", "Interview Questions": "How will you communicate with the co-worker?"}, {"date": "11 Oct 2016", "title": "Director of Marketing and Resource Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Evangelical Lutheran Good Samaritan Society (Beatrice, NE) in Jun 2013", "Interview Descriptions": "I was called for an interview with the HR Director.  I accepted a time and showed up.  She was on time and the interview was detailed and organized.  She asked a list of questions that they ask of every appellant that is interviewed.  My second interview was with the Administrator and a manager of Assisted Living.  This was also a list of questions, but fewer, that required more detail.", "Interview Questions": "Tell me about a time when you had to resolve a conflict between you and a co-worker."}], [{"date": "23 Apr 2017", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Evangelical Lutheran Good Samaritan Society (Gresham, OR) in Jun 2013", "Interview Descriptions": "applied on line, rec'd a call, was interviewed timely, offered job, low pay, benefits sounded decent, got a better offer. Odd to fill out paper work before being hired.", "Interview Questions": "About expierence "}, {"date": "29 Sept 2016", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Evangelical Lutheran Good Samaritan Society (Kearney, NE) in Apr 2013", "Interview Descriptions": "Hiring process was fairly short. Received a phone call about a week after the interview for an offer. I thought that it was a very easy process and the questions that were asked during the interview were fairly standard.", "Interview Questions": "How do you handle time management?"}, {"date": "12 Apr 2013", "title": "Weekend Housekeeping Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Evangelical Lutheran Good Samaritan Society in Sept 2012", "Interview Descriptions": "I applied online after seeing a job opening they had posted on my university's website. I was called back about a day after I applied and asked to come in for an interview. The process was incredibly simple and brief. The interview itself was very easy and it felt like the interviewer was more so explaining what the job entailed than asking me questions. I think I was only asked about 2 actual questions, the rest was just us talking or me asking questions about the job. I thought it was abnormal for an interview, but then again being a housekeeper isn't rocket science, and I'm not complaining about not having to answer tough questions! The environment was pretty comfortable and everyone seemed nice.", "Interview Questions": "There literally were no difficult or unexpected questions."}, {"date": "16 Apr 2016", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Evangelical Lutheran Good Samaritan Society (Brainerd, MN) in Mar 2012", "Interview Descriptions": "The process was fairly quick. The administrator contacted me within a week and scheduled an interview with me the next week. Everyone there was very helpful and happy to have me", "Interview Questions": "describe a time that you showed good customer service"}, {"date": "22 Dec 2014", "title": "Systems Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Evangelical Lutheran Good Samaritan Society in Jun 2011", "Interview Descriptions": "The interview was a mixture of formal and non-formal. No low level technical questions. They seem to really appreciate total disclosure. Remember also this is a truly God oriented/run cooperation. I believe they make most of their hiring decisions based on a good personality fit over qualifications for the most part.", "Interview Questions": "There were really no difficult or unexpected questions. "}, {"date": "28 Jul 2010", "title": "Dietary Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Evangelical Lutheran Good Samaritan Society (Kissimmee, FL) in May 2009", "Interview Descriptions": "People are very nice, very helpful show that you are respectable and job is in sights.", "Interview Questions": "Are you good with people can you get along with fellow employees?"}]]