[[{"date": "27 Jun 2023", "title": "Telefundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Portland State University (Portland, OR)", "Interview Descriptions": "Initial interview was done over the phone as an assessment of phone skills. After that, an additional interview may be requested. Questions were fairly standard and candidates were assessed on phone capability more so than experience.", "Interview Questions": "What is your previous work experience?"}, {"date": "18 May 2023", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Portland State University (Portland, OR)", "Interview Descriptions": "Questions related to field. Appropriately difficult relating to content knowledge. I'd recommend reviewing common questions for your specific field and pedagogical approaches to instructing in your specific content areas. I would not answer vaguely, but include specific examples from past teaching experiences.", "Interview Questions": "What teaching methods would you use in the classroom?"}, {"date": "27 Feb 2023", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Portland State University", "Interview Descriptions": "I had a Zoom interview. I was interviewed by three people representing the department. They each took turns asking the questions and it only took about fifteen minutes. There was very little back and forth conversation. I got the impression they were just going through the motions.", "Interview Questions": "This job requires attention to detail in a fast-paced environment. Please describe your experience in a role like this. What techniques did you use to prioritize tasks and check for accuracy in your work?"}, {"date": "21 Sept 2022", "title": "Working Student Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Portland State University", "Interview Descriptions": "The interview process I had to go through admissions and then I had to ask multiple questions.  The interview process I had to go through admissions and then I had to ask multiple questions. The interview process I had to go through admissions and then I had to ask multiple questions. The interview process I had to go through admissions and then I had to ask multiple questions. ", "Interview Questions": "How many times?\nHow many days?\nWorking hours "}, {"date": "17 Sept 2022", "title": "A/V Services Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Portland State University (Portland, OR) in Jul 2022", "Interview Descriptions": "Multi-round process, received tour of facility and complete walk through of position. Interviewed with head of department as well as 3 other affiliated cohorts. Asked about inclusivity, as well as previous education, experience, qualifications, etc.", "Interview Questions": "Give an example of a time you were responsible for others"}, {"date": "13 Jun 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Portland State University", "Interview Descriptions": "Unexpectedly a large panel style interview , comprised of community members and staff. There were approximately 14 people that interviewed me and, I was asked the same question at least twice for half of the interview it was a little intense and not very pleasant.", "Interview Questions": "Why do you want to work here?\r\nWhy do you think you would be a good fit here?\r\nHow would you benefit the community?"}, {"date": "6 Jul 2022", "title": "Academic & Career Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Portland State University (Portland, OR) in May 2022", "Interview Descriptions": "There were two rounds of interviews. The first round was just with the hiring committee, which included 7 people. They sent me the 4 questions that I had 25 minutes to answer 24 hours in advance. The second round took place two weeks later, and involved three different interviews back-to-back. One that was an open Q&A with a variety of department members, no question prep, 25 minutes long. The second was again with the search committee for 25 minutes. They had five questions this time. The third was a 20 minute interview with the Associate Vice Provost of Advising, which I did not receive questions in advance for. I did not hear back from them after this second round. I reached out to inquire after two weeks, and a whole month after my final interview I was told I would not receive an offer.", "Interview Questions": "Why are you interested in this position? What excites you about this position at PSU?"}, {"date": "30 Apr 2022", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Portland State University", "Interview Descriptions": "it was very easy but it is a different world now. the people are not great. I do not know what else this box wants me to say. application, phone call, come in and meet people.", "Interview Questions": " Can you give me an example of a difficult problem you solved at work?"}, {"date": "2 Mar 2022", "title": "GRA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Portland State University", "Interview Descriptions": "resume was sent by mail and called for a in person interview, Its about 30 mins . Asked a basic quesyions why im instered in this fiedld, Offer received in a 2 weeks", "Interview Questions": "basic questions on materaila science and previuos experence"}, {"date": "11 Feb 2022", "title": "Executive Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Portland State University", "Interview Descriptions": "Standard Interview using behavioral interview questions. Also, there was a panel interview. Do not expect to get paid for hard work here. It is a union job you only get paid what the union allows you can do bad or good it does not matter.", "Interview Questions": "Give me an example of a time you had to prioritize certain tasks or projects over others."}], [{"date": "14 Jan 2022", "title": "Front Office Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Portland State University", "Interview Descriptions": "They asked the standard questions, mostly behavioral things because you interact so much interpersonally with staff, students, and faculty, and so a lot of different issues and problem solving opportunities come up. All very standard.", "Interview Questions": "Tell us about a time you resolved an issue with a customer/client who was unhappy."}, {"date": "27 Oct 2022", "title": "Medical Office Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Portland State University (Portland, OR) in Jan 2022", "Interview Descriptions": "Interview was very structured and interviewers were warm and welcoming. They may ask you about how you deal with emergency situations, your experience working with/alongside college students, and your ability to work well with the other staff members.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "29 Jul 2021", "title": "Academic Advisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Portland State University", "Interview Descriptions": "Went through several interviews: an initial phone interview with the hiring committee and in-person interviews with the hiring committee, manager and the team, and the division dean. Overall, the experience was good and pretty straightforward. I ended up being offered the job shortly after the last interview, but as soon as I attempted to negotiate salary (their offer was pretty low), the job offer was revoked. I had been grateful and completely professional in my response to the offer and was simply asking if the salary was negotiable. I was totally shocked at the revoking of the job offer, and considering that they had seemed so eager to hire me, it didn’t make any sense. Felt like I was being punished for trying negotiate salary. As a PSU alum myself, I felt very insulted by this experience and am very hesitant to apply for any other positions there again. Not to mention, their pay overall seems quite low compared to other colleges and universities in the region.", "Interview Questions": "Pretty standard questions, including several scenario-based questions. "}, {"date": "26 Apr 2021", "title": "Office Specialist II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Portland State University", "Interview Descriptions": "My interview was fair, thorough and relaxed. I met with team who'd I be working with. They asked standard questions about personality, technology and fit. They put me at ease.", "Interview Questions": "How comfortable are you with Office?"}, {"date": "19 Jan 2021", "title": "9 MO Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Portland State University", "Interview Descriptions": "I have 1st and 2nd interviews.  Both were online through the zoom.  5-6 interviewers were there, and they tried to be friendly, but due to the time limit, I felt they were also rushing. They asked very structured questions. Each interviewer asked a question one by one. Questions were about my research agenda, research methods, teaching experience, etc.", "Interview Questions": "Research methods I often use "}, {"date": "17 Dec 2020", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Portland State University (Portland, OR) in Dec 2020", "Interview Descriptions": "Applied and was contacted by email for an interview.  The initial interview was conducted via Zoom due to COVID-19 precautions. The interview panel consisted of seven interviewers. The questions were mostly situational.", "Interview Questions": "Can you tell us about a time when you had to juggle with multiple competing priorities?"}, {"date": "4 Aug 2020", "title": "Computer Lab Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Portland State University", "Interview Descriptions": "I applied and got an in-person interview in a week. The questions are very simple to answer. Very basic behavior questions. For example: describe the situation you disagree with the idea of your team members?", "Interview Questions": "describe the situation you disagree with the idea of your team members?"}, {"date": "8 Jul 2022", "title": "QAE II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Portland State University in Jan 2020", "Interview Descriptions": "Good. Just 2 rounds of interview. One was technical and other was more on qa process and methodology and some were he questions. It was for 2 hours. Database sql queries, automation, manual test plan and strategies.", "Interview Questions": "Good got the offer after the interview "}, {"date": "9 Jan 2023", "title": "Internship Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 months. I interviewed at Portland State University in Oct 2019", "Interview Descriptions": "Phone interview, two-hour in-person interview with a panel of 20 people, and a final round interview with three leadership members in the division. this process took months from application to final offer. Grueling, and I wound up getting another job in the meantime.", "Interview Questions": "What do you know about our student population? How would you market our services to students? What do you know about the labor market? What challenges do you anticipate in the role? etc."}, {"date": "5 Sept 2019", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Portland State University", "Interview Descriptions": "A one-to-one interview with the professor. The student must have a GPA over 3.00 and maintain it over the year. Very casual and friendly environment depending on the hiring professor.", "Interview Questions": "What are the last 5 books that you've read?"}], [{"date": "22 Sept 2021", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Portland State University (Portland, OR) in Jun 2019", "Interview Descriptions": "There were three people interviewing me and they were all very nice. I instantly felt comfortable being around them. There were two interviews but the first one was easier than the second one.", "Interview Questions": "What don’t you like about the idea of working here?"}, {"date": "29 Apr 2019", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Portland State University", "Interview Descriptions": "Interviewed by panel of people I'll be working with. Very professional and organized. The interview was light hearted but also serious topics were talked about! Upon selection the panel asked me about my goals, my habits and put me in hypothetical situations and asked me to solve them.", "Interview Questions": "Goals in life and career!"}, {"date": "1 Feb 2019", "title": "Client Systems Junior Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Portland State University (Portland, OR) in Jan 2019", "Interview Descriptions": "I applied on Handshake and had an unscheduled phone screen interview. The interviewer, Michael, was nice from the start, asking if now was a good time or I needed to reschedule.\r\n\r\nAfter a week and a half of no update, I emailed back asking about the of my application. I received an email back and also an invite to do a group interview the next week.\r\n\r\nMy interviewers (Michael, Shem, Matt) were very kind throughout the whole interaction. They asked me questions about my previous work experience, technical skills, and resume. I also had a chance to ask questions.  A week later I asked for and received a status update -- that the position had been closed due to no one applying with the experience they wanted.\r\n\r\nOne thing I would recommend to future interviewers is to watch for trick questions and politely point them out when interviewers are clearly testing your knowledge by spouting misinformation. I did not know how to handle these questions all the time in a polite way, though I knew the majority of them were incorrect. Practicing beforehand may have improved my chances for landing a position with this group of people.", "Interview Questions": "What are the common ports used for HTTP and HTTPS?"}, {"date": "4 Jan 2019", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Portland State University in Nov 2018", "Interview Descriptions": "Questions about the graduate teaching assistant position and General question on student-teacher scenario. Behavioral questions. Background and project related experience. Salary expectations and term schedule related to courses at PSU", "Interview Questions": "Why you want to apply for this position?\r\nHow do you rate in your teaching skills? "}, {"date": "8 Aug 2018", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Portland State University", "Interview Descriptions": "I have two rounds of interviews, the first one was general and about personality. The second one was about accounting and the job duties. It was relaxing and outgoing interviews, I didn't have any previous university experience, I had to study some of the government accounting before I go to the interview. They went very well and I got the job after a week of the second interview", "Interview Questions": "-what is your accounting experience\r\n-how much do you care about diversity \r\n-how would you react to a mad customer (the job was involved with students) "}, {"date": "6 Mar 2019", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Portland State University (Portland, OR) in Mar 2018", "Interview Descriptions": "It was 1:1 interview, very casual and simple. They asked questions about past experience and give us a situation to see how we can handle it. At the end, they as technical questions like how long can I work and etc.", "Interview Questions": "How long can you work during summer? (They prefer full time)"}, {"date": "12 Sept 2021", "title": "Financial Aid Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Portland State University (Portland, OR) in Feb 2018", "Interview Descriptions": "First interview was Over the phone.  The second was in person and required the preparation of a 30 minute presentation based on an FSA Conference topic. It was a heavy interview process for a job that started at relatively low wages for living in PDX", "Interview Questions": "What are your current areas of expertise in financial aid "}, {"date": "13 Jan 2018", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Portland State University (Portland, OR)", "Interview Descriptions": "Go to a couple group interviews that are structured like a lecture with about 20 ppl, learning about the position and doing some team building.\r\n\r\nHave an individual interview that consisted of one Resident Assistant and one supervisor. was given a list of questions that were going to be asked.", "Interview Questions": "What is an example of a time you had to talk to a friend that was going through a difficult time. How did you respond and what was the outcome?"}, {"date": "13 Oct 2018", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Portland State University (Beaverton, OR) in Jan 2018", "Interview Descriptions": "Most impersonal interview I have ever experienced. 5 people on a screen call. Total overkill for a screen. Did not break the ice or ask one personal question to ease in. It was incredibly uncomfortable and obviously didn’t go well. I knew when it ended, this was not a place I wanted to work.", "Interview Questions": "Give an example of a proposal you wrote"}, {"date": "10 Dec 2021", "title": "Student Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Portland State University (Portland, OR) in Jan 2018", "Interview Descriptions": "I had applied for a registrar student representative position through handshake and was responded to in a reasonable amount of time. The interview entailed the basic questions, they asked about your schedule, previous experience, and flexibility.", "Interview Questions": "What is your school schedule like? "}], [{"date": "5 Aug 2017", "title": "Helpdesk Consultant II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Portland State University", "Interview Descriptions": "Only a few days after the job closed, I received an email explaining that I had been selected for a thirty-minute phone screening, and I was given at least ten times to choose from (possibly indicating how many other candidates there were).  During the phone call, the five-person hiring committee asked roughly ten technical questions, then some typical behavioral ones, and finally a brief opportunity for me to ask them some questions.  They were polite but a bit rushed.", "Interview Questions": "Describe what VPN is and how it is used."}, {"date": "14 Mar 2017", "title": "Graduate Admissions Intake Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Portland State University (Portland, OR) in Feb 2017", "Interview Descriptions": "I was contacted for a phone interview and availability, time was confirmed the next day, and the interview was two days after that. Not only did I feel very underprepared, but phone interviews are really not my forte (and altogether not a great idea, in my opinion). Perhaps the office is too busy to take time for an in-person interview, but if the three interviewers were all available for a phone interview and I live in the area, it seems an in-person interview could have been arranged. Not to mention, since it was over the phone with three different people, I had to ask several times for questions to be repeated due to a lack of clarity/reception through the phone line. The actual questions were fairly difficult for an entry level position of its caliber.", "Interview Questions": "What previous experience do you have and why are you interested in this position?"}, {"date": "27 Jan 2017", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Portland State University", "Interview Descriptions": "I was invited to an interview on campus with the hiring manager and other staff.  It ended up being a panel of two and they alternated asking questions, which they had prewritten so it was standard for all the applicants.  It was pretty straightforward and they were relatively friendly.", "Interview Questions": "What's an example of when you applied theory or research to your work?"}, {"date": "29 Sept 2020", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Portland State University (Portland, OR) in Nov 2016", "Interview Descriptions": "It went for several days, presented research, taught a guest lecture, and met with several faculty. Everyone was pleasant and it was nice learning more about the department and university,", "Interview Questions": "What is your teaching philosophy? "}, {"date": "15 Nov 2016", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Portland State University (Portland, OR) in Oct 2016", "Interview Descriptions": "Phone interview with five faculty members. Each faculty member asked at least one question. The interview lasted about an hour. However, it was difficult to keep all the voices straight.", "Interview Questions": "Why Portland State University?"}, {"date": "19 Aug 2017", "title": "Student Grounds Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Portland State University (Portland, OR) in Oct 2016", "Interview Descriptions": "There was one in-person interview. They explained to me the nature of the work and asked couple of questions related to my interest in it and past grounds-keeping related experience.", "Interview Questions": "Why are you interested in this job?"}, {"date": "18 May 2017", "title": "Lab Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Portland State University (Portland, OR) in Aug 2016", "Interview Descriptions": "They explained on the phone that it would be a group interview, but did not mention there would be five different supervisors asking questions, so that was a bit shocking and threw off my confidence in the beginning. Everyone was friendly and polite, and I took my time before answering the questions, so I was able to regain my balance, so to speak. I tried to be conversational, but it was more of a highly structured Q&A type of interview.", "Interview Questions": "Describe a time when you were faced with a difficult decision. What was your thought process in coming to the decision you made?"}, {"date": "28 Aug 2017", "title": "Student Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Portland State University (Portland, OR) in Jun 2016", "Interview Descriptions": "Phone Interview, in person interview, then meeting with executive director. Standard process and fairly easy. Interviewers asked simple and basic behavioral questions. Interview lasted about thirty minutes and they were all very kind.", "Interview Questions": "How did you handle conflict with an employee?"}, {"date": "26 May 2016", "title": "Systems Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Portland State University", "Interview Descriptions": "I had applied and a few weeks later they got back to me asking me to do a phone interview. I happily accepted and specifically asked if it was going to be a technical interview or not. The individual arranging the interview told me it was not. Once the interview started, it was in fact a technical interview; there were fix or six individuals asking me technical questions.  I was, of course, a little off kilter having expected a different sort of interview. The questions were mostly trivia questions, such \"What does CNAME stand for?\", with a few questions about how technology comparison \"What is the difference between git and svn?\". There were no critical thinking or puzzle questions. Never-the-less, I performed well enough that they invited me to the second round. At this point in time, I had a firm job offer from another company and inquired at what stage we were at in their process. It turns out that there would be four more interviews spanning over two or three months. I thanked them and politely declined.", "Interview Questions": "What does CNAME stand for?"}, {"date": "9 Nov 2017", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Portland State University (Portland, OR) in Feb 2016", "Interview Descriptions": "A lengthy process of phone interview, project, presentation, and several in-person interviews. After finally spending almost four hours interviewing, presenting, and meeting several people, I heard nothing. After waiting several weeks, I finally contacted them, twice, and was told that the person I interviewed with was no longer there and that I was not hired (which I had already guessed).", "Interview Questions": "What makes you the person we should hire?"}], [{"date": "26 May 2017", "title": "Admissions R Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Portland State University (Portland, OR) in Jan 2016", "Interview Descriptions": "It was incredibly casual, and they basically want to make sure that you are a good personality fit. They want to make sure that you will get along with the team, and that you can be a quick learner.", "Interview Questions": "What are you involved with on campus? "}, {"date": "5 Aug 2015", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Portland State University", "Interview Descriptions": "I was already temping in the role so the interview was more of a formality than anything. It was pretty standard fare in the questioning. It mirrored my initial interview which was for a temporary admin position in the same office. They explained the day to day work and tasks.", "Interview Questions": "Describe a situation in which you've effectively handled a difficult situation at work."}, {"date": "12 Dec 2017", "title": "Student Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Portland State University (Portland, OR) in Aug 2015", "Interview Descriptions": "I sat down with two amzing people and ask qustions of me. This was in the office and made you feel very welcome. This took about 45 min to get done.", "Interview Questions": "how I dealt with stress"}, {"date": "24 May 2015", "title": "Adjunct Business Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Portland State University (Portland, OR) in Feb 2015", "Interview Descriptions": "I reached out to the Accounting Department at the School of Business Administration. I was relocating to the Portland metro area and wanted to keep teaching accounting in post-secondary education.  The department chair told me she might have a course I could teach and to come by her office to meet. She emailed me the adjunct faculty application and put me in the \"bullpen\". She emailed me in April with a course that she needed to cover. I'll be teaching at Portland State this fall.", "Interview Questions": "How did I get into teaching."}, {"date": "9 Apr 2016", "title": "TA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Portland State University (Portland, OR) in Feb 2015", "Interview Descriptions": "It depends on professor. Some of them are really hard, while others are easy. The job duties are variable among professors and course. You might experience too loaded. Some professors are asking for grading homework and midterm. Some others may ask to set office hours. Some of them want you be in the class in every session.", "Interview Questions": "Years of experience"}, {"date": "27 Aug 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Portland State University (Portland, OR) in Apr 2014", "Interview Descriptions": "45 minute 2:1 between myself, hiring manager and colleague in OIT.  Informal, but detail oriented.  Questions were relevant to my then coursework in administration as my work would be project and program management related.", "Interview Questions": "What technical/development work experience do you have?"}, {"date": "10 Mar 2014", "title": "Adjunct Assistant Professor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at Portland State University", "Interview Descriptions": "Excellent", "Interview Questions": "Where do you see yourself in 10 years? "}, {"date": "2 Mar 2014", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Portland State University (Portland, OR)", "Interview Descriptions": "Speedy response time on my online application- I was contacted within two weeks of submission for an interview. The department manager was my contact through the interview process and she made everything extremely easy- scheduling interview times, providing directions to campus as well as keeping me up to date throughout the process. I went through 2 face to face interviews and was selected as the final candidate. The salary offer was lower than I expected, however my soon to be manager called me and candidly addressed my concern about the salary range. They were very transparent about the budget for the position. The only downside to the process was the turnaround time on the background checks which took about two weeks.", "Interview Questions": "Questions were pretty standard for an admin position and included describing my transferable skills, handling disgruntled clients, multi tasking, communication skills and the ability to work autonomously. "}, {"date": "5 Oct 2015", "title": "Systems Analyst II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Portland State University (Portland, OR) in Feb 2014", "Interview Descriptions": "The interview was in three stages, the first part of the interview was on the phone, the second interview was one on one, and the third interview was a panel, mainly it was behavioral, the interview was very tough, where do you see yourself in 5 years", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "29 Oct 2015", "title": "Accounting Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Portland State University (Portland, OR) in Jan 2014", "Interview Descriptions": "one accounting manager and several senior accountants interviewed me on the office. I answered total 10 questions in about half hour time period. They were super friendly, most questions are basic skill-oriented that will be useful during the work time", "Interview Questions": "strength and weakness of mine"}], [{"date": "25 Sept 2013", "title": "AV Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Portland State University (Portland, OR) in Sept 2013", "Interview Descriptions": "Mandatory to send resume and cover letter through PSU career connect. I was emailed by the manager to schedule an interview. At the interview, you sit down with 2-3 managers and they go through a set of questions. Be prepared to demonstrate technical skills. Youll have to set up some equipment. I was emailed a few days later that I got the job.", "Interview Questions": "You need to know three of your own weaknesses. And the technical skill demonstration."}, {"date": "6 Apr 2016", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Portland State University (Portland, OR) in Aug 2013", "Interview Descriptions": "A simple seven or so question interview. When I interviewed there was my supervisor, and two student coordinators in the room with me around a small round table. The questions were applicable to the job and were trying to get at my past experiences and how that applies to tutoring.", "Interview Questions": "Tell us about a time that you had a conflict with someone. What was the situation and what came from it?"}, {"date": "24 Apr 2017", "title": "Field Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Portland State University (Portland, OR) in Jul 2013", "Interview Descriptions": "Behavioral interview process.  Interviewed with the director, office admin, and project lead for the research unit I was applying to.  They asked a series of questions about different academic and job specific instances.", "Interview Questions": "Describe a time that you did not meet a work related deadline or goal"}, {"date": "16 Jul 2013", "title": "Revenue Agent I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Portland State University in Feb 2013", "Interview Descriptions": "Hiring process was simple, you will see opportunities on the HR website and apply from there. Going forward, make sure all required documents are in order and if your qualifications are above par, you will be selected for a panel interview with the supervisor and two others.", "Interview Questions": "All questions are behavioral, so prepare yourself to answer questions using the STAR technique (situation or ask, action and result)."}, {"date": "13 Jul 2017", "title": "Production Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Portland State University (Portland, OR) in Jan 2013", "Interview Descriptions": "Brief and pretty simple. It helps to know someone that currently works there. Its all student ran so its not the most professional thing you'll do in your life.", "Interview Questions": "what my availability is?"}, {"date": "22 Mar 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Portland State University (Portland, OR) in Jan 2013", "Interview Descriptions": "Mostly based on the advisor I applied to.   Sent in an application and was invited to fly in for an interview.  The interview portion itself was pretty brief - maybe an hour or so with the primary advisor - but the entire process lasted a day and a half.  I received an officer within a week of the visiting day.", "Interview Questions": "Tell me more about the research you have done? What were the findings?"}, {"date": "12 Dec 2015", "title": "Computer Lab Attendant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Portland State University (Portland, OR) in Dec 2012", "Interview Descriptions": "I sat in front of four coordinators and they rapid fired questions of my customer service experience. It lasted 10 minutes at the most. Overall, I would say that it gives the interviewers a good idea of how you can handle yourself under pressure.", "Interview Questions": "What is one issue you've had with management in the past?"}, {"date": "18 Oct 2012", "title": "Office Coordinator II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Portland State University (Portland, OR)", "Interview Descriptions": "The hiring process was drawn out. I received a call about 6 weeks after submitting my materials. A quick screening interview took place on the phone. Two weeks later, I sat before the interviewing committee (4 people from the office and 1 union representative) for about an hour. About 3 weeks after that I was contacted with a job offer. The interview itself was fine, but there is a lot of bureaucracy to deal with in getting hired.", "Interview Questions": "Nothing out of the ordinary came up. Typical questions concerning relative experience and working in a diverse office environment. \"What is your greatest weakness?\" etc..."}, {"date": "7 May 2015", "title": "Conversation Partner and Activities Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Portland State University (Portland, OR) in Sept 2012", "Interview Descriptions": "Panel interview by direct supervisor, student adviser, and current employee. Standard interview questions. Pretty informal; I was in business casual, they in jeans and t-shirts. Was pretty quick-I think only 20 minutes or so. You don't need to have a linguistic background; they're actually looking for people from a variety of backgrounds to ensure variety of perspectives.", "Interview Questions": "What is your experience with international communities?"}, {"date": "29 Oct 2016", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Portland State University (Portland, OR) in Apr 2012", "Interview Descriptions": "The process was straightforward as I had previously been a Teaching Assistant and was a known quantity. They preferred to hire previous TAs over most other part-time applicants. I did have the implicit support of the Department Chair (who was ostensibly the manager for the position) and of the Calculus Coordinator, who developed, maintained, and guided the calculus curriculum and the teaching thereof for the department.", "Interview Questions": "N/A"}], [{"date": "23 Feb 2016", "title": "Office Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Portland State University (Portland, OR) in Feb 2012", "Interview Descriptions": "Submitted my application, received an invitation about two weeks later.  I went interviewed with a panel of about five to six people.  I received an offer about a month afterwards.  This was a pretty straightforward process that didn't vary much from my previous experience.  Have examples of overcoming adversity ready, as they will probably ask you to give a couple of examples.", "Interview Questions": "They asked how interested I was with furthering my education, as the educational benefits are pretty good at PSU."}, {"date": "11 Apr 2015", "title": "Management Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Portland State University (Portland, OR) in May 2011", "Interview Descriptions": "Good process and felt comfortable with everyone.  It took a very long time to get on the campus from the time they called me to tell me they were interested in me to getting on campus for the interview.", "Interview Questions": "Why would I choose to work at PSU?"}, {"date": "5 Oct 2014", "title": "Classified Employee-Financial Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Portland State University in Apr 2011", "Interview Descriptions": "Experiences interviewing with the department I worked in was excellent, great interviewers, management and follow up, the only problems I ever encountered was with the official \"HR\" department of the university who was so out of touch with what went on at the university and in the departments as to be laughable.", "Interview Questions": "N/A"}, {"date": "5 Oct 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Portland State University (Portland, OR) in Mar 2011", "Interview Descriptions": "I was referred by another student. I thought I was going to interview for the position, but apparently had the job as soon as I walked in (I had provided a resume). I had a brief discussion with the lead professor and his team before I hit the ground running less than 15 minutes later.", "Interview Questions": "There were no formal interview questions. They just wanted to see if I was interested."}, {"date": "21 Jan 2012", "title": "Parking Enforcement Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Portland State University (Portland, OR) in Nov 2010", "Interview Descriptions": "most questions were behavioral and couple of them were related to my past experience in same field.", "Interview Questions": "Do you have any experience in cash handling and reconciling?"}, {"date": "8 Dec 2012", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Portland State University (Portland, OR) in Oct 2010", "Interview Descriptions": "Submit resume, cover letter and references\r\nPhone interview", "Interview Questions": "Describe a time you had to defend a policy you didn't support.  "}, {"date": "18 May 2011", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Portland State University (Portland, OR) in Feb 2010", "Interview Descriptions": "Tell me something about you", "Interview Questions": "Tell me something about you?"}, {"date": "9 Jun 2010", "title": "Librarian Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at Portland State University (Portland, OR) in Feb 2010", "Interview Descriptions": "The process was glacially slow as most of academia is.  I was treated well for the most part but had a very odd interview with their dean, where she complained for an hour about everyone who worked there.  I got the sense that their minds had already been made up and I was fulfilling a quota.  When I finally got the rejection letter it was for a different position which was a bit strange.", "Interview Questions": "not really a question but listening to a diatribe about current employees"}, {"date": "12 Apr 2012", "title": "AV Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Portland State University (Portland, OR) in Jan 2010", "Interview Descriptions": "I was called on campus and was interviewed there about some of the basic audio visual stuff and some behavioral questions were asked as well.", "Interview Questions": "Tell me your weakness"}, {"date": "22 Jul 2010", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Portland State University (Portland, OR) in Apr 2009", "Interview Descriptions": "Easy, common questions", "Interview Questions": "Why do you choose this position?"}], [{"date": "5 Apr 2011", "title": "Education Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Portland State University (Portland, OR) in Jan 2009", "Interview Descriptions": "Phone interview followed by panel interview.  They paid for travel to the university.", "Interview Questions": "What are three strengths."}]]