[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great nonprofit; mission-centered", "rating": "5.0", "reviewer_affiliation": "Current Contractor", "job_date": "24 Feb 2023", "job_title": "Recruitment Consultant in Richmond, CA", "duration": "N/A", "pros": "Excellent team dynamic, focused on mission and operates through core values", "cons": "growing pains and some turnover"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Intense Power Dynamics and Leadership Disconnect", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Nov 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Benefits, such as time off and employer covered healthcare are great. Everyone on the CAP side of the office below the director level is very qualified, very kind, and very passionate about the work, some of the best people I've worked with.", "cons": "There are major leadership issues at Making Waves Foundation. I witnessed racial micro and macro aggressions with no accountability. Leadership is heavy on white folks, many of whom think they are committed to DEI but not working meaningfully toward it. There are many initiatives leadership is attempting to push out, and a large emphasis on the strategic plan, but no concern for how not rehiring coaching staff when they leave is already impacting a massively burnt out programs level team. Roughly 10% of the organization has quit within the last month for reasons such as lack of promotion opportunities, inadequate pay for the level of work being done,"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "What", "rating": "2.0", "reviewer_affiliation": "Current Contractor, more than 1 year", "job_date": "8 Nov 2022", "job_title": "Enrolled Agent in Oakland, CA", "duration": "N/A", "pros": "Do not deal with office politics", "cons": "Had to make cold calls"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Toxic and Power Hungry Leadership- Specifically the College and Alumni Program", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Jun 2018", "job_title": "Anonymous Employee in Richmond, CA", "duration": "N/A", "pros": "Does important work for students who really need the support and coaches are extremely passionate and good at their jobs.", "cons": "Melissa Fries believes that she lives in an autocracy, led by herself.  Which is crazy considering how smart and talented everyone is around her that does the actual work. \r\n\r\nShe refuses to see how damaging she has been to this organization and therefore to the students that she says she loves. \r\n\r\nBecause of her insecurities, she micromanages, she instills fear of speaking your mind, and she promotes a culture of \"follow me or get out of the way.\" \r\n\r\nI personally was once told that some people are sheep and some people are wolves. Melissa is a wolf so I need to decide whether I wanted to be a sheep or I wanted to leave. THIS WAS TOLD TO ME BY MANAGEMENT. \r\n\r\nI don't care how much money gets throw at Making Waves. If they don't handle their management problem, they will continue to see a high turnover rate."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "A Dynamic Organization with High Expectations", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "31 Jul 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Making Waves is an organization constantly evolving to meet the needs of those it serves, and to respond to changing educational and non-profit sector landscapes. I worked under the supervision of Melissa Fries for eight years in various capacities. Melissa Fries was an exceptional leader and mentor who took on tough challenges by remaining consistent and focused, and keeping very high standards for herself and her staff. I had many opportunities for project management and professional development. If I had an idea, I had to justify it, plan it, and assure it was executed responsibly. Some of my best professional development experiences came via colleagues who were entrusted with sharing their expertise with the rest of us. \r\n\r\nAs I  advance my career, I look back at Making Waves as a place where I was allowed to do my best work and I was recognized and appreciated for it. That Making Waves continues to expand its services speaks to the collective efforts all of the families and staff that have been a part of it.", "cons": "Making Waves is a very much driven by a vision and mission. This means not everyone will agree at all times about how those are achieved, and what approaches are more suitable. While I was there, the organization had a (necessary) tension between developing programmatic structure and bureaucracy, particularly to ensure sustainability, and nurturing autonomy in order to let the best ideas flow. This means anyone who works there needs to be comfortable in this environment."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Opportunities for Professional Growth & Advancement", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "22 Jul 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I worked at Making Waves for over a decade under the direction of Melissa Fries, our Director.  Throughout the years, as the education landscape shifted, and its funding model came under threat, our organization transitioned from serving primary, secondary and post-secondary students to working exclusively with high school graduates helping them get through college and beyond.  \r\n\r\nDuring the transition, we were not always sure that our doors would remain open.  I watched Melissa plan and work tirelessly to maintain not only quality programming for our students, but also ensure that our workforce could move forward so that staff could remain employed.  It was her vision that led to the development of a robust College and Alumni Program that allowed for continuing to serve the Wave-Makers who had already been in the program for years, as well as be able to recruit and assist new students to help them persist through college.  I am sure that were it not for her efforts, the program would not still exist, in any form—which would be a shame considering all the students, families and staff who were helped over the years, and continue to be so.  \r\n\r\nWe were a small start-up in the beginning, which meant everyone performed multiple jobs, including the boss.  Melissa spent much time performing many of the job duties—inclusive of working directly with students—for which she would later hire staff as we grew.  This gave her direct insight and perspective into the challenges and needs of staff that made her an effective advocate for her employees within the larger organization.  She constantly researched and familiarized herself with changing trends in the field that fueled her decision-making and allowed our organization to remain relevant and sustainable in its practices.  \r\n\r\nMy career development and professional growth were encouraged under her direction.  I would describe her leadership style as confident and tough, but fair.  She had high expectations regarding quality of work, which was critical considering the under-resourced students we served.  She was always very open to suggestions to address our evolving needs as we grew, and advocated constantly for not only our students, but the employees’ needs as well.  Staff were encouraged to generate ideas that would allow our work to improve.  If we saw a more efficient way to approach a task or arrive at a needed outcome, we could submit a proposal to demonstrate the viability of the idea, and actually be allowed to implement the procedural change moving forward, for which we received the credit within the organization.  Hard work was always rewarded, and there was room for progression in responsibilities, professional growth, and job and salary advancement.  \r\n\r\nWhen I reflect on my career trajectory since then, I have developed a sincere appreciation for my time working at Making Waves.  Working under the direction of Melissa Fries allowed me to grow and create opportunities for myself that I may not have otherwise developed.", "cons": "The cons were typical of many workplaces, and nothing unique to Making Waves.  (Everybody has a boss to whom they must answer, including the boss.)"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Making Waves needs organizational structure change.", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Jun 2008", "job_title": " in Richmond, CA", "duration": "N/A", "pros": "Making Waves supports kids in a community who really need help.", "cons": "AWFUL management. The folks in charge are passionate about what they do, but the intense micro-management does a disservice to the organization. Furthermore, the main person in charge is not an educator and makes unilateral decisions based on her intuition.  Unfortunately, her intuition is not sufficient."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent organization focused on growth", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Jul 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "MakIng Waves was instrumental in my professional growth.  I worked in the College and Alumni Program for many years, working directly under ED, Melissa Fries.  She always provided excellent coaching and management, truly focused on the career path of each employee.   I owe much of the significant growth in my career to my time at Making Waves.", "cons": "Working in the Bay Area, it is challenging to be outside of the city.  The commute across the bay is quite challenging."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Tutor", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Mar 2013", "job_title": "Tutor in Richmond, CA", "duration": "N/A", "pros": "Best place to work in the world! If you are into helping kids with get a brighter future and get to college, this is the place to do it at!", "cons": "Pay is great, but of course, would like to get paid more haha. Love this place! Keep doing what you are doing !"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Sub", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "You can really make a difference in a community where it is sorely needed.", "cons": "Was not paid during holidays. I brought this up to human resources and they were not willing to change this."}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "College Preparatory Intern", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The community is a great place, and the staff is extremely friendly.", "cons": "There was not as much structure as I would have liked."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Comapny", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Aug 2020", "job_title": "Help Desk Technician in Richmond, CA", "duration": "N/A", "pros": "Amazing company, super super amazing", "cons": "No cons lebron - honestly im just filling this out because I want to see more reviews about another company. Great company."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": "N/A", "review_title": "Meaningful student-centered work", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "15 Apr 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "You are working for a noble, inspiring cause", "cons": "Beautiful campus, but the commute is long from outside the Richmond area."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Dedicated staff and leadership", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "30 Jun 2020", "job_title": "Associate", "duration": "N/A", "pros": "Staff are passionate about their mission.", "cons": "Location not accessible by public transportation"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "MWF", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Apr 2020", "job_title": "Administrator in Richmond, CA", "duration": "N/A", "pros": "Good salary for education professionals", "cons": "Staff are pushed to limit by management"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Junior Accountant", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Nov 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Pay well I don't think any else", "cons": "Lack of support from management, unprofessional working environment."}]]