[[{"date": "26 Jul 2023", "title": "Application Experience Advisor  Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Motability Operations (Bristol, England) in Jul 2023", "Interview Descriptions": "It was a two stage interview process. The first was a phone interview which was more like an informal chat. I think this is to see what your personality is like. The second stage is an assessment split into 3 steps. Step 1 was a role play as if you were accepting a call from a customer. Step 2 was answering questions by finding the answers on the website or by using their system. Step 3 was a little tour followed by a face to face interview.", "Interview Questions": "They asked thing like \"Tell me a time when you delivered exceptional customer service\" and \"How have you dealt with and resolved challenging customers\" and \"If you were to ask your friends what's one word they'd use to describe you\""}, {"date": "7 Jun 2023", "title": "Customer Relations Account Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Motability Operations (Bristol, England)", "Interview Descriptions": "There was an initial phone call interview to screen. On the interview day, there was a one on one interview with standard questions. There was a role play on the phone with an unhappy customer and there is a group activity dealing with a complaint outcome which is observed.", "Interview Questions": "How I went above and beyond for a customer."}, {"date": "25 Mar 2023", "title": "Sales Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Motability Operations", "Interview Descriptions": "Hard to get the answers that they wanted I felt like I was under a lot of pressure to come up with examples of things that I had found challengung", "Interview Questions": "How I performed in a crisis"}, {"date": "14 Mar 2023", "title": "UX Writer/Content Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Motability Operations (London, England) in Mar 2023", "Interview Descriptions": "Brilliant interaction with the recruitment agent to reach interview stage. Company moves quickly to hire. 90 minute interview to discuss a task provided in advance. 2-person panel interview. UX Manager (UXM) and Content Marketing manager (CMM). Role reports to CMM despite being a UX-specific role. Interview went pear-shaped with CMM. While explaining my work I used the term 'grandma test', widely used to refer to the user-friendliness of interfaces. CMM instantly accuses me of being ageist and sexist. UXM speaks up on my behalf, saying it is a recognised test. I knew the role was gone at this point but also defended myself and the test name. Should have stopped the interview and requested an apology because of the interviewer's ignorance. Yes, BS-W, you were ignorant. Learn and do better for future interviews.", "Interview Questions": "Explain the difference between content design and UX writing"}, {"date": "21 Feb 2023", "title": "Customer Service Expert Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Motability Operations (Bristol, England) in Feb 2023", "Interview Descriptions": "The process consisted of a phone interview, a most likely/least likely selection test, a video interview and had to attend the office where it was the final stage interview. It’s a lengthy process but worth it with the perks you get in the job. The staff are super friendly when doing the interviews, the hardest part is the video interview as you have to be on the ball with answers to give and have a specific time you have to answer them by.", "Interview Questions": "Tell me a time you have went against a normal work process and why."}, {"date": "8 Jan 2023", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 6 weeks. I interviewed at Motability Operations", "Interview Descriptions": "It was short, the question asked was answered but apparently more specific information was needed. Role play was great but they wanted me to as more questions. Nice chat before the start and relaxed and then at the end bum no.", "Interview Questions": "Hard situation you needed to deal with?"}, {"date": "4 Mar 2023", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Motability Operations in Jan 2023", "Interview Descriptions": "Was very informative. Can't really complain. Both interviewers were really nice and friendly . It was more focused on situational examples. I do hope I get it. Definitely quite intrigued.", "Interview Questions": "Role as a BA in workshops"}, {"date": "23 Feb 2023", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Motability Operations in Nov 2022", "Interview Descriptions": "First part is online, answering interview questions by video then attending an assesment evening. You attend in a group scenario in the office and it included role play and other excercises", "Interview Questions": "What does good cs look like"}, {"date": "7 Sept 2022", "title": "HR Business Partner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Motability Operations", "Interview Descriptions": "I submitted an application via the company website.  From this I was called and asked some pre interview questions around salary expectations and high level experience.\r\nI was then invited to my first interview on Zoom, which was an informal conversation with HR. The second interview was a more formal interview with the business area and the final interview was with HR", "Interview Questions": "What was your previous experience"}, {"date": "26 Oct 2022", "title": "Applications Experience Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 1+ week. I interviewed at Motability Operations in Sept 2022", "Interview Descriptions": "Application process consisted of 2 telephone assessments, if you pass this you get invited to their office for a group interview task, then a 1-1 interview with a manager and another assessment. The whole experience was pretty intense, and pressured. Did not seem like a nice environment. If I was offered the job I most likely would have declined.", "Interview Questions": "Would you sack this person in this situation"}], [{"date": "11 Oct 2022", "title": "Customer Service Agent Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Motability Operations (Bristol, England) in Aug 2022", "Interview Descriptions": "Horrific interview- actually gave me bad nerves having interviews\r\nIt was 2 role plays, one for a customer and one for a dealership.\r\nIt was so intense and wouldn’t recommend it", "Interview Questions": "Role play for customer \r\nRole play for a client"}, {"date": "3 Jun 2022", "title": "Applications Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Motability Operations (Bristol, England)", "Interview Descriptions": "3 part interview process - telephone interview, role plays email & phone then lastly if your succesful through the first 2 stages face to face assessments & interview. \n\nHighly scripted last stage interview no small talk here which immediately puts a prospective employee off wanting to work in such unfriendly closed environments.  \n\nImpression given would put any potential employee off with strict details about no holidays being allowed for first few weeks until probation is passed or your let go. \n\nPassed all tests but wasn't offered the job due to not being able to answer one question in more depth which my agency thought was absolutely silly to decline me on this one thing but im happy it was a huge relief as I personally couldn't work in a place where no one wants to have a normal friendly conversation & its all rules rules not allowed this that is the impression i got very closed no interaction.\nIf I was offered job I would have declined it in end.", "Interview Questions": "competency , managerial & behavioural questions"}, {"date": "11 May 2022", "title": "Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Motability Operations (London, England) in Apr 2022", "Interview Descriptions": "Very friendly, relaxed interviewers, down to earth questions. It was a two stage interview, last one face to face, with a excel test in between. It was a pleasant experience.", "Interview Questions": "Excel test based on pivot tables"}, {"date": "11 Jan 2022", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Motability Operations (Bristol, England) in Jan 2022", "Interview Descriptions": "A telephone interview which comprised of job details, standard interview questions and role play about a given scenario. The next stage a video interview and then an assessment centre. Three stage process.", "Interview Questions": "What is your greatest achievement?"}, {"date": "13 Dec 2020", "title": "Graduate Role Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Motability Operations", "Interview Descriptions": "Firstly, there was a Phone Interview which was super great and easy&relaxed, loved it! I heard back super quickly with a personal email.\r\nNext stage is the Assessment centre which is yet to come.", "Interview Questions": "Why this programm or why this specific role"}, {"date": "8 Nov 2020", "title": "Customer Service Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Motability Operations (Edinburgh, Scotland) in Oct 2020", "Interview Descriptions": "Phone call then video interview then face to face. \r\nThis company seems desperate for staff. They actively tell you that it is a “difficult probation period”. The staff turn over rate screams “stay away”", "Interview Questions": "Would this person pass probation?"}, {"date": "9 Sept 2020", "title": "Complaints Handler Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Motability Operations", "Interview Descriptions": "Phone interview basic , next stage is an assessment Day including a role play, group task and two to one interview. The group task was fine, two to one interview lasted about half an hour. Role play was a pretend phone call from a customer", "Interview Questions": "What challenge would you expect to overcome in the role"}, {"date": "29 Jul 2019", "title": "Customer Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Motability Operations (London, England)", "Interview Descriptions": "My card was marked as soon as I spoke with a 'coach' about noticing her park in a disabled space at the front of the building then subsequently speaking with her during the role play exercises...hmmmm\n \nSorry but if that's how you react I wouldn't want to work with you on any team including the one I'm currently managing!\n\nThe other staff were really friendly and helpful but I questioned if they were volunteers or press-ganged. \n\nThe call-centre atmosphere seemed one of passive controlling and it was unsettling to experience. I think I would be scared to leave my desk to pee!\n \nStaff there reminded me of the folk in the  fairy tale of the Kings New Clothes where everyone pretends all is ok but are too scared or intimidated to say otherwise.\nWell I was the boy who called out! \n\nIt would appear anyone with personality, your own mindset, opinion. common sense approach or who aren't afraid to challenge are unwelcome.\n\nYes, I totally agree to show sympathy and empathy with customers but let's not patronise people with falseness pet empower them to do some things themselves.    \n\nSeriously, I'm not bitter and twisted nor is this sour grapes, far from it!\nI am currently employed in a good job but I was prepared to almost HALVE my current salary to work at Motabilty Operations, particularly after having read the positive blurb on their website I was really impressed.\nPrior to assessment day I had not seen many of the reviews on this site, however having read these reviews since my interview I can clearly see where the negatives are coming from.\n\nThe coaches and senior managers need to take note of the negative reviews on here and CHANGE! However it's obvious that there's a cult like status at this place and I doubt anyone will be brave enough to actually do something to change this! \n\nHowever, I left the day feeling uneasy at what I saw with my own eyes and the impression of workers being micro-managed every minute of the day and almost scared to express any opinion.", "Interview Questions": "Nothing specific but don't dare speak up or challenge!"}, {"date": "29 Jul 2019", "title": "Customer Service Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Motability Operations (Bristol, England) in Jul 2019", "Interview Descriptions": "Phone call with scenario based question which was sent via e-mail a few moments before. \r\nGot through to the assessment centre. \r\nThere was a group of maybe 18 of us, we were greeted by all the assessors (maybe 8-10 of them).\r\nWe were taken to a room and given a quick presentation. The presentation focused heavily on Motabilty's expectations. I felt they focused on their inflexible procedures for sickness, absence, lateness, shift patterns and parking far more than needed and left me feeling quite intimidated. \r\nWe were split into 3 groups. One had a tour and test of ability to use their computer system (I think it was called Alpha), the second did 2 group exercises (1. decide on who will be the next ambassador and 2.  Decide if someone should fail or pass their probation) the third was taken to do mock calls on the phone, using their system 'Ask Mo' to answer the scenarios that were presented.  \r\nThe day was ran very smoothly and was well organised. But I felt that it was a real 'show' and reading between the lines, not one person said how nice it was to work there, that they enjoyed it or really anything at all that made me want to work there. \r\nI was told they need to recruit 40 people before Nov as they have a real problem with people failing their probation. If I am honest it felt as though the assessment day is designed to make you fail. \r\nI didn't get the position (which I was relieved about). The feedback was that I didn't ask enough questions on the mock assessment. I believe this would be an unfair reason to not give someone a job as their 'Ask Mo' system did not prompt you with which questions to ask. And certainly, with maybe half a day of practice would be something an individual could work on or improve. It is an unrealistic to expect candidates to know exactly which questions to ask with no training or prior experience. I did resolve the clients issues in all 3 scenarios. \r\n\r\nThere was a feedback form at the end, which you are asked to put your name on. \r\nI think it would be incredibly difficult for a prospective employee to write honestly about their experience on the day for fear of it interfering with their chances of getting the position.  They asked everyone if they have any questions at the end. I did not feel that I could  ask the questions I wanted to because they weren't relevant to everyone. There was no actual interview other than a couple of questions over the phone right at the beginning as part of their screening. \r\nHonestly the worst interview process I have ever been through and wouldn't wish it upon anyone else, hence why I am writing this review. \r\nI felt like I was on a conveyor belt having scripted conversations. \r\nIf you want this job, prepare, make sure you know their policies and expectations and practice mock scenarios. \r\n\r\nMy comment to management: \r\nI can understand you want to set clear expectations from the start but I would suggest keeping the details of policies such as how many minutes you can be late and how many sick days you are 'allowed' per year are conversations to be had with employees who have performance issues and not to be had with prospective employees, especially when that potential employee is the most diligent, hard working, reliable and conscientious employee you will never have the pleasure of working with.", "Interview Questions": "A lady 's son had put diesel in a petrol car. "}], [{"date": "9 Feb 2019", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Motability Operations (Bristol, England) in Feb 2019", "Interview Descriptions": "First there was a phone interview. Then I had an assessment at the main offices. There were about 15 of us altogether.\r\nWe had 3 role plays on the phone, a look around the building and last bit of the assessment, we as a team had to decide wether we thought someone should pass \r\ntheir probation. If you managed to pass the assessment you then get another phone interview.  Which I did not pass. The money is great and their are good Benifit’s, but I get the feeling you have to jump through hoops for the pleasure.  \r\nBeware if you do get the job, there is 6 weeks training, if you are not up to scratch after the first 3 weeks, you will not proceed on.", "Interview Questions": "Tell me a time when you made a decision outside of company guidelines?"}, {"date": "11 Oct 2018", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Motability Operations (Bristol, England) in Oct 2018", "Interview Descriptions": "Long - 3 hrs long! \r\nI had a first interview with the agency. There were some questions about my CV, why I want to work for the organisation and some competency based questions. \r\nSo then i was invited for an actual interview and we were 7 people.  So they showed us around and it started with  a roleplay over the phone.  I am normally very good at these  but these were the hardest roleplays i have ever done in my life. They use system called ASK MO. \r\nso first example was policy holder called to ask to add a driver and you have to use this system to advise them can you do that and what happens with no prep! I struggled to find this information so i failed all 3 roleplays and i got fustrated as i couldnt find the information i was looking for. the feedback i received after was that i am very process orrientated - well i just wanted to tell them the correct information and not blag it. \r\nafter that was a group exercise and then was competency based questions. fairly easy stuff. \r\nEveryone was very nice and the company looked like a lovely place.", "Interview Questions": "nothing too dificult, can you work in team, can you tell me a time when you?? etc "}, {"date": "23 Oct 2017", "title": "Client Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 3 months. I interviewed at Motability Operations", "Interview Descriptions": "Thanks.. For not offering me the job.  It seems I had a narrow and very great escape.  The interview process was probably the worst experience I've ever had the misfortune to have done.  It started with a telephone interview with the agency, which was fine.  \n\nThe company spent more time showing off their building than focusing on who they were employing.  A huge amount of candidates turned up all together to be shown around, then individual interviews.  Only to be invited back for more rigorous testing.  After all the effort and time consuming meetings I was given the most flimsy and feeble reason as to why I was not to be offered the job.     \n\nPeople are attracted to the better pay and office.  But don't forget you have to also work with these draconian devils. Money is not everything and thanks for the warnings that this place is not for me.  I prefer to keep my personality and individuality.  Don't waste your time on this company.", "Interview Questions": "What rating from 1-5 would you rate the advisor (having watched and listened to the adviser) on a TV clip?"}, {"date": "18 Dec 2016", "title": "Graduate Program Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Motability Operations", "Interview Descriptions": "Application form which included a few long answer questions as well as your CV. After this you are invited to a telephone interview and after this an assessment centre.\r\n\r\nAlthough my interviewer was great and the process was fairly straight forward, Motability Operations do not offer any feedback upon rejection 'due to the high volume of applicants'.. I found this disappointing as many huge organisations will not provide feedback if you don't make the telephone interview but will provide feedback if you are rejected after the telephone or group interview. I think that this is something that Motability Operations should look at as an applicant has taken the time to attend the telephone interview and undertaken a lot of research so even if it was just a few lines of feedback this would be very much appreciated.", "Interview Questions": "Why did you choose your university? Why did you choose your course? What areas are you most interested in of the graduate rotation?"}, {"date": "11 Nov 2016", "title": "Graduate Programmer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Motability Operations", "Interview Descriptions": "The interview process was quick. It was clear what would happen next and what I should expect at each stage.  \n\nDuring the process I met a lot of people from the company, helping to get a clearer idea of what it would be like to work there. \n\nThe questions were tough but it became clear it was a hardworking but friendly environment to work in.", "Interview Questions": "Tell us about a time you have had to overcome a setback."}, {"date": "20 Nov 2016", "title": "Contact Centre Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Motability Operations (London, England) in Jan 2016", "Interview Descriptions": "1. Initial telephone chat. 2. Follow-up telephone interview (structured) with interactive role play; you will receive email instructions halfway through phone call, be given a short timeframe to read and prepare, then be called again to go through it. 3. Formal interview; quite long, you'll have the face-to-face, also do more interactive role play.", "Interview Questions": "Why do you want to work for us and what do we do?"}, {"date": "11 Oct 2017", "title": "Senior Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Motability Operations (London, England) in Jan 2016", "Interview Descriptions": "first round telephonic interview\r\nSecond round personal where they ask about the previous project and then presented me a sheet of paper and asked what is the code doing etc etc etc etc etc", "Interview Questions": "Apache camel route based question and then asked to draw the previous set up of the project and general questions. Few people were asked to design the problem given to them."}, {"date": "26 Oct 2015", "title": "Contact Centre Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Motability Operations", "Interview Descriptions": "I had a first interview with the agency. There were some questions about my CV, why I want to work for the organisation and some competency based questions. Then we had a roleplay over the phone. The second interview was in the organisation and there were 4 more people. The first part was a 1-2-1 traditional interview with more competency based questions, then we had another two roleplays over the phone and a group exercise where you had to discuss a couple of topics with the rest of the group.\r\nEveryone was very nice and the company looked like a lovely place.", "Interview Questions": "How would you describe your sense of humor?"}, {"date": "26 Feb 2014", "title": "Graduate Scheme Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Motability Operations in Dec 2013", "Interview Descriptions": "During telephone interview a lot of emphasis was placed on understanding the company. The company is a non-profit company, but take much pride in describing themselves as \"the most profitable non-profit company\" in the UK.\r\n\r\nInterview questions were mostly as expected: What do you know about the company, asking about the reasons for choosing your degree/university, examples of showing leadership/initiative/etc.", "Interview Questions": "Understanding and relaying to interviewer exactly how the company operates."}]]