[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Capacity Building Associate", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "25 Oct 2019", "job_title": "Anonymous Employee in Quito", "duration": "N/A", "pros": "They are a great support for all the employes, They let you grow as a profesional and we developed some proyects so in that way we had the chance to have more knowlege in our area.", "cons": "some of the proyects are not for a long time to work."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great Company to Work for.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Jul 2017", "job_title": "Anonymous Employee in Quito", "duration": "N/A", "pros": "I have been working for SMTN some years now. Working here has been totally different than in other companies. The office environment is very comfortable and everybody here treats you in a very nice way.  Supervisors are always willing to listen to you and willing to help you, however they can. I have always felt comfortable to talk to them directly. Even though they might be really busy, they will always listen to you. Benefits that I have received here have been FANTASTIC. I can honestly say that I have not found any other companies where I received this kind of benefits. Health benefits have helped me in an enormous way and not only to me but to some of my family members. I am very thankful! I do appreciate that when things are done in a  good way, supervisors will recognize that and let you know that you have made a good job. When things go wrong they will help you to overcome any situation and will make you feel supported.", "cons": "Company might need a little more organization as in who is responsible for what. Sometimes a same task has been given to different members of the team, this can be defined in roles and responsibilities.\r\nSometimes a sensation of separation between technical team and administrative team has been felt.\r\nSometimes there has been last minute changes in different aspects. This can complicate and make more difficult to obtain the desired result.\r\nSome lack of organization for the coordination of projects execution."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Excellent opportunities for ambitious young professionals", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "12 Aug 2017", "job_title": "Program Associate in Quito", "duration": "N/A", "pros": "As a young professional, working at Sun Mountain was an excellent opportunity to get involved in important environmental and development projects. The team at Sun Mountain was welcoming and encouraging.  Since the first moment I felt that I was part of a closely-knit group of talented professionals that strove to create synergistic products.  They provided clear expectations and they gave me expanded latitude to pursue my passions. They provided all the resources so that I could maximize my potential.  They supported my initiatives investing heavily in my training and my professional development. \r\nThe work environment in Sun Mountain is innovative by nature and requires a great deal of initiative.  From weekly team meetings with banana splits at the office in Quito to exploring the beauty of the southern Andes on a mountain bike after an intense week of cutting-edge work assessing flood-mitigation strategies in Bolivia.  From feeling the uncertainty of families affected by natural disasters to designing projects that will enhance mobility and reduce air pollution in large cities.  The range of experiences and projects we worked on at Sun Mountain expanded my horizons and motivated me to dream big and pursue these dreams.  The skills I acquired in Sun Mountain have been instrumental in continuing my education in graduate school and most recent professional endeavors.", "cons": "There wasn't dedicated HR personnel ."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "A traumatic experience", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 Oct 2013", "job_title": "Young Professional in Quito", "duration": "N/A", "pros": "Most of the Young Professionals at SMTN are lovely - recent college grads, friendly, smart. It's surprising that they all ended up at SMTN, but makes sense given the economy right now. If you're a recent college grad and you can assume a \"fake it til you make it\" mentality (and not feel guilty doing work you're vastly under-qualified for), and put on blinders to everything else going on in the office, SMTN is a great fit!", "cons": "I cannot disagree with the other comments here - SMTN treats its male and female, foreign and Ecuador, employees differently. Working here was really bad for my confidence in the workplace and my sense of right and wrong. I also realized SMTN has been reporting my \"salary\" to the US Dept of Treasury without informing me (while I was, legally, on \"volunteer\" status in Ecuador and from what I understood, they were reporting my taxes there). If you speak to a former SMTN employee, there is reason that no-one can or will tell you anything good about the experience. It's shocking that USAID works with this group."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Sketchy, bad work culture, no values", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Dec 2012", "job_title": "Technical Team/Young Professional in Quito", "duration": "N/A", "pros": "-As former reviewer said, tons of responsibility to entry-level professionals with little to no experience\r\n-Nice office space, lots of windows, relatively safe area of Quito\r\n-Good vacation allocation for technical team (\"young professionals program\")\r\n-Great colleagues; intelligent, driven group", "cons": "-Reprehensible management practices. No mentorship, employees (\"YPPs\") are charged with responsibilities and tasks beyond the scope of their experience, no support from solitary senior staff member (employer)\r\n-Huge salary and benefit differential between male and female employees of same position with same experience level and time at Sun Mountain International. Blatant sexist remarks from senior employer, males given responsibilities and tasks considered \"beyond the ability\" of female employees with equivalent experience level. 2011 Christmas bonus came in form of pots and pans for female employees, collared shirts for male employees.\r\n-No financial transparency. Confusing tax and payment structure. Three different company entities, two in Ecuador and one in US. Company markets itself as NGO though is a for-profit company. Pay checks come late, checks bounce. Salary levels of co-directors unclear. Recent purchase of Quito real-estate with company funds. Checks in the tens of thousands made out to unknown recipients."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": 5, "review_title": "Great Working Experience and Very Professional Work", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Jun 2019", "job_title": "Research Assistant in Quito", "duration": "N/A", "pros": "With great pleasure I'm writing this review, today . Working at Sun Mountain International, under Scott's leadership, was a very professional and enlightening  experience . Professional because every team member did very high quality research thanks to well organize and high quality research methods that the company provided us.  Also it was an enlightening experience because we had the chance to see our research be applied in real life situation and make us realize how useful our work was. All of these was only possible under the leadership of Scott Solberg that was the glue that made everyone worked at its best and made the working environment very pleasant and interesting .  Overall great experience and looking forward to do it again.", "cons": "Prepare for long working days and intense deadlines."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company to work for in Ecuador", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "10 May 2019", "job_title": "IT Web Manager in Quito", "duration": "N/A", "pros": "Sun Mountain is a fantastic company to work for. The staff is very welcoming and professional. I worked as an IT and web manager, but I also had the opportunity to support other IT related initiatives travelling around Ecuador, Honduras, Ghana and Liberia. Scott the managing director is approachable and eager to take ideas and make them happen. His work ethic is par to non.", "cons": "Sometimes long flights around the world. Workshops abroad are demanding and could take 12 hour work days, but overall is a rewarding experience."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great Career Opportunity and Intro to the Development Sector", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Aug 2017", "job_title": "Project Manager in Quito", "duration": "N/A", "pros": "The growth opportunities for early career professionals at SMTN are very uncommon in larger organizations, offering significant responsibility relatively quickly. Many staff have gone on to work in leading international development organizations.\r\n\r\nSpecifically, for those interested in sustainable development SMTN offers great opportunities for motivated professionals to work at the intersection of environment and development on projects with international NGOs and donors. \r\n\r\nSun Mountain actively seeks to create opportunities for early career professionals to be part of the team, and to actively participate in projects, including engaging with clients and traveling to the field. \r\n\r\nFurthermore, there is a wide array of projects and SMTN management seeks opportunities for staff to work on a diverse set of projects, providing excellent professional growth opportunities. SMTN also directly implements projects, offering staff the opportunity to work both as consultants and on implementation, providing a unique perspective. Young staff work closely with senior consultants, offering tremendous opportunities to take on significantly more responsibility for those who take initiative and demonstrate strong performance.\r\n\r\nSMTN is by no means perfect-few fast growing, small organizations can avoid growing pains-but I learned and grew a ton, and gained experience that few of my peers have achieved.", "cons": "As SMTN is a relatively small consulting office, project loads are not always constant, leading to periods where staff can be overstretched by overlapping projects (although vacation benefits help to compensate). \r\n\r\nFor a number of years, the in-house staff was skewed towards young professionals; more senior staff sometimes struggled to provide sufficient support when teams were stretched (although the organization was improving this balance at the time I left). While senior short-term consultants were often engaged when additional support was needed, they often were not as effective as mentors for more junior staff. \r\n\r\nThe open office environment was better suited to more extroverted personalities and those who took initiative. However, by the time I left, the organization had implemented more formal professional development processes, to ensure that staffing decisions were made based on our individual interests. \r\n\r\nWhen SMTN provides technical assistance to partner organizations, as is true in consulting across industries, partners may not always adopt all recommendations. While this occurs in all industries, this can be demotivating for staff who join SMTN without an appreciation for the challenges involved in implementing recommendations. Colleagues who did well were those who took initiative, recognized that development work is not easy and can involve difficult tradeoffs, understood the art of promoting behavior change, and enjoyed supporting partners to solve problems and develop appropriate solutions."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A great experience for on-the-ground development", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "21 May 2019", "job_title": "Project Manager in Quito", "duration": "N/A", "pros": "Sun Mountain gave me the opportunity to get my hands and boots dirty doing true development. Leadership believed in me and put me in charge of sustainable agriculture project. I was able to thrive and learned a ton with the director's guidance and support. Great relationships with local partners.", "cons": "There was a fair bit of winging it sometimes because it's a small organization. But that is the very quality that fosters creativity, which makes it a great place for someone with initiative and drive."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "A family company with great opportunities", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Jul 2019", "job_title": "Socio-Economic Specialist in Quito", "duration": "N/A", "pros": "Good opportunity for young people with a lot of travel and different assignment. over a bit more than 2 years I went to Congo, Mali, Senegal, Honduras and Ethiopia. Assignments were diversified, mostly around environment management, and there was always people in the field there to support you", "cons": "It is quite  an horizontal company, working with a lot of consultants. Very flexible but not too many opportunities to progress in the hierarchy"}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Good for entry-level employees without experience, bad due to abusive employee practices", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "1 Oct 2012", "job_title": "SMTN Young Professionals Program in Quito", "duration": "N/A", "pros": "Hire employees with little or no experience, often recent college grads\r\nGood opportunity for travel and gaining experience\r\nHeadquarted in beautiful city", "cons": "Abusive and occassional sexist treatment of employees\r\nNo budget transparency, mismanagement of finances, \"cash flow\" problems\r\nSalaries often paid late, health care costs often refused\r\nEmployees assigned to tasks far beyond their breadth of experience\r\nMicro-management of employees, usually female employees"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Not worth it.", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Oct 2014", "job_title": "Environmental Consultant in Quito", "duration": "N/A", "pros": "The city is nice and has opp. to meet new nice people. When you go on work trips you have the opp. to work with interesting people and see great places.", "cons": "bad management, bad work environment, bad pay, lack of structure, lack of training, lack of supervision, lack of freedom, not able to work in a peaceful manner"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "An organization committed to the environment with a good work environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Jul 2019", "job_title": "Staff Accountant in Quito", "duration": "N/A", "pros": "an organization that commits and completes\r\ngood order and planning", "cons": "work can be demanding at times"}]]