[[{"date": "28 May 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Action Against Hunger (New Delhi)", "Interview Descriptions": "Slow but efficiently managed, I liked the way the interview went... They were really nice with me, I recommend them to others... I liked the Teams interview and the team in Delhi", "Interview Questions": "Do you have experience in nutrition?"}, {"date": "25 May 2023", "title": "Agronomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Action Against Hunger (Kiryandongo, Masindi)", "Interview Descriptions": "ACF like STAR interview approach, the written test was on technical competence and oral interview was on team and conflict management. They asked many questions related to dealing with refugees. How would you improve food security and nutrition in the refugees settings", "Interview Questions": "A situation you were confused on how to make decision at your work place. Describes the situation and what did you do"}, {"date": "8 Dec 2022", "title": "MEL Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Action Against Hunger (London, England) in Nov 2022", "Interview Descriptions": "I submitted my CV and Cover letter after which I was invited for Only one stage interview where the final decision was made. Though I didn’t get the job, I had an excellent experience", "Interview Questions": "Motivation for applying for the role"}, {"date": "9 Oct 2022", "title": "Grants and Reporting Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Action Against Hunger", "Interview Descriptions": "I had a HR interview then technical interview a week or two apart both done on skype calls from paris and in the field location about one hour for each interview", "Interview Questions": "N/A"}, {"date": "17 Jul 2022", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Action Against Hunger", "Interview Descriptions": "They made me go through five interviews, got me really excited and then ghosted me. I applied for one position, then HR referred me to another one where I had three interviews . After not hearing from them for a while I had to reach out again and then HR referred me to the original position where I took out valuable time to go through two more interviews.", "Interview Questions": "Show us a time you a time you had to exhibit leadership"}, {"date": "15 Jun 2022", "title": "Senior Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Action Against Hunger in Jun 2022", "Interview Descriptions": "HR screening interview\r\nthen the director interview for 50mins. \r\nafter that they asked for a panel interview where you should submit 3 pages, answering 3 questions about the post. \r\nthe panel discussion was smooth. \r\nstill didn't hear back from them, it's been a week.", "Interview Questions": "they asked multiple times if I had experience dealing with donor like USAID"}, {"date": "28 Mar 2022", "title": "Learning Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Action Against Hunger (London, England) in Mar 2022", "Interview Descriptions": "1 hour in person interview to discuss skills, experience and content expertise. Interview was with one senior employee on the MEAL team and a colleague the new hire would work with.  24 hours prior to interview, I had to submit a task related to key learning outcomes and demonstrate my ability to complete tasks related to the position's day to day responsibilities. The hiring team took a while to update me regarding their decision but did eventually give me feedback.", "Interview Questions": "How would your colleagues describe you?"}, {"date": "29 Jun 2022", "title": "Senior Technical Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Action Against Hunger (Washington, DC) in Oct 2021", "Interview Descriptions": "I participated in five interviews, including prescreening, a presentation, a written statement of interest, and speaking with the CEO, but I didn't get the job. It was a huge waste of time. Though it was a highly technical job, and I was qualified, I got a call from HR saying she didn't know why I didn't get the job but THOUGHT it was because I didn't have \"proposal writing experience,\" which is not true. Though I have never led an end-to-end proposal writing process, I have significantly contributed to technical content and advised on several winning proposals. Extremely unprofessional that no one from the team reached out to me to provide a more concise explanation of why my qualifications were insufficient. Nine months later, I see that they are advertising for the same job.", "Interview Questions": "In your opinion, what is the most promising FSL intervention or approach that progresses actions to end hunger?  \n\nWhat evidence leads you to and supports your opinion? \n\nWhat steps would you promote to take this intervention to scale?   \n\n"}, {"date": "19 Jul 2021", "title": "Volunteer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Action Against Hunger", "Interview Descriptions": "The interview lasted approximately 30 minutes, started with technical questions on the internship/volunteer specific topic to test my knowledge and experience, followed by character questions (e.g. overcome difficulties, partnership) and ended with my questions for them.", "Interview Questions": "Which of the tasks outlined in the job offer do you feel more confident with and which one less?"}, {"date": "29 Apr 2021", "title": "Grants Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Action Against Hunger", "Interview Descriptions": "There were 2 interviews - the first was with human resources in headquarters and the second was with the hiring manager in country. All were done remotely via Skype calls and were about one hour in length. The HR interview is basic questions to determine your eligibility and the second interview is to assess your technical skills and fit for the country office.", "Interview Questions": "What has been your favourite and least favourite donor to work with any why; Explain your understanding of the Do No Harm principle; How does our work relate to the humanitarian context and contribute to the development nexus; What do you do if you see inconsistencies in reporting and overspending; What makes a good manager/ how do you manage people; What are you looking for from the people you will be working with and interacting with \r\n\r\n\r\n\r\n\r\n"}], [{"date": "15 Jul 2021", "title": "Surveillance Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Action Against Hunger (LakshmÄ«pur, Chittagong) in Jan 2021", "Interview Descriptions": "1. Program Part/Technical side to know my sound knowledge\n2. Project Management either I am capable or not\n3. HR , finance and logistic Part for immediate action during implementation\n4. Communication and ICT for my immediate response", "Interview Questions": "Research, Surveillance, Management, Implementation, Budget, Basic Information, Experiences"}, {"date": "14 Oct 2020", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Action Against Hunger", "Interview Descriptions": "I did a Technical Test where they asked about technical questions about project management.\nI did an Interview on skype with senior managers , I did a final Interview with hiring manager and other technical officers.\nOverall the interview process took 3 months,", "Interview Questions": "Tell us about your self"}, {"date": "3 Oct 2020", "title": "MERL Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Action Against Hunger", "Interview Descriptions": "I went through four stages during the recruitment process, the first stage is the interview through Skype with a responsible person from the human resources, the second stage is the technical examination, the third stage is the interview with the direct supervisor in the presence of a responsable person from the human resources, the fourth stage is the final interview.", "Interview Questions": "technical questions about the position"}, {"date": "19 Dec 2019", "title": "Grants Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Action Against Hunger", "Interview Descriptions": "Test, Interview and Reference Check. The interview is competency based where they ask the questions around the competencies. It is good to prepare good examples of your work if you want to be successful. Test is mostly technical where the questions will be specific to the technical domain.", "Interview Questions": "Competency Based Interviews"}, {"date": "17 Dec 2019", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Action Against Hunger", "Interview Descriptions": "I applied online. The process took 3+ weeks. I interviewed over the phone for a position in Peru. Well structured process overall, always thinking about the future and potential opportunities for candidates", "Interview Questions": "what are your thoughts on the current water issues face worldwide"}, {"date": "8 Aug 2019", "title": "Finance Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Action Against Hunger", "Interview Descriptions": "Online application and invitation. Wrote a test and was not invited for an oral interview. Received a regret letter email after 3 months. I got information people were invited for oral interview.", "Interview Questions": "tell us about yourself"}, {"date": "1 Aug 2019", "title": "Dcd Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Action Against Hunger", "Interview Descriptions": "It was quicker than what I was expecting, the online system is very easy to use for application. However, for employee's who wants to apply within the organization requires vetting from their supervisors which sometimes is difficult henceforth leading to loss of very good staff to other agencies", "Interview Questions": "what interest me in this role and why I think I am the best fit for the role"}, {"date": "6 Jul 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Action Against Hunger", "Interview Descriptions": "A short conversation with the supervisor. It was only a few minutes, since it was an internship and I knew the supervisor already. It was smooth. I enjoyed it. The people seem really chill there.", "Interview Questions": "What can you contribute to the team here?"}, {"date": "26 Jun 2019", "title": "Supply Chain Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Action Against Hunger", "Interview Descriptions": "The hiring process is HR coordination review and prepare long listing and then to  present the logistics to short listing and then next stage with the written test and interview with Pannel", "Interview Questions": "N/A"}, {"date": "26 Jun 2019", "title": "Administrative Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Action Against Hunger (Nairobi) in May 2019", "Interview Descriptions": "It was a two stage interview,A written interview and a competency based oral interview.The written interview determined the second interview(oral).It took 4 weeks from invitation of interview to job placement.Before the oral interview a guide was sent to me on what to expect from the inte rview and also what the organisation expects from me.", "Interview Questions": "What have you been doing since end of your last contract?"}], [{"date": "26 Jun 2019", "title": "Wash Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Action Against Hunger (Alek, Upper Nile) in Apr 2019", "Interview Descriptions": "To begin with, I was eagerly demanding to get a job with any organization for about 1 years after ending of my contract with previous employer  , fortunately a  friend of mine inform about the advertisement being published by Action Against Hunger -Alek Field Base in Gogrial West, I   developed interest and apply for the post, lucky enough I was shortlisted and invited to attend a schedule written and oral interview in the same month of advertisement, after the interview, I was the bless candidate for the post and the management call me to the office and I was given one day on job orientation before I signed my 6 months contract, which I enjoy up to date. Working for Action Against Hunger is a blessing.", "Interview Questions": "They asked technical question, like, what motivated to apply for this job or to wok with Action Against Hunger?"}, {"date": "18 Apr 2023", "title": "Program Support Systems Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Action Against Hunger (Maidugu, Borno) in Apr 2019", "Interview Descriptions": "I applied for and interviewed for this role twice in the space of three to four months and was rejected. The most annoying part was that no feedback whatsoever was provided.", "Interview Questions": "The questions asked were mostly around setting up MEL Systems for a WASH program."}, {"date": "30 Dec 2022", "title": "General Education Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Action Against Hunger (Lagos) in Dec 2018", "Interview Descriptions": "it was easy and straightforward and the interviewers were so friendly and nice. they also told me I could skip any question I wasn't ready to answer and answer later when ready. I was able to answer all the questions correctly", "Interview Questions": "why should we hire you"}, {"date": "30 Dec 2022", "title": "General Education Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Action Against Hunger (Lagos) in Dec 2018", "Interview Descriptions": "it was easy and straightforward and the interviewers were so friendly and nice. they also told me I could skip any question I wasn't ready to answer and answer later when ready. I was able to answer all the questions correctly", "Interview Questions": "why should we hire you"}, {"date": "4 Jun 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Action Against Hunger (New York, NY) in Apr 2018", "Interview Descriptions": "There were overall 3 interviews. One first phone conversation with the HR Director, a second interview with the HR Director and one Senior Manager, and finally a third interview with the CEO. A job offer was sent after the third interview, approximately a week after. The entire process took about a month, from first phone interview until the job offer acceptance. Communication was via e-mail mostly. The HR staff was very friendly and responsive. Personally, I thought the most helpful resource for preparing for these interviews was a pdf called \"Interview Preparation Guide\", which can be found on their website in the Careers->Recruitment Process->Interview Preparation Guide section. The document contains common questions and answers as well as general skills they look for, you only need to personalize your answers according to your experience and making sure it matches what they have outlined in the job description.", "Interview Questions": "Tell us about a situation where you used your problem solving skills to resolve an issue?\r\nWhat action did you take? What was the result?"}, {"date": "18 Jul 2021", "title": "Nutrition Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Action Against Hunger (New York, NY) in Apr 2018", "Interview Descriptions": "Several stages including written test (online), panel interview and lastly placement discussion. There was about 2 weeks wait between the different stages. Questions are not very difficult if you have the relevant qualification and experience.", "Interview Questions": "What is your added value to this position?"}, {"date": "18 Mar 2018", "title": "HR Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Action Against Hunger (Baghdad) in Mar 2018", "Interview Descriptions": "The recruitment process took two steps first I had a test composed of essay questions and Excel proficiency test. Then I had a competency-based interview, asking common situational and behavioral questions", "Interview Questions": "Tell me about a time when you handled a difficult situation?"}, {"date": "24 Feb 2022", "title": "Deputy Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Action Against Hunger (Galveston, TX) in Mar 2018", "Interview Descriptions": "The interview process was conducted by phone and video chats.  The initial interview with HR was to determine initial qualifications necessary for the position.  This was followed up by several in depth interviews with hiring manager to determine skill sets, aptitude, and knowledge as well as people skills.", "Interview Questions": "What is your experience working in an overseas position>"}, {"date": "20 Dec 2017", "title": "Finance Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Action Against Hunger (Nairobi) in Dec 2017", "Interview Descriptions": "The process was clear and straightforward. The written test was sent via email in good time. The questions consisted of excel and essay-based questions. It was a timed interview for two hours only.", "Interview Questions": "How to go about performing reconciliations"}, {"date": "11 Jul 2017", "title": "Training Support Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Action Against Hunger (Nairobi) in Jul 2017", "Interview Descriptions": "It was a sit in interview with 3 panelists.There were 2 sections i.e testing qualification and behavioral .Overall i had a wonderful experience as the panelists were very patient with me as i answered my questions,they didn't mind repeating the questions to me when i asked them to do so.", "Interview Questions": "Name some of the documents in procurement."}], [{"date": "22 Jun 2017", "title": "Nutrition Expert Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Action Against Hunger (New York, NY) in Apr 2017", "Interview Descriptions": "The interview process involved appropriate questions for the post, a very smooth discussion and respect of ideas, views. Very professional communication.Prior to the actual interview questiosn, I was briefed about the post and the expected deliverables.", "Interview Questions": "My background information with focus to what was expected for the post I applied for.\r\nAn understanding of my previous experience in program development of multi-sectoral nature \r\nAssessment of my understanding of innovative approaches to tackle undernutrition \r\nWhat opportunities exist to efficiently meet expectations from the post?\r\nWhether I’m comfortable to liaise with other departments than my technical expertise such as WaSH, Food Security and Livelihood\r\n\r\n"}, {"date": "22 Jun 2017", "title": "Field Manager, FSL, WASH, RRM Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Action Against Hunger (Maiduguri, Borno) in Mar 2017", "Interview Descriptions": "After applying, i got the response that  my application was being processed. After a  i was contacted that i was selected for any interview and was given a date. I asked  the date to be pushed as i was in some remote parts of my country. I was asked to prepare for the interview.  The panel was made up of staff from Nigeria, Kenya and USA.  They alternated in asking questions.", "Interview Questions": "What is your experience working  in volatile places/ far away from you family?"}, {"date": "23 Apr 2018", "title": "Associate - External Relations Department Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Action Against Hunger (New York, NY) in Feb 2017", "Interview Descriptions": "The interview consisted of a one-on-one interview with the position's full-time supervisor, followed by a group interview with a couple other key members of the team. The interview was straightforward, although they did re-schedule my second interview at the last minute, which caused a few headaches. I thought the questions were fair and relevant to the work I am now doing.", "Interview Questions": "They asked for specific experiences with fundraising."}, {"date": "8 Sept 2017", "title": "Field Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Action Against Hunger (Kathmandu) in Jan 2017", "Interview Descriptions": "If your CV is short listed then AAH would take technical test and if you pass this test then panel of expertise would do a  Competency based interview to evaluate you, following that if you are selected they would inform you to check your interest in the offer", "Interview Questions": "why do you want to apply for this position"}, {"date": "4 Feb 2019", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Action Against Hunger (Abuja, Federal Capital Territory) in Jan 2017", "Interview Descriptions": "It was fair. The interviewers were quite nice and wanted the best for me. There were two people in the panel. They took turns to ask competency based questions from my CV. They needed specific answers backed up with previous experience.", "Interview Questions": "1. Have you worked in this role before.\r\n2. Do you have prior client facing experience."}, {"date": "25 Apr 2017", "title": "Logistics Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Action Against Hunger (Nairobi) in Jan 2017", "Interview Descriptions": "The interview was very transparent and fast. The job was advertised on line, submitted application and selection was done. First took written technical question, and best candidates were selected for oral interview. I was selected as the best candidate, and went through placement discussion.", "Interview Questions": "When in the mission Logistics Coordinator, what will be the first thing you will look at when you arrived."}, {"date": "19 Jul 2017", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Action Against Hunger (Nairobi) in Sept 2016", "Interview Descriptions": "This is highly professional. Good contact made during interview process and good level of curiosity in the added value that I could make to the organization when onboarded. The interviewing staff have a very good comprehensive knowledge of my CV and background and solicit to hear what else I can come with to make the organization move forward.", "Interview Questions": "How can you help us dialogue and engage our security system with communities affected by armed conflict and other situations of violence... and how can we internally build a system of security that works ?"}, {"date": "19 Jul 2017", "title": "Logistics Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Action Against Hunger (Khairpur, Sind) in Jul 2016", "Interview Descriptions": "Online Apply, Shortlisted for Written Test , Given detail written test and Call received by HR then Interview Call and after that call and email received for offer .", "Interview Questions": "All Questions are related to applied post  & Previous Experience by Interview panel , And asked about low salary Job ? "}], [{"date": "22 Jan 2019", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Action Against Hunger (Nairobi) in Feb 2016", "Interview Descriptions": "Very calm process  in front of a panel of four people for the oral part. there was also a written interview. The panel was very nice and helped with clearing the atmosphere and making  the environment ease off.", "Interview Questions": "Why work with us"}, {"date": "22 Nov 2015", "title": "New Business Manager - Corporate Partnerships Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Action Against Hunger (London, England) in Nov 2015", "Interview Descriptions": "The interview process seemed fair.\nThere is a short online form to which applicants can attach their cv and statement. \nThis is a good point because applicants are not required to fill out all the information already included in the cv.", "Interview Questions": "In 30 minutes, I had to prepare a 10 minute pitch for a new partner they had in mind (I got a Spanish restaurant chain in the UK). Including the he fundraising mechanism I would suggest to implement. \nI had an Internet connection to gather the needed information."}, {"date": "28 Oct 2017", "title": "Human Resources Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Action Against Hunger (Erbil) in Apr 2015", "Interview Descriptions": "It includes two parts, one HR questions which is asked by HR employer. it includes questions about your personal life and the way you behave in different situations. the other part is the department questions which is been asked by the department manager. this part is mostly asking you specific questions about the field you applied for.", "Interview Questions": "what is your weakness point?\r\n"}, {"date": "6 Mar 2015", "title": "External Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Action Against Hunger", "Interview Descriptions": "Put in touch with the External Relations team through a contact. Interviewed with the head of the department and the assistant I would be reporting to. Process was very straight-forward. Contacted by email a couple of days later and offered the internship.", "Interview Questions": "What experience do you have in event planning?"}, {"date": "8 Feb 2018", "title": "Events Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Action Against Hunger (London, England) in Mar 2015", "Interview Descriptions": "Questions about myself, followed by more specific questions regarding the skills mentioned in my Cover Letter. Skills included: communication skills,  management skills, teamwork skills, organisation skills. These questions were then followed by another general questions regarding  Action Against Hunger as a whole. They asked about my interest in working with an NGO.", "Interview Questions": "Tell us about a time you managed to deal with a very difficult situation."}, {"date": "20 Jan 2015", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Action Against Hunger", "Interview Descriptions": "Good interview process, took about an hour, asked good questions, met with two people, Human Resources--on time and very nice, good interview experience--was laid back, more of a conversation, but did throw a few tough questions", "Interview Questions": "The difference between efficiency and efficacy in terms of cost savings"}, {"date": "24 Jul 2014", "title": "Field Support Staff Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Action Against Hunger", "Interview Descriptions": "It was a long interview process. I basically had to meet with the entire HQ. It was a bit intimidating and challenging. The hiring process was a bit unorganized. Things were never clear and most information was vague. Not wanting to get into details.", "Interview Questions": "N/A"}, {"date": "7 Jun 2017", "title": "Payroll Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Action Against Hunger (New York, NY) in Jul 2014", "Interview Descriptions": "The process at the time was very easy and informal. Which took the pressure of interviewing. I felt like I was talking to a colleague at all time. Met with HR, then the director of the finance department. And received and offer shortly after.", "Interview Questions": "Mention a situation where you had to convey a message about a change in benefit and how did you relate the message?"}, {"date": "27 May 2013", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Action Against Hunger (New York, NY) in May 2012", "Interview Descriptions": "good interview process but a little bit long, it took 3 months ( sceening, mail contact, phone contcat, writing test, phone call and oral interview by phone )", "Interview Questions": "Technical Questions were not difficult"}]]