[[{"date": "20 Jul 2023", "title": "Digital Marketing Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Ottawa in Jun 2023", "Interview Descriptions": "Quick and clear, questions asked both in English and in French. Interview lasted 40 minutes and it was a nice exchange overall. There were 3 people interviewing including and HR rep.", "Interview Questions": "Are you okay being flexible, working in the weekends?"}, {"date": "5 Jun 2023", "title": "Laboratory Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Ottawa (Ottawa, ON) in May 2023", "Interview Descriptions": "The recruiter reached out to me several weeks after I applied for the position. I wasn't available when he called, so I tried to call back. I tried several times, but the phone rang out each time. At some point, I started to think it was a scam. Then I reached out via email. He called back the next day and conducted a phone screening. I was in a public place when his call came in. The place was quite noisy, but knowing how difficult it would be to reconnect with him if I rescheduled, I went on with it. It's been several weeks now and not a word on the status of the application. Given the shoddy communication, I wasn't expecting much from the process", "Interview Questions": "Do you speak French? Why would you like to work with the University of Ottawa?"}, {"date": "29 Mar 2023", "title": "Full Stack Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Ottawa", "Interview Descriptions": "Test to finish within a week before the interview, interview was a bit technical and then behavioral. Asked couple of questions that were not hard and had to present the work I had to do", "Interview Questions": "What is a json file"}, {"date": "21 Nov 2022", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Ottawa", "Interview Descriptions": "Met with the group's supervisor for a chat where we discussed my short- and long-term goals, and why I wanted to pursue a graduate degree. Had to also provide evidence that I could work in a research/lab environment.", "Interview Questions": "Why do you want to pursue a graduate degree, when you have/can easy get a good job using your undergraduate degree?"}, {"date": "15 Nov 2022", "title": "Resident Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Ottawa", "Interview Descriptions": "Fun, easy going. I was in a virtual room with one physician and one resident. It was 20-30 minutes long and everyone was nice and supportive. I had a really easy time talking to them.", "Interview Questions": "Non disclosure so can't answer"}, {"date": "5 Oct 2022", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at University of Ottawa (Ottawa, ON)", "Interview Descriptions": "Online interview with dean assistant, pretty straight forward process like asking about previous experience, but they do mostly employ students who knows French, and I was failed because I have no knowledge of French even if I met every other condition.", "Interview Questions": "Do you speak any French?"}, {"date": "13 Nov 2022", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at University of Ottawa (Ottawa, ON) in Sept 2022", "Interview Descriptions": "Interview was very short, interviewer did not seem prepared. It was clear they had not read my resume or application. They insisted on doing the interview in French, even though I told them I didn't speak French.", "Interview Questions": "What are your French language skills?"}, {"date": "13 Jun 2023", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Ottawa (Ottawa, ON) in Sept 2022", "Interview Descriptions": "Thorough, lots of questions. Make sure to give good examples, and make sure to follow the STAR method to answer topics, view it as a government-style interview. Make sure you say their expectation when giving answers, so they can be sure to know you know what the job will entail.", "Interview Questions": "how past experiences can aid in current job expectations"}, {"date": "2 Nov 2022", "title": "Academic Operations Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Ottawa (Ottawa, ON) in Aug 2022", "Interview Descriptions": "I had one interview and had to pass the second language test required for the position. It took up to a month or two for the process. But it is good.", "Interview Questions": "What are the principles that you know that are important for this position?"}, {"date": "19 Jul 2022", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Ottawa", "Interview Descriptions": "I was interviewed by my thesis supervisor to become a graduate student via Skype when Skype was still a thing.  It was a fast and easy process.  He asked me questions.", "Interview Questions": "What is your experience and interests"}], [{"date": "14 Jul 2022", "title": "Programmer Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Ottawa", "Interview Descriptions": "Straightforward, got a response from them quickly. During the interview asked about me and my experience. Explained the position throughly as well. Had time at the end to ask any questions I have, interviews were friendly. Entire interview lasted around 30 minutes.", "Interview Questions": "Asked about a project of mine"}, {"date": "16 Jun 2022", "title": "Graphic Designer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Ottawa", "Interview Descriptions": "It was not a great experience in my opinion, the people weren't very friendly and they surprised me with answering questions in French and English - I didn't appreciate having no warning on that", "Interview Questions": "Experience, technical questions, questions in French & English"}, {"date": "19 Jul 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of Ottawa in Apr 2022", "Interview Descriptions": "a quick interview with HR and a second one with management team. Both were very professional and they had prepared questions. However, I never got any response back for 5 months now! although they promised me that I would get an answer in about a week!", "Interview Questions": "How to deal with a difficult client – example dealing with a difficult client"}, {"date": "6 Mar 2022", "title": "Mechanical Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Ottawa", "Interview Descriptions": "Super friendly staff, amazing energy, close knit environment. There was a technical test at the end. A mix of technical and interpersonal questions. If you don't know a question they will kindly try to guide you on the right path. I really enjoyed my interview but due to personal circumstance I had to decline the offer. Great opportunity", "Interview Questions": "Technical experience regarding working with consultants"}, {"date": "19 Dec 2022", "title": "Graduate Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at University of Ottawa (Vancouver, BC) in Jan 2022", "Interview Descriptions": "it was really professional and organized. the HR is really nice and explained every process in detail. it just has lots of stages and makes the hiring process overwhelming. I hope to get the offer soon and get hire in this well known company", "Interview Questions": "why do you want to work here"}, {"date": "16 Sept 2021", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Ottawa", "Interview Descriptions": "Very fast and easy questions. They mostly ask about your schedule, and they tell you about the responsibilities that you will have. If you get interviewed, you most likely got the job.", "Interview Questions": "Will you be working full time during the semester. "}, {"date": "5 Oct 2021", "title": "Student Recruitment Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Ottawa (Ottawa, ON) in Sept 2021", "Interview Descriptions": "The interviewer was very kind and friendly and put me at ease during the whole process. He started out by asking me about my hobbies and how my background makes me a good fit for the company.", "Interview Questions": "How would I deal with a stressful situation and what makes me a good fit?"}, {"date": "1 Sept 2021", "title": "Community Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at University of Ottawa", "Interview Descriptions": "A long but effective interview. Lots of elements, however, it is appropriate as the job demands that you wear a lot of hats. From individual questions to group scenarios, the interview process is unique.", "Interview Questions": "Questions are in French and English"}, {"date": "30 Aug 2021", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Ottawa", "Interview Descriptions": "A lot of general security items, A lot of general security items, A lot of general security items, A lot of general security items, A lot of general security itemsl, A lot of general security itemsA lot of general security items", "Interview Questions": "A lot of general security items"}, {"date": "20 Aug 2021", "title": "Communications Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Ottawa", "Interview Descriptions": "The interview was professional, respectful, friendly, and efficient. There was a mix of English and French questions, with the requirement to answer each question in the language it was asked in.", "Interview Questions": "Describe your editing and proofreading process."}], [{"date": "13 May 2021", "title": "Teacher Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Ottawa", "Interview Descriptions": "The interview process was easy and simple you have only to apply in the website.\r\nAfter that you will set a meeting with the prof to get the position. The most important thing is to be ready for some issues with some professors.", "Interview Questions": "How many publications do you have?"}, {"date": "17 May 2021", "title": "Prospect Research Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Ottawa (Ottawa, ON) in Apr 2021", "Interview Descriptions": "The interview was with three members of the faculty I will be working with. Most of the questions were technical questions directly related to the job, the software they use, and my experience with them coupled with few questions on the experience I have in the prospect research field.\r\nA lot of questions were asked. The interview lasted about an hour. The panel had a mix of relaxed and serious faces.\r\nThere were some questions asked in French as they were looking for someone who is bilingual. \r\nWhat made me stand out is the fact that I could speak French and write a bit of French too.\r\n\r\nI was called after the interview to provide three references and the check took a week before they got back to me. I started the job after 3 weeks but the University is wide and have a lot of departments so things can be a little slow in the process. I got an actual offer letter two weeks after I was told I got the job.", "Interview Questions": "How do you get an estimate/know someone's net worth of wealth?"}, {"date": "31 Mar 2021", "title": "Clerk Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Ottawa", "Interview Descriptions": "Was great er by 3 indiv iduals, interv iewed basic questions. For a stud ent clerk job, they case about extracu rricular activi tes. It was a pleasant experience.", "Interview Questions": "What extracurricular activities do you do?"}, {"date": "25 Dec 2020", "title": "Residence Life - Student Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Ottawa", "Interview Descriptions": "This fun interview process was unlike anything I had ever experienced and really allowed students to shine in their own way! This activity-based, carousel style interview process has multiple elements that  allow you to show your many skills related to the job.", "Interview Questions": "Activity based interview process that discussed hiring, scheduling, etc. "}, {"date": "21 Dec 2020", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Ottawa", "Interview Descriptions": "I applied online after seeing their job ad. This was for a professor position in a department within the Faculty of Science. If you are shortlisted, you'll receive an email invitation to do an onsite interview, which is typically 1.5 days long. The interview is typical of academia, i.e., an hour-long presentation of your past research, one-on-one meetings with professors, and an 1-to1.5 hour long research proposal defence/Q&A. The interview was not overly difficult and does not require any special prep, but honestly, my best advice to any prospective academics thinking about U of Ottawa is to simply decline the onsite invitation and look elsewhere unless you're in desperate need of a meal ticket. I am serious.", "Interview Questions": "Composed almost entirely of technical questions pertaining to your presentations, plus some banal 'chit-chat' style general queries in the 1-on-1s. Unlike a company interview, there will generally be no behavioural questions."}, {"date": "8 Apr 2021", "title": "Digital Communications Officer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of Ottawa (Ottawa, ON) in Dec 2020", "Interview Descriptions": "Had to do an interview and send in work samples. Interview conducted via zoom, pretty awkward since no one smiles and you can't look anyone in the eye. Lots of questions about skills and experience, not many about personality. You need to prepare your answers in advance because they have a score sheet with specific answers on it.", "Interview Questions": "How would you create a comms plan"}, {"date": "1 Dec 2020", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Ottawa", "Interview Descriptions": "Submit applications and all documents that required. Then waiting for around 3 months and get the feedback from the committees. After that, you will have an interview opportunity. Submit applications and all documents that required. Then waiting for around 3 months and get the feedback from the committees. After that, you will have an interview opportunity.", "Interview Questions": "why are you applying for this program?"}, {"date": "24 Dec 2020", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Ottawa in Nov 2020", "Interview Descriptions": "They (HR) sent an email to set a time for an informal phone pre-screening interview only to test the second language  (French /English).  if you could speak both in English and  French you will pass the first step and will invite to the next process.", "Interview Questions": "Where did you learn French?  Where did you learn English? Are you able to present in both languages? "}, {"date": "25 Oct 2020", "title": "Programmer Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of Ottawa", "Interview Descriptions": "With a panel of three interviewers. Usually lasts one hour with questions in both French and English. Straight forward, and classical interview questions. Give as much examples as possible. Show your confidence.", "Interview Questions": "You have a project that you think you will be late on delivering, what do you do?"}, {"date": "12 Aug 2020", "title": "PMO Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Ottawa", "Interview Descriptions": "Smooth, they asked various questions about past experiences and the elements in the resume.  Nothing really unexpected. Bonus if you know some BI software. The interview was bilingual, so expect some questions in French. Had a response pretty quickly, and accepted the offer.", "Interview Questions": "Describe me one time you had a conflict within a team environment, how did you resolve it"}], [{"date": "21 Aug 2020", "title": "Student Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Ottawa (Ottawa, ON) in May 2020", "Interview Descriptions": "It was mainly behavioural questions to see how organized and focused you are as a person. They also asked about what you've been doing since the pandemic started so that they can see if you've stayed productive during the pandemic.", "Interview Questions": "How do you stay organized?"}, {"date": "23 Mar 2020", "title": "Student Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at University of Ottawa", "Interview Descriptions": "Be on time! Arrive 10-15 minutes early.\r\nDress appropriately and professionally. (Dress to impress guide)\r\nGreet your interviewer with eye contact, a smile and a firm handshake.\r\nBring your portfolio (copies of your resume, references, transcripts, certificates, etc…).\r\nBe positive and enthusiastic; employers are looking for people with a positive attitude and often emphasize attitude over skills, training and experience.\r\nMaintain eye contact and good posture throughout the interview; 55% of the communication process involves body language.\r\nAnswer questions clearly and concisely. Stay focused and do not deviate from the topic.\r\nFollow the lead of the interviewer and ask questions for clarification whenever necessary.\r\nAlways include a concrete example in your answer that supports the skills or experience that you are highlighting.\r\nAsk the employer the questions that you have prepared.\r\nDon’t forget to find out about the next step in the recruitment process.\r\nThank the interviewers for their time, shake hands and say goodbye.", "Interview Questions": "tell us about your self"}, {"date": "19 Nov 2020", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 2 months. I interviewed at University of Ottawa (Ottawa, ON) in Mar 2020", "Interview Descriptions": "3 stage interview.\r\none with the COO.\r\nsecond with Director.\r\nthird with HR.\r\nthen background check - background check happened by calling previous managers.\r\nthen submitted education documents.\r\nhave to write 30 words to complete this....", "Interview Questions": "Show your previous work by sharing your screen on Teams"}, {"date": "2 Dec 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Ottawa", "Interview Descriptions": "Applied through the careers portal, and got called in for a structured interview in a conference room with two department directors. Very standard interview verifying contents of resume etc and asking behavioral related questions.", "Interview Questions": "What is your strength / weakness"}, {"date": "30 Jan 2023", "title": "Maintenance Engineer 3rd Class Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Ottawa (Ottawa, ON) in Nov 2019", "Interview Descriptions": "One interview Interviewers were friendly and encouraging; They asked about response to emergencies and specified the nature of the job. This is a maintenance, hands on job with the possibility of moving to the plant if the opportunity is available.", "Interview Questions": "If you were to receive an emergency call at the pool, how would you react if you were in the middle of a job already."}, {"date": "6 Aug 2019", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Ottawa", "Interview Descriptions": "Technical and to the point. Expectations were exchanged, timelines were made aware of and policies that needed to adhered to were discussed in great detail. Overall, professional and clear. There was no ambiguity in the entire process.", "Interview Questions": "Technical questions."}, {"date": "31 Jul 2019", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Ottawa (Ottawa, ON)", "Interview Descriptions": "There is no interview process as such. Only few professors might want to see you if you have prior knowledge about a course area otherwise if you resume backs that you have knowledge of that particular area there wouldn’t br any interview.", "Interview Questions": "Nothing I never had an interview. "}, {"date": "15 Jun 2019", "title": "Archivist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Ottawa (Ottawa, ON)", "Interview Descriptions": "You apply on the HR website-  Then if you are already an employee, you should get an opportunity. You need to het 75% on the interview or higher to be considered, then they go by seniority if you are internal.", "Interview Questions": "What is something that can get in the way of doing your job? This seemed to be a time management/communication Question. They will ask you three of these kinds of questions."}, {"date": "23 Apr 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Ottawa", "Interview Descriptions": "referred by my friend, ask questions related to the work need, such as technical skills. Other questions include the available schedule. \r\nreferred by my friend, ask questions related to the work need, such as technical skills. Other questions include the available schedule.", "Interview Questions": "do you know this technology"}, {"date": "19 Jan 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of Ottawa (Ottawa, ON) in Apr 2019", "Interview Descriptions": "It was just a few question about my self and what I do and do I have read the research papers of the field that I am applying to and do I know programming.", "Interview Questions": "Do I Know programming?"}], [{"date": "22 Feb 2019", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Ottawa", "Interview Descriptions": "Short 20 minute interview. Mostly questions about engineering design and design thinking. Covered topics such as product development. Few questions about previous and present education and experiences. Overall quite simple.", "Interview Questions": "How would you manage the students in the lab?"}, {"date": "28 Feb 2019", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Ottawa (Ottawa, ON) in Jan 2019", "Interview Descriptions": "The process was pretty long.\r\nI applied in Dec 26, 2018 and got interview call on 14th January 2019.\r\nI was being told that they will call me in the next 2-3 weeks if I am selected.\r\nI heard back from them after 4 weeks. \r\n \r\nThey had a list of questions ready to ask to the candidates.\r\n\r\nWritten test took about 30 minutes\r\nPersonal interview took about 45 minutes", "Interview Questions": "What are WCAG standards, where did you use them in your previous projects"}, {"date": "9 Mar 2023", "title": "Call Center Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Ottawa in Jan 2019", "Interview Descriptions": "Applied through their work navigator, got an email from the hiring manager, interviewed on campus. Questions were simple, just wanted to know my availability, and if I was good at verbal communication.", "Interview Questions": "Q: What's my availability Q: Have you worked in a call centre environment before"}, {"date": "4 Mar 2020", "title": "Post Doctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Ottawa (Ottawa, ON) in Aug 2018", "Interview Descriptions": "A 3 step interview process, that starts with phone interview, then will be called for a 1-1 personal Walkin interview and time will be given for making a final decision on the offer", "Interview Questions": "How you could contribute for the research"}, {"date": "3 Jul 2018", "title": "Corrector Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at University of Ottawa", "Interview Descriptions": "No actual interview. Just screened application when I applied online through job posting portal.  Basically, I got this offer without any interview at all. This was just a part-time job while I studied full time there.", "Interview Questions": "N/A"}, {"date": "29 Aug 2019", "title": "Marketing Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at University of Ottawa (Ottawa, ON) in Apr 2018", "Interview Descriptions": "Very Easy, the interviewer was so chill and welcoming . she described the job role and asked me if i had any previous experience relating to it\r\nHow do i strive in a fast paced environment\r\nsamples of marketing product i had developed in my previous experience", "Interview Questions": "Why do you think we should employ you"}, {"date": "7 Feb 2018", "title": "Electrical Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Ottawa (Toronto, ON)", "Interview Descriptions": "Got invited to the office one week after applying. Got to see the labs, offices and how they worked. The interview was approximately one hour. they respond quickly got a response in about a week.", "Interview Questions": "How would you act if you had a lot of workload during the week"}, {"date": "29 Nov 2021", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Ottawa (Ottawa, ON) in Feb 2018", "Interview Descriptions": "Discuss fit with labs and projects interested in working on. Passion for the subject is key! Had a great experience. Would recommend emailing as early as possible to ensure there are enough spots available", "Interview Questions": "What kind of projects would you be interested in working on"}, {"date": "5 Mar 2020", "title": "Grad Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Ottawa in Dec 2017", "Interview Descriptions": "had a casual lunch with P.I, we then went back to their  office where we chatted more about what the position would entail. at that point, i was told my references would be contacted, and then I got an e-mail saying I was hired", "Interview Questions": "why are you interested in this work?"}, {"date": "20 Feb 2018", "title": "Junior Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Ottawa (Ottawa, ON) in Oct 2017", "Interview Descriptions": "Short interview with the manager and a senior developer consisting of basic questions about PHP, web development and some \"HR-type\" or professional questions.\r\n\r\nAn example of a PHP question is \"what is the difference between single and double quotes in PHP?\".\r\n\r\nAfter the interview I heard back and received an offer in less than 2 weeks.", "Interview Questions": "Level of experience with PHP."}], [{"date": "1 Apr 2018", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Ottawa (Ottawa, ON) in Sept 2017", "Interview Descriptions": "Just received mail from department ccing professor to choose to accept the student as a teaching assistant. Received an email from professor for an interview. Professor asked regarding the background and whether i am comfortable with the subject.", "Interview Questions": "Which background are you from?"}, {"date": "6 Jun 2017", "title": "Software Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Ottawa (Ottawa, ON)", "Interview Descriptions": "There are three rounds\r\n(1) Initial phone call to provide information about the job role \r\n(2) Technical round - this gets very technical, mostly coding questions and you can answer it in any object oriented programming language you want.\r\n(3)HR round - this is the final round and if you get to this stage you are almost in.", "Interview Questions": "Why do you want to work for UOttawa?"}, {"date": "11 Nov 2021", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at University of Ottawa (Ottawa, ON) in Jun 2017", "Interview Descriptions": "One principal investigator looking for a person to fill long overdue vacant space. \r\nToured the lab and talked  to current employees about their status as employee or student.  \r\nAsked questions about lab work required.", "Interview Questions": "When can you start full timr\r\n"}, {"date": "8 Sept 2017", "title": "Marker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Ottawa (Ottawa, ON) in Jun 2017", "Interview Descriptions": "No interview I am graduate the department select according to your grade point average. There's nothing to say. You apply for the marker job, if you are selected you have the job if not you don't have the job. That's all.", "Interview Questions": "N/A"}, {"date": "5 Oct 2017", "title": "Ressearch assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at University of Ottawa (Ottawa, ON) in May 2017", "Interview Descriptions": "Je pense que j'étais la seule candidate qui avait les competences requises donc entretien d'embauche egal signature de contrat.Je pense que j'étais la seule candidate qui avait les competences requises donc entretien d'embauche egal signature de contrat.", "Interview Questions": "Êtes vous prêts à commencer"}, {"date": "21 Mar 2017", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Ottawa", "Interview Descriptions": "Bilingual interview with 3 people, including my manager. Took place in the Ottawa location and lasted approximately 30 minutes, with all 3 interviewers asking questions. Most of the questions seemed to come from a general sheet.", "Interview Questions": "Lots of questions relative to the position requirements. How much experience I had doing those specific things. Very little coverage of past positions, except how they directly related to this position."}, {"date": "15 Jul 2019", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of Ottawa (Ottawa, ON) in Mar 2017", "Interview Descriptions": "First, I sent my CV and research proposal to a prof. in my research field. Then, received a response from the prof. Only Skype interview with the prof. Then invited at the end of the interview", "Interview Questions": "Specific questions from your CV"}, {"date": "14 Feb 2019", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Ottawa (Ottawa, ON) in Mar 2017", "Interview Descriptions": "Not many questions asked, the professor knew me before. Reaching out to a professor to do research with them is a really opportunity for students and many are happy to take on students.", "Interview Questions": "Are you interested in Combustion?"}, {"date": "6 Nov 2018", "title": "IT Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Ottawa (Ottawa, ON) in Jan 2017", "Interview Descriptions": "Was done within the office, and the questions were pretty straight forward and at the end he asked about identifyign the different computer components, different ports and finally asked the ip/tcp protocols", "Interview Questions": "Explain the different IP/TCP  protocols "}, {"date": "24 Jun 2020", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at University of Ottawa (Ottawa, ON) in May 2016", "Interview Descriptions": "I found the posting through an email from LinkedIn. I was invited to the interview within a few weeks. I met with the Dean and Vice Dean. They were both tough but fair I thought. We met in the Dean's office over coffee and talked about the future plans for the University in light of recent political and financial shifts in focus.", "Interview Questions": "How would you go about increasing funding to support priorities at the university"}], [{"date": "19 Apr 2016", "title": "Risk Management Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Ottawa (Ottawa, ON) in Apr 2016", "Interview Descriptions": "I applied online and a month and a half later recieved a request for phone interview.\r\nThe phone interview lasted 15 minutes and was essentially just to make sure I was bilingual.\r\n\r\nOne week later I was asked to interview in person at the downtown office. A committee of 3 performed the interview and it lasted 1h 15 minutes which is exactly what they plan for.\r\n\r\n13 questions, with sub questions are asked. You are allowed to write the question down and take your time before responding.\r\n\r\nMost of the questions were to test knowledge on regulations and were situational. I.e. the University is planning this process  - what are your recommendations, what is the process and what regulations would apply. \r\n\r\nThis was probably the most difficult interview I have ever had, great questions though - made to reflect real life situations.\r\n\r\nI will not write the actual interview questions as they worked hard to build them and I wouldn't want them to have to restart the process.", "Interview Questions": "I have to write something here"}, {"date": "27 Feb 2018", "title": "Senior Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Ottawa (Ottawa, ON) in Nov 2015", "Interview Descriptions": "Asked questions about myself, what I expected from the job. Gave situational questions and asked how I would react and what I would do. Very relaxed environment, did not feel stressed what so ever.", "Interview Questions": "What would you do during a blackout at the dome "}, {"date": "14 Feb 2017", "title": "Work-Study Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at University of Ottawa (Ottawa, ON) in Apr 2015", "Interview Descriptions": "Applications happen through the work study navigator. If you want a position where you actually code, then you will want to move all that information to the top!\r\nContacting the department and doing your research will help you get the job. There are a lot of people applying through this program.", "Interview Questions": "What type of linux servers have you managed and what tasks did that include?"}, {"date": "4 Mar 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Ottawa", "Interview Descriptions": "I submitted my resume to the law professor and then met with the professor to describe my interests and past educational and work experience. I explained to the professor as to why I am interested in the position and what I would hope to learn from this experience as well as how I could help to contribute to the work the professor was doing. The interview process was informal and friendly.", "Interview Questions": "work experience and interests"}, {"date": "13 Jan 2019", "title": "Proctor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Ottawa (Ottawa, ON) in Jan 2015", "Interview Descriptions": "I got an email for the interview. I went to the office, the manager was waiting for me, asked me some general questions and behavioral questions. After the interview I waited for a week and then I was told I could proctor for the exam and gave me further details.", "Interview Questions": "What would you do in case of emergency situation, if the professor did not arrive on time for the exam."}, {"date": "27 Dec 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at University of Ottawa (Ottawa, ON) in Jan 2015", "Interview Descriptions": "Just had a direct interview with the Professor asked some very basic questions and told me to wait for a decision regarding position in his research group. Had me in contact with the member of his research group and get me to have help regarding the basics of research work. Had to complete few university oriented workshops.", "Interview Questions": "tell be someting about your previous research experience?"}, {"date": "1 Jun 2018", "title": "Academic Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at University of Ottawa (Ottawa, ON) in May 2014", "Interview Descriptions": "Meeting with the department manager and answering questions about technical experience and mathematics. Discussed use of proprietary admissions software, privacy regulations and opening mail. Questions were asked in both English and French.", "Interview Questions": "Can you calculate averages?"}, {"date": "15 Apr 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Ottawa", "Interview Descriptions": "applied out of Canada by email.", "Interview Questions": "No difficult questions"}, {"date": "18 Oct 2017", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at University of Ottawa (Ottawa, ON) in Apr 2014", "Interview Descriptions": "I sat with a three person panel for about 45 minutes. I was asked behavioural and situational questions. The panel were friendly. HR called me within a week to ask for my references.", "Interview Questions": "How does your experience and background prepare you for this role? "}, {"date": "21 Oct 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 6 days. I interviewed at University of Ottawa (Ottawa, ON) in Apr 2014", "Interview Descriptions": "There was only one interview and that`s the direct one-to-one interview, and the employer asked some background questions first, then the questions about the software ability and analytical skills. The questions also included \"do you think you are suitable for this position\"\"tell your merits\", etc.", "Interview Questions": "describe one example about utilizing the STATA software."}], [{"date": "5 Feb 2014", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Ottawa", "Interview Descriptions": "There may or may not be a interview. Advanced courses usually have a small interaction process before the final offering. Job seekers should have passed that particular course in past years.", "Interview Questions": "You must know the tools to be used in the lab sessions."}, {"date": "6 Oct 2015", "title": "Master's Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Ottawa (Ottawa, ON) in Jun 2013", "Interview Descriptions": "Basic, lab questions- have I do PCR, western, worked with cells, etc.. before.\r\nTook about an hour. The building is very complicated so get there an hour before to find the lab.", "Interview Questions": "Describe past lab experience"}, {"date": "19 Apr 2013", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Ottawa", "Interview Descriptions": "There is no no interview process. The positions are generally allocated to students as a part of a scholarship, at a rate of one course or 130 hours per semester for four semesters.  However registered students with relevant experience may apply for the positions, but face still competition from others especially since there are few positions to begin with.", "Interview Questions": "No questions as there is no interview. "}, {"date": "22 Oct 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of Ottawa (Ottawa, ON) in Oct 2012", "Interview Descriptions": "Sending e-mail to professor, get an interview in office.", "Interview Questions": "N/A"}, {"date": "14 Nov 2015", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Ottawa (Ottawa, ON) in Sept 2012", "Interview Descriptions": "My grades for the applied courses were checked to make sure I had a minimum of an A-. It took a couple of minutes and it was over. Nothing difficult, just grade check on the transcript online.", "Interview Questions": "What courses do you want to tutor? Did you get a minimum of an A- in each?"}, {"date": "12 Dec 2016", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Ottawa (Ottawa, ON) in Jan 2012", "Interview Descriptions": "was very tough people dont apply, better to apply to other universities, specially US universities as they offer better research facility as well as stipends and support network. uOttawa lacks all of these.", "Interview Questions": "Your interest in the field"}, {"date": "13 Jan 2013", "title": "Programme Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Ottawa (Ottawa, ON) in Nov 2011", "Interview Descriptions": "Conventional staged interview process. After applying for the posting online, you will be selected among candidates for an initial interview. Moving onto the second interview you will be asked to answer questions catered to your job description. Finally orientation and training.", "Interview Questions": "Ever worked with management you did not like. "}, {"date": "27 Sept 2015", "title": "Financial Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Ottawa (Ottawa, ON) in Oct 2011", "Interview Descriptions": "Before  the interview there was a test to review the financial skills and the University's policies.\r\nI was interviewed by 3 people. My direct supervisor, someone from HR aND somebody from other sector. \r\nThey did I it iN order. They ask about previous experiences and how those should be related with the job posting.", "Interview Questions": "Some typical questions and other's more technical"}, {"date": "9 Jul 2012", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at University of Ottawa (Ottawa, ON) in Jun 2011", "Interview Descriptions": "I was fortunate to get this job opportunity as my effort to see many counselors paid off. I booked an appointment with one of the counselors at Career Services in the university and the very next day, there was an opening in the same office. Interview took 15 minutes and I was hired based on my experience in IT sector and knowledge of computers.", "Interview Questions": "How would you be helpful for our team and project?"}, {"date": "3 Nov 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Ottawa (Ottawa, ON) in Feb 2011", "Interview Descriptions": "it was telephone interview, quite simple question. The professor emailed me in advance about the email so that I can come prepared. So everything is going as expected. Nothing special", "Interview Questions": "I am doing research on power electronics. All the question related to the fundamental of power electronics"}], [{"date": "9 Jun 2013", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of Ottawa (Ottawa, ON) in Feb 2011", "Interview Descriptions": "Took a course from a professor. Got good grade. Then mentioned to him that I'm interested in doing a research project with him. No interview.", "Interview Questions": "How to find a solution to a new research project"}, {"date": "30 Sept 2014", "title": "Development Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Ottawa in Dec 2010", "Interview Descriptions": "All candidates must be fluently bilingual both in French and English. Candidate will be asked to answer both in French and English during interview process. Sometimes a test is required for certain position. The hiring process is based on a grade system, and of course priority will be given to current employees", "Interview Questions": "Mostly your previous experience in correlation with the new job you are applying"}, {"date": "4 Oct 2010", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 days. I interviewed at University of Ottawa (Ottawa, ON) in Mar 2009", "Interview Descriptions": "Phone Interview followed by Face to face Interview", "Interview Questions": "What is my expected slary"}]]