[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent Company!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 May 2022", "job_title": "Support Specialist in Honolulu, HI", "duration": "N/A", "pros": "The people at McREL are consistently friendly, professional, and helpful. The work is rewarding and makes a difference within the education system. The pay and benefits are competitive. The office setting is clean, efficient, and high in quality.", "cons": "I do not have any cons about McREL."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good experience with a twist ending", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "18 Jun 2022", "job_title": "Writer/Editor in Denver, CO", "duration": "N/A", "pros": "My time at McREL was characterized by professional growth and collegial warmth. I liked it there and would recommend it to prospective applicants.", "cons": "I was ready to give a five-star review upon departure but with a week to think about it, I have to nudge that downwards because of something that happened right at the end: A job with my duties but a new title was posted with more or less the deal I’d been trying and failing to get for two years. All’s well that ends well, I suppose: The new person will earn much more than I earned, and I’m now earning much more than that person will earn. Still, it makes me wonder what might have been if I’d spoken up a bit more forcefully and/or someone had been listening with more acuity."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Growing", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "19 Apr 2022", "job_title": "Senior Managing Researcher/Evaluator in Denver, CO", "duration": "N/A", "pros": "Staff community, values-driven, forward thinking", "cons": "Education is a tough sector in which to work."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "About ten years behind the industry", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "11 Mar 2022", "job_title": "Research Director in Denver, CO", "duration": "N/A", "pros": "is family friendly\r\nallows for flexible schedules", "cons": "all products could be of better quality, but there's no interest in improving"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Terrible work culture", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Jan 2021", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "Decent pay and an initially welcoming team.", "cons": "The leadership at McREL takes advantage of staffers and is often unorganized, providing little to no guidance or clear expectations. I left feeling like I survived a psychological thriller where everyone was in on company needs except for me. Poor communication. Poor culture of secretly working around the clock for no acknowledgement. Poor relationships and a total lack of vision. Prepare for random projects that interfere with your regular work, people assuming you’re lazy/ not working hard enough, no training or team support, and no introduction/ orientation to the organization to help you understand outcomes."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Great ideals, have difficulty in follow through", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "7 Feb 2015", "job_title": "Consultant in Denver, CO", "duration": "N/A", "pros": "I've been working at McREL for more than 10 years. McREL has some of the best people in education working together to make a real, positive difference for everyone involved. Very intelligent, dedicated, and motivated staff. The benefits and salaries are very competitive, and the working environment is great, especially for a non-profit. The work can be extremely rewarding, as McREL truly can make huge differences to educational practice.", "cons": "The work done at McREL is usually contract work. If you're not working on a contract, you're probably not going to be working at all. A lot of pressure is placed on the workers to be on a contract, but then many of the workers are not given the tools or support they need to get contracts. McREL can be seen as very expensive, so many districts and states can't afford us. The great salaries, benefits, and working environment come at a cost, and that makes it very challenging to get the work."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "A research company that has ignored every bit of data and information about employee unhappiness and turnover.", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Jul 2014", "job_title": "Anonymous Employee in Honolulu, HI", "duration": "N/A", "pros": "The work is for a great purpose. People believe in the purpose and are committed to that purpose.", "cons": "By all indications, there has been near continuous turnover in this office and all signs point to the same underlying causes. All concerns have consistently been dismissed with all of the complaints brushed away as misperceptions. Complaints have been made to supervisors, to the director, to human resources, and to the very top of the organization and on several occasions by several people. Nothing has changed. It is clear that some benefit from their relationships with leadership no matter the quality of their work or their actual contributions. This is demoralizing as it shows that merit is highly subjective. The hiring practices have been suspect with people interviewing for one position but being assigned to something completely different. The reputation in the research community is terrible as we are known to be unresponsive and untimely and a growing sense of mediocrity. What's worse is that the Honolulu office has been around for more than three years and there are many in our local education community who have never heard of the organization or the work that we do. If not for the support system of coworkers who try to remain committed to the work (not the organization), the situation would be intolerable."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "It is a Mess!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Jul 2018", "job_title": "Researcher in Denver, CO", "duration": "N/A", "pros": "It’s a struggle to find any good reasons. Like any business there are a few nice, kind and honest people.", "cons": "Before posting my review, I have read all of the previous reviews and I encourage others to read more than just the first few that might come across your screen. Take notice of the large discrepancies between the good and poor reviews. Not many reviews in the middle and that alone should send a clear message to you as a job seeker to stay clear of this company.  It is poorly managed from the CEO’s office to HR to middle management. There are so many excuses for lack of business generation and work given to employees and the board. There is no solid plan to grow. There is no quality leadership at any level to keep this company going well into the future. It’s a mess and my advise, for what it’s worth is not to waste your valuable time on this company."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "If only they practiced the \"high reliability\" strategies they sell...", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Apr 2013", "job_title": "Lead Consultant in Honolulu, HI", "duration": "N/A", "pros": "McREL can present itself as a professional organization with competitive salaries to applicants they highly favor.  The company has a history of publishing research-based educational products and providing effective professional development.  I worked with some of the most talented colleagues I've known while at the company.", "cons": "The leadership at Denver headquarters requests input on business directions and feedback on operational functions.  However, ultimately, the creative contributions of dedicated employees has little impact on decisions and company growth is stunted.  The Honolulu office poorly manages funds, personnel, and partner relationships with no meaningful research to show for the Pacific Regional Education Laboratory (REL).  In less than a year, nine employees (more than half) left the REL staff.  I believed their spiel about commitment to Pacific educators and students and I was disappointed to learn the company's intent and character."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Run, don't walk, run away from this company", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "31 Jan 2017", "job_title": "Consultant in Denver, CO", "duration": "N/A", "pros": "Lots of good people who put in long hours and believe in the mission", "cons": "This company has lost money the last 5 out of 6 years with the only profitable year coming from the acquisition of Edvantia and the cash they brought to the deal.  Take away the Edvantia cash and it would be 6 years in a row. How bad are things?  Last week they laid off the receptionist and this week the IT staff was let go.  McREL expects employees to put in 60 hour weeks for 40 hour pay.  There is no real business plan other than \"Be Brave\" and the senior leadership is very much a buddy buddy environment.  Also, if you're looking for a company that embraces diversity, look elsewhere.  \r\n\r\nAs I said run away from this company"}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "One star rating is too high", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Jun 2013", "job_title": "Researcher in Denver, CO", "duration": "N/A", "pros": "Nice offices in Denver. Slick presentations to the outside world. Effectively presented perceptions that meaningful work by the organization is being carried out. Individuals in the organization do good work and care about the clients they serve.", "cons": "Poor attention to diversity ( ethnic/cultural, idealogical, regional ). Financial mismanagement addressed by employee furloughs with no attention to mismanagement by the leadership. Negative perceptions of the organization is handled by creating \"spin\" to make the organization look better rather than addressing  the ills of the organization. Only lip service paid to the values articulated by the organization. Very little organizational credibility in the regions served by the organization."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Disgruntled", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "3 Jul 2015", "job_title": "Administrative Coordinator in Aurora, CO", "duration": "N/A", "pros": "I met some great people who were willing to support each other to meet important deadlines. Many were very dedicated to their work in improving student achievement.", "cons": "Very top heavy in management positions. They spend money on things that aren't necessary for the efficient running of the organization and won't spend money on the things that might help increase their revenue. Saw lots of waste! They don't consider years of experience when looking at possible advancement opportunities, especially for administrative staff. Must have college degrees to get promoted (but perhaps not in all cases??)."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "a word of caution to job seekers and current/potential clients (one star is too high)", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Oct 2017", "job_title": " in Denver, CO", "duration": "N/A", "pros": "previous reputation as an industry leader", "cons": "Due to a number of poor decisions (see other reviews), it is unlikely that McREL will be around much longer. This is sad because previously we were considered leaders in the education industry. If you are looking for an education service provider for employment or for services, you may want to consider someone else. \r\nI and other “survivors” of the last round of layoffs are being asked to take on work that we are not qualified for. It is unfair to us and to our clients who are/will continue to suffer the consequences. McREL has once again let go of the best and brightest in our organization to save money."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A unique place to work and do something important with your life", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "14 Jun 2013", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "McREL is a leader in education research & reform in the U.S., the Pacific, and now, Australia. The majority of people who work there are smart, friendly and committed to quality. It's a great place for those who want to work hard and solve big challenges in education.", "cons": "Extra hours are often required to do the job done right. Travel can be frequent, and, yes, there's pressure to bring in contracts. Basically, it's a totally different environment than K-12 or higher ed and probably not for everyone."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Tough decisions aren't always popular", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "22 Mar 2017", "job_title": "Consultant in Denver, CO", "duration": "N/A", "pros": "Just won a major, 5-year contract. Strong focus on values. More cohesive, engaged staff. Still significant reserves.", "cons": "Not sure if it's a downside, but there are some disgruntled former employees now competing (unsuccessfully) with the organization who are posting repeat reviews to vent and make the organization look bad. They need to get over it."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Fake company", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Oct 2019", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "Nice people and nice office.", "cons": "Executives treat others poorly and talk behind their backs. HR doesn't know how to properly run an office and unfortunately they think they run the entire office. CEO has no backbone. Micromanaged office with no advancement.  You think people are being nice in your face, but lots of gossip. Non-profit joke, surprised if they are still in business next year."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great People and Great Work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "1 Jul 2014", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "The staff is McREL is comprised of some of the smartest and hardest working people I have ever worked with. The quality of the work is consistently high.", "cons": "This is a soft money organization and as such, we have to pursue grants and RFPs. For some this is hard."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A great introduction to McREL", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Jul 2017", "job_title": "Writer/Editor in Denver, CO", "duration": "N/A", "pros": "I'm thrilled with my first few weeks at McREL. The people are nice, the workplace is comfortable, and the benefits are the best I have seen in decades. Onboarding was efficient and I felt like part of the team right away.", "cons": "Nothing to report at this time."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "No job protection", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Feb 2015", "job_title": "Researcher in Denver, CO", "duration": "N/A", "pros": "Paid to investigate important issues that impact educational outcomes. Dream job.", "cons": "Too much work and too little time. As salaried employee, worked until job was done. \"At will\" state so could be fired for any reason."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Mixed review", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "19 Jan 2016", "job_title": "Managing Consultant in Denver, CO", "duration": "N/A", "pros": "Fun and challenging work- opportunity to learn and work with a variety of schools", "cons": "need to cover your time or you are at risk of being let go"}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Feb 2017", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "Benefits, family focused, team oriented, & flexible.", "cons": "Location is the biggest con for me."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Consultant", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "15 Jan 2017", "job_title": "Consultant in Denver, CO", "duration": "N/A", "pros": "Great and smart people n he trenches.", "cons": "Management is more concerned with money than with the schools they should be helping. Ethics and trust are a concern."}]]