[[{"date": "21 Nov 2020", "title": "Account Manager Trainee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Strategic Account Management Association", "Interview Descriptions": "The interview process was very comprehensive and impressive. It consisted of several interviews, a quite comprehensive case, and a presentation. Very fun and learned a lot. It seems like the culture is very very good and you get to meet several people from the company.", "Interview Questions": "Why did you choose Lime? "}, {"date": "21 Jun 2017", "title": "Marketing Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Strategic Account Management Association (Chicago, IL)", "Interview Descriptions": "This was by far the most dysfunctional and frustrating interview experience I've ever had. First, it took the person in charge of HR - which is just the company's accountant - over 4 weeks to simply set up a phone interview. Once invited to attend an in-person one, I found out the night before they were actually going to be interviewing me for two positions (I only got a heads up because I knew someone working there). I had to meet with six people over the course of three hours. When I asked one of the staff what they liked best about the company, he said \"nothing\" - naturally I left feeling awkward. Days later they realized I hadn't met with the supervisor for the other role they interviewed me for, so insisted I set up another phone interview. At this point the process had taken almost 2 months when they finally offered me a job (conveniently the one I hadn't even applied for - bait and switch). The worst part: after reviewing the offer and inquiring about some options, they left me cold turkey. Eventually I received an email from the accountant stating they were reconsidering me as a candidate! Another week went by until they finally emailed again saying they were retracting the job offer and ultimately not hiring anyone…not only was this unprofessional, but a complete waste of everyone’s time. If this company’s complete lack of organization and respect for people interested in them is any sign of how they’re doing, don’t bother.", "Interview Questions": "Their questions varied by department and difficulty - overall it wasn't transparent who was interviewing me for which role"}, {"date": "7 Jan 2016", "title": "Membership Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Strategic Account Management Association in Feb 2012", "Interview Descriptions": "first with office manager then CEO, then rest of staff just to check fit. easy process. 2 inperson and 2 on phone. Long term didn't figure out that CEO was a control freak. 2 meeting with offer given at end of second meeting", "Interview Questions": "how do you support clients. whats your knowledge of strategic selling"}], []]