[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": 5, "review_title": "Terrific Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "21 Feb 2019", "job_title": "Director in Peoria, IL", "duration": "N/A", "pros": "Midstate is a small, privately owned college\nEveryone here is treated like family with caring and compassion\nEveryone's opinion and suggestions are taken into account on a daily basis, we are encouraged to make quality improvements to our departments and make suggestions that may help other departments as well or the college in general\nEveryone is willing to step up and help out and to work together as a team\nFlexibility in scheduling", "cons": "Being a for-profit institution, there are many more regulations and requirements from state and Federal agencies that we have to meet and adhere to in comparison to not-for-profits.  Midstate has risen to each of these challenges for over 130 years and will continue to do so."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "I love my Midstate family!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 Mar 2014", "job_title": "Anonymous Employee in Peoria, IL", "duration": "N/A", "pros": "Midstate College is one of the best place places I've ever worked. The leadership of the college makes it a priority to treat every employee, member of faculty and student like a part of their family. I, personally, have been given many opportunities and feel that I am advancing my career in a very positive way by working at Midstate. The President of the College has worked her way through the entire school, performing many different key job functions, including admissions and developing the foundation for eLearning, as well as many other responsibilities. The President's leadership style, knowledge, expertise and experience prove over and over again that Midstate will continue to succeed for many years to come, just as it has since 1888. I am so proud to be a part of the Midstate family!", "cons": "I don't have any cons to include about working for Midstate. I am genuinely very happy working for this college!"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Admissions Representative", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Jun 2017", "job_title": "Admissions Representative in Peoria, IL", "duration": "N/A", "pros": "The supportive faculty helped a lot of students that previously attended two or more schools unsuccessfully (or never aspired to a college degree until later in life) finish their diplomas and degrees--a terrific thing. While I was there the school outperformed any other school in the market area to train students to interview and network well to attain the real goal for them-a better life for themselves and their families. I was there so see the whole process happen for several people, and the good things about Midstate made it possible.", "cons": "Current and present operating management punishes initiative, yet pretends to worry every  quarter when enrollments are down after they discourage and even thwart good ideas from program directors and staff to promote the school to major area employers with the very students  they could have helped a great deal.  Midstate management richly deserves the downfall of the past few years. If you choose to work here you will never experience so much backwards arrogance and dishonesty from such average people."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "I love my job!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "11 Mar 2014", "job_title": "Anonymous Employee in East Peoria, IL", "duration": "N/A", "pros": "Small classes, individual attention to student needs, up-to-date materials and technology, excellent accreditations, prepared faculty with excellent academic credentials, salary commensurate with like institutions, high expectations backed by available resources, student focused, program admissions standards, tuition reimbursement, 401K, adequate work space conducive to class preparation and student meetings, provision of equipment and materials as justified by program demands, stimulating work environment, family atmosphere fostered within a caring environment, respect as a professional and as a colleague---not just another name, excellent community involvement.", "cons": "None that I can think of."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Adjunct Faculty", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Jul 2016", "job_title": "Adjunct Instructor in Peoria, IL", "duration": "N/A", "pros": "Great atmosphere. Great group of students who are willing to learn. Small class sizes. Assistance is always provided for a better understanding.  They will also work with your schedule and communicate through Skype if they have to.", "cons": "1-2 class offerings per semester.  They need to really get their name out there.  This is a great school but the enrollment is lacking.  They need to push their online program and set some parameters for students that are more strenuous than what's in place."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Adjunct Instructor", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "14 Nov 2015", "job_title": "Adjunct Instructor in Peoria, IL", "duration": "N/A", "pros": "Small student population; small class sizes. Offered various delivery methods for classes including fave to face and blended learning. Offers individual attention based on learner needs.", "cons": "Family owned business where The direction changed once the daughter stepped in. The staff seemed very \"clicky\". Policies changed in regard to pay without my knowledge. I relocated and was traveling 2 1/2 hours and mileage was a part of the expense where I was reimbursed. It was decided after my travels they would no longer reimburse me. Left and never looked back. It was a great experience until leadership changed."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "If only zero stars was an available option...", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "17 Sept 2018", "job_title": "Adjunct Faculty in Peoria, IL", "duration": "N/A", "pros": "Best reasons to work at Midstate College?\r\n\r\nUhhh....\r\n\r\nYeah, I'm drawing a blank, here.\r\n\r\nSeriously, I've got nothing nice to say.", "cons": "The institution has been around since 1888.  If things keep going the way they are currently, I doubt they'll see their 135th anniversary in five years.  \r\n\r\nI think the criteria for admission is that you have a name, a SSN, and, the ability to either pay tuition via loans or the ability to land a bunch of grants.  Student quality is at an all-time low.  They will not turn anyone away, because, well, they want the revenue.\r\n\r\nThe last pay raise to adjunct instructors was a paltry $0.40/hour.  This was over the course of at least TEN years, too, so, that averages $0.04/hour/year.  That's not something of which to be proud; that is a slap in the face, an utter INSULT to the folks who have made your institution what it once was.  Adjunct Instructors at other local institutions make almost 1.5 times what Midstate pays.  Trust me, the instructors know it, too.\r\n\r\nThe administration is a joke.  Most are grossly-unqualified to do their jobs, and, are only in their positions because the kiss the CEO's butt every chance they get, OR, are members of the family.\r\n\r\nCEO.  What can I say?  Awful.  She's awful.  She is NOT a leader; she does NOT have the best interests of the institution, the faculty, the staff, OR the students in-mind.  She only has the best interests of herself on her mind.  Anything she wants, like a new car, or a payraise, all she has to do is whine to the Board (which consists largely of her family and family friends), and, the princess gets anything and everything she wants.  Spoiled brat at the helm of a company = horrible outlook for the company.  This is what we have here, 100%, and, she has proven time and time again that she will not lower her lifestyle for the benefit of the masses.  True leaders?  Will."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Department Assistant", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Feb 2016", "job_title": "Department Assistant in Peoria, IL", "duration": "N/A", "pros": "There are some amazing, brilliant people working there that care very much about the students and their jobs.", "cons": "Administration needs to acknowledge the amazing people they have working there, and make the most of their abilities."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Facilitator/Professor", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Jul 2015", "job_title": " in Peoria, IL", "duration": "N/A", "pros": "The staff are cordial, the faculty is excellent.", "cons": "Due to a recent decline in students due to the national economic slump, many excellent teachers and staff were laid-off."}], []]