[[{"date": "22 Nov 2022", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Wisconsin-Stout", "Interview Descriptions": "Interview at different tables with themed questions. There is time for you to sit in the center of room where you are asked fun questions and not the ones at the tables.", "Interview Questions": "why do you want this position"}, {"date": "22 Mar 2021", "title": "Lecturer In EEE Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Wisconsin-Stout", "Interview Descriptions": "Applied for a job that was perfectly match my credentials.  Get an email saying that I am not qualified for the position, emailed the chair he responded that they  have position advertised in the chronical of Higher education.  I looked the jobs are totally different.  They dismissed my application for the position for unknown reason.", "Interview Questions": "No question was asked total dismissal."}, {"date": "20 Dec 2021", "title": "Resident Advisor (RA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Wisconsin-Stout (Menomonie, WI) in Nov 2020", "Interview Descriptions": "I gathered references and wrote quick responses on basic questions, like: \"Why do you want to be an RA\", \"What skills do you bring to the table\".  etc.\n\nThey gave me a document describing the position, which was very important during the interview.", "Interview Questions": "Why do you want to be an RA?\nHow did you solve your last problem?\nHow would others describe you?"}, {"date": "4 Sept 2018", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Wisconsin-Stout", "Interview Descriptions": "Easy, brief, and timely. I received a late call-back, but it was just in the nick of time. I received a few offers, but ultimately I accepted the UW-Stout offer.", "Interview Questions": "Why I wanted the position"}, {"date": "6 Nov 2019", "title": "Involvement Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Wisconsin-Stout (Menomonie, WI) in Dec 2017", "Interview Descriptions": "The application was easy to submit requiring a simple review of the job, strengths of myself, class schedule, my key qualities and then a scheduled in-person interview. The form to complete is found on CONNECT and tests if you know how to use CONNECT.", "Interview Questions": "Tell us about yourself, strengths and weaknesses, why the position is of interest, teamwork skills, challenges faced, event experience, CONNECT experience and questions."}, {"date": "12 Sept 2019", "title": "UW-Stout Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Wisconsin-Stout (Menomonie, WI) in Sept 2016", "Interview Descriptions": "Very simple. Got in contact with the supervisor, they scheduled the interview. Within 3 days they offered me the position.  It was very simple and they got right to the point. University is always looking for student workers and they believe that student's should be there to help in the process of each program.", "Interview Questions": "What makes you a good team member?"}, {"date": "22 Oct 2015", "title": "Director of Accounting Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Wisconsin-Stout (Menomonie, WI) in Oct 2015", "Interview Descriptions": "Telephone interview with multiple people. All very pleasant individuals.   After having gotten past the telephone interview, they check references and then decide if they want to face-to-face interest.  This was unusual as normally reference contact occurs after a face-to-face interview.  References do not expect to be contacted for preliminary information.", "Interview Questions": "Discuss a time that you failed..."}, {"date": "6 Aug 2015", "title": "Desk Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Wisconsin-Stout", "Interview Descriptions": "The interview was relatively easy and comfortable. It consisted of two people who alternated questions. They asked a variety of things like work experience and also situational questions. It wasn't very stressful and most of the answers were straight forward.", "Interview Questions": "How would you handle a situation where an emergency occurred?"}, {"date": "18 Dec 2015", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Wisconsin-Stout (Menomonie, WI) in Jun 2015", "Interview Descriptions": "Math Lecturer. I drove to the university and made a teaching course (30mins), was asked some trivial questions (e.g., why this university). Then I obtain the offer in the nextfew days.", "Interview Questions": "Why you choose this University"}, {"date": "7 Oct 2016", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Wisconsin-Stout (Menomonie, WI) in Nov 2014", "Interview Descriptions": "Typical interview process with a interview panel.  Panel consisted of manager and two team members that had the most experience with the core job functions.  A series of questions re:job experience and a few behavioral type interview questions.  It took a long time for them to make the job offer.  Once offer was made the process went in a timely manner.", "Interview Questions": "Several questions were asked regarding computer expertise; in particular Microsoft Office."}], [{"date": "12 Sept 2017", "title": "Financial Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Wisconsin-Stout (Menomonie, WI) in Sept 2013", "Interview Descriptions": "The interview was small, with just the supervisor and the current occupant of the position (who was retiring). HR contacted me about setting up the interview, then contacted me again with an offer.", "Interview Questions": "Are you comfortable in a high-stress working environment?"}, {"date": "10 Apr 2014", "title": "Assistant Controller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Wisconsin-Stout in May 2012", "Interview Descriptions": "Long and multiple stages as is the case with any position in the University system in Wisconsin.", "Interview Questions": "What was your most difficult employee and how did you handle the situation."}, {"date": "24 Jul 2012", "title": "Grounds Crew Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Wisconsin-Stout (Menomonie, WI) in Apr 2011", "Interview Descriptions": "Searched online for jobs offered by the university for the summer and found this on Stout's website. I applied by sending my resume and cover letter in an email to the grounds crew superintendent. I received a response from him a week later letting me know when interviews would be held, went in for an interview and received a job offer within the next week.", "Interview Questions": "No unexpected or difficult questions. He just wanted to know about my previous grounds work experience and availability."}]]