[[{"date": "9 Aug 2022", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Child Guidance Resource Centers (Philadelphia, PA) in Jul 2022", "Interview Descriptions": "The process was detailed and long but was overall pleasant. They make sure that their candidates are qualified and engage you in many questions. The interviewer was friendly. Overall a good experience.", "Interview Questions": "They asked about case studies. "}, {"date": "14 Jun 2022", "title": "Mental Health Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Child Guidance Resource Centers", "Interview Descriptions": "They reached out for an interview over zoom. The interviewer made me very comfortable. This non profit has a lot to offer from what they made it seem! I was super thrilled with how it all went.", "Interview Questions": "Have you ever had to handle crisis calls?"}, {"date": "9 Jul 2019", "title": "Outpatient Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Child Guidance Resource Centers (Coatesville, PA) in Jun 2019", "Interview Descriptions": "Saw job posted online, applied and was contacted for an interview. Met with two supervisors and had a pleasant experience. They wanted to know about my experience, how many hours I wanted, and my philosophy of counseling.", "Interview Questions": "Are you comfortable with electronic medical records?"}, {"date": "2 Aug 2019", "title": "Tss Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Child Guidance Resource Centers (Philadelphia, PA) in May 2019", "Interview Descriptions": "First Interview given over the phone. Interviewer went over my skills and qualifications. Asked about my ability to use medical billing system and computer skills. Interviewer also asked about my knowledge of ABC behavior model.", "Interview Questions": "My experience with children"}, {"date": "8 Nov 2017", "title": "Tss Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Child Guidance Resource Centers", "Interview Descriptions": "I applied online and the manager caller me to set up an interview. I interviewed the next day. The hiring manager was 15 minutes late. Asked normal questions. Asked when I could start work and then handed me paper work.", "Interview Questions": "Tell me about a time you went above and beyond at your last job?"}, {"date": "18 Jul 2017", "title": "Therapeutic Staff Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Child Guidance Resource Centers", "Interview Descriptions": "-filled out initial questionnaire screening and then spoke with two interviewers\r\n-they asked questions about experience and situational questions (i.e. tell me about a time that you had to work with a difficult person and what did you do?)", "Interview Questions": "Behavioral interviewing"}, {"date": "7 Dec 2016", "title": "Intervention Development Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Child Guidance Resource Centers (Havertown, PA) in May 2014", "Interview Descriptions": "Background check, drug test, and general job overview. Describing the length of the job and location. Also what to expect when working with children and teenagers. Interviewer explained that children and teenagers ranged from low mental functioning to highly overactive behavior.", "Interview Questions": "Do you have any experience working with children."}, {"date": "23 Mar 2016", "title": "Lead Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Child Guidance Resource Centers (Phila, PA) in Apr 2014", "Interview Descriptions": "Half hour interview with the Assistant Director of the program. Easy questions, not anything out of the ordinary. Received an e-mail offer for the position approximately one week following my interview.", "Interview Questions": "How comfortable are you working with children with ASD/emotional disabilities?"}, {"date": "18 Jul 2014", "title": "BSC MT Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Child Guidance Resource Centers (Coatesville, PA) in Aug 2012", "Interview Descriptions": "The interview was a piece of cake.  This was surprising to me as I found it unusual that I was hired on the spot without checking references, etc.  I knew that the site must have been hurting and had a high turnover.  Hiring process was longer and a bit tedious.  I was not informed by the hiring supervisor that I would be required to attend so many hours on multiple days of orientation and training prior to beginning work.  This posed a problem for me as I already had a job, and the part-time position at Child Guidance was not as important as my full-time job.  I had to take many unexpected days off of my primary job to fulfill the Child Guidance requirements.", "Interview Questions": "As I stated, the interview was a piece of cake.  There were no unexpected or difficult questions.  I suppose I could say that the most unexpected question was how quickly could I start work."}, {"date": "1 Sept 2011", "title": "Mental Health Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Child Guidance Resource Centers (Havertown, PA) in Jul 2011", "Interview Descriptions": "I am already a per-diem employee and was told at my initial interview they hire F/T workers from within.  When I got the call that there was a F/T and P/T opening I was asked to come in and speak with the supervisor since I hadn't worked at that specific site before. When I got there it was an interview and I was asked the general scenario questions. I was also told there was another candidate up for the position.", "Interview Questions": "If a client was verbally abusing you what would you do?"}], [{"date": "2 Mar 2012", "title": "Behavior Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Child Guidance Resource Centers (Havertown, PA) in Aug 2010", "Interview Descriptions": "Came in to a group hiring day.  Supervisor looked at my resume, asked me 1 question and then offered me a job.  The only question asked was how did I like working for my last employer.", "Interview Questions": "No real questions were asked"}]]