[[{"date": "29 Mar 2023", "title": "Donor Relations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Simmons University", "Interview Descriptions": "Great interview with the hiring manager. Unfortunately, the role was put on hold. Great follow up and I appreciated the updates I received. I would be interested in moving forward if the opportunity reopened.", "Interview Questions": "Why are you looking to make a career change?"}, {"date": "26 Jan 2023", "title": "Technology Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Simmons University", "Interview Descriptions": "Talked to manager and then interviewed with fellow co worker, along side student. Was a zoom interview. Lasted about 2 days then waited about a week or so before I got the offer.", "Interview Questions": "Tell me about yourself, and why you think you fit this role"}, {"date": "24 Feb 2022", "title": "Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Simmons University", "Interview Descriptions": "Experienced very good communication and response from beginning to end; friendly and welcoming during my visit.  Timely updates on status.  Helpful information about benefits and offerings.  Easy campus to navigate.", "Interview Questions": "Why are you interested in Simmons?"}, {"date": "24 Nov 2021", "title": "Executive Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Simmons University (Boston, MA) in Nov 2021", "Interview Descriptions": "Simple process 1 interview basic questions met with 2 people and was offered the job later on that day but also got another offer offer same day so I had to decline", "Interview Questions": "They asked my Proficiency in Microsoft Office "}, {"date": "7 Mar 2021", "title": "Circulation Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Simmons University (Boston, MA)", "Interview Descriptions": "The interview process was quick and easy. The interviewer was kind and had a good sense of humor. We spoke about my past experiences and how I would handle situations with difficult patrons.", "Interview Questions": "How would you handle a difficult patron?"}, {"date": "5 Mar 2021", "title": "Residence Life Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Simmons University (Boston, MA) in Feb 2021", "Interview Descriptions": "Not all participants were on the same page and most people validated what I was saying with praise which was super misleading in the follow up. The last interview the main hiring manager described the job differently than what was posted and the other members of interview questioning described different qualities they were looking for not mentioned by the hiring manager, the job description, or anyone on the team. They were repeatedly validating what I had to share which was a shock when I asked for feedback and haven’t heard anything back to work at Simmons or another school. It validates bias in the selection process; I was not selected due to my race since it mostly white women and very few people of color.", "Interview Questions": "What did I gain from the experience of round table questions?"}, {"date": "11 Apr 2019", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Simmons University", "Interview Descriptions": "Several phone screens and several hours in person interviews.  All went well but then was ghosted, investing that much time into a candidate and then ghosting makes me wonder about the culture of the place.", "Interview Questions": "How do you handle stress?"}, {"date": "9 Dec 2019", "title": "IT & AV Assistant (Part Time) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Simmons University (Boston, MA) in Apr 2019", "Interview Descriptions": "Was invited to the office and spoke to several IT leads/managers. Interview was straightforward and was for general tier 1 support and AV infrastructure. We spoke about goals, experience and expectations on the job + small walkthrough of IT office space.\n\nEveryone was super friendly and I had a great time.", "Interview Questions": "Tell us about your previous experiences"}, {"date": "29 Jan 2020", "title": "Assistant Director of Alumni Relations Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Simmons University (Boston, MA) in Nov 2018", "Interview Descriptions": "Very long interview process: first there is a phone screen, then a formal interview, then an internal team interview with multiple teams in the department, then a final interview with Vice President of Advancement", "Interview Questions": "What's your big idea?"}, {"date": "11 Apr 2019", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Simmons University in Sept 2017", "Interview Descriptions": "It was brief, kind. Went over qualifications in relation to role. Asked about my skills, office and explained the admissions process as I would be working for an admissions team.", "Interview Questions": "How would you handle a difficult situation? "}], [{"date": "28 Jul 2017", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Simmons University in Jul 2017", "Interview Descriptions": "I have never been through an interview process so quickly before!  From the day I submitted an application to the final round interview (and subsequent rejection), it was only 15 days.  I had a screening interview with a recruiter, a phone call with the hiring manager, and a Skype session with the team (was out of area and couldn't attend an in-person interview).  I have worked in higher education for a while and no job process has moved as quickly as this team.", "Interview Questions": "Normal interview questions - what are you looking for in a team, what role do you play on teams, what kind of work environment do you best work in, scenario questions for situational advising."}, {"date": "24 Apr 2017", "title": "IT Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Simmons University (Boston, MA) in Mar 2017", "Interview Descriptions": "The Technology department was located in a remote 3rd floor area on the Simmons campus and there were no directions on how to get there. Email said to walk in through the front but then you would have to go back outside anyways in the back. You would have to ask someone for directions. Got there on time and process took 30-45 mins.\r\n\r\nMet with 2 people. The manager would ask a rundown of simple qualifications, scheduling, and the rotation process. You then move on to meet with another manager who asked and reviewed your resume.", "Interview Questions": "How would you handle a situation you don't know at the help desk."}, {"date": "13 Oct 2015", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Simmons University (Boston, MA)", "Interview Descriptions": "Interview with hiring manager, recruiter, and two people in my department I met with a few other people in the department. The process took the full day, but it was very much informative. I thought it gave me a great overview of the school and what they were looking for in the position and for the new person they were looking to hire.", "Interview Questions": "Program Management history\r\nWorking style"}, {"date": "22 Sept 2015", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Simmons University (Boston, MA) in Aug 2015", "Interview Descriptions": "Applied online and received an interview request less than 2 weeks later. No phone screen with HR or hiring team, which is unusual these days. In-person interview was very straight-forward and questions were pretty typical. Received an offer two days after the interview, and started a week later. Very quick process!", "Interview Questions": "How do you see yourself fitting in with the team?"}, {"date": "31 May 2015", "title": "Office Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Simmons University (Boston, MA) in May 2015", "Interview Descriptions": "I submitted application on Simmons career website in April, then received phone interview notification after 3 weeks. I talked to associate director of undergrad admission. The questions are common and standard, but I was rejected after one week. so it took 4 weeks process.", "Interview Questions": "Why you fit this position？ How much you know about Simmons?"}, {"date": "13 Nov 2018", "title": "IT Co-Op Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Simmons University (Boston, MA) in Dec 2014", "Interview Descriptions": "Basic general questions to get to know you better. Know what you put on resume for any curve balls that could be asked. Customer Service should be your main priority.", "Interview Questions": "Questions vary...but usually they ask about your past job experiences."}, {"date": "27 Sept 2013", "title": "Applications Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Simmons University (Boston, MA)", "Interview Descriptions": "Very thorough. They have a lengthy online application through the school's site, then a phone interview, then an in-person interview and also a group interview. They ask a lot of great questions that cover personal, professional, and case study experiences.", "Interview Questions": "Describe a time you made a mistake and how you went about resolving it. "}, {"date": "12 Nov 2015", "title": "Technology Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Simmons University (Boston, MA) in Sept 2013", "Interview Descriptions": "I interviewed with one person but my colleagues had a few rounds of interviews with management. It was simple and the interviewer was very friendly. I got the job on the spot. Right after the interview the showed me around the office and I met with the rest of management.", "Interview Questions": "Mostly questions about skill set and a questions about a mock phone call."}, {"date": "31 Aug 2013", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Simmons University (Boston, MA)", "Interview Descriptions": "I got the interview through an agency. (I was surprised that an HR department at a non-profit could not do their own sourcing and screening of candidates and would spend money on agency fees, especially in this weak job market.)  The first person interviewing me left me waiting for 25 minutes past the interview start time and didn't have a copy of my resume. The second person who interviewed me seemed distracted.", "Interview Questions": "Honestly, they didn't ask me that many questions. It was strange. For HR people, they were very weak at interviewing."}]]