[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "None", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "20 Jan 2021", "job_title": "Administrative Assistant in Croydon, England", "duration": "N/A", "pros": "Good and pleasant place to work", "cons": "Nothing that I can think of"}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Have enjoyed my time here", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "29 Aug 2021", "job_title": "Learning Support Practitioner in Canterbury, England", "duration": "N/A", "pros": "Some really excellent and passionate staff.\n\nThe students are great to work with.\n\nGood work/life balance, very long, frequent holidays.\n\nThe college offers free level 2 courses which you can do in your own time if you wish.", "cons": "Always understaffed with a high turn over.\n\nSome classrooms are extremely stressful environments with not enough support.\n\nAs an LSP you don't feel listened to.\n\nNot very organised and communication is poor."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Great work environment", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "4 Jan 2021", "job_title": "Student Ambassador in Canterbury, England", "duration": "N/A", "pros": "Fair wage, good work environment, good staff, polite service", "cons": "Limited work, staggered breaks, not enough training for some workers"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Very poor senior management", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Nov 2016", "job_title": "Lecturer in Canterbury, England", "duration": "N/A", "pros": "Great location, nice campus, good canteen, modern building. Friendly security staff, modern gym and decent library.  Place is kept clean and is well maintained.", "cons": "Was led by a poor principal who simply did not have a strategic vision for the future of the college. This meant that a lot of money appeared unaccounted for' and un-affordable projects were embarked on e.g. a new gym building. My former (middle) manager was a bully, which was OK, but she was also completely incompetent in all aspects of her job. She even seriously suggested singing to the learners as an innovating teaching technique. \r\nUnfortunately far to many staff do not understand how to read, understand and implement course specifications. This is reflected in poor Ofsted reviews and verification. When they finally had someone (me) who was an important part in creating an Ofsted grade 1 programme (at a different educator), the resistance was unimaginable.  The external verifier praised the work I had did and annihilated the work of the so called expert mentor I was assigned. Sadly, this is kind of thing is inherent within some FE departments.\r\nThe was so little money that instead of buying resources to teach from, staff are told to spend untold hours reinventing the wheel in their own time creating resources that should simply be bought in. Furthermore, at one point we had no photocopying paper."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "I didn’t realise how unhappy I was until I gave my notice in and knew I didn’t ever have to go back.", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 Aug 2020", "job_title": "Support Staff in Canterbury, England", "duration": "N/A", "pros": "EKC Group as a whole have some good policies in place for staff.", "cons": "Canterbury College has a very toxic atmosphere. Some departments more than others. Especially supported learning, where management should be understanding and caring. However this is not the case. If your face does not fit and you stand up for your beliefs and the students you get targeted and pushed out by upper management. The turn over of staff is high and many people have complained and reported the behaviour of management but it never changes, just gets over looked. Low level managers are expected to line manager lots of staff with no management experience or training, meaning they can not give the staff the support they need, especially working in a high stress environment."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "An Arrogant, Uncaring and selfish organisation", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Sept 2015", "job_title": " in Canterbury, England", "duration": "N/A", "pros": "Much money has come in the way of grants, so the resources are reasonably good for an underperforming and progressively less relevant, declining sector, and poorly run business due in part to the increased popularity of sixth form training opportunities in schools.", "cons": "Lets start with their Interview process: Rather than stagger interviews like most normal organisations usually do, they get everyone in at once. Not for a group interview which would perhaps justify this choice, but rather to have all interviewees just hang around for three hours for when this disorganised bunch feel like seeing you for the ten minute interview you receive. As if you have nothing better to do all day. Their inability to organise themselves (especially in the HR department) where they won't disclose any helpful information, such as oh I don't know,  when might the start date be, as well as their contempt for the interviewees is immediately evident at the start of the unnecessarily long-winded and rediculous interview process.  I attended an interview a couple of years back during a sweltering summer, and gave a presentation in a suit, in a hot room. They all had their glass of water that they frequently sipped without even considering offering the performer (me) anything to drink. I had to ask after I could no longer get words out due to such a dry throat from the heat. Others I know have experienced the total disregard for the feelings of others during the interview process and have been shown the total disinterest in the people who apply for a job. I might understand if this was a top job at Buckingham Palace, but frankly its for a sinking ship of an organisation, where senior members often comment on the abnormally high rate of full time staff that are off on long term sickness. Its doubtful whether they will have many high value members of staff starting at the college any time soon given the way they treat staff members from the off, where most decent organisations at least try and sell their better sides at the beginning. Incompetence is evidently rife, staff moral is low. Senior staff members make themselves as unapproachable and as difficult to get hold of as Barak Obama for some unexplainable reason. Perhaps its an easier day to get through if all they do is keep out the way without considering the place may benefit from having some kind of effective leadership and organisational improvements to its processes of human resources and staff management. If you are a hard worked are a high value potential staff member they will probably overlook you, or even more likely hack you off so much by their obsurd recruitment disorganisation that you'll go somewhere else where you will be fully utilised and appreciated. Save the bother and look elsewhere from this archaic failing business in a shiny building"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Changing for the better. Public-sector inefficiencies.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 Mar 2018", "job_title": "Anonymous Employee in Canterbury, England", "duration": "N/A", "pros": "Fair treatment. E&D instilled. Patient management. Nice, safe environment.", "cons": "Bureaucratic inefficiencies and slow procedures. Sector-wide instability. Managers' immense workload."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Working at the College", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "15 Mar 2016", "job_title": "Anonymous Employee in Canterbury, England", "duration": "N/A", "pros": "The accommodation and resources are impressive. Colleagues are friendly, helpful and professional. The clear majority of students have a very good experience.", "cons": "Some of the HR processes are applied rather rigidly and lose the personal touch. Some of the quality processes are rather cumbersome."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Too many re-structures and redundancies", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "20 Sept 2012", "job_title": "Lecturer in Canterbury, England", "duration": "N/A", "pros": "- good LRC (Learning Resource Centre); LRC has developed a lot over the last couple of years. It has now wifi available for users. Eduroam is also available\r\n- big organisation\r\n- new buildings", "cons": "- no job security\r\n- some managers can fire staffs if they don't like them\r\n- in some departments/faculties racism is clearly evident"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "A dispassionate, corporate experience.", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "23 May 2016", "job_title": "Lecturer in Canterbury, England", "duration": "N/A", "pros": "The front-line staff are fantastic. You will never meet a more resourceful, creative bunch of people that give so much and receive so little.", "cons": "You feel expendable, paperwork is ludicrous and management are trying their best to keep their jobs. CC is an unfortunate victim of education turned business."}], [{"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "No progression", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "9 Feb 2017", "job_title": "Recruitment in Canterbury, England", "duration": "N/A", "pros": "Nice environment to work in and staff discounts/trips etc.", "cons": "poor pay, no progression, lots of jobs cut"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Facilities Coordinator", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "4 Feb 2019", "job_title": "Facilities Coordinator in Canterbury, England", "duration": "N/A", "pros": "Good benefits/ pension benefits there", "cons": "funding problems with FE/Goverment funding"}]]