[[{"date": "10 Jun 2023", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Moody Bible Institute (Chicago, IL)", "Interview Descriptions": "There were two rounds-- the first (with HR) was general, reviewing questions about faith, motivation, salary expectation, etc., and was conducted over the phone. The second was with the actual department, and involved position-specific questions and a position-specific exercise. This was followed by a paper-based general skills test. Overall, everyone was kind and polite, and the departmental interview seemed thorough and relevant.", "Interview Questions": "What does following Jesus mean to you?"}, {"date": "12 Mar 2023", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Moody Bible Institute", "Interview Descriptions": "Simple conversation that included past experience, work responsibilities, skills necessary to do the job. The interview included 3 current employees. The Admissions team has been in transition since COVID, but the changes sounded like new recruitment strategies are being implemented", "Interview Questions": "What are your strengths? How would you describe your work style? Do you enjoy talking on the phone? How would you handle a difficult or upset conversation?"}, {"date": "7 Nov 2022", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Moody Bible Institute", "Interview Descriptions": "Cumbersome process for RN interview. Had me take a basic skills assessment exam. This step seems unnecessary and outdated when applying with a BSN in nursing for a nursing position. Many questions about faith which is expected, and I do not mind. But when your answer does not fit neatly within their mindset, HR was unwilling to be forthright or work at best possible solution. HR just wanted to check a box and move on. Unfortunately, life is messy because we are messy(that's why we need Jesus!) and situations and life events don't always check a box. Apply here if you have a strong Christian faith that you can defend. And be prepared to be met with unreasonable HR department.", "Interview Questions": "Many questions about Christian faith walk"}, {"date": "27 Dec 2021", "title": "University Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Moody Bible Institute", "Interview Descriptions": "Great organization to work for. Values based but driven company. Enjoyed the people I worked with and the pay was competitive. Important things are kept important. Highly recommend it! Apply now.", "Interview Questions": "What do you most look for in a team setting."}, {"date": "14 Mar 2022", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Moody Bible Institute in Jan 2021", "Interview Descriptions": "The process took about 1 month from start to finish but everyone involved was professional and kind. All interviews and orientation were done virtually. I did have to send a follow-up email to confirm where we were in the process.", "Interview Questions": "Describe your faith background/ walk. "}, {"date": "21 Oct 2020", "title": "Digital Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Moody Bible Institute", "Interview Descriptions": "really good! they care about you as a person, and are very welcoming. they ask good questions and do not make you feel pressured. the nerves mostly went away. i like that they had two people interview me, because somehow that was more relaxing. one on ones can be more intense.", "Interview Questions": "What is your experience with teams?"}, {"date": "18 Jun 2019", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Moody Bible Institute", "Interview Descriptions": "There were two rounds of interviews, beginning with a group interview and ending with an individual interview. For the group interview, you sat before a panel of 3-4 staff members, and answered questions with 5-6 other applicants.", "Interview Questions": "Do you have a preference of which floor you'll be placed on? "}, {"date": "1 Apr 2019", "title": "Associate Dean Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Moody Bible Institute (Chicago, IL)", "Interview Descriptions": "They are very thorough.  Interviewed with many different people.  They were very kind and welcoming.  I felt like the day was evenly paced and have me a good sense about the people who work here.", "Interview Questions": "Tell me about your faith in Christ."}, {"date": "4 Jan 2018", "title": "IT Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Moody Bible Institute (Chicago, IL)", "Interview Descriptions": "Got an email to come in for an interview. Came in and interviewed first w HR then some weird number test in a closet space room. Then a small lecture from the HR lady about how important attendance to church is. Then met w the director then ate a small lunch w a conference room full of the IT people that pry into your religious background and kinda judge you on that. Very very odd and uncomfortable. Emailed the HR lady for a status on my application and never got a reply after all the effort and religious and prying they put you through.", "Interview Questions": "What’s your religion?"}, {"date": "4 Feb 2020", "title": "Student Locksmith Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Moody Bible Institute (Chicago, IL) in Nov 2016", "Interview Descriptions": "Phenomenal interview process with Tom Addison, first was phone, then Skype, and then I got hired for the job. Very personable and cares about the people! Tom does a great job at evaluating the skill set of a person and makes sure that they are a good fit for the team.", "Interview Questions": "What do you do with your free time?"}], [{"date": "23 Jun 2017", "title": "Dining Room Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Moody Bible Institute (Chicago, IL) in May 2016", "Interview Descriptions": "The interview process was pretty easy.  I got an email from the supervisor that they wanted to interview me, and we scheduled it within a week.  After that, I waited about another week and they got back to me by email.  It was a pretty quick ordeal.", "Interview Questions": "Why do you want to work here?"}, {"date": "4 Dec 2016", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Moody Bible Institute (Plymouth, MI) in Jul 2015", "Interview Descriptions": "Interviewed by Librarian, who asked questions concerning my skills, passions, explained me what was required of me and we discussed the hours I wanted to work and my flexibility. Then I was informed of the selection.", "Interview Questions": "Are you comfortable dealing with people?"}, {"date": "27 Apr 2017", "title": "Library Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Moody Bible Institute (Chicago, IL) in Oct 2014", "Interview Descriptions": "First step is a phone interview with HR, then if you pass that you'll come in for HR testing, an interview on campus with hiring manager and an interview with an HR rep.  Even with an open position that's been vacated, HR moves pretty slowly through this process - could take anywhere from 6 weeks to 3 months.", "Interview Questions": "How do you know you are saved?"}, {"date": "22 Jun 2015", "title": "Office Job Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Moody Bible Institute (Chicago, IL) in Aug 2012", "Interview Descriptions": "Honestly, since I am only part time, the interview process was not too hard. Really just present yourself well, and come across as yourself. Typically they like to hire students for the part time word, since they are part time and not full time and don't need benefits.", "Interview Questions": "They asked a lot about my past work history and things like, \"how did you handle this certain situation\"? "}, {"date": "23 Oct 2013", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Moody Bible Institute (Chicago, IL) in May 2012", "Interview Descriptions": "Received information from someone in the office about a possible job opening. Brought in Resume with application. Application was short. More focus was placed on the resume. Was called in for an interview within 3 days. Set up the interview for that week. Was called in for the position the following Thursday.", "Interview Questions": "What makes you stand out from others"}, {"date": "9 May 2016", "title": "Kitchen Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Moody Bible Institute (Chicago, IL) in Apr 2012", "Interview Descriptions": "The interview process was very easy and informal for me because I transferred to this crew from another kitchen crew. However, after the fact I participated in interviews for new employees, and the process was smooth. The interview was conducted in the SDR with some questions and analysis of class schedule to see if their schedule was a good fit for the crew. Then they took a walk through the kitchen as the daily tasks were described. The prospective employee was able to get a first hand look at the work they would be required to do. I thought this was beneficial to both parties making  decision about the individual being hired or not.", "Interview Questions": "Are you able to stand for long periods of time"}, {"date": "19 Mar 2013", "title": "Kitchen Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Moody Bible Institute (Chicago, IL) in Dec 2011", "Interview Descriptions": "They contacted me within a week of my application; we had one interview, it went very well. A cook and two supervisors interviewed me. They were very friendly. They basically wanted to make sure I was going to be a positive addition to the crew, and that I was willing to do whatever kind of task presented itself.", "Interview Questions": "I told them I had experience washing dishes, and they said, \"We wash pots, not dishes.\" I didn't realize there were very distinct crews in the kitchen. "}]]