[[{"date": "5 Jul 2023", "title": "Central Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Denver Health and Hospital Authority", "Interview Descriptions": "The interview wasn’t too bad. Easy and quick. To the point I might say. Most of the interview involved a review on the job and company. Only a few interview questions.", "Interview Questions": "Time you dealt with a difficult situation?"}, {"date": "2 Jul 2023", "title": "Registered Nurse (BSN - RN) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Jun 2023", "Interview Descriptions": "It was a chat with a Critical Care recruiter. He was nice and helpful although he didn’t know about my field of Psych he checked out the possibilities and said he’d send my info to the department. Haven’t heard anything and it’s been almost a week.", "Interview Questions": "Nothing, maybe since the recruiter wasn’t in my field."}, {"date": "30 May 2023", "title": "Mental Health Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Denver Health and Hospital Authority", "Interview Descriptions": "Disregard interview difficulty, etc., as this refers to the pre-interview process. I was given tests to take when applying for a technician position. One was a logic test, which was real hard. The other one was all kinds of questions about whether I'm more or less likely than other people I work with to be on time to work, be honest, etc. Everyone I work with is on time every day, very honest, etc. I fit in there. So I put \"about as likely\" which probably is what resulted in me not getting an interview. So word to the wise: if you apply here, answer all the questions \"much more likely\" so you get a higher score. I was trying to be real careful and honest with the questions but I guess you have to game the system instead.", "Interview Questions": "N/A"}, {"date": "31 May 2023", "title": "RN Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Denver Health and Hospital Authority", "Interview Descriptions": "15 team members in a room all asking scripted questions. These questions varied from traits to situational. Everyone took turns and assisted each other in the process. None of the questions were about The facility in general", "Interview Questions": "Situational questions related to leadership"}, {"date": "19 Mar 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Denver Health and Hospital Authority", "Interview Descriptions": "I had one interview with the manager and then an interview with a panel. I then did a shadow shift after. Overall it was a great experience. It is a great company to work for.", "Interview Questions": "Basic behavioral interview questions were asked"}, {"date": "20 Mar 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Denver Health and Hospital Authority", "Interview Descriptions": "Submitted resume, phone interview with the recruiter and another one with the manager, in-person interview- shadow day and then hired... took a while on their end to get everything processed.", "Interview Questions": "When was a time you need to dealt with conflict well? When was a time you were able to meet your patients needs.?"}, {"date": "19 Nov 2022", "title": "Enrollment Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Nov 2022", "Interview Descriptions": "1st interview - Phone screen. 2nd interview - I was required to call to have both interviewees conduct the interview. An extremely unprofessional process and laziness on behalf of the supervisor and team lead. I asked when a decision would be made and the supervisor indicated by the end of the week. I was advised that the recruiter would reach out if it was a yes or no. No follow-up on Denver Health's behalf so I withdrew my application from consideration. Overall, the entire process was pathetic and a waste of time. It seems like they are just cycling through representatives for this position which indicates an extremely high turnover rate from my experience working in customer service.", "Interview Questions": "The questions were basic and robotic. No energy or enthusiasm. The interview would have been completed in less than 10 minutes if I didn't ask follow-up questions."}, {"date": "16 Mar 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Denver Health and Hospital Authority (Denver, CO)", "Interview Descriptions": "It was over the phone and they were very respectful, kind and courteous as well as made tings go smoothly over all very nice and good company to work for. I would definitely recommend them.", "Interview Questions": "About my experience and why I wanted to work there"}, {"date": "18 Aug 2021", "title": "Certified Pharmacy Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Denver Health and Hospital Authority in Jul 2021", "Interview Descriptions": "Applied for position online, got an email from management about a week later asking to set up a phone screen. After a brief screening, I was invited to come for an in person interview. Had an interview and was told a recruiter would be reaching out for references. 2 weeks went by and heard nothing, reached back out to the hiring manager and they told me I would be receiving an email from HR for a reference check. I completed it and weeks went by with no word. I had to find out by checking online that I was not chosen. They need to do a better job of communicating through the process and being respectful of an applicant's time.", "Interview Questions": "How do you prioritize your work?"}, {"date": "5 Jun 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Denver Health and Hospital Authority", "Interview Descriptions": "Laid back interview with manager and 2 staff RNs. Asked typical \"tell me about a time when...\" questions.  Helped to have some knowledge of DH going into the interview. Overall very positive experience", "Interview Questions": "Tell me about a time when you went above and beyond for a patient."}], [{"date": "20 May 2021", "title": "RN Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Apr 2021", "Interview Descriptions": "1. Extensive phone screen with recruiter 2. Week later, Did not hear back  from hiring director 3. Reached back out to recruiter 4. Week later Heard back, scheduled phone interview w/ hiring director 5. Week later heard back 6. Week later heard back to schedule in-person 7. week later attended in-person 2 hours interview w/ staff and other managers. 8. week later recruiter asked for references. 9. 2 weeks later reached out to recruiter, confirmed references. 10. Month later not heard anything.", "Interview Questions": "STAR question format, focused on greatest challenges, greatest accomplishment"}, {"date": "26 Jan 2022", "title": "Social Work Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Feb 2021", "Interview Descriptions": "Had two interviews over Zoom because of COVID. First interview was with about 5 people who run the internship program, and the second was with 3 people who run the specific internship track I applied to.", "Interview Questions": "How much do you know about harm reduction models and what is your opinion of them?"}, {"date": "11 Mar 2021", "title": "Lead Data Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Feb 2021", "Interview Descriptions": "Hiring manager, team interview, director interview. All interviews done remote at this time. Hiring manager was first, then the team and director were one long meeting. As with all team interviews only a couple of people talked.", "Interview Questions": "Focused on the qualities they want in a team member and the ability to adapt to multiple projects"}, {"date": "5 Mar 2021", "title": "ER Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Jan 2021", "Interview Descriptions": "Interview process was very extensive and time staking. Interviewing process was two video interviews and the whole process took 36 days from application to decision. \n\nThe panel interviewed was interrupted multiple times by staff and communication regarding the decision was nonexistent after a 36 day process.", "Interview Questions": "What’s is your 5 year plan"}, {"date": "2 Jan 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Dec 2020", "Interview Descriptions": "Overall a pretty great interview process. Started off with a screening interview, then an interview with the primary researcher, then a group interview with some of the research team. The whole process from applying to getting the offer took about a month and a half, so a pretty lengthy process.", "Interview Questions": "Explain a moment when you had to prioritize multiple projects? "}, {"date": "14 Oct 2020", "title": "IT Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Sept 2020", "Interview Descriptions": "I completed two separate rounds of interviews, with the first primarily being a personality screening interview, and the latter being more of a technical knowledge interview in front of a small board. (The hiring manager, an HR rep, and a Tier 3 IT Specialist)\nI was told approximately a week after that second interview is when they sought to make a decision, and all candidates would be reached out to stating whether or not they had been selected for the position. A week later I had heard nothing either way. I attempted to contact the HR rep (who I had been in contact with since the beginning) a few days later, and again heard nothing back. \nAll communication attempts since have failed.", "Interview Questions": "What are the steps you follow to solve a technical problem?"}, {"date": "13 Aug 2020", "title": "Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Denver Health and Hospital Authority", "Interview Descriptions": "Applied online and was contacted for an interview shortly after. The interview was a panel with 7 people going around in a circle asking questions. Intimidating at first but really very chill overall and a great interview experience.", "Interview Questions": "What is your biggest pet peeve?\r\nHow do you respond to criticism?"}, {"date": "31 Aug 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Aug 2020", "Interview Descriptions": "HR called and made a phone intervew. HR asked simple questions and explained their benefits and pay scale. Several days later, HR set up an interview with the unit manager. It was in person with manager, charge nurse, and educator. They asked questions. Couple of days later, HR offered the job.", "Interview Questions": "Tell me about your background "}, {"date": "16 Jun 2020", "title": "RN New Grad Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Denver Health and Hospital Authority in Jun 2020", "Interview Descriptions": "Applied online and within one week they emailed me to schedule an interview. I did a phone interview, and when they called for my interview they seemed as though they were in a rush and did not sound excited to be interviewing me nor did they take the time to show any personality whatsoever over the phone. They asked me about three questions total. I am a competitive applicant and I can usually easily connect with hiring managers, in person or over the phone, so this set a weird tone for this hospital. They also did not email me to notify me that I was not selected.", "Interview Questions": "What is your biggest disappointment?"}, {"date": "7 Oct 2020", "title": "COVID-19 Screener Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Jun 2020", "Interview Descriptions": "It's a behavioral phone interview. They will ask you about how would you react and deal with certain conflicts and situations and how have you solved them in the past. It's a very simple process of one interview and then some background check with drug screening.", "Interview Questions": "How would you deal with a conflict customer?"}], [{"date": "8 Feb 2020", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Denver Health and Hospital Authority (Denver, CO)", "Interview Descriptions": "Phone screen, followed by an information coffee shop interview, then a panel interview with Director of the PMO, managers, and senior project managers.  Questions focused on my experience, my work styles, and my career goals.", "Interview Questions": "Why are you interested in Denver Health?"}, {"date": "11 Jan 2020", "title": "Operations Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Jan 2020", "Interview Descriptions": "I had a very hostile conversation with the recruiter that called me. She would not stop asking about salary for about half the conversation and I was telling her I would rather discuss the position and if it’s a good fit instead of talking about money. When I said it was about more than money she responded sarcastically “so you would take 20,000 a year?” I’ve never had a recruiter be this rude. She was incredibly short with me and had very little insight. I would recommend you know some information about the company because she was drilling about what I knew about the company. Made me very uninterested in working for this company. Best of luck!", "Interview Questions": "What have you learned about Denver Health?"}, {"date": "24 Oct 2019", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Denver Health and Hospital Authority in Oct 2019", "Interview Descriptions": "The interview was set up as a group interview with the therapy team (supervisor, lead, team member). They provided a background of the work environment and asked a series of questions based on my experiences.  Afterwards, we took a tour of the hospital.", "Interview Questions": "Tell us about a time you had a great relationship with a patient"}, {"date": "2 Oct 2019", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Sept 2019", "Interview Descriptions": "I received an email to set up a phone interview. The phone interview was a simple screening of a few questions.  Received a call a few days later for an in person interview.  I met with a panel of people within the clinic and had 3 pages front/back worth of questions to answer while they took notes.  Mostly behavioral interview questions. Didn't receive a response back about the position until I reached out to them via email", "Interview Questions": "Describe a time you made a mistake and how you handled it"}, {"date": "24 Jul 2019", "title": "Enrollment Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Denver Health and Hospital Authority (Denver, CO)", "Interview Descriptions": "I checked in at the front desk, waited about 10 minutes or so, and was taken up to the office of one of the people interviewing me. They then jumped into interviewing me. The interview took about 15-20 minutes total and seemed pretty general. I wish those who had interviewed me had introduced themselves and said what their titles were. I also wish they had spent a little more time actually trying to get to know me versus just speeding through the interview questions. Once done, they told me what I could potentially expect in terms of the interview advancing.", "Interview Questions": "How have you handled conflict at work?"}, {"date": "24 May 2019", "title": "Behavioral Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Denver Health and Hospital Authority (Denver, CO) in May 2019", "Interview Descriptions": "Phone interview then in person interview. There were 6 questions and they were all pretty straight forward. Questions included: do you have any experience in this field? If so, how much.", "Interview Questions": "What do you know about us?"}, {"date": "14 Mar 2019", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Denver Health and Hospital Authority", "Interview Descriptions": "Had a phone 30-minute phone interview with a recruiter first. She asked me about my work history and why I was interested in Denver Health. I was told that I was being passed on to the hiring manager for an in-person interview, and would be contacted in a day or two to schedule. However, the it was almost 2 weeks before the hiring manager contacted me. I met with her a few days later for an hour long interview that consisted of behavioral based questions. I was given a tour of where I would potentially be working and introduced to the team. The hiring manager told me that they were interviewing candidates for the next week, and I would know where I “stood in the process” after that. I didn’t receive a response to my inquiries or a follow up for almost a month. Overall, it seemed very disjointed and unorganized. They obviously weren’t in as big of a rush to fill the position as they made it seem and weren’t very good at sticking to their deadlines regarding follow up", "Interview Questions": "What do you know about Denver Health?"}, {"date": "4 Apr 2023", "title": "Health Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Mar 2019", "Interview Descriptions": "Heard back within a week had two interviews and then ultimately received offer within a couple of weeks. Very fast process. Had a general HR meeting and then met with two team embers including supervisor.", "Interview Questions": "Experience in health education field"}, {"date": "28 Jan 2019", "title": "Compliance Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Denver Health and Hospital Authority", "Interview Descriptions": "Phone interviewer did not seem very interested in my qualifications and wanted to describe my work history. The interviewer did not sell the benefits of working at Denver Health. Although I am very well qualified, the interviewer was trying to disqualify me for the position, \nperhaps they had an internal candidate already chosen already. Phone interview lasted 30 min. Private industry interviews are more engaging than government positions offered by Denver Health.", "Interview Questions": "Tell me about yourself in the resume."}, {"date": "27 Sept 2018", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Sept 2018", "Interview Descriptions": "I applied online and the hiring manager reached out within a week.  The interview was very casual and the hiring manager was very friendly. It was a short interview, and none of the interview questions were too hard. They were pretty standard interview questions.", "Interview Questions": "Tell me about your previous CNA experience."}], [{"date": "11 Sept 2018", "title": "Health Program Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Denver Health and Hospital Authority in Aug 2018", "Interview Descriptions": "First I completed an online application that had standard questions and requirements. I was then was invited to complete a 30-minute phone screen, and then an in-person interview (had to give a presentation as part of it).", "Interview Questions": "Describe a time you had to make a decision under pressure."}, {"date": "4 Mar 2019", "title": "Medical Interpreter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Denver Health and Hospital Authority in Jun 2018", "Interview Descriptions": "Long but worth it, refrences and background took 2 months alone. There are great benefits and a great atmosphere. Love working here with diferent people and staff with diverse backgrounds.", "Interview Questions": "How I started to interpret?"}, {"date": "10 May 2018", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Denver Health and Hospital Authority", "Interview Descriptions": "Easy interview long process to get hired. Back and forth with HR on salary. Dealing with HR wasn’t great and the salary at DH isn’t competitive compared to other organizations in the area.", "Interview Questions": "How do you deal with workplace adversity"}, {"date": "26 Nov 2020", "title": "Addictions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Jan 2018", "Interview Descriptions": "Panel interview with three or four people, usually counselors that are available. It can be a long process from interview to hire but the benefits and pay can be worth it.", "Interview Questions": "How do you feel about working with a population of people experiencing homelessness?"}, {"date": "17 Dec 2017", "title": "Trauma Registrar Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Denver Health and Hospital Authority", "Interview Descriptions": "Applied online, contacted roughly a week later by a manager expressing interest in doing an interview, group style interview with up to ten people from the department all asking a variety of questions.", "Interview Questions": "How do you handle conflict with another employee?"}, {"date": "12 Dec 2017", "title": "Spanish Medical Interpreter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Dec 2017", "Interview Descriptions": "It only took a week for someone to call me for the initial phone screening. A week later I had a Skype interview with the supervisors of the department. It was 45min and I felt it was a pretty good interview process. Unfortunately they had a requirement for FIVE references, TWO of which had to be managers or supervisors. I was not able to continue because out of the 3 previous jobs I had all 3 supervisors are retired and I have no way of communicating with them and asking them to be references. Technically I could have added my two current supervisors but I do not want them to know I'm searching for a job. They are strict with their reference requirement so I chose not to continue with the interview because I would have had to list my current supervisors as references.", "Interview Questions": "Have you ever had a disagreement with a colleague? If yes, what was it and how did you solve it?"}, {"date": "12 Sept 2018", "title": "IT Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Aug 2017", "Interview Descriptions": "Not the most technical interview. They'll ask basic questions about how you might attack repairing a printer, but their questions mostly focus on customer service. They want to find out what your personality is as much as they want to confirm your technical background/aptitude.", "Interview Questions": "If you get a call from an upset employee who is having trouble with their system/equipment/pc etc., what how would you cal them down and get to finding the solution as quickly as possible. "}, {"date": "1 Jun 2017", "title": "Medical Assitsant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Denver Health and Hospital Authority", "Interview Descriptions": "I applied online and had received an email just a few days later wanting to set up an interview. I had one phone interview explaining the job and asking me questions about myself. The second interview was in person and was all behavioral type questions based on personal experience.", "Interview Questions": "Tell me about a time that you made a mistake at work. Did you own up to it? What steps did you take to make sure that it did not happen again?"}, {"date": "23 Feb 2018", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Oct 2016", "Interview Descriptions": "Two set of interviews one by phone if employer interested it will be followed by an in person interview with a tour of the facility that you will be working out of if hired.", "Interview Questions": "Pharmacy experience, pharmacy work-flow and volume as well any obtained skills related to pharmacy."}, {"date": "1 Apr 2020", "title": "EMT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Oct 2016", "Interview Descriptions": "It was a group interview, with many people coming in and out of the interview asking questions on how I have handled past situations and how I would handle future situations.", "Interview Questions": "How have you handle and coworker disagreement in the past?"}], [{"date": "16 Sept 2016", "title": "Nuclear Medicine Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Denver Health and Hospital Authority (Denver, CO)", "Interview Descriptions": "The interview process was very easy and pleasant. It quite easily was one of the easiest interviews I've ever had. Upon arriving in the department, I felt very welcomed by the whole team. I was able to meet with several different members from different areas of the department.", "Interview Questions": "No formal interview questions asked. Just came in to see if I could carry on a conversation and jive with the crew."}, {"date": "17 Jul 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Denver Health and Hospital Authority (Denver, CO)", "Interview Descriptions": "Great. Very detailed, open, encouraging and honest. The hospital staff was very inviting. Team atmosphere. The position was explained in detail from the start of a clinic day to end. \r\n\r\nAble to meet the staff and asked questions and they asked questions of my background, work ethics, abilities and capabilities.", "Interview Questions": "Why the change."}, {"date": "19 Jul 2018", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Denver Health and Hospital Authority in Jul 2016", "Interview Descriptions": "It was inconstant with the IT process, even thou Epic is part of the IT department.  The communication between the Epic team and other IT teams are rare and not favorable.  The  \r\njob posting does not identify which team it is for.", "Interview Questions": "why do you want to work for our team."}, {"date": "1 Aug 2016", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Jul 2016", "Interview Descriptions": "I sat with a panel of 5 people including supervisor and lead techs. They had a list of questions to ask about my background, work habits, personality and technical knowledge, but it was the most enjoyable interview I've ever had. It was like meeting new friends. Afterwards, I was given a tour of the areas of the lab I would be working in.", "Interview Questions": "What organism would you be looking for if you plated to Chocolate Agar?"}, {"date": "29 Jun 2016", "title": "Senior Grant Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Denver Health and Hospital Authority (Denver, CO)", "Interview Descriptions": "I applied through an outside recruiter and went through two in person interviews. The process was pleasant and went very well. Overall it took about six weeks from application to offer, but they stayed in regular contact throughout the process.", "Interview Questions": "If you had to complete a task with minimal training, how would you go about it?"}, {"date": "27 Jun 2016", "title": "Epidemiologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Denver Health and Hospital Authority in Jun 2016", "Interview Descriptions": "I applied online, and was asked to complete an online assessment. The assessment was a series of logic-type questions. A couple days later, I was contacted and completed a brief phone screening. Immediately following the phone screening, I was invited to participate in a Skype interview with a panel of interviewers. They asked 10 total questions, and it appeared that these were the same 10 questions every interviewee was asked. All the questions were fairly straightforward regarding my skills, experience, and work style.", "Interview Questions": "What type of work environment do you prefer?"}, {"date": "18 Aug 2016", "title": "Chief Technology Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Denver Health and Hospital Authority in May 2016", "Interview Descriptions": "Standard interview -- apply on line, invitation to take some personality, skills and reasoning tests (online), then a panel phone interview.  Several employees at different levels were present on the panel interview.  The phone interview lasted just under 30 minutes. The longest part of the process were the assessment tests (administered by CEB); these took about 90 minutes in total.\r\n\r\nAll of the interviewers were very professional, and the interview process made it clear that the team at DH is very interested in getting exactly the right person for their current needs.", "Interview Questions": "Describe how to move a data center."}, {"date": "6 Mar 2019", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Denver Health and Hospital Authority (Denver, CO) in May 2016", "Interview Descriptions": "I received a call that my application was pulled from their system for this position, which I didn't apply. It was a group/panel interview by the supervisors within the Admissions and Registration department. They all took turns asking questions. I can't really remember. But I remember preparing for it by researching the company which they liked.", "Interview Questions": "What are your long term goals?\r\nWhat was a mistake you made and how you went about solving it?"}, {"date": "22 Apr 2016", "title": "Chief Technology Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Denver Health and Hospital Authority (Denver, CO)", "Interview Descriptions": "Unfortunately Denver Health uses an antiquated parsing engine for resumes as seems to be fairly prevalent in the hiring world for larger companies.  The process for me was working through their initial intake system, contacting the hiring manager and working through their \"assessment\".\r\n\r\nUnfortunately while I invested my time in attempting to communicate with the team and working through their assessment interview, Denver Health did not communicate back and only provided a form letter at the end.  Very unprofessional for the level of position they are evaluating and for the amount of time investment they request from applicants.", "Interview Questions": "They asked me to evaluate video recordings of potential employee interactions."}, {"date": "9 Feb 2017", "title": "Physician Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Apr 2016", "Interview Descriptions": "Behavioral interviewing is the most utilized interviewing method at Denver Health. Be prepared to answer open ended questions while providing personal experiences. The best way to prepare to is research and find behavioral interviewing questions online and practice coming up with real life, personal experiences you have to share.", "Interview Questions": "Talk about a time when you had to work closely with someone whose personality was very different from yours."}], [{"date": "15 Jan 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Denver Health and Hospital Authority", "Interview Descriptions": "I was interview over the phone. I have been on a hiring panel though. We look for energetic people with experience. There are usually 5 interviewers at the table with one candidate.", "Interview Questions": "I didn't have any difficult questions"}, {"date": "24 Jan 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Jan 2015", "Interview Descriptions": "Met with both manager and asst manager. Asked behavioral questions. Was already an employee. Was promoted from within to RN. Was told there were 2 positions available. 5 of us interviewed and we all got offers.", "Interview Questions": "Name one time you went above and beyond."}, {"date": "20 Feb 2018", "title": "Licensed Clinical Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Apr 2014", "Interview Descriptions": "Contacted and questioned by recruiter first. Moved on to a phone interview with direct supervisor and director.  Then moved on to a in person interview with supervisor and one other team member. Contacted by recruiter for the offer.  Negotiations were done by  supervisor and director. They previously used to give an online test before the application was submitted but they don't do this anymore.  They will also ask you if you have a disability.", "Interview Questions": "I can't recall exactly but it included my clinical experience, communication style with colleagues, why Denver Health..."}, {"date": "29 Mar 2014", "title": "Account Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Denver Health and Hospital Authority (Denver, CO)", "Interview Descriptions": "HR is very courteous and contacts you to discern if there is a good fit, before taking up your time to complete an online assessment. Many other jobs I applied for wasted my time with the assessment first. With the go-ahead you are given a very interactive management test online,  complete with example employee issues, done through video, and opportunities to respond and indicated how you would lead. Next is a panel interview in person, and if narrowed, an interview with your potential direct report or future boss. Pleasant experience for sure.", "Interview Questions": "One line of questioning asked how you would solve a problem, then continued to \"remove\" the tools you mention using. \"how would you do it without that tool? And without that one?\" Didn't make sense to me."}, {"date": "8 Feb 2014", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Denver Health and Hospital Authority", "Interview Descriptions": "One phone interview, one in person interview. The team was great. Recruiter was not horribly responsive, but the supervisor in charge of hiring was.", "Interview Questions": "The questions were pretty standard - looking for content knowledge, cultural fit, and big picture thinking. "}, {"date": "28 Jul 2013", "title": "WIC Counselor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Denver Health and Hospital Authority", "Interview Descriptions": "Received phone call 2 wks after sending appliaction which was very long and took 4 online tests. Hiring manager asked a few questions over the phone, like, why was I intersted in position, tell me aout yourself, etc. then she proceeded to invite me for an interview.", "Interview Questions": "Tell me about a time when you didn't suceed in a task given to you by your manager and how did you handled it?"}, {"date": "10 Apr 2013", "title": "Lean Facilitator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Denver Health and Hospital Authority", "Interview Descriptions": "Interview, phone interview, and panel interview", "Interview Questions": "how long will I be there."}, {"date": "3 Oct 2017", "title": "Behavior Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Apr 2013", "Interview Descriptions": "The manager and another employee was present in the interview, they mostly basic questions such as How to handle conflict, tell something about yourself. It was fairly easy and relax interview.", "Interview Questions": "How did you handle conflict with a colleague"}, {"date": "23 Nov 2012", "title": "Desktop Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Denver Health and Hospital Authority (Denver, CO)", "Interview Descriptions": "Interviewer was condescending and not well groomed", "Interview Questions": "How can you make our organization better "}, {"date": "10 Aug 2012", "title": "Instructional Design and Training Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Denver Health and Hospital Authority (Denver, CO)", "Interview Descriptions": "There is a 45 minute \"Talent Plus\" phone interview process that you must pass or the process stops.  It simple to pass, just present yourself as a recruiter or salesperson would do.  Make your responses proactive and team oriented.", "Interview Questions": "I didn't experience any; however, I adequately research my subject well in advance."}], [{"date": "10 Feb 2012", "title": "Applications Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Jan 2012", "Interview Descriptions": "The hiring manager and his analyst called me for about 20 minutes to discuss the position and wanted to access my interest in the job.  They invited me for an onsite interview at the end of the phone call.\r\n\r\nThe onsite interview was a 2 hour panel interview with the manager and about 8 of his staff.  The questions weren't very technical.  They asked me stuff about dealing with work situations and soft skills.  Then they gave me a short tour of the department and the analyst showed me some of the systems that I would be working on.", "Interview Questions": "Describe working with a difficult co-worker and how you deal with it."}, {"date": "22 Jun 2014", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Aug 2011", "Interview Descriptions": "Phone Interview.  Be care of what they ask, and think about what want to hear.  I know this isn't right, but there are certain answers an employer wants.  Like Team Player, go the extra mile for your job, etc.", "Interview Questions": "Would you tell on a friend who was doing wrong on the job.  Answer yes.  Even though you might go talk to them about it and work on correcting them, the management there wants to know.."}, {"date": "2 Dec 2011", "title": "Paramedic Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 days. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Jul 2011", "Interview Descriptions": "First came the phone interview which consisted of your standard personality test questions, ie have you ever stolen, do you like job, what do you like to do for fun, etc. This lasted and hour with the promise of a call back.  The second portion was an in person interview which consisted of two parts. The first part was a sit in with two Denver Health Paramedics. Three scenarios were presented and I was given an unlimited time with each scenario.  The panel made me feel very comfortable and assured me to just relax and have fun.  This part took me about 30-45 minutes.  The second portion was a meeting with three of the chiefs.  This part was all about my history, and my work experience and where I came from.  The chiefs were also very nice and reassuring making the entire process very easy.  After this was wrapped up in another 30-45 minutes, I was told I would receive a call very soon.  The next day I got the call with a job offer.", "Interview Questions": "What are you looking to get out of employment here?"}, {"date": "12 Oct 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Denver Health and Hospital Authority in Oct 2010", "Interview Descriptions": "My first and enduring impression was that the manager I had contacted wanted me to interview and get started, and the whole process was held up by the nurse recruiter. First there was a phone interview with TalentPlus--look it up online, I'm not sure if they use it anymore. Some people don't pass it, it basically asks you about your personally habits and aspects of your personality (i.e., \"do you find yourself tidying your workspace even if you didn't creat the mess?\", obvious answer being,\" yes I sometimes do\"). Then the interview with the manager was set up within a few weeks. I was offered the position immediately, but it took emailing/calling the nurse recruiter, and calling the manager to call the nurse recruiter before I received the offical offer 1 month later.", "Interview Questions": "How I deal with conflict"}, {"date": "13 Jun 2010", "title": "Research Assistant II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Apr 2010", "Interview Descriptions": "Brief phone interview followed by a in-person interview about two weeks later with two of the managers.  Interview was relaxed but they stumped me on a few questions.  \"What is something that you do great everyday?\"   I have been asked this question twice now from this organization.", "Interview Questions": "What is something great that you do everyday?  "}, {"date": "24 Jul 2011", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Oct 2009", "Interview Descriptions": "After filling out the application and personality test online I was called by TalentPlus. This is an outsourced company that inititated my \"first\" interview. Most of the questions were the same that you'll find on the personality test and it took about an hour. After I passed the TalentPlus interview, I was then called by the supervisor of the area that I applied. Went on-site for an interview and after reference checks and verification of previous employment, was offered the postion from the HR department.", "Interview Questions": "If you won the lottery, what would you do?"}, {"date": "13 Apr 2011", "title": "Lcsw Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Denver Health and Hospital Authority (Denver, CO) in Aug 2009", "Interview Descriptions": "First had to go through an outside agency, Talent Plus, which involved an interviewer calling my home and asking questions such as \"Would you say you are generally a happy person\", and \"if you noticed a co-worker stealing would you report it?\".  (Despite the easy of this process a lot of people fail the talent plus interview due to answering \"it depends\" on too many questions).  I was then called back for an initial interview with the social work department and had a panel interview with the department that had an opening meeting my experience.", "Interview Questions": "How do you handle down time?"}]]