[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Jul 2022", "job_title": "Digital Mentor in Brighton, England", "duration": "N/A", "pros": "They really look after the mental health of their employees and the atmosphere is super supportive and welcoming.", "cons": "I'm looking forward to the team growing to build on what we already have!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Glad It's Over", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "10 Jan 2019", "job_title": "Anonymous Employee in Brighton, England", "duration": "N/A", "pros": "I felt the management was terrible but it did bring the team closer together \r\n\r\nAnd there is a nice cafe just below the office", "cons": "In my opinion, the managment are delusional and I believe the way they talk to and act around their staff is wrong.\r\n\r\nI worked at Ditch for almost a year and on my last day Liam didn't even give me a goodbye. - I think this perfectly sums up his behaviour which I felt was childish and at times spiteful. \r\n\r\nBy the end of my time working there I felt that Liam would be quick to put down the majority of my work and verbal input to conversations.\r\n\r\n\r\nWhile writing this review I am also having to be very cafeful, using terms like \"in my opinion\" and \"I belive\" becuase I have revived a letter and email threatening legal action if anything defamitory is posted online. \r\n\r\nI did want to site the other dissatisfied reveiws but I am concerned that would subject me to the same legal threats so I won't, i won't suggest anybody reading this review to go read the other negative reveiws and make your own opinions, I won't do that"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Rewarding work - great team", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "27 May 2017", "job_title": " in Brighton, England", "duration": "N/A", "pros": "I have worked here for 4 years and really value being able to work across the entire team (regardless of specific role) and contribute on all projects and campaigns. Excellent opportunities to really carve and develop your own role. Great office culture despite the serious nature of the work.", "cons": "More staff so we can reach even more young people that need support."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great culture, supportive team, all over great anti-bullying charity", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Nov 2018", "job_title": "Digital Delivery Manager in Brighton, England", "duration": "N/A", "pros": "- Positive culture\r\n- Actively encouraged to take days off for physical and mental health\r\n- Bright and airy office\r\n- Snacks provided\r\n- Mature, friendly supportive team\r\n\r\nHaving read previous reviews left by trolls, I have to say that none of them marry up to my experience at all. Having worked here for over 6 months, I can already say that this is my dream job working for a fantastic team.", "cons": "- Like previous reviews, the main downfall is the team is still growing so sometimes it takes a bit longer to bring things to market"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "All round, a fantastic time at Ditch the Label anti-bullying charity", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Jan 2019", "job_title": "Marketing and Communications in Brighton, England", "duration": "N/A", "pros": "Having read previous reviews before joining the team, I was nervous and decided to come for an interview. Straight away I picked up on the atmosphere and vibes and knew they were hogwash. I've been here for 6 months now and wanted to share my honest experience of working at Ditch the Label.\r\n\r\nDitch the Label is my 4th office job and I have to say that the ethos of Ditch the Label really permeates across the team and leadership.\r\n\r\n- Collaborative, with team morning briefs 3 times a week\r\n- Beautiful, open plan and huge office\r\n- Progressive leadership who aren't bothered if you're occasionally late or need a last minute day off\r\n- Mental health days off actively promoted as well as days off for physical health\r\n- Team socials\r\n- Being able to help young people and hearing some of the anecdotes and stories that come in. I'm not in a support mentor role but still witness the amazing work they do\r\n- Graze snacks\r\n- Coffee machine \r\n- All around a beautiful environment to work in\r\n- Loads of breakout areas in the office if you fancy a quieter space to work \r\n- 28 days holiday on top of company holidays over Xmas, they are also pretty relaxed when it comes to the amount you can take off. You are encouraged to use it all at the end of the year which I thought was nice\r\n- Quarterly checkins with leadership\r\n- Regular sessions with trustees and I've had chance to work on projects I never dreamt of, lots of growth opportunity and success is shared", "cons": "- The amount of flack the charity and its leadership come under from people who disagree with our work and ethos. It's ironic really.\r\n- Like other genuine reviews, I do wish the team was a bit bigger so that we could get more done."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A lovely place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Nov 2018", "job_title": "Head of Education in Brighton, England", "duration": "N/A", "pros": "Having been at Ditch the Label for a few months now, I can really say that I love it here. The team are so supportive and friendly, the job is really rewarding, and the haribo are a bonus too!", "cons": "Can’t really think of any to be honest. The office environment is really open and our work often involves collaboration, so if you’re not really a team player then it might not be the place for you."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "A great place to work.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Jun 2017", "job_title": "Digital Marketing Executive in Brighton, England", "duration": "N/A", "pros": "Good career progression. A really supportive, fun environment. Nice team and great office by the seaside.", "cons": "Can be pressurised at times as the team is small but it means you get a real overview of how the company works."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "False, Disgraceful CEO", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Dec 2018", "job_title": "Coordinator in Brighton, England", "duration": "N/A", "pros": "I don’t have any to be honest", "cons": "Without delving into it too much because the other two dissatisfied reviews were 100% accurate and highlighted my exact experience at Ditch the Label, but my God what a toxic place to work.\n\nLiam the CEO is a bully himself. He is self obsessed and his behaviour and attitude towards people is unprofessional and embarrassing. The power completely has gone to his head and honestly I couldn’t tell you what the donations go towards other than his designer life.\n\nThis job contributed to the downfall of my mental health and please please think about your wellbeing before applying to this hellhole."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Anti-bullying charity run by a bully", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Apr 2017", "job_title": "Anonymous Employee in Brighton, England", "duration": "N/A", "pros": "I literally cannot think of one pro.", "cons": "When I applied for this job I expected to find it an enriching, rewarding experience (it being a charity after all) - I expected to find a team who were working hard to help people, a working environment that was supportive, enjoyable and most of all, professional. \r\n\r\nIt saddens me still that what I found at Ditch the Label, within the first couple of days, was in fact the complete opposite of this: \r\n\r\n- First and foremost the CEO is the most egotistical, rude, self-obsessed person I have ever come across in a professional capacity. He talks down to all of his staff, humiliates them in the office and in meetings, talks badly about his staff (past and present) in front of other colleagues and then claims that is was merely 'banter'. As someone running an anti-bullying charity, you would think he would be aware that he is causing offence. Many staff have left in tears and not returned to the workplace. Staff that have left are then talked about in the most unprofessional manner in front of present staff (and many an untruth said about them - stealing, lying, incapable at work etc).\r\n\r\n- The staff are EVER changing for such a small team. No one can stand the work environment here for too long and many leave in tears (like myself) and suffer from such stress and fear, induced from this poisonous work environment they have to get signed off of work. \r\n\r\n- Expect ZERO training for your role (even if it says full training is offered when you apply) and then to be thrown in at the deep end, if you can't swim, expect to be humiliated.\r\n\r\n- You can work as hard as you can here - really give it your all - and it won't be appreciated. The hours are 9.30am - 6pm, yet you will be judged and made to feel bad for leaving at 6pm, even though the CEO swans in and out when he wants - goes for spray tans, cosmetic surgery, hair cuts, eyebrow threading during work hours whenever he wants and to be honest, while the team are working hard he will sit there taking selfies, strutting around the office topless asking if his muscles are bigger or if he is 'tanned for the gods' (you couldn't write it down the things that go on here are so ridiculous). You have 30mins for lunch although a lot of the time you end up eating over your computer at the desk because god forbid you are gone for 20mins he starts talking badly about you to other members of staff and asking where you are.\r\n\r\n- The charity is a complete vanity project on the CEO's behalf. They claim to help thousands of people each month, but really this is calculated merely on website hits. The values of this charity have been lost somewhere along the way - the main interest here seems to be to get as much publicity as possible for the CEO who sees himself as some sort of celebrity. \r\n\r\n- The 'HR' department consists of one woman, who is the CEO's best friend and now the deputy CEO  - any feedback or grievance given to her is fed straight back to the CEO, not an ounce of confidentiality exists here so you really have no one to turn to. These two are quite an awful duo - they talk badly about the staff, they back up each other's ridiculous and totally unprofessional behaviour.\r\n\r\n- Expect to do a lot of the CEO's work for him while he takes credit for your ideas because 'he can'."}], []]