[[{"date": "30 May 2023", "title": "Clinical Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seneca Family of Agencies (Seattle, WA)", "Interview Descriptions": "Straight forward remote interview, my time was well-spent and I felt the process was effective. I declined due to lack of chances to practice. School based seems well run program.", "Interview Questions": "What your philosophy of supervision?"}, {"date": "4 May 2023", "title": "Conselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (South San Francisco, CA)", "Interview Descriptions": "Pretty straight forward, but left some information out of the job description such as mental intensity. Also the time for the interactive felt shorter and having more time to interact with the students on campus would be better to see more of the work that happens at the school.", "Interview Questions": "What is some ways you take care of yourself mentally?"}, {"date": "30 Mar 2023", "title": "Graduate Trainee Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "Application. Then I received an email to schedule a phone screener. It was followed up by a zoom interview with the hiring manager and supervisor. There was an issue with getting an update. HR was slow to reach out.", "Interview Questions": "Tell me about yourself. What are you looking for in training? What do you look for in supervision? What is a strength and weakness?"}, {"date": "25 Mar 2023", "title": "Behavioral Clinician I Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies in Mar 2023", "Interview Descriptions": "Met with two interviewers on zoom for one hour. They asked various questions about me and my previous work experience and offered the position a few days later. The interiviewers were extremely kind", "Interview Questions": "Describe one success and one failure from your previous position"}, {"date": "26 Jan 2023", "title": "Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seneca Family of Agencies", "Interview Descriptions": "The staff asked general questions to learn my experience with working with youth. The staff was helpful by providing information regarding the position and explained day-to-day tasks. All the staff and supervisors are caring individuals!", "Interview Questions": "Experience working with at-risk youth?"}, {"date": "16 Jun 2022", "title": "School Based Clinician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Seneca Family of Agencies (Seattle, WA) in Apr 2022", "Interview Descriptions": "The interview process was extremely slow and there was poor communication throughout. The lack of communication was off-putting there were many unanswered calls and emails. Do not recommend it. The interviewers were also late for interviews.", "Interview Questions": "How have you committed yourself to understanding and aiding in the pursuit of equity and inclusion in your professional and or personal life?"}, {"date": "7 Feb 2022", "title": "Health Information Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Seneca Family of Agencies", "Interview Descriptions": "It was a combination of group interview, individual interview and computer test. Applicant needs to be prepared for the interview. Focuses on technical skills, communication skills, leadership style, problem solving skills, etc.", "Interview Questions": "Share an experience when you had a conflict with a colleague or supervisor and how did you address it?"}, {"date": "19 Feb 2022", "title": "Mental Health Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (San Francisco, CA) in Feb 2022", "Interview Descriptions": "The interviewer asked straightforward, thoughtful questions, and invited me to take time to think and sit with answers before answering which relieved some pressure on the process. It was my first interview in a while and her calm demeanor made it not to stressful.", "Interview Questions": "What has brought you joy in the past about your work?"}, {"date": "2 May 2022", "title": "Associate Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Seneca Family of Agencies in Feb 2022", "Interview Descriptions": "The interview was conducted virtually and each open position was described. The interviewers wanted to know about my experience and what I get that my strengths and weaknesses were and how my experience would benefit me in the position.", "Interview Questions": "How would you work with a child of color and their family?"}, {"date": "14 Dec 2021", "title": "Youth Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seneca Family of Agencies", "Interview Descriptions": "I applied online. After about two to three weeks the agency calls you and goes over the requirements. If you are still interested they set up a group interview via zoom.", "Interview Questions": "What would you do if a child calls you the B word"}], [{"date": "29 Nov 2021", "title": "Technical Support Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (San Leandro, CA)", "Interview Descriptions": "I applied for a technical support position, arrived at the interview early, and felt a nasty vibe from the hiring manager and IT manager. I guess I did not fit the bill of falling in a certain criteria.", "Interview Questions": "Tell me about a challenging time?"}, {"date": "13 Apr 2022", "title": "Program Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Seneca Family of Agencies (Oakland, CA) in Nov 2021", "Interview Descriptions": "The interview process was confusing.  No real follow up, even when I would follow up.  The people who interviewed me (over Zoom) were pleasant and seemed interested in me and my experience, but was unorganized.", "Interview Questions": "Describe your approach to issues of DEI.\r\n\r\nHow does your experience fit in with this job?\r\n\r\n"}, {"date": "21 Sept 2021", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "Interviewed with the department director. The director was pleasant and welcoming.  Interview style was casual and questions weren't too difficult. The process was simple. I was offered the position after the single interview.", "Interview Questions": "What is your leadership style?"}, {"date": "4 Aug 2021", "title": "Connection Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "After the phone interview, I attended the on-site group interview. There are 4 -5 candidates who do not interview for the same position. The interview runs for around an hour.", "Interview Questions": "Why would you choose this position? Do you have any questions about the position?"}, {"date": "8 Jul 2021", "title": "Quality Assurance Health Information Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seneca Family of Agencies", "Interview Descriptions": "Received a phone call to schedule an interview at the desired program that I indicated at my initial 'group interview'. Then, I interviewed on-site with QA Director & Program Director.", "Interview Questions": "Q: Why do you want to work with us?"}, {"date": "28 Jul 2021", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Jun 2021", "Interview Descriptions": "First received a phone call from the principal, very friendly, gave me an overall introduction to the school and their values/mission. Then I got invited to the school itself for the second interview. 1 hour was interactive, you get to talk to staff, teachers, and students. I must mention though there is no direction or instructions for the interactive portion so come ready with questions and curiosity to participate. Then the other hour was an interview where they ask you questions and then you get to ask them questions.", "Interview Questions": "Knowing how difficult the students may be, why do you still want to work here?"}, {"date": "18 Mar 2021", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (San Leandro, CA)", "Interview Descriptions": "The interview process was a good experience.  There was a screening call that lasted about 15 - 30 mins and  I was asked questions as to why I was interested in working with the agency. My next step in the process was to participate in a group interview in which the interviewer asked questions and presented scenarios that we may encounter. Following that interview, I got a callback and my onboarding process started after that.", "Interview Questions": "Tell me about yourself and why you've decided to run towards a population that some people would rather run away from?"}, {"date": "5 Mar 2021", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seneca Family of Agencies", "Interview Descriptions": "Two-tier interview. The first is a group interview and the second is with the executive. Really good turnaround time and the questions are pretty standard to what's out there as test questions for these kinds of roles.", "Interview Questions": "How do you manage stress?"}, {"date": "26 May 2021", "title": "Estagiário Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (Rio de Janeiro) in Jan 2021", "Interview Descriptions": "o entrevistador deixa bem a vontade e fica somente focado nas habilidades de cada candidato. educado, rapido e direto ao ponto, todas as perguntas tipicas de uma entrevista de emprego", "Interview Questions": "como voce se enxerga em 6 anos?"}, {"date": "2 Oct 2020", "title": "Bilingual Youth Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seneca Family of Agencies", "Interview Descriptions": "Thorough, complete and very professional. The first one is through the phone, the second is a group interview and the third one is directly one on one. The staff is very professional and kind.", "Interview Questions": "Q: How would you react in the hypothetical case of being introduce to a child that start calling you names inmediately after?"}], [{"date": "3 Sept 2020", "title": "Resource Family Home Advocate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seneca Family of Agencies", "Interview Descriptions": "Went really smooth and the environment was welcoming.  The interviewer was very approachable and made sure I was at ease by breaking the ice. Overall, the questions were average, about a 30 minute interview. He also clarified any questions I did have.", "Interview Questions": "What was an issue you went through in your past employment and how did you react?"}, {"date": "5 Sept 2020", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Seneca Family of Agencies in Aug 2020", "Interview Descriptions": "Great process! HR screening, group interview, computer test, then a final panel interview. They made me feel so comfortable during the entire process. The best experience I could’ve asked for.", "Interview Questions": "Describe a time you dealt with a disgruntled customer."}, {"date": "22 Aug 2020", "title": "Clinical Intervention Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seneca Family of Agencies (Orange, CA) in Jul 2020", "Interview Descriptions": "First a phone call was made by the program manager asking for availability for an interview. Then, you are invited to a group interview, during COVID-19 this is a virtual interview, then if you are selected for a second interview, it is a panel.", "Interview Questions": "How have you handled a crisis situation in the past?"}, {"date": "25 Feb 2020", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "Group interview, computer test, onsite interview. It is a long process, but I enjoyed all of it. everyone was friendly and professional. The Group interview included 4 interviewees and 1 interviewer, we all took turns answering the same question. We were told the group interview was so that they could see all of us interact with each other and to help hurry the process.", "Interview Questions": "A lot of behavioral questions. "}, {"date": "16 Dec 2020", "title": "Direct Service Community Based Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (San Jose, CA) in Dec 2019", "Interview Descriptions": "Friendly, open, collaborative conversation style.  Asked about experience and interest in the field and described position and expectations.  There is no attempts to catch you out, just to get to know you, your goals and what you think you can contribute.", "Interview Questions": "Why do you want to do this work?"}, {"date": "6 Dec 2019", "title": "Classroom Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Nov 2019", "Interview Descriptions": "I applied online and got a screening phone call one day later. We scheduled a group interview for next week with 5 other candidates for similar positions. After I got a call for an interactive interview at my specific site.", "Interview Questions": "What would you do if it was your first day and a student calls you a B word? "}, {"date": "31 Oct 2019", "title": "Parent Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Seneca Family of Agencies (Anaheim Hills, CA)", "Interview Descriptions": "Called for phone screening then brought in twice for interviews. The phone screening took about 20 minutes am the in person interviews took about 1 hour each on separate days.  The interviews took place in Santa Ana.", "Interview Questions": "2 separate sessions 1-2 weeks apart with 1-2 interviewers -Scenario questions , why should we select you? type questions"}, {"date": "9 Oct 2019", "title": "Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (San Leandro, CA)", "Interview Descriptions": "Contacted for phone screening and group interview scheduling 10 days after application submission. Group interview with a few other candidates and two recruiters for various other positions at their San Leandro office. Contacted with invitation to schedule second interview with local team  4 business days after the group interview.", "Interview Questions": "Describe a time you interacted with someone that was culturally different from you."}, {"date": "8 Nov 2019", "title": "Youth Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seneca Family of Agencies (Oakland, CA) in Oct 2019", "Interview Descriptions": "First they called and did an interview over the phone. Afterwards they invited you to a group interview with around 8 or 9 other people. We were all asked a series of hypothetical and anecdotical questions that we answered taking turns. The interview took around 2 hours.", "Interview Questions": "Some questions that came up were  \"speak of a situation in which you've had to relate to someone that was very different to you\" or \"children are very curious, how much of your private life would you share with them?\""}, {"date": "23 Sept 2019", "title": "Classroom Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "The group interview lasted about 1.5 hours. The interviews gave several scenarios to which each interviewee had to answer. This made the interview feel quite long. But, the interviewers were very friendly and did not rush anyone, which was a bonus. the last half of the interview was the the interviewers providing information on the company and what to expect if hired.", "Interview Questions": "How would you handle a student who has screamed profanity at you in front of an auditorium?"}], [{"date": "20 Sept 2019", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "A screening call, a first interview and then a second interview. The second interview included a computer test on Microsoft Word and Excel. \r\nThe whole process was made very easy by Seneca. They were incredibly kind and made the interview a lot less stressful. Both interviews were one on one, meeting with different people each time. \r\nThey checked my references shortly after the first interview, and were very communicative throughout the process of doing so. Overall, I would say it was a very positive experience.", "Interview Questions": "Describe a time when you were faced with a challenge that didn't have a good outcome"}, {"date": "14 Sept 2019", "title": "Classroom Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Seneca Family of Agencies (Oakland, CA)", "Interview Descriptions": "The whole process took me about 5 weeks. First, they contacted me via phone to set up a group interview. The group interview took 2 full hours and included 6 other people who were mostly interviewing for different positions in different locations, so it didn't feel too competitive.\r\nNext, they called me to invite me to interview with 2 directors of the program. This was a pretty straightforward interview with standard questions (strengths, weaknesses) as well as requiring examples of your past experiences and how you handled them.\r\nThey called me immediately to set up a 1 hour interactive interview at one of the public schools they work with. I had no guidelines on how this interview was supposed to go or what was expected of me. When I arrived, the interviewer was unfriendly and I could tell she immediately disliked me, or was extremely annoyed I was disrupting her day. She told me that she would be watching how I interact with the kids and adults, but not to be too coddling or give the kids too much attention. I was confused, but I feel I did my best considering the vague instructions. I only got to spend 20 minutes with the kids outside for recess and 10 minutes inside the classroom, so I couldn't really get a feel for the job. She ended the interview by asking me a few questions, and I left with a bad gut feeling.\r\nSure enough, a few days later HR called saying I was not recommended for that position, but I might be a fit for a position in one of their non-public schools, which is what I originally applied for anyway. I had to do yet another interactive interview, except this one was 3 hours, 2 hours in the classrooms and 1 talking to the director. This one went much better as I was able to actually see how the job would be like and interact more with the kids. About a week later, I was contacted with an offer.", "Interview Questions": "What would you do if the kids asked you personal/inappropriate questions?"}, {"date": "11 Dec 2019", "title": "Youth Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (San Jose, CA) in Sept 2019", "Interview Descriptions": "I went in for an initial group interview in a room with 3 other candidates and one interviewer. we were asked a lot of hypothetical based questions to see what we would do in those situations.  I moved on to a solo interview a few weeks later, where more personal questions were asked about myself.", "Interview Questions": "What would you do if it's your first day on the job and a child calls you the \"B\" word?"}, {"date": "21 Aug 2019", "title": "Mental Health Clinician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "In person interview about 1 hour in length. Interviewer gave plenty of time for interviewee to ask questions. Interviewer seemed to want interviewee to have some prior knowledge and experience with the given population.", "Interview Questions": "What strengths do you bring to this role and what would you have trouble with?"}, {"date": "22 Aug 2019", "title": "Clinician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seneca Family of Agencies", "Interview Descriptions": "A big group was interviewed, which was unknown to many of the applicants. It was an unstructured format and vague questions with answers that became redundant after such a large group. However the staff was very friendly and inviting!", "Interview Questions": "How one provides empathy for caregivers "}, {"date": "19 Aug 2019", "title": "Bilingual Care Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seneca Family of Agencies", "Interview Descriptions": "It was a group interview with three panel members interviewing me and another applicant. The first half of the interview was them asking questions about your experience and how it relates to the position. Then, they give you a worksheet to translate.", "Interview Questions": "1. Working at Seneca, there is the possibility that the children/youth may act aggressively towards you, so why do you want to work at Seneca?"}, {"date": "20 Aug 2019", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Jul 2019", "Interview Descriptions": "Brief phone screening then a group interview. The group interview was about 1.5-2 hours long.  They told the candidates to give them 4-5 business days before checking if we would get a second interview which would be an interview at one of their school sites. I called after  4 business days and was told they would contact the sites and they would be in touch with me. They called a couple of days later to set up the second interview for the next week and the next day they reached out to my references. a couple of days after that I got a call from HR that the position was filled. they asked if I would be interested in a different position and I said yes so he said he would send my application to that department. He said if they were interested then I would have to do another interview. I had to wait another 4-5 business days to reach out for an update. I was really disappointed and frustrated with the process and how things were handled by their HR so I didn't bother following up.", "Interview Questions": "How would you respond to students asking you personal/inappropriate questions?"}, {"date": "6 Jun 2019", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Apr 2019", "Interview Descriptions": "I was called for a phone interview and then scheduled for a group interview. Following the group interview, I was contacted by the site director who then scheduled me for a 2-hour interview a week later. The first hour was 1:1 and the second hour was an interactive, which entailed me visiting two different classrooms for 30 minutes each.", "Interview Questions": "These kids will call you every name in the book and spit on you, why would you want to do this work?"}, {"date": "15 Jun 2019", "title": "Youth Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (Oakland, CA) in Apr 2019", "Interview Descriptions": "Process first stared with a brief phone interview that went over job description and requirements. After that a group interview about a week later. Group had 4 other people, a few applying for the same job and others applying for jobs at other locations. Questions were mostly scenario based.", "Interview Questions": "It is your first day. You enter a room where a kid is sitting down. When he sees you, he use foul language towards you. How do you respond?"}], [{"date": "16 Aug 2019", "title": "Youth Counselor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Mar 2019", "Interview Descriptions": "Not a job for professionals with rent to pay. Pay can not compare to most professional jobs. Interview was full of college children. When asking questions regarding employee  training, they were unable to answer. That's scary!!", "Interview Questions": "Describe a time when you dealt with someone \"different\" that you're not used to. What was the situation? What was the result?"}, {"date": "7 May 2019", "title": "Behavioral Coach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Seneca Family of Agencies in Feb 2019", "Interview Descriptions": "Made initial contact within a week of applying. Had a group interview then somewhat of a panel for the second interview. The interviews were very relaxed in the best way, best interviews I've ever been to.", "Interview Questions": "What does mental health mean to you?"}, {"date": "22 Mar 2023", "title": "Lead Clinician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Seneca Family of Agencies (Castro Valley, CA) in Feb 2019", "Interview Descriptions": "I was already working for Seneca in a different role. They like to hire internally, and the process was pretty simple. I met with the clinical director and site supervisor to review my past work and why I wanted to transition.", "Interview Questions": "Past challenges, strengths, weaknesses, plans for growth."}, {"date": "23 Jul 2019", "title": "Health Information Department Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Jan 2019", "Interview Descriptions": "Applied  to posting I saw on indeed, received a call  for a phone interview about a week later. Got invited for a group interview with a panel of people. She emailed me directions and a thank you email l.", "Interview Questions": "Why did you apply for this position "}, {"date": "11 Dec 2018", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "First, I got a phone interview. The person on the phone described more about the position and some benefits. Since I am a student, the person described the pay raise after I got my degree. Then, I scheduled an in-person interview, where I was interviewed by one person. I was with about 6 other people in a conference room. It was kind of like a popcorn style, where we answered the interviewer's questions when we were ready. Everyone was applying for a similar position at a different location, so there wasn't any competition. It was a relaxed interview process.", "Interview Questions": "Why do you want to work with this population? , What will you do if the student was in crisis? "}, {"date": "8 Sept 2018", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "After submitting an online application, I was contacted by an employee for a brief phone screening.  They asked standard questions such as my education, experience, why I was interested in the position, etc.  That same day I was scheduled for a group interview, that would happen the following week.  The group interview had three of us applicants and one employee interviewing us.  We took turns answering the question.", "Interview Questions": "Give an example of a time when you had to deal with a stressful situation, how did you handle it?"}, {"date": "5 Sept 2019", "title": "Mental Health Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (Oakland, CA) in Sept 2018", "Interview Descriptions": "Involved a group interview, followed with the interview at a site they thought fit for you. They would ask a lot of questions, and then in the group interview, you would freely answer and wait for a period where you would be able to talk.  The group interview seems frightening, but it's not they make it a very relaxed environment.", "Interview Questions": "What would you do if a student had called you a bad word when you first enter the classroom?"}, {"date": "20 Apr 2022", "title": "Mental Health Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (Concord, CA) in Aug 2018", "Interview Descriptions": "Three interview process. The first one was a group interview with 10 other applicants, the second one is at the site you will be serving and the final step is an interactive interview with the students and staff.", "Interview Questions": "Scenario based questions...what would you do if? How do you handle?"}, {"date": "21 Jul 2018", "title": "Mental Health Clinician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Seneca Family of Agencies (Oakland, CA)", "Interview Descriptions": "The process was very short and sweet. I applied, and received  a call to schedule an interview the next day. Two clinical directors interviewed me and asked me a series of questions regarding my experience. They were extremely friendly and sweet!", "Interview Questions": "Tell me a little bit about yourself and your experience. "}, {"date": "19 Jul 2018", "title": "Bilingual Youth Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Seneca Family of Agencies (San Leandro, CA)", "Interview Descriptions": "I applied on indeed and was contacted via phone a few days later. The phone interview was to get to know me and they explained the position qualifications. The 2nd interview was a group interview with 4 other people. We were all applying for different positions but got all the same questions. This process was long and kind of hard to not be repetitive since we were all answering the same questions. Most of the questions were situational. The 3rd interview was with 2 program supervisors they both switched off asking questions. Most questions were situational as well as previous experience.  After this they were supposed to let me know if I got the job instead they scheduled a 4th interview!!!! This interview was extremely redundant most of the questions were similar to the previous 3 interviews. The overall process took 2 months. It was so long I had 5 other offers which I accepted another job even though I really wanted this job because they took so long to get back to me.", "Interview Questions": "What would you do if a child called you a (racial slur) b***h on your first day on the job?"}], [{"date": "22 Jun 2018", "title": "Care Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seneca Family of Agencies (Santa Ana, CA)", "Interview Descriptions": "Seneca has been incredible throughout the entire process. They have a great reputation for how they treat their employees and I can see why. I have been notified and updated every step of the way. The interview was a group interview, but it was very relaxed and comfortable. The interviewer was polite and friendly and each person in the interview was just as passionate as their job as you'd hope. The facilities were also much nicer than I had expected. If you catch their interest in the first interview, they will quickly follow up with you for a second one-on-one interview.", "Interview Questions": "What is the most creative thing you've done on the job?"}, {"date": "2 Jul 2018", "title": "Health Information Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (Santa Ana, CA) in Jun 2018", "Interview Descriptions": "First there was an Online application. Then a phone call to go over the benefits, pay, and interview schedule.  Then a group interview.  Then a computer test. Then individual interview.", "Interview Questions": "Why do you want to work here? "}, {"date": "3 May 2018", "title": "Preschool Teacher Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Seneca Family of Agencies (Oakland, CA)", "Interview Descriptions": "Being that I had Senecas training manual I though the interview went great And I have over 3 year experience working  with children and with  Seneca staff  and a early childhood degree. I feel that Seneca only want to hire people of non color . I though the interview went great because I prepare for it by using their training manual and I thought I would get the job or another position as a mental health counselor but I got an email saying that they have pick someone more qualifed. I really believe that they do no want the children who are mostly black to work with someone that is black and experience that is why they have a high turnover rate I was willing to work with these kids but they rather hire non black who will not last the whole school year . When I walked around the school there was not one staff who was black . I am more than qualifed to work with these children and it is so sad how they make you go thru such a long process like two hour interview just to be told that they don't want you.  when I came in the preschool class I had the children under control and  was told they actually behaving themselves for the first time all day.  I am starting to believe Seneca does not want the  children to thrive they just want to keep getting funding for the kids without  actually hire people who are qualified to work with these youth most of there staff will not last a year .", "Interview Questions": "What would I do if a kid hit me ?"}, {"date": "14 May 2018", "title": "Student Support Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies in May 2018", "Interview Descriptions": "Two weeks after I applied, I heard back from a recruiter. The recruiter asked why Seneca? The recruiter then went over the qualifications for this particular position and its benefits, then asked if I was still interested in moving forward. We scheduled a video interview since I was in another state. The interview lasted about an hour. Majority of the questions were situational.", "Interview Questions": "During a crisis, what are some things that you do or consider? "}, {"date": "9 Apr 2018", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "I am not completely done with the interview process, but I went through a phone call and a group interview so far. I thought that the group interview was cool for how we were able to get to know each other better, as well as understand what the environment of the workplace we will be going to might be like. I was the youngest one there, and as a recent graduate, I am thankful for any opportunity to learn from anyone. There were 5 other people in the group interview, all who were at least 5 years older than me, and I learned a lot by listening to their answers to the questions. I saw how everyone came from different backgrounds with different professional experiences, and how they were willing to work with each other in the answers. At the same time however, I could still feel the competition. The interviewer first asked us questions like \"tell me about yourself\" and \"why Seneca?\" and then moved onto more situational questions. I balanced listening to the other answers first and building off of them, with answering first for the questions that I was passionate about. I hear that the next portion of interviews is an interactive one where we are put into the classroom, so I will update this description later.", "Interview Questions": "Why Seneca?"}, {"date": "6 Apr 2018", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Seneca Family of Agencies", "Interview Descriptions": "Group interview went smoothly and was open for discussion. The recruiter was welcoming and engaging, while still allowing for questions and comments to aid the candidates in making an informed decision.", "Interview Questions": "What experience do you have with working with children? "}, {"date": "2 Dec 2022", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Seneca Family of Agencies (San Francisco, CA) in Mar 2018", "Interview Descriptions": "Phone screening. 1st official interview was a short chat with the principal and a walk through campus to give you a sense of the environments and how you would interact in that space. I got a second interview and did a 2nd walk through this time with a different age group. I was offered the role 3 days later.", "Interview Questions": "Tell me about yourself and goals."}, {"date": "9 Feb 2018", "title": "Mental Health Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Seneca Family of Agencies (Oxnard, CA)", "Interview Descriptions": "A lot of questions about how you handle conflict. They were really concerned with one's ability to work in a team based decision making process regarding client care.  Then they wanted to see if you could stand by your decision regarding client treatment even if others may not habe agreed, and how would you handle a disagreement with the team.", "Interview Questions": "How I may have handled a difficult situation with a client then with a staff member in the padt."}], [{"date": "6 Feb 2018", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 weeks. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "1st interview is a group interview, 2nd interview is with the program director, 3rd interview is an interactive with students. The last interview was difficult because they just throw you in the classroom while the students are learning so its hard to interact since you don't want to interrupt the class.", "Interview Questions": "Describe yourself, and why do you want to work with children who have behaviors "}, {"date": "17 Apr 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seneca Family of Agencies (San Francisco, CA) in Feb 2018", "Interview Descriptions": "Applied online on their website. I then received a phone call to schedule an on-site interview a week later. The interview was a group interview with two other people applying for either the same or a different position. The interview was pretty laid back and Informative. The recruiter talked about the mission of Seneca, what the position we applied for does and how it plays a part with Seneca's mission. Didn't seem like there was too much pressure and everyone was able to answer the questions giving similar answers with their own twist on it.", "Interview Questions": "What would be three things your coworker/supervisor say about you?"}, {"date": "26 Jan 2018", "title": "Development Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Seneca Family of Agencies (Salinas, CA) in Jan 2018", "Interview Descriptions": "Scheduled for 30 minutes. Started late. Recruiter did most of the talking. Scripted. Stone-faced. No indication of follow up. Felt very odd. No warmth or rapport building. Great questions. Posting for your benefit.", "Interview Questions": "How would you handle this scenario: You're on the phone, your boss needs 10 copies of something for a meeting, a volunteer is at the desk, the sheriff walks in"}, {"date": "22 Feb 2019", "title": "Student Support Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Seneca Family of Agencies in Jan 2018", "Interview Descriptions": "2 hour group interview. The interview is facilitated by a HR employee and the interview is similar to a group discussion which you need to elaborate with other employees and contribute new ideas.", "Interview Questions": "You will be working with clients who have different racial, cultural, and socioeconomic background. Tell me a time you have worked with similar population. "}, {"date": "31 Dec 2017", "title": "Student Support Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (New York, NY)", "Interview Descriptions": "I was contacted by an HR rep about a week after sending in my resume, and was scheduled for a group interview the following week. That meeting was postponed due to a family emergency, and rescheduled for the next week. I was expecting a group interview based off the other reviews that I read about this agency, but the interview was scheduled later in the afternoon and was just the HR rep and I. It only took about 30 minutes and for she gave me the history of the company. Then she went on to some fairly informal interview questions, at which we talked about my past experience with kids and behavior and Trauma backgrounds. She then told me about the sort of General hiring information for the agency. It sounds like a really great agency to work for with a lot of growth potential, so I'm excited to hear back and see if I progressed to the next interview.", "Interview Questions": "Scenario: you are working with a teacher on student behavior issues, and the teacher says that one student always acts up when you're not there. how would you go about explaining to the teacher in the next steps?"}, {"date": "8 Dec 2017", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Nov 2017", "Interview Descriptions": "I applied online. A week later an HR rep contacted me for a group interview. During my group interview, 2 other recruiters were there. They were professional and tried their best to make us feel at ease about the group interview. They tried to do this by having us do a brief breathing exercise. In my group interview, there were two others, I was the third. My overall experience with the interview was nerve wrecking. Group interviews make me nervous because I feel like I have to outsell my peers (right in front of them). A lot of it felt like a competition (which in a sense it is.) There were two position open during our interview session. The three of us were going for the classroom counselor position. The interview started off with the male recruiter elaborating about Seneca, then asked us hypothetical and personal questions about ourselves. We were given the opportunity to answer or not. However, it is obvious that it is in your best interest to answer. This is where the competition came in because you felt like you had to out answer your opponent. The interview ended with questions or concerns that you may have. I assume that there are multiple group interviews. So technically, I believe that you are not only competing with your peers that you saw during your interview, but others in other interviews as well. After the interview was over, we were handed a survey to fill out to help them improve their interview process. They emailed me a week later stating that they found someone that was more suitable for the position. As disappointed as I am, I appreciate that they emailed me to let me know instead of just letting me wonder.", "Interview Questions": "N/A"}, {"date": "29 Nov 2017", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (Santa Ana, CA) in Nov 2017", "Interview Descriptions": "It was a group interview of 6 - 8 people with 3 interviewers. Overall it felt more like a conversation than an interview, and it was very relaxed, humorous, and informational. One of the most fun interviews I've been to yet!", "Interview Questions": "1. Tell me a bit about yourself.\r\n2. The front office interacts with a wide range of people. How have you handled someone who was angry with you?\r\n3. What would your supervisor say are your strengths? What about areas of improvement?\r\n4. How have you helped contribute to the positive morale of the office?"}, {"date": "21 Nov 2017", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seneca Family of Agencies (Oakland, CA) in Oct 2017", "Interview Descriptions": "They called me a week after sending in my application to offer me a group interview. The group interview was with two HR employees of Seneca and 6 other applicants of the same position and other positions. The interview consisted of 6 or so questions and took about two hours. After the questions, they talked about Seneca and the open positions' descriptions and hourly pay.", "Interview Questions": "N/A"}, {"date": "11 Sept 2017", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Seneca Family of Agencies (San Leandro, CA)", "Interview Descriptions": "This interview was several years ago.  First we had a group interview around a table, where a person from HR asked us questions -- I only ended up answering two or three questions total.  Then I was called back for a one on one interview.", "Interview Questions": "How do you feel about having to learn how to safely restrain clients?  How do you feel about the possibility of getting bitten or kicked by a child?"}, {"date": "19 Sept 2017", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Sept 2017", "Interview Descriptions": "I applied online. Someone called me for a phone interview and to schedule a group interview. There were 2 others at the interview. I was contacted later that week for the interactive portion, where you are suppose to interact with the kids. After that there was another interview with 2 people from that site where they asked how the interactive went and similar questions to the group interview.", "Interview Questions": "What kind of behaviors did you notice in the classroom, how the counselor handled it, and how you would have handled it differently."}], [{"date": "28 Sept 2017", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (Oakland, CA) in Sept 2017", "Interview Descriptions": "I had one interview then got called for a second interview . First interview was a group interview. Second interview was with 2 directors. First you interview with HR then you have your interview at the location you wish to work at.", "Interview Questions": "Why Seneca? "}, {"date": "2 Aug 2017", "title": "Program Assistant/Health Information Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "Basic interview, mostly with questions about skills/background and reason for being interested in the position. They also asked some situational questions (e.g. how would you handle a typical challenging scenario that is likely to come up if you are hired). A good portion of the interview was also dedicated to explaining the position and its benefits, location possibilities, etc. In general, the interview process seemed very standardized/formalized and the interviewer was very friendly.", "Interview Questions": "How would you handle a complex situation in which you are dealing with multiple competing (and complex) demands on your attention while you are working in a \"front desk\" role at a Seneca office? (the question itself was slightly more specific than that...they actually presented a hypothetical scenario, but I don't remember the exact details of it) "}, {"date": "31 Aug 2017", "title": "Classroom Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (Berkeley, CA) in Aug 2017", "Interview Descriptions": "I applied online and got a call about a week later for a quick phone screening. During that screening I was asked one question and it was why Seneca? I answered the question and later was asked to go to a group interview. After that interview, you have an interview with the program directors and they ask you about 5 questions and if answered well they move on to an interactive interview. \r\n\r\nThe interactive interview is good, you get to see the environment you work in and how your co-workers would handle certain situations. If you get intimidated easily I can assure you the job is not going to work. \r\n\r\nI have heard wonderful things about Seneca and hope to hear from them soon.", "Interview Questions": "Tell me about a time you gave feedback to someone in a superior role than you."}, {"date": "30 Jul 2017", "title": "Health Information Specialist, Program Assistant, Executive Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "Really vague what you're interviewing for. There is a phone screen, group interview, and then if you're selected you will be bounced around from program to program not 100% sure what you're even interviewing for at a certain point.", "Interview Questions": "How do you practice self care?"}, {"date": "10 Aug 2017", "title": "Youth Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (Oakland, CA) in Jul 2017", "Interview Descriptions": "First there was a group interview. There were around 10 people and they asked questions. We all had to answer every question (make sure to answer first sometimes and in the middle at other times to show team work). It was not too stressful because you could listen to others answers first and build on them if you did not know what to say right away. Then there was an individual interview. The whole process took around a month.", "Interview Questions": "If you were to go to a clients house and it felt very dangerous, would you go in?"}, {"date": "26 Jun 2017", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (Oakland, CA)", "Interview Descriptions": "I went through their first round which was the group interview and I thought it was chill (very conversational and everyone got to speak up) until they told us that there were other candidates way ahead of us in the process and they were already deciding on making an offer. Felt like I wasted my time.", "Interview Questions": "Same exact question as the previous reviewers regarding how to prioritize multiple tasks at once. How do you keep yourself organized? What computer programs are you familiar with? What would your boss/supervisor or mentor say are your strengths and weaknesses? Describe a time when you handled a major conflict and what you learned from it? How would you handle a situation where a client/person was angry with you (or something of that matter) "}, {"date": "23 Jun 2017", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (San Leandro, CA)", "Interview Descriptions": "Got a phone call, scheduled a group interview, then had a 2nd interview which had me go to a site and then speak to the directors. Haven't heard anything back yet and it's been about a week and a half. Hopefully hearing back soon because it looks like a great company!", "Interview Questions": "What do you do to promote self care?"}, {"date": "28 Jun 2017", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (Oakland, CA) in Jun 2017", "Interview Descriptions": "It is a group interview and I had to drive to the Oakland Location.  There was about 10 other people interviewing with me and one person from HR.  The HR person would ask a question and everyone would respond at their own time. If you pass this interview then you move on to a separate interview with your potential supervisor and then you also do an interactive interview with children.", "Interview Questions": "N/A"}, {"date": "26 Jul 2017", "title": "IT Support Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Jun 2017", "Interview Descriptions": "The phone interview was quick and was just asking questions to get to know you and see if you are a good fit for an on site interview. They did give a follow email to see if they are interested in you.", "Interview Questions": "Tell me about some of your experiences on your resume?\r\nHow did you hear about Seneca?"}], [{"date": "29 Jun 2017", "title": "Care Coordinator - Wraparound Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (San Francisco, CA) in Jun 2017", "Interview Descriptions": "I was called for an interview 1 week after I applied online and scheduled an interview for a week following. I was told I would have a half hour to write a response to a case report prior to meeting with two supervisors for two different positions they were considering me for (also a TBS clinician).  I was called for a second interview the same afternoon.", "Interview Questions": "Discuss at time you had to work with someone who was very different than you and how you dealt with it?"}, {"date": "12 May 2017", "title": "Youth Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "I like the group interview because everyone was given a chance to talk so it wasn't like a competition . Some of the scenario questions were tough to answer on the spot.", "Interview Questions": "How would you respond if someone called you a bad name on the first day?"}, {"date": "23 Jul 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (Santa Ana, CA) in May 2017", "Interview Descriptions": "Large (~8 applicants) group interview. First our interviewers introduced themselves and then they asked a series of eight questions. It was a little difficult because we did not want to interrupt anyone else and we wanted our answers to sound unique.", "Interview Questions": "Describe yourself using 3 adjectives"}, {"date": "18 Apr 2017", "title": "Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "Interview was with two upper management employees, asked basic questions about employment history and experience.  Prior to meeting with said employees, the receptionist gave me a writing sample (with a vignette) as to gauge my writing level and style.", "Interview Questions": "Can you describe the populations you have previously worked with?"}, {"date": "30 Mar 2017", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (Oakland, CA) in Mar 2017", "Interview Descriptions": "There's a multi step interview process: first the group interview which takes about an hour, then the 2 hour computer test, and then a final interview with the director of whatever department you would be assisting. At the final interview, I was surprised with another 30 minute plus computer test in addition to the hour long interview.", "Interview Questions": "What do you value in a supervisor?"}, {"date": "23 Mar 2018", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Seneca Family of Agencies (Oakland, CA) in Feb 2017", "Interview Descriptions": "The hiring process went quite well actually. First, you have a phone interview. Next there is a GROUP interview. I was someone that listened to each question carefully, let someone answer the question first to get a sense of how the recruiter listened and responded but, after question 1 and 2, I was one of the first to answer all the following questions. They were really straight forward and I honestly enjoyed the group interview. This give you a chance to stand out.", "Interview Questions": "Q: Why do you want to become a counselors, What are some qualities you need to be a great counselor? (not kidding--- You walk into a group setting with your kiddo's and one of the students says \"I don't want that (b-word) working with me\", how do you respond?\", You see one of your clients after work and he has a brown bag with \"something\" in it and gives it to his friend - what would you do?\""}, {"date": "10 May 2017", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Seneca Family of Agencies (Oakland, CA) in Feb 2017", "Interview Descriptions": "They have 3 interviews in total. First is group interview, where they ask you around 6-8 basic program assistant related questions and about your background along with other candidates who are applying for the same or similar jobs positions. Second is computer test, where they ask you very basic questions about excel, word and outlook. The test takes about 1 hour or may be even less. Lastly, they will do a final interview with the team director or CEO or the head of the department you are applying too. Again, very basic and general assistant type questions. It is usually with 2-3 people and they try to make you very comfortable.", "Interview Questions": "Why Seneca?"}, {"date": "23 Jan 2017", "title": "Development Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "I went to a group interview. Everyone was applying for different positions and they were deciding who was the best fit for every position at the same time. We were asked a few questions than explained every position available. We wrote down which position we felt would be best for us and they would decide that as well for us.", "Interview Questions": "Name the most creative thing you have done in a work setting."}, {"date": "13 Apr 2017", "title": "Program Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seneca Family of Agencies (Oakland, CA) in Jan 2017", "Interview Descriptions": "Interview was divided into three parts: group interview, computer test, and one-on-one interview (followed by a computer test). Love the staff that I encountered! Managers are nice and genuinely care about you.", "Interview Questions": "Introduce yourself"}, {"date": "11 Oct 2016", "title": "Student Support Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (New York, NY)", "Interview Descriptions": "I was contacted by email for a group interview. On the day, there were two interviewers and a few interviewees. I did not hear back from them so emailed and asked for updates. They returned the email promptly.", "Interview Questions": "What would do you if a child spits at you and cusses? Why would you want to work with them. "}], [{"date": "7 Sept 2016", "title": "Classroom Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Sept 2016", "Interview Descriptions": "Applied online. Received a phone call to schedule an on site interview a week later. Interview was a group interview with six other people applying for either the same or a different position. Interview was pretty laid back and mostly situational. Didn't seem like there was too much pressure. Everyone gave similar answers to questions but put their own twist on it.", "Interview Questions": "What would you do if it was your first day and one of the children calls you a bitch?"}, {"date": "13 Oct 2016", "title": "Classroom Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (San Leandro, CA)", "Interview Descriptions": "They got back to me in about a week after I applied for a group interview. The interview itself was fairly informal without a ton of structure or pressure.", "Interview Questions": "The work will be very challenging. Why Seneca?"}, {"date": "7 Nov 2016", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Seneca Family of Agencies (Hayward, CA) in Oct 2016", "Interview Descriptions": "Got a call after I applied within a couple of days. I was asked to go in for an in person group interview. There were around 6-7 people who came in for different positions and 2 recruiters who asked us around 10-15 questions. They were general questions about what we would do when certain situations arose and why we would be a good fit at Seneca. The interview lasts a long time and it feels like a discussion group so it is not that stressful.", "Interview Questions": "What kind of kids do you think you will be working with?"}, {"date": "3 Oct 2016", "title": "Youth Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (Santa Rosa, CA) in Sept 2016", "Interview Descriptions": "I submitted my application online and was contacted within a week to schedule a group interview. During the interview, three of us were being interviewed but for all different positions within the company. We all answered the same questions. They said we would be contacted for the next steps in the process.", "Interview Questions": "Children are very curious by nature. How much do you think is appropriate to share with the children?"}, {"date": "19 Aug 2016", "title": "Classroom Counselor, Youth Counselor, Mental Health Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (New York, NY)", "Interview Descriptions": "Received a quick prescreening phone call after about a week after I applied online. They basically went over the benefits, starting salary, and minimum requirements for all the position. After that they scheduled a group interview with me. When I arrived, there was only one other candidate beside me who is scheduled on that day. It was more like an informal discussion than an interview with lots of situational questions. After that, the interviewer said that they will contact us about a week later. If selected, you will move on to a one on one interview with the department manager/director. But for positions like classroom counselor, you will also have an interactive test with the kids after the individual interview.", "Interview Questions": "Tell me about yourself."}, {"date": "15 Aug 2016", "title": "Behavioral Coach Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "To preface my review, I actually applied for and was offered almost the exact same position at Seneca 5 years ago but I turned it down back then. This time, the process was almost exactly the same but I didn't get an offer! The first interview is a group interview with someone from HR. It's uncomfortable because everyone has to answer the same questions in succession and everyone basically said the same thing. The HR guy just read questions off of a piece of paper and didn't respond to (or even acknowledge) anyone's answers. It seemed impersonal and not a good way to screen people. My second interview took weeks to schedule because the assistant who was scheduling them kept getting the interviewers' availability wrong and had to reschedule with me 4 or 5 times. The second interview was with the two supervisors I'd be working with if I got hired. They were late and neither one was very friendly. They seemed inexperienced with interviewing. I'd expect social workers to be a bit warmer and better at putting people at ease. They told me they only had my resume from 2011 and then asked really basic questions that (again) they read off their pieces of paper. It wasn't conversational at all and I couldn't wait to leave. One of them was incessantly yawning the whole time which I thought was really unprofessional and rude. \r\n\r\nTo be honest, everyone at this agency seems really young and inexperienced. This might be a good job for someone straight out of college but I have a lot more experience than the job required and still wasn't offered a job, even though I was offered it 5 years ago. So I don't know what they're looking for but for $17 an hour, their expectations seem a bit ridiculous!", "Interview Questions": "Why do you want to work with this particular population of children?"}, {"date": "23 Sept 2016", "title": "Health Information Specialist/Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Aug 2016", "Interview Descriptions": "The process took about 2 months. You apply. If interested they email you to schedule a brief phone interview/discussion. You do group interview. Computer test (microsoft office was surprisingly really hard, excel was basics). Last interview with heads of department. Then fingerprinting. If they dont call you for the next interview, CALL THEM to check on your status. I only moved on to each step after calling them to check in when I wouldn't hear from them for a week.", "Interview Questions": "What are 3 adjectives to describe yourself?"}, {"date": "8 Mar 2017", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Aug 2016", "Interview Descriptions": "Group interview with two other candidates. Other candidates were applying for the same and/or similar jobs. Two interviewers. Interviewer asks a question and each candidate has to give a response but no order is specified. The interview lasted approximately 45 minutes.", "Interview Questions": "What would you do if a student called you out for having privileges that they didn't have (white/white-passing, male, able-bodied, wealthy, etc)?"}, {"date": "22 Jul 2016", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "An HR recruiter calls you for a brief phone screen going over the job position, salary and benefits. If you accept, then they ask you to come in to their main office for a group interview. The group interview asks some situational but mostly standard interview questions and to have each person go around and share their answers. Slightly off tangent but I felt bad because group interviews can be nerve-racking for some, especially those with anxiety in which unfortunately one member in my group interview had and had to step out. The wait time was less than a week to do a skills test at the main office which was the next step (4 components, 1 excel and 3 word documents you have to create, very easy for those proficient in both programs). Within the week, I was contacted to have an interview with the Executive Director. The interview with the Executive Director (from the Crisis Center) went well and she offered me after our interview however, I declined because the role was very different from what I had expected (more of personal assistant than overall admin assistant).", "Interview Questions": "What experience do you have with scheduling?"}], [{"date": "14 Jul 2016", "title": "Wraparound Facilitator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (San Jose, CA)", "Interview Descriptions": "Received phone call regarding application and to schedule a phone interview for the following week.  The woman who interviewed me was not very warm - felt like she was reading off a list of questions - and felt hurried. Not a great experience.", "Interview Questions": "What are you weaknesses?"}, {"date": "13 Jul 2016", "title": "Mental Health Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "I got a call from Seneca about a week or two after applying. Then I was called and had a brief interview over the phone about myself including details about the position I am applying for. The questions they asked were basically just seeing if I fit the minimum qualifications for the position.", "Interview Questions": "Why do you want to work at Seneca?"}, {"date": "10 Jul 2016", "title": "Human Resource Recruiter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (San Leandro, CA)", "Interview Descriptions": "Applied online and got called the next day for a group interview. After, they call you if they're interested and ask for you to come in for computer based test. Still waiting for my results.", "Interview Questions": "How do you stay organized?"}, {"date": "6 Jul 2017", "title": "Crisis Clinician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (Thousand Oaks, CA) in Jul 2016", "Interview Descriptions": "Submitted Application. Completed a phone interview and then scheduled an in person interview. After the in person interview received response a few weeks later regarding their decision. They responded by email.", "Interview Questions": "Have you ever been in a situation with a violent youth? "}, {"date": "18 Jul 2016", "title": "Assistant Director of Programs Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (Oxnard, CA) in Jul 2016", "Interview Descriptions": "I received a request for a phone interview in less than a week of submitting my application/ resume. \r\nThe interview was crisp and short; but the we had some points of discussion that felt positive and collaborative.", "Interview Questions": "I was asked about my background in working with children and families. Also, certain questions about statements made in my cover letter....asked to elaborate."}, {"date": "29 Jun 2016", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (Oakland, CA)", "Interview Descriptions": "i applied online and got a call 4 days later for a phone screening, and scheduled a group interview for a week later. Then had a group interview with 8 of us to 1 interviewer. All of the questions were situational, and you answer when you felt comfortable. Overall it was a pretty laid back interview, but they do not give you any feedback. They definitely already have in mind who they are looking for, and they touch on that a little bit in the beginning of the interview.", "Interview Questions": "What would you do if it was your first day and a student called you a bitch?"}, {"date": "26 Jul 2016", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Seneca Family of Agencies (Oakland, CA) in Jun 2016", "Interview Descriptions": "1.) Initial Phone Screening\r\n2.) Group Interview - Group of 5 people(Very easygoing and comfortable)\r\n3.) Computer Test - Basic Excel and Word skills\r\n4.) Interview with Potential Dept. Head or Supervisor(My initial interview was with two people, but my second and third were one on one)", "Interview Questions": "Why Seneca?"}, {"date": "28 Jun 2016", "title": "Behavioral Coach Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies in Jun 2016", "Interview Descriptions": "Interview Process was very impersonal and awkward. Group Interview. People were late. While we were waiting for others to arrive I looked around at the training center, and was really impressed by the environment. I appreciated the gender neutral bathroom attempt, although having 5 urinals and 2 toilets in a stall isn't exactly ideal or practical. Parking was a pain, I arrived 40 minutes early because we were warned about this. I had to park on a dirt road and hike up multiple flights of stairs. Interviewers seemed like actors reading a script and adding in gestures and facial expressions to make it seem more realistic.", "Interview Questions": "What personal details would you share with the children you would be working with?"}, {"date": "17 Oct 2016", "title": "Classroom Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (San Francisco, CA) in Jun 2016", "Interview Descriptions": "Interview was fairly easy. It was a group interview with about 6 other people, and the questions had a lot to do with why you want to work there and situational questions. Questions are answered on a \"whoever wants to answer\" kind of basis. Interviewer was very informative and left a lot of time for interviewees to ask questions.", "Interview Questions": "What would you do if a student called you a b*tch in your first day?\r\n\r\nWhat would you do if you saw one of your students selling drugs but you were off duty?"}, {"date": "11 Jul 2016", "title": "Mental Health Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Jun 2016", "Interview Descriptions": "Applied online and got a response the next day to set up an interview.  It was a group interview that took about 1.5 hrs.  Questions were more situational than about you as a person/employee.  Each interviewee spoke in no particular order, but all answered each question.  It was more of a discussion, as each interviewee could build off what the other said.  The interviewer would polish off each question with a \"Seneca-like\" answer, usually telling the mission and values of Seneca and what kinds of kids yo u would see at Seneca.  There are two more interview rounds if you get past the first one.  Interviewer told us she would follow up with each interviewee about the status of their application by 5-7 business days-- however, it has been 2 weeks and I have not received an update.", "Interview Questions": "What would you share about your personal life to one of your clients/kids and why? (or something to that effect)"}], [{"date": "6 Jul 2016", "title": "Senior Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Jun 2016", "Interview Descriptions": "I got an email from the current Senior Administrative Assistant of the Executive Director of Crisis Services asking me if I'd be interested in an interview. We scheduled things, and it all went pretty smoothly. A week later, I drove to San Leandro, walked into the front office, and waited for the Director to show up. The wait time was good; it only lasted a few minutes. I was then greeted by the Director, and we walked over to where her office was. The overall interview process was pretty standard, but there was one thing that went wrong: Mid-conversation, she stopped us so that she could text/ send an email/ whatever on her phone. I then proceeded to sit there in awkward, uncomfortable silence, for at least 5 minutes. I know that 5 minutes isn't very long in the big picture. HOWEVER. As an interviewer, you must know that the interviewee is already extremely nervous and receptive of any signals you are giving them. So, to the interviewee, 5 minutes feels MUCH longer than it really is. And pulling such a rude stunt in the middle of an interview shows that you do not have respect for the person who is showing interest in working for you and your company. I have never been in this kind of situation before. \r\n\r\nAnyways, after that happened, we continued with the interview. The Director seemed extremely terse and distant, which also was a bad sign for me. In the end, she started seeming less and less interested in what we were doing, like she had somewhere better to be. When I asked her my questions that I had for her, she gave me very short and sometimes unhelpful answers. I know that she is a busy woman, and the fact that she was giving me such a bad vibe was just a standard, tell-tale sign that I was not the right candidate. My only problem is, however, that she seemed disinterested right from the get-go. If you already knew that I wasn't a good fit for this position, why did you even bother to interview me in the first place? So much time, gas money, effort, and stress could have been spared if you did us both the favor of not reaching out to me in the first place. Since you did do so, at least give me the basic respect that professionals give to each other.\r\n\r\nOne more thing: At the end of our interview, the Director told me that they would get back to me with a decision within the next week. It had been more than two weeks until they got back to me. I understand that you are extremely busy and that interviewing may not be the top priority right now. But don't say things that you don't mean. Even a \"We honestly don't know when we'll get back to you\" would have been better, because then I wouldn't be confused and concerned when one week goes by and I don't even get an update email.", "Interview Questions": "Why are you interested in working for Seneca?"}, {"date": "23 May 2016", "title": "Health Information Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (Oakland, CA)", "Interview Descriptions": "I applied online, they gave me a call within the next week, and I started out with a group interview. There were four people in total, and we were interviewing for various positions. They asked us basic questions, such as why we wanted to work at Seneca and about our previous experience. After the group interview, I did not receive an invitation for a second round.", "Interview Questions": "What would your previous boss say were your greatest strengths? Your greatest weaknesses? "}, {"date": "24 May 2016", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seneca Family of Agencies (Ventura, CA) in May 2016", "Interview Descriptions": "It was a group interview. Part one of two part interview process. We were told only 5 % of applicants get interviews, and only 5% of those get hired.  Very pleasant and fun format.  I was super impressed and inspires  by the other applicants.  I would be so honored to obtain a second interview!", "Interview Questions": "I was interviewed with about 6 other applicants.  We were asked to introduce ourselves and then asked several \"'what would you do?' scenarios\"\r\n\r\nPart one of two part interview process. We were told only 5 % of applicants get interviews, and only 5% of those get hired.  Very pleasant and fun format.  I was super impressed and inspires  by the other applicants.  I would be so honored to obtain a second interview!"}, {"date": "21 Jul 2016", "title": "Human Resources Recruiter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Seneca Family of Agencies (San Leandro, CA) in May 2016", "Interview Descriptions": "It was very brief. I participated in a group interview with just two people. We were asked situational questions as well as standard interview questions. The interviewer was very nice and respectful.", "Interview Questions": "How would you handle it if the phone rang, you had to get a conference room ready, make copies, and assist people that entered the office all at the same time?"}, {"date": "30 Jun 2016", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (Oxnard, CA) in May 2016", "Interview Descriptions": "A 10-15 minute preliminary phone call reviewing the responsibilities and benefits of the position and an invitation to attend a group interview within the week. At the group interview, there were five other applicants, not all for the same position, and one interviewer. He asked a series of situational questions which applied to office work, case work, or field work.The interview felt relaxed and conversational. At the end of the interview, our interviewer outlined in detail the responsibilities of each position that was available for any of the applicants and asked us to fill out a form ranking which positions we want and in what order. I was emailed about 10 days after the first round interview to partake in a second round interview and skills test but opted out, as it had become clear to me that the position description that originally interested me in applying had become dramatically different and I no longer had an interest in or the proper qualifications to pursue this particular job.", "Interview Questions": "Describe at time at which you felt uncomfortable at work. Explain why and how you handled the situation."}, {"date": "2 Aug 2016", "title": "Administrative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at Seneca Family of Agencies (Oakland, CA) in May 2016", "Interview Descriptions": "Consisted of a group interview with only one other interviewee. This was my first interview after undergrad and was not what I was expecting. The interviewer was friendly but it felt impersonal. It was good practice for what I need to work on.", "Interview Questions": "What would your current manager say your biggest weakness is?"}, {"date": "16 May 2016", "title": "Human Resources Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Seneca Family of Agencies (Oakland, CA) in May 2016", "Interview Descriptions": "Multiple person interview, which is fine. But the interviewer seemed rehearsed and underwhelmed by the presence the applicants. The questions were relatively easy. First, we started off by explaining who we are and our work background a bit. Then the Recruiter asked some questions. Then he explained each position and the company as a whole.", "Interview Questions": "What are three great qualities that you can bring to the workplace?"}, {"date": "4 Apr 2016", "title": "Human Resources Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at Seneca Family of Agencies (Oakland, CA)", "Interview Descriptions": "I applied and was called within the next week and invited to a group interview. The group interview was laid back  with simple questions and I quickly learned that nobody in the group interview was applying for the same position as me. I was called the day after the group interview and was invited to take a computer test, again very simple just tested basic knowledge of Microsoft word and excel. After the computer test, I was contacted for a final individual interview, which again was fairy easy.", "Interview Questions": "They asked situational questions, as in what would you do if...? Also ask why you want to be apart of Seneca. "}, {"date": "11 May 2016", "title": "Classroom Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Apr 2016", "Interview Descriptions": "Brief phone screening after applying online. Then I had a group interview with 7 other people. We were all applying for the same position except for two who were applying to be a youth counselor.\r\nThe interviewer would ask a question and expect each of us to answer.  It felt pretty chill and more like a conversation.", "Interview Questions": "What do you keep in mind during times of crisis and what do you do to decompress (or something to that effect)?"}, {"date": "14 Apr 2016", "title": "Program Assistant/Health Information Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seneca Family of Agencies (Oakland, CA) in Mar 2016", "Interview Descriptions": "Applied online. Got contacted via phone, when she did a quick impromptu phone screening. Immediately offered me a group interview. Went to group interview the following week. Pretty straightforward and very casual, with people interviewing for all kinds of different positions (I was the only one interviewing for my position). Pretty typical questions, including a situation question. Got contacted the following week about coming in for a test. Really simple Microsoft Word/Excel test (hint: only need to know the SUM function....I was trying to review VBA and macros in preparation for this test, really overestimated and overthought it). Anyways, next week I got called in for an in-person interview with the people I'd be working under. Interview went fine...until they realized that I was still in school (only for another month, though), at which point they finally decided to inform me (in the middle of the interview!!!) that they were looking to hire someone immediately within the next two weeks. Straightforward process that's pretty relaxed, just annoying that it took them 3 weeks to realize that I was still in school...", "Interview Questions": "Describe a project you are especially proud of, are you a team player or an independent worker, how would you handle a situation where a colleague wasn't doing their job and you need their input in order to meet a deadline, etc. Know your resume/background well and be ready to link your experiences to the role (like with any other interview)."}], [{"date": "5 Apr 2016", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies in Mar 2016", "Interview Descriptions": "So far has taken about 3 weeks. I am still pending for a second interview. First Interview: Asked a lot of questions about how I have dealt with issues in the past. How I have dealt with someone who was upset. How I have dealt with cultural differences. What my previous employer would say regarding how I need to grow.", "Interview Questions": "What are you excited/nervous about your first internship?"}, {"date": "6 Jun 2017", "title": "Senior Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies in Feb 2016", "Interview Descriptions": "4 Rounds of interviews. Phone interview was fairly easy, just basic questions why you're interested and why you think you're a good fit for the position. 2nd round was a group interview and it was more conversational. Try to speak no later than second person because often times people have similar answers. The interviewing has a blank face whenever you answer. I guess it's to show that they're unbiased? 3rd round was basic computer test (Word and Exel). You need to know basic exel cell formating.", "Interview Questions": "You're at the front desk, the phone rings, then your supervisor comes up and asks you to make copies of some documents, you need to set up a meeting room in 5 minutes, a patient comes in needing help, then a police office also comes in. How would you prioritize this?"}, {"date": "23 Mar 2016", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Jan 2016", "Interview Descriptions": "Four interviewees an two interviewers. Interview was about 1.5 hours, lots of questions, many asking what one would do in certain situations with difficult to manage, difficult to teach, difficult to soothe kids.", "Interview Questions": "What would you do if you saw one of \"your\" clients (a child in your program), on the street corner looking suspicious of selling drugs? ( you are \"off duty\")"}, {"date": "16 Dec 2015", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Nov 2015", "Interview Descriptions": "After receiving a brief phone interview (basic information), I was invited to a group interview There were two people from Human Resources conducting the interview amongst 6 applicants for different positions Most questions were situational ... What would you do if ?  Pretty common sense questions ... So it seemed I thought I answered the questions well with experience However, I think they are looking for recent graduates who have a good base, willing to learn and utilize their model I felt that my years of experience as a teacher and in administration actually hindered my job opportunity Advice:  listen and present yourself to an openness to their model", "Interview Questions": "Use one word to describe yourself and tell us why"}, {"date": "10 Mar 2016", "title": "Youth Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Nov 2015", "Interview Descriptions": "A phone interview was scheduled first so they can get to know a little about me and my background. I was then directed to a group interview. It wasn't as intimidating as I thought it would be because the group I was with were all interviewing for different positions. Most of the questions being asked were scenario questions or questions that you needed experience in working with children.", "Interview Questions": "What would you do if someone cursed at you on your first day?"}, {"date": "16 Jan 2016", "title": "Classroom Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (Oakland, CA) in Nov 2015", "Interview Descriptions": "I applied online and within a week received a phone call asking some general interview questions. I then was asked to come in for a group interview, but declined the offer.", "Interview Questions": "How would you handle a student swearing at you?"}, {"date": "25 Jul 2019", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seneca Family of Agencies in Oct 2015", "Interview Descriptions": "Friendly, non-judgmental and positive. I appreciated the environment and connection made with director. I felt welcomed, secure and safe to express myself. I was encouraged to think outside the box and demonstrate my ability to relate to others.", "Interview Questions": "Can you develop goals?"}, {"date": "22 Nov 2015", "title": "Data Analyst/Research Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at Seneca Family of Agencies in Oct 2015", "Interview Descriptions": "It was a 3 step interview process - 30 mins prescreen onsite then a technical excel test (with some VBA Coding) then a final 1 hour + interview with multiple colleagues. It took 2 months plus for this  entire process. Big application forms requiring details and references to be filled out at the start of the process itself.", "Interview Questions": "Questions based on your resume and experience. "}, {"date": "16 Sept 2015", "title": "Case Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Sept 2015", "Interview Descriptions": "first a couple questions on the phone with hr, then a group interview and then a computer test with word and excel and then an on site interview with qa and a member of the on site staff. all went well and I got an offer and then after I accepted they told me that I \"didn't sound excited enough\" and that they were going to continue interviewing other people... not sure how that works or is ok but for everyone else make sure you put on your best excited voice if you get an offer -_-", "Interview Questions": "for the computer test you need to know excel"}, {"date": "12 Aug 2015", "title": "Family Support Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "phone interview then non competitive group interview then individual interview. Individual interview seemed to be just if you are a good personality fit for the office and to really emphasize the heavy load and ask if you could handle it.", "Interview Questions": "How would you respond to a parent who asked you how you could give them support if you are not a parent? What is one enrichment activity you would do with a group of kids?"}], [{"date": "9 Aug 2015", "title": "Mental Health Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "During the first interview, I met with one of the supervisors. It was a pretty general interview and most of the questions were just trying to get to know you as a person. The supervisor explained about the company as well as the salary and benefits. I received call that same day to set up for a second interview that week to meet with another supervisor. The second interview was composed of case scenarios and testing your skills as a therapist. I got a sense during both interviews that they already had someone in mind for the job from the little things that they said, so when I was notified that I didn't get the position I wasn't surprised. Overall, I had a pretty positive experience. The supervisors were professional and friendly and both showed passion for the clients they worked with.", "Interview Questions": "What did you do when you liked or did not like a client and how did you handle that countertransference?"}, {"date": "11 Jul 2015", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Seneca Family of Agencies (Oakland, CA)", "Interview Descriptions": "The entire interview process took a little over two months from the time I applied. First I attended a group interview with about 10 other people. Seneca kindly tries to lessen the pressure by pooling interviewees who are not necessarily interested in the same positions or locations. The interview did feel less competitive and nerve-wracking this way, but it was still awkward at moments. It's discussion based, so prepare yourself to jump in and formulate original answers to a question 10 people have just answered. It seemed pretty clear to me that the group interview's purpose is to find out how well you can listen to, talk with and work with others. Almost all of the open positions were described as very team-oriented. \r\n\r\nThe second interview was a 1 on 1 with a program supervisor. This experience was completely fine. My interviewer was a little late, but they asked fair questions and gave time for me to ask questions and pick their brain about the job. They even asked some repeat questions from the group interview. It would be a good idea to prepare a list of emotional/behavioral signs that indicate a struggling child in advance. The program supervisor then set me up for the third and final interview, which is an interactive at one of their school sites.\r\n\r\nThis is where things got odd for me, and I suspect it's probably why I didn't get an offer. If you get to this point, you will be expected to head over to one of Seneca's schools where you will observe a Classroom Counselor, and they will in turn observe you as you interact/don't interact with the children. They will then report back to the program supervisor and supposedly give their opinion of you. \r\n\r\nThis experience was the worst part of the process for me. My host was, honestly, quite rude the entire length of the procedure. They spoke to me, maybe, a total of three minutes out of the entire hour and a half interview. At the time, I brushed it off as them maintaining a sense of objectivity. I carried on and tried my best to interact with the kids while maintaining a sense of boundary. They gave no notice of interview time frames, no feedback or thoughts about my performance and no chance to ask ask about their job. I get the sense they were pretty annoyed that I was interrupting their day (understandable). If you have to do an interactive interview, I'd say be more assertive than I was about interacting with your host so you can better understand how they think a Classroom Counselor should act/carry out their job. I think I may have faired better if I'd tried to match my host's style of interacting with children in the classroom.\r\n\r\nFinal opinion, the strangest aspect of this interview process was being expected to interact with children who don't know you and won't continue to see you. Seneca seems to pride itself on building strong bonds with young people, but they think it's okay to send in random, transient strangers for the sole purpose of an interview. I didn't trust that my interactive host really took the time to assess how well I would have done the job. Even after asking for feedback twice, I was not given any. And, the process really just took way too long. I waited 3-4 weeks between each interview before I got responses.", "Interview Questions": "Describe a time you disagreed with your supervisor. What happened and what did you do?"}, {"date": "27 Aug 2015", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Seneca Family of Agencies (Hayward, CA) in Aug 2015", "Interview Descriptions": "The interview was a group interview but there were only 4 people and they were all incredibly friendly and kind people so the intimidation factor of being interviewed in a group did not last. The interview primarily consisted of scenario questions that previous employees had to face and we were all asked to answer the same question. The second part was more of a out of the book interview in which we had to describe difficult situations and how we dealt with them. It seems to me that overall, very specific previous experience is what they look for above anything else.", "Interview Questions": "If you see a client you have recently bonded with selling drugs, how do you handle the situation?"}, {"date": "12 Aug 2015", "title": "Mental Health Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Seneca Family of Agencies in Aug 2015", "Interview Descriptions": "I applied online and recieved a phone call three days later to schedule a group interview. The group interview consisted of 6 people. The interview itself felt competitive, even though some applicants were applying to different positions. The agency notifiys applicants (via email) 4-5 days after the group interview regarding if they are offered a second interview.", "Interview Questions": "the kids will sometimes ask you questions about your person life, how much information would you disclose to the kids? "}, {"date": "7 Aug 2015", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (Oakland, CA) in Jul 2015", "Interview Descriptions": "There were 5 candidates in the room and 1 interviewer. The interviewer had a set of 5-6 prepared questions. Each candidate had an opportunity to answer each question in any order. The interview felt low pressure and relatively comfortable. However, this disguised its difficulty.  The majority of the questions were difficult hypothetical situation questions. I believe people feel pressured to share space and therefore do not elaborate enough on their thinking for each question. If I could do the interview again I would try to add examples from my past working experiences to justify my answers. You are able to apply for any job or multiple jobs from the same group interview.", "Interview Questions": "N/A"}, {"date": "29 Aug 2015", "title": "Therapist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (Orange, CA) in Jul 2015", "Interview Descriptions": "The interview process was fairly simple and easy going. The only problem with this company is that they don't do the courtesy of interviewing all the interviewees. Once they find qualified candidates the company cancels on the candidates that may have scheduled interviews later on in the week. This process prevents other more qualified candidates to be interviewed, but allows the company to hire candidates that meets the bare minimum requirements.", "Interview Questions": "What theoretical orientation do you use during session?"}, {"date": "16 Jul 2017", "title": "Mental Health Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Seneca Family of Agencies in Jul 2015", "Interview Descriptions": "The interview process included a phone screening to discuss job qualifications and expectations. Second interview included a review of job experience and personal qualities. In addition third interview included discussing various scenarios and engaging in a couple roleplays. Definitely be prepared to discuss how you would handle tough situations with kids and families. I would encourage to meet with supervisor and your program team members.", "Interview Questions": "How would you handle a situation where a child engages in name calling? "}, {"date": "18 Jun 2015", "title": "Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Jun 2015", "Interview Descriptions": "I applied online and got a call from them 10+ days later. They asked why I wanted to work for Seneca and then scheduled a group interview. My group consisted of 5 others and we were all applying for different counseling positions for various locations. We were all asked the same questions, but had to answer at least one per question. A few days later, I got scheduled for a 1-1 interview.", "Interview Questions": "It is your first day at work and a child you have not spoken to before point to you and says, \"I don't like that b*\". What would you do?”"}, {"date": "12 Jun 2015", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Jun 2015", "Interview Descriptions": "I applied online and got a call from a recruiter about 10 days later. They asked why I wanted to work for Seneca and then scheduled a group interview.  My group consisted of 4 others and we were all applying for administrative positions for various locations.  The recruiter that led the interview was really nice and made us feel at ease. We were expected to answer each question, which is good because we weren't fighting for air time.  After the questions she explained a bit about the company and their services.  It took about 1.5 hours and she told us that we would hear back within a week either way. The next step would be a computer test in word/excel and then an interview with the program we were applying for.  Just from their interview process I can see that they value teamwork and and fostering a friendly and open atmosphere. There seems like a lot of room for growth in this organization and it has been a good experience so far.", "Interview Questions": "How did you handle a conflict with a supervisor or coworker?"}, {"date": "28 Jul 2015", "title": "Human Resources Recruiter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Jun 2015", "Interview Descriptions": "The interview process for this admin position consists of a phone screen, a group interview, a computer test and two in-person interviews (I interviewed with the recruiter lead and HR director and then again with another recruiter) The first in-person interview, they didn't seem to have any questions prepared so the HR Director mostly just went over my resume with me. It was pretty nerve-wracking because she was asking the questions in rapid-fire mode. I thought I did pretty badly because my nerves got to me, but they still ended up calling me back in. The second interview was with another recruiter. It was a much more friendly atmosphere and speaking with this person and learning more about the various projects really made me want to work for Seneca. I thought I did significantly better in handling my nervousness. I was rushed out of the interview because he had another appointment right after and we were already over our time (which I took as a good sign). Ultimately I didn't get the position but had a pretty good experience interviewing with Seneca. The only thing that irked me was that the wait in between calls are about a week so the whole process took over a month.", "Interview Questions": "If we give you $10000 for marketing for the agency, what would you do with it?"}], [{"date": "18 Jun 2015", "title": "TBS Clinician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seneca Family of Agencies (Oakland, CA) in Jun 2015", "Interview Descriptions": "Was called a week after applying on their website to set up an interview. I was interviewed by one supervisor and it was a relatively generic interview. After a few pretty broad questions, the interviewer told me more about the position. She was pretty poker-faced throughout and, because she asked me relatively few questions, I got the sense that it was just a formality to have me there. Perhaps they had already decided on someone else? Sure enough, I was not offered a position.", "Interview Questions": "What theoretical orientations do you like/use? What kinds of case notes do you have experience writing?"}, {"date": "19 May 2015", "title": "Wraparound Care Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seneca Family of Agencies", "Interview Descriptions": "They did a phone interview followed by two in person interviews. Direct supervisors were not present, and other admin staff facilitated the interview. Each interview took about an hour.", "Interview Questions": "how do you deal with witnessing much suffering"}, {"date": "11 Jun 2015", "title": "Youth Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (San Leandro, CA) in May 2015", "Interview Descriptions": "Within a week of applying, HR called and set up a group interview. That interview lasted about an hour and a half and involved about 7 scenario questions. There was lots of time for our questions about the various positions and locations Seneca has to offer. They emailed everyone within 8 days of their decision.", "Interview Questions": "How do you make time for yourself and recharge?"}, {"date": "9 Jun 2015", "title": "Program Assistant/Case Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (Oakland, CA) in May 2015", "Interview Descriptions": "It was a group interview. HR recruiter was very knowledgeable about the organization and explained to us about what they do. We were 5 of us for the interview.  For each question, each one of us answered it.  Interview was easy as the HR recruiter made us feel comfortable.  We had to tell about ourselves, some were situational and behavioral questions.  What are my top 3 strengths? What is my weakness and need improvement on? If you are well prepared you would do just fine.  Within 4 days of my interview, I got a phone call to come in for the computer test(Entry Level Word and Excel).  Within a week of taking the computer test, I called them to find out the status.  Was told that, I would find out at the end of the day. Got the email in the evening, No offer.", "Interview Questions": "(Situational Setting): How would you handle stress?"}, {"date": "2 Jun 2015", "title": "Mental Health Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Seneca Family of Agencies (San Francisco, CA) in May 2015", "Interview Descriptions": "I submitted my application for the MH Therapist position in SF and was contacted via email 2 days later by the Clinical Supervisor of their Early Childhood MH program (Building Blocks Preschool) in Oakland to set up an interview for the MH Consultant position. I was surprised to receive an invitation to interview for that position because it was a different one than what I'd applied to (!), but decided to do so since it was a good match based on my clinical experiences.\r\n\r\nThe Skype interview was set up for a few days later over Skype, lasted about 1.5 hours and was generally pleasant. The questions asked were of average difficulty and used to gauge experience, comfort level and cultural fit within the agency. I was invited for a 2nd on-site interview that never happened (they ended up hiring someone else before getting to see me again), and was told that my resume would be passed back to HR for further consideration elsewhere.\r\n\r\nOverall, the application and interview process was smooth and positive. I do however wish there was more transparency as to how and when the agency makes hiring decisions so that I can plan accordingly.", "Interview Questions": "Q: How did you or would you deal with a parent who was absolutely disinterested in your work with their child?"}, {"date": "21 Apr 2015", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (Castro Valley, CA)", "Interview Descriptions": "I submitted cover letter and resume through their website and received a call from HR about a week later. They did a basic screening and scheduled me for a group interview later that week and emailed me an application packet to fill out and bring to the interview.\r\n\r\nGroup interview consisted of about 10 applicants and 1 interviewer seated around a conference table. Most applicants were either applying for different positions or different locations, so it was not competitive. There were general questions that anyone who wanted to could answer, and scenario/personal experience questions that everyone was expected to answer. At the end, the interviewer went over all the positions available, their locations, the starting pay for each, and benefits. \r\n\r\nInterviewer was friendly and chatty when explaining things, but stone-faced when listening to people answer questions. I understand it's to remain unbiased, but it led to a lot of awkward moments. They email everyone a few days after the interview, whether you get an offer or not, which is nice.", "Interview Questions": "A kid on probation that you've finally started bonding with, after months of no progress, drops a bag of weed in front of you and begs you not to tell anyone. What do you do?"}, {"date": "27 May 2015", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Seneca Family of Agencies (San Leandro, CA) in May 2015", "Interview Descriptions": "This was my first group interview, and it felt pretty impersonal. The interviewer was nice, but she just read off of a script.  I do feel like it helped me prepare for future interviews though.", "Interview Questions": "They gave us a list of 5 things happening at once and what order we would take care of them in. "}, {"date": "22 Apr 2015", "title": "Classroom Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "Group Interview which is hard to know how to balance your ability to collaborate vs. taking initiative. Although held by a very talented interviewer, the process is still from a script. It was difficult to really engage the interview as a human being and get a feel to see if there was a match. It is really hard to tell what it is they are looking for.", "Interview Questions": "What would you do if one of your clients you have been working with for some time is caught carrying a bag of weed which will violate his probation?"}, {"date": "22 May 2015", "title": "Classroom Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Seneca Family of Agencies (San Leandro, CA) in May 2015", "Interview Descriptions": "I applied online. About one week later I was contacted for a group interview. My group had about 8 other people. The interview felt pretty laid back. Almost as if we were having a conversation. We then were told about the jobs and benefits available to those that were hired. The recruiter told us we would hear something within 4 to 5 days about whether we received a position or not.", "Interview Questions": "How have you handled cultural differences in the past?"}, {"date": "30 Jul 2015", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (San Leandro, CA) in May 2015", "Interview Descriptions": "I applied online. The process took about a week. I was called in for a group interview with 3 others. The interview lasted about 1 hour. I was emailed a week later.", "Interview Questions": "What would you do if you walked into a classroom and a students said \" i do not know you b@%^&\""}], [{"date": "17 Jun 2015", "title": "Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Seneca Family of Agencies in Apr 2015", "Interview Descriptions": "The interview was with the manager and the director of the program. They made me feel very comfortable, which was great. I started the interview by answering to a few questions based on a clinical vignette. The interview last more than 1 hour. The questions were mostly about my understanding of the position, as well as my experience.", "Interview Questions": "Why do you want to work in this program?"}, {"date": "17 Mar 2015", "title": "Classroom Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Seneca Family of Agencies (Oakland, CA) in Mar 2015", "Interview Descriptions": "It was long, group interview.  One interviewee looked as if he did not even care to be there.  The other was very positive and bubbly.  It was awkward in that the questions were specific situations and almost everyone thought the same way, so it was basically like a game of who could speak better.", "Interview Questions": "After earning their trust, your youth is caught with a bag of weed. what do you do?"}, {"date": "7 May 2015", "title": "Youth Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Mar 2015", "Interview Descriptions": "I had the opportunity to attend the panel Interview in March. There were about 7-10 people in the room. The HR manager asked us a couple of questions about our prior experience with kids with drug use issues, family issues, and emotional issues  in the capacity of a counselor. Almost all of the questions he asked are situational which means you should have some experience from your job that enable you to deal with future problems.", "Interview Questions": "How did you deal with any conflicts that took place between you and your supervisor?"}, {"date": "14 Jul 2015", "title": "Case Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Mar 2015", "Interview Descriptions": "First was a group interview with other administrative positions, and was followed by a computer proficiency test where they tested me on Excel and Word programs. Following the computer test was  two individual interviews. They all were very casual in which they asked me about my resume and experience and details about the job. The only interview that felt formal was the group interview because you were answering specific questions and had to share the time with the other candidates.", "Interview Questions": "Describe a time when you had to do something outside of your job description."}, {"date": "24 Feb 2015", "title": "Program Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "Interview process was simple. Went into a meeting room for group interview. Most of the interviewees were for the same job. Overall it was an easy group interview type where each person talks in turn.", "Interview Questions": "Basic information, what you would do in a stressful situation, if the phone is ringing and you have a customer waiting and you need to get papers ready for a meeting in 5 minutes?"}, {"date": "2 Mar 2015", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Feb 2015", "Interview Descriptions": "I applied online to multiple positions with Seneca and was contacted about a month after I submitted the online application. They first called me and did a sort of phone screen type of interview then went ahead and scheduled me for a group interview later that week. I interviewed in San Leandro with two other women in my group. The male conducting our interview seemed as if he had a memorized speech and did not seem actually engaged with the answers the other women or I gave; instead, he seemed like a robot reading off a page of notes. A lot of the questions he asked were situational and had to do with \"what-if\" worst-case-scenario's in a classroom.", "Interview Questions": "N/A"}, {"date": "30 Nov 2016", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Feb 2015", "Interview Descriptions": "The whole process was a bit uncomfortable. Because the company focuses on altruistic intentions, I expected the interviewer to be at least somewhat of a warm person. However, the interviewer was extremely robotic and rather cold. They recited the interview questions monotonously, stared blankly at me while I answered them, and then immediately jumped to the next question as soon as I was done speaking. The interviewer asked a mix of basic and practice-based questions.", "Interview Questions": "What is your experience with diverse populations?"}, {"date": "22 Dec 2014", "title": "Classroom Counselor Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "Group interview. About 10 people sitting in a round table. Being asked pretty basic questions, such as \" why do you want to work here?\"\"Do you know what type of children we work with?\"\"why do you want to work with these children?\"\" what woud you do if ....\"? atc", "Interview Questions": "N/A"}, {"date": "19 Feb 2015", "title": "Recruiting Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Seneca Family of Agencies (Oakland, CA) in Jan 2015", "Interview Descriptions": "I applied online. Recieved a call from a recruiter right after, asked me briefly whether I have the minimum qualification or not and set me up with a group interview.", "Interview Questions": "How did you hear about Seneca"}, {"date": "15 Apr 2018", "title": "Family Support Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Seneca Family of Agencies (San Francisco, CA) in Jan 2015", "Interview Descriptions": "I found it to be a very comprehensive and thorough interview process and I can see why now that I work there. Seneca only hires high-quality candidates who they feel fit with the company values and are passionate about the youth and families. This is difficult, but meaningful and awesome work and they clearly want to weed out those who aren't truly called to the work.", "Interview Questions": "Tell us about your experience working with youth and families."}], [{"date": "6 Apr 2015", "title": "Youth Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Dec 2014", "Interview Descriptions": "Before coming in for an interview, the agency called to ask a few questions about how I found out about the job and why it is that I wanted the position. They then asked me about my availability and which location I would like to work in. At the end of the phone call, they asked me what days I am available for a group interview. \r\n\r\nThe group interview consisted of about 8 people including me. Everyone at the group interview were applying for various positions at Seneca. During the interview, it kind of felt like a competition on who could answer the quickest and best. Since there were quite a few of us, it was hard to not say something similar to what someone has said before.", "Interview Questions": "This is a scenario question. What if you walked into a room and a child yells and says for you to stay away from them and uses profanity? How would you approach the situation? "}, {"date": "17 Dec 2014", "title": "Family Support Counselor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Seneca Family of Agencies", "Interview Descriptions": "Group interview. It was fun being able to interact with other people. You can see management is very passionate about their jobs and if accepted you would be apart of a great company.", "Interview Questions": "Biggest disappointment "}, {"date": "12 Dec 2014", "title": "Classroom Counselor/Behavioral Coach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seneca Family of Agencies", "Interview Descriptions": "It was a group interview process. I thoroughly enjoyed my time interacting with the other applicants. We were asked questions and told to jump in whenever to answer the question. They want to see how you interact with others. I had a great time and developed a greater genuine interest in the company after the interview process.", "Interview Questions": "Given scenarios and how you would handle the situations"}, {"date": "8 Dec 2014", "title": "TBS Coach Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "First interview was a group interview. There were seven people including me being interviewed by one interviewer. We each had to answer the questions he posed, just chiming in whenever we thought of something instead of raising hands or going in a particular order. It took 2 hours. The second interview is in-person.", "Interview Questions": "\"What do you think of the term \"emotionally disturbed\" when used to describe children?\""}, {"date": "24 Feb 2015", "title": "Care Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (Tustin, CA) in Dec 2014", "Interview Descriptions": "Pretty straight forward process. Applied and received a call in 3 days . They asked for me to come for an interview. They asked standard question like why do you want to work here? strengths, weakness, etc.", "Interview Questions": "Your strengths, weakness, why you want to work here, questions abut if i were in certain situations"}, {"date": "30 Jul 2017", "title": "Staff Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Dec 2014", "Interview Descriptions": "Multi-step interview process.  First interview was with Accounting Director and Controller, and took a quick Excel test on the computer before leaving.  Second interview was with the Accounting Director and Chief Financial Officer.", "Interview Questions": "How comfortable I was with the Mas 200/Sage 100 ERP program."}, {"date": "27 Nov 2014", "title": "Mental Health Clinic Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Seneca Family of Agencies (San Francisco, CA) in Nov 2014", "Interview Descriptions": "Received a call about a week after applying online.  I traveled to San Francisco for a group interview consisting of 7 individuals.    Felt like it went well. Was expecting a second interview that did not happen.", "Interview Questions": "What exactly do they want?"}, {"date": "15 Aug 2015", "title": "Peer Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Seneca Family of Agencies in Nov 2014", "Interview Descriptions": "I applied online and then was contacted about a week later for a phone interview. \nThe phone interview went well, I was then invited for a group interview. \nThe group interview was something new for me. It wasn't a panel, it was actually a group of other applicants in one room with 2 interviewers.", "Interview Questions": "Why do you want to work here?"}, {"date": "29 Sept 2014", "title": "Classroom Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "you will first have a group interview. if you pass you move to a 1-1  and an interactive interview with the kids. The first interview was about 2 and half hours because there was about 15 of us. It was collaborative and we all communicated thoroughly as a team or like a seminar. The 1-1 is really chill, you get to know the team and staff, and experience how it would be if you were to work there! great process.", "Interview Questions": "N/A"}, {"date": "1 Oct 2014", "title": "Case Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Seneca Family of Agencies", "Interview Descriptions": "I applied online and received a phone call from HR about a week later. The HR representative asked me a few questions about my background and I was invited to a group interview. The group interview consisted of 3 other candidates and we were asked a variety of scenario questions. After the group interview, I was asked to come back to take a computer skills assessment test.", "Interview Questions": "N/A"}], [{"date": "22 Oct 2015", "title": "Care Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (Oakland, CA) in Oct 2014", "Interview Descriptions": "I went through a  couple level of interviews. First was a phone call, then I was invited for a group interview, and finally, I was given a tour of the school where I could potentially be placed and introduced to people I could potentially work with. All three levels were very friendly. The group interview was particularly interesting because it had a very discussion feel.", "Interview Questions": "Why do you want to do this? If this happened with a child in the middle of the class, how would you handle it?"}, {"date": "25 Sept 2014", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Seneca Family of Agencies in Sept 2014", "Interview Descriptions": "I applied online and was contacted by phone shortly after and had an interview in person a few days later.  They email you a three page application, an Equal Opportunity Data Form, and an Education Authorization form to complete prior to the interview.  The interview lasted almost 2 hours including question and answer opportunity afterward.", "Interview Questions": "The questions were worded EXACTLY as described by previous reviewers so the interview is completely scripted.  No variance and nothing unexpected or unusual.   "}, {"date": "6 Nov 2014", "title": "Case Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Sept 2014", "Interview Descriptions": "Interviewed a group of 5 possible candidates applying for various positions all at once. Which sucks because you don't get the direct attention or opportunity to shine as you would on a one to one interview. My first time doing this, and in all honesty it was dumb and not fair. I think the H&R people are dumb because it seems like they are taking the easy way out for doing group interviews. They honestly seemed like robots and showed no emotion whatsoever! it was weird!! They really need to take time to get to know the appliants one on one to give an equal chance and opportunity.", "Interview Questions": "Gave a scenario of five things occurring at once and how we would best address the situation."}, {"date": "20 Jul 2014", "title": "Classroom Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seneca Family of Agencies (Oakland, CA) in Jul 2014", "Interview Descriptions": "I emailed my resume and cover letter in then about a week later I received a phone call from HR asking a few questions about why I wanted to work for the agency. Set up to come in for a group interview the following week which consisted of 8 people. There we were asked about our background and why we wanted to work for Seneca even though the children can sometimes be hard to handle. The interviewer then explained some behaviors and asked how we would respond to them. The hardest part was making sure you responded to each question and didn't just say I agree. Later in the week I got a call from a director in the city I wanted to work in asking to come in for a 1:1 and interactive interview. This was more formal they just wanted to know about you and went into more detail about the company and their school. During the interactive portion they allow you to interact with the children during the school day and they don't hover over you. They also asked for a simple writing sample just to make sure you were capable of doing the daily summaries. Then a few days later I received a call from the supervisor offering me the position!", "Interview Questions": "N/A"}, {"date": "18 Aug 2015", "title": "Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (San Jose, CA) in Jul 2014", "Interview Descriptions": "first they interview you over the phone, if they decide you are qualified they scheduled you for a group interview, if you like them, they will schedule you for a one on one", "Interview Questions": "what would you do if one of the kids insulted you?"}, {"date": "2 Jul 2014", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "Phone call from HR recruiter a week after applying online, asking why the position interested me, then talked about the requirements for the position. Scheduled for a group interview the following week. They e-mail you an application to fill out to bring with you to the interview. Group interview-5 people when I interviewed. Asked to name 3 strengths, and what a previous supervisor would say they would like you to improve on. How you handled a situation in a previous job that was a disaster. What kind of computer programs are you efficient in? They give you a situation and ask how you would handle it. After the interview questions, they tell you a little more about the company and the positions you are applying for. If they feel they have found a fit for you, then you will be given an excel/word test just so they know you know the basics. (not timed) After that, you will have a 1/1 interview with the supervisor of that specific program you are applying for.", "Interview Questions": "Nothing was unexpected. General interview questions."}, {"date": "5 May 2017", "title": "Family Support Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (Santa Rosa, CA) in Jul 2014", "Interview Descriptions": "They had me go through two lengthy interviews with the entire management team. The interviews were extremely in-depth and exhaustive.  Once I got in the company, I learned that they were very proud of how hard the hiring process was (and used that as proof that the people that were hired were the cream of the crop).", "Interview Questions": "They gave me a vignette that I had to write what I would do in that situation  even before I was brought into the interview. The interview itself was a lot of questions about my previous experience and \"what are your greatest strengths/challenges\" kinds of things. "}, {"date": "10 Jun 2014", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Seneca Family of Agencies (Oakland, CA)", "Interview Descriptions": "The initial interview is a group interview. My group had 6 other people in it. Then if you get a call back it is an situational interview. ie in the classroom. and after that a one on one personal interview. You are judged on how well  you interact with the other candidates and of course your answers. Seneca really values unconditional care for children,  when their behavior is not stellar.", "Interview Questions": "What do you think is the background of the kids we work with?"}, {"date": "24 Jun 2014", "title": "Classroom Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (Oakland, CA) in Jun 2014", "Interview Descriptions": "I had 3 total interviews plus the initial phone interview. Group Panel interview included myself and 6 other people. Informal, facilitator asked questions, everyone was given an opportunity to answer.\n\n1:1 interview with director and manger, went into more detail about the company.\n\nInteractive interview, in which applicant is evaluated based on their interaction with students.", "Interview Questions": "Why do you think you're the best fit for this position"}, {"date": "16 Jul 2014", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Jun 2014", "Interview Descriptions": "Emailed resume and cover letter. Received a phone call from HR asking a few questions about why I wanted to work for the agency. Set up to come in for a group interview. Interview consisted of about 7-8 people asking about our background and why we wanted to work for Seneca. Gave a few scenarios and wanted to know what you would do in those instances.", "Interview Questions": "What would you do if a child called you the b word?"}], [{"date": "20 May 2014", "title": "Speech-Langauge Pathologist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Seneca Family of Agencies", "Interview Descriptions": "The director of the Fremont non-public school (where I had been contracting at the time) approached me and asked if I would be interested in a full time position that would include serving both the San Leandro and Fremont non-public school sites. I was then contacted for an interview with the San Leandro director on site.", "Interview Questions": "None. Both directors were straight forward and down to earth."}, {"date": "7 Apr 2014", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Seneca Family of Agencies (Oakland, CA) in Mar 2014", "Interview Descriptions": "Received a call about a week after applying. Invited to a group interview of about 10 people which felt like a group discussion. BA level starts at $14 and MA start at $16.", "Interview Questions": "It is your first day at work and a child you have not spoken to before point to you and says, \"I don't like that b*\". What would you do?"}, {"date": "16 Mar 2015", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Seneca Family of Agencies (Tustin, CA) in Mar 2014", "Interview Descriptions": "Seneca recruiters went to my university and I submitted a resume. I got an email from Seneca about a week later with a link to current openings. I attended a group interview which consisted of the expected types of questions and was invited to stay for the computer test. I was called later that day to be scheduled for a 1:1 interview.", "Interview Questions": "What computer programs are you familiar with?"}, {"date": "31 Mar 2014", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies in Mar 2014", "Interview Descriptions": "I applied online and received a message on my answering machine a few days later. I called back and was asked a few basic questions about why I wanted to work at Seneca and what my background was. It took about 10 minutes. I was then asked to come in for a group interview. The interviewer was very friendly but asked some difficult questions with some scenarios of what you would do if a student called you a a derogatory name, spit on you, ect. I think the most difficult part was getting your voice heard but not being pushy or repeating things that have already been said.", "Interview Questions": "What do you think the background is of the children who you will be dealing with?"}, {"date": "15 Feb 2014", "title": "Family Support Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "Initially, I was called in for a group interview which right off the bat was extremely ineffective. The interviewer asked questions and told all 12-15 candidates to just call out the answers. It seemed to be too much of a competitive environment and gave little indication of an individuals contribution to the company.", "Interview Questions": "The most difficult question was what would you do if a child called you a b**** without even knowing you (yes they really asked this)"}, {"date": "19 Feb 2014", "title": "Wraparound Social Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (San Francisco, CA) in Feb 2014", "Interview Descriptions": "Online application. Was called for an interview by HR, who forwarded my name to the location I specified. At the location, I was first given a case description and asked to come up with questions I would have about the case and prioritize what needed attention (in writing). Then I was interviewed by two people, a manager of the whole group I would be working for, and a supervisor who was at the level directly above where I would be. Interview was an hour long, informal.", "Interview Questions": "How do you keep both the long-term treatment plan and the short-term goals and challenges of a case in mind at the same time?"}, {"date": "6 Jul 2014", "title": "Behavioral Coach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Seneca Family of Agencies (Oakland, CA) in Feb 2014", "Interview Descriptions": "I emailed my resume and cover letter to HR. About three days letter I received a phone call; the HR representative asked me some questions and invited me to a group interview. I came to the group interview and there were 4-5 more people there. We were asked to talk about ourselves, why we wanted the job and why we wanted to work with Seneca. We were also given some scenarios and how we would react/respond to these cases. Overall, it was a good experience.", "Interview Questions": "I don't remember the exact words but it goes... What would I do if a child pointed at me and said \"I do not want to work with that woman\"? And how would I build rapport with said youth?"}, {"date": "26 Jan 2014", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "I applied online and got a call in for a group interview about 3 days later. They ask you about 6 questions- What background do you think the kids that come here are from? These kids will be very curious about you and ask you all sorts of questions (personal questions) how do you deal with that? You are with one of your kids on probation for drugs and you find drugs on him what do you do?", "Interview Questions": "Most unexpected question was- These kids will spit on you, kick at you and call you every name in the book why do you want to work here? "}, {"date": "16 Sept 2015", "title": "Program Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (Fairfield, CA) in Jan 2014", "Interview Descriptions": "Group interview first with 5-6 people and a hiring manager. Roundtable. Be friendly and relaxed with other applicants. Very basic computer skills test is next - microsoft word and basic excel. Finally, a one-on-one interview with a counselor or other higher up. It's very clear that they are committed to creating a safe, friendly work environment, and communicating that you understand that and can handle the pressure of the center is essential.", "Interview Questions": "How would you make this office a better place?"}, {"date": "12 Dec 2013", "title": "Classroom Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Seneca Family of Agencies (Oakland, CA)", "Interview Descriptions": "The interview environment was very laid back and and genuine. After reading qualifications, some questions were asked and scenarios were given. It was a group interview so we all collaboratively answered.\r\n\r\nI was a bit surprised how negatively the kids that attend Seneca were portrait during the interview. I am not sure if it was to see the reaction of interviewees or if its it true.", "Interview Questions": "These kids will spit in your face, kick and punch you and call you every name in the book, why do you want to work with them?"}], [{"date": "5 Apr 2014", "title": "Family Permanence Facilitator, Social Work Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seneca Family of Agencies (San Francisco, CA) in Dec 2013", "Interview Descriptions": "Applied online and then played phone tag with the HR department for weeks. Finally scheduled an interview and once I passed the initial 1:1 interview, HR checked my references and then had a discussion about the jobs that were available at Seneca. When I discussed positions I would be interested in I went in for a second 1:1 for that specific position and got an offer two days later.", "Interview Questions": "Most questions were expected asking questions about considerations for different populations and how I understand wraparound. I heard that they look for responses about how you understand your role on the team, how to work collaboratively with community partners and that you ask clarification questions about potential concerns you may have about the case."}, {"date": "13 Feb 2014", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (San Jose, CA) in Dec 2013", "Interview Descriptions": "Applied online, very brief phone screen with HR recruiter who asked why I applied to Seneca and confirmed whether I met the minimum qualifications, then was invited to group interview the following week.\r\n\r\nFive other candidates were at the group interview. The HR recruiter first asked us to introduce ourselves and then asked a series of behavioral questions: strengths and weaknesses; how you handled a difficult person; how you managed a difficult situation; how you stay organized; how you would prioritize multiple tasks.\r\n\r\nAt the end of the 1-hour group interview, we were told that they would let us know whether we were continuing in the process within a week. The next steps would have been a 1-hour Word/Excel test, and then a 1-on-1 interview with the prospective supervisor.", "Interview Questions": "What steps would you take if you were manning the front desk and two phone lines started ringing, then a person walked in the door to be helped, then the Sheriff walked in the door, and you had to make 10 copies for a meeting in 5 minutes, as well as prep the conference room for that meeting?"}, {"date": "3 Apr 2014", "title": "Community Partnership Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Seneca Family of Agencies (San Jose, CA) in Dec 2013", "Interview Descriptions": "- Initial interview was timely and basic interview questions were asked. The front desk admin were hospitable and sincere throughout all my interview appointments.\r\n- The next step was a computer test in word and excel to ensure knowledge of those programs.\r\n- The next interview was with the Division's Director and went very well. Questions about my work and how I see myself doing this position. I was also able to feel like I could ask any questions that had come up from my end.\r\n- Final interview was at their headquarters where I was asked similar job performance and personality questions as in the prior interview. I felt very comfortable and like I had a safe space to say whatever I was thinking.\r\n-Throughout the entire interview process Seneca was extremely good with their communication and each time I received a call the following day about the status of my hiring process.", "Interview Questions": "I was asked to name a time when I knew I could of done something differently or better to achieve a certain outcome."}, {"date": "26 Jul 2017", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Dec 2013", "Interview Descriptions": "I submitted an application and met with the Clinical Director of the program. The process has since changed and starts with a group interview and then a subsequent interview in the specific program.", "Interview Questions": "Talk about a challenged you faced with a client.\r\nTalk about something you feel especially proud of (professionally)."}, {"date": "18 Nov 2013", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "After seeing an ad for an executive assistant position within Seneca Family of Agencies, I replied with my resume and cover letter. Several days later, I received a call from their HR rep, who asked me what drew me to a job with Seneca, and ran through their list of minimum qualifications. At the end of the phone screening, the HR rep told me that she wanted to invite me to a group interview for the following week and we set up a date and time.\r\n\r\nThe group interview turned out to just be myself and one other person. A hr rep came and asked us both questions and we took turns answering first. He then went through a packet which discussed their benefits, job offerings, training, etc. At the end of the interview, we were told that we would hear about the position and whether or not we would continue in the interview process within 4-5 business days.\r\n\r\nTwo business days later, I received an email which informed me that they did not have a position to offer me, and wished me luck in my ongoing job search.", "Interview Questions": "\"What steps would you take if you were manning the front desk and two phone lines started ringing, then a person walked in the door to be helped, then the Sheriff walked in the door... and you had to make 10 copies for a meeting in 5 minutes, as well as prep the conference room for that meeting?\""}, {"date": "19 Aug 2013", "title": "Wraparound Social Worker Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "Considering the large amount of applicants Seneca has, they first do a group interview with about 8-10 people. Seneca does not like outspoken people who overpower others, which is why it's best to sit back, answer questions, but do not be the person where everyone is annoyed at you for answering every single question obnoxiously. Fortunately, I got to skip the group interview and went directly to meeting with the Director of the location I applied for. After answering an insane amount of questions and completing a case study, I was asked for a 2nd interview and was then hired. They are VERY choosy when it comes to hiring, and they pick you apart until they decide you're fit for the job.", "Interview Questions": "You are at a home visit after receiving a phone call on the crisis phone, a teenager has told you that she wants to slit her wrists at home and her mother is a known alcoholic and her brother is on drugs. It's late at night and you've already been at the home for several hours with the girl, it's now approaching bed time. The girl is still saying she'll slit her wrists. What do you do?"}, {"date": "18 Jul 2013", "title": "Family Support Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seneca Family of Agencies (Santa Rosa, CA) in Jul 2013", "Interview Descriptions": "In Sonoma...Emailed my cover letter and resume on Sunday, got a call to set up interview on Monday.  Interview was on Tuesday, it was a group interview.  Really felt like we were competing head to head to answer questions.  They called me on Weds to set up appointment for second interview on Thursday.  They contacted for offer 10 business days later.", "Interview Questions": "Senario question with difficult child."}, {"date": "20 Aug 2016", "title": "Wraparound Social Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seneca Family of Agencies (San Francisco, CA) in Jul 2013", "Interview Descriptions": "Somewhat disjointed and tangential. Two face to face interviews at different dates and locations. Interviewers were friendly, but not necessarily prepared for interview process. Lengthy wait time after arrival to both interviews. Prior to meeting with initial interviewer, I was asked to complete a lengthy questionnaire which was never referred to during the interview.", "Interview Questions": "Why do you want to work for Seneca? What do you do for fun?"}, {"date": "14 Jul 2015", "title": "Mental Health Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Jun 2013", "Interview Descriptions": "There was an initial call to set up a group interview. There were about 6 other potential hires there. After that interview I had an interactive interview where I went into a classroom and interacted with current clients and staff, followed by a one on one interview with the director of the program I was interviewing for a position with.", "Interview Questions": "What would you do if you walked in to your first day in the classroom and a kid immediately yelled \"F*!k you B*tch\"? How would you react?"}, {"date": "11 Apr 2014", "title": "Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies in Jun 2013", "Interview Descriptions": "I was contacted via phone and asked to come in for an on site interview and writing sample. Writing sample was easy, just a basic vignette. Was a very relaxed environment and somewhat informal interview with Program Director and outgoing Care Coordinator. Asked the usual questions about strengths, weaknesses etc.", "Interview Questions": "Tell us about a time you had trouble working with a co-worker/supervisor? What did you do, and how did it turn out?"}], [{"date": "20 Jul 2013", "title": "Family Support Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Seneca Family of Agencies (Santa Rosa, CA) in Jun 2013", "Interview Descriptions": "Saw the ad on craigslist, and had three interviews--one group interview in Oakland, two individual interviews in Santa Rosa. I was warned that the HR process of checking references takes awhile and it had all seemed to go well, but after waiting a month I sent an email inquiry and was told they did not have a position to offer me. I find that very confusing, since I have an MA (the job only required a BA) and they are currently advertising multiple job openings.", "Interview Questions": "I was asked about how I had handled crisis situations in the past."}, {"date": "3 Apr 2013", "title": "Family Support Counselor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Seneca Family of Agencies", "Interview Descriptions": "I sent in my resume and got a call back in about a week. They did an initial phone interview, then I went to a group interview. The group interview was interesting, but went well. They called me back for an individual interview, which I went to as well.", "Interview Questions": "Please describe wraparound counseling"}, {"date": "27 Aug 2015", "title": "Case Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Apr 2013", "Interview Descriptions": "I was called for a quick screening interview (verifying that I met the minimum qualifications of Bachelor's Degree, 21 years old, Driver's License, etc.) and then invited to a group interview. There were about 8 other applicants in the group interview. After the group interview, I was invited back for a computer test and individual interview. The entire process from applying to being hired was about 3 weeks.", "Interview Questions": "How would you handle a situation where you disagreed with a supervisor? They also give scenarios around organization skills and time management for admin support position interviews. "}, {"date": "12 Apr 2016", "title": "Family Support Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seneca Family of Agencies (Oakland, CA) in Feb 2013", "Interview Descriptions": "The entire process took about 3 weeks from sending in my cover letter and resume to job offer. Sometime in late February of 2013, I applied online via Craigslist on a Monday or something. I received a phone call from HR later that week (Wednesday or Thursday) for what felt like a brief and informal phone interview as well as to schedule an appointment for a group interview at their main office in Oakland, California. I went to the group interview the following Monday. There were several candidates present who applied for various positions in different Seneca programs. I approached the group interview non-competitively, which I think HR valued. HR would ask the group a question and it's up to you to respond. HR may follow up to see if anyone else has anything else to say before moving on to the next question, but it's better if you take the initiative and/or build off of each other. After I completed the group interview, HR requested to complete additional information such as professional references, etc. I received a call a few days later and was informed that I moved onto 1:1 interviews at the program-specific location. We scheduled the first of two 1:1 interviews in the beginning of the next week. I was interviewed (though the person was not physically present--I was in a conference room and the interviewer Skyped). Either before or after the first interview, the program assistant provides you with a written prompt. I received a phone call shortly after (a day or two) to schedule another 1:1 interview with my direct supervisor later that week. That interview formerly lasted about 5 minutes before he offered me the job and then we informally talked for the next half hour or so. Received my confirmation email from Seneca that day with my new hire information and scheduled my fantastic 2-week orientation!", "Interview Questions": "Group Interview Question: Tell me about yourself, your educational background, and what position you are applying for."}, {"date": "12 Jan 2016", "title": "Education Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Seneca Family of Agencies (San Jose, CA) in Feb 2013", "Interview Descriptions": "I don't know how to even make this 50 words...they honestly called me, talked AT me on the phone for about 15 minutes, asked me to visit the school site, talked at me some more, then offered me the job.  I really don't think I answered a single question about myself or my experiences.  It was almost as if I was interviewing them.", "Interview Questions": "N/A"}, {"date": "22 Feb 2017", "title": "Wraparound Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seneca Family of Agencies (Oakland, CA) in Jan 2013", "Interview Descriptions": "I had two interviews with Seneca, the first was a group interview with 6-7 other applicants. This was a bit daunting at first as I thought we were all interviewing for the same position! However there were a variety of people interviewing for different positions and only a handful of people interested in the job that I was applying for.", "Interview Questions": "Explain how you would handle a situation in which a child was escalated or upset."}, {"date": "30 Aug 2012", "title": "Peer Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Seneca Family of Agencies (San Leandro, CA)", "Interview Descriptions": "Group Interview. Not difficult at all.", "Interview Questions": "Very easy questions"}, {"date": "14 Jul 2012", "title": "Family Support Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seneca Family of Agencies (San Francisco, CA)", "Interview Descriptions": "Sent my resume in via the company website, since I saw the listing on craigslist. They usually do group interviews but had me come in for a 1:1 due to timing contraints. I met with HR, then a day or two later met with a Supervisor. I completed a short essay about a case. The Supervisor interview was very good, honest questions and positive. They completed a 2 week background check and I heard back right after that.", "Interview Questions": "If a child starts swearing at you and displays certain behaviors what would you do?"}, {"date": "14 Jan 2015", "title": "Family Support Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Seneca Family of Agencies in Jun 2012", "Interview Descriptions": "I received a phone call asking me to come to a group interview at the Oakland office; there were about 6 other applicants there. Questions were asked to the group in general, and you had to take the initiative to contribute to the discussion and offer ideas. From there I was called to schedule a one to one interview with the director of the program I would potentially be working at. It was relatively informal; we met in his office and the interview style was very conversational. From there, my references were checked, which took the longest time by far. Overall it took me about 6 or 7 weeks from the initial contact to the time I was hired. Once I was hired, I started basic training the following week [which you receive pay for]", "Interview Questions": "N/A"}, {"date": "23 Oct 2011", "title": "Case Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Seneca Family of Agencies in Oct 2011", "Interview Descriptions": "Received a call for an interview about two weeks after applying for the job.  It was a group interview with about six other people and one recruiter.  The recruiter asked basic questions (what drew you to the organization, positive and negative things a previous supervisor would say about you) and we would take turns saying our response.  The atmosphere was very casual and friendly.", "Interview Questions": "What is something your previous supervisor would say is a negative attribute of yours?"}], [{"date": "28 Jun 2014", "title": "Family Support Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seneca Family of Agencies (Oakland, CA) in Apr 2011", "Interview Descriptions": "The hiring process took about 3 weeks. Human Resources first reached out to me for an informal phone interview asking me why I was interested in the job and a little history about my experience. I then went in for a group interview with about 6 other people and they asked basic situational questions about working with youth, what some of the skills you have and how you seperate work and personal life. At the end of the interview they give a list of openings within the agency and have you write your top three so you would have more chances of being given an opportunity. I was scheduled for a second interview the same day. The second interview was the supervisor of the specific program and was also very situation and more focused on the position. In addition to the interview, I also met some client to see how my interactions with them were like and a glimpse into what my work day would look like. I got the job a week later.", "Interview Questions": "questions were basic, situation scenarios of a typical day at work. \"what would you do if there was a child who was secluded from the group and when you approached you, she cursed at you?\""}, {"date": "1 Jul 2015", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Jan 2011", "Interview Descriptions": "Seneca Family of Agencies has a group interview, followed by a series of individual interviews. Many people are not given a chance to participate in the group interview process. If you make it past the group interview the site or workplace interested in your skill set will continue the interview process.", "Interview Questions": "Describe your previous work environment? Why do you want to work with at risk youth?"}, {"date": "13 Sept 2010", "title": "Human Resources Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Seneca Family of Agencies (San Leandro, CA) in Jun 2010", "Interview Descriptions": "Seneca Center was a pleasure to interview with. The staff are friendly. There was a group interview with approximately 2 other applicants. Everyone was asked the same questions and the order of how the applicants answered questions was flexible. The atmosphere was casual and relaxed. I interviewed one time but I am unsure if other applicants were asked to come back.", "Interview Questions": "There were no difficult or unexpected questions. The questions were typical of what would be asked at a job interview. The most difficult would probably be What is your greatest weakness?"}, {"date": "13 Jul 2010", "title": "Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at Seneca Family of Agencies in Jun 2010", "Interview Descriptions": "When I received a call back from Seneca to schedule an interview, the HR lady was very nice on the phone. On the day of the interview, I found the HR place pretty easily. The receptionist was also very helpful and told me where the interview would be held. It was also a group interview (which I had never done before so I was curious to know how the process would go). There ended up being 9 candidates in one room and one lady telling us about the company and the kinds of things that are faced on a weekly basis. Everyone introduced themselves and the interviewer asked questions to which everyone gave an answer in an informal way. It seemed more of a discussion. Afterwards I felt pretty cool with the other candidates. The interviewer then gave us more information on various positions at the company that we could apply for. She said that someone would contact us within 5 business days and who the call would be coming from and there would be a 2nd and 3rd interview.", "Interview Questions": "How would you handle a child who blatantly dislikes you the second you meet?"}]]