[[{"date": "12 Apr 2023", "title": "Customer Relationship Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at RHP (Teddington, London, England) in Mar 2023", "Interview Descriptions": "Very relaxed and made to feel at ease. Interviewed by 2 people relevant to the role. I just felt at home and welcome from the moment I walked in. The interview was in 2 parts and included tasks to complete and return.", "Interview Questions": "The interview questions would differ for each role, obviously you have to match your skills to the role advertised and show passion for what you do or want to do"}, {"date": "1 Mar 2021", "title": "Customer Success Centre Apprentice Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at RHP (London, England) in Feb 2021", "Interview Descriptions": "Through Microsoft Teams with 3 people - 2 of which interviewed me and the 3rd was HR. They were all very friendly and the 2 took turns to ask me questions. Overall the interview went very well, and it was a good experience. Jordan was very informative when I asked questions at the end and it gave me a good understanding of the role, what RHP does, and what RHP is like as an employer.\r\n\r\nThe 40 min psychometric test to be completed prior to interview (through a game-like app) was different to traditional tests and it was very challenging in my opinion. The feedback from this however was very insightful and more-or-less accurate!\r\n\r\nFollowing the interview I was asked to complete some tasks by the same day - one was a response to a customer's email, and the other was to order tasks based on priority and describe why. I was unsure about something in one of the tasks and Hannah was very quick to clarify it for me.\r\n\r\nOverall throughout the application and interview process Hannah kept me well informed. I greatly appreciated that despite not being offered the role (I had accepted another job offer and also this role wasn't the right fit for me), I received a call giving me feedback on how my interview went.", "Interview Questions": "Where do you see yourself in the future (in around 2-5 years time)?"}, {"date": "12 Dec 2020", "title": "Housing Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at RHP", "Interview Descriptions": "Half a day process of various group activities and individual interview. In addition to this various talks from senior members of staff. They didn't bother to let me know if I was successful or not, I had to chase them for an answer and feedback.", "Interview Questions": "Tell is about a time you have experienced great customer service. "}, {"date": "6 Aug 2020", "title": "HR apprentice Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at RHP (London, England) in Aug 2020", "Interview Descriptions": "I had to do a series of different assessments as well as an online interview with Hannah and Rebecca.  I appreciate the fact that I was given feedback and the work I had done before, during and after the interview was acknowledged.  This is the first HR role I have ever applied for and I did not know what to expect, but I am glad that the feedback I received was extremely positive and my only fault was that I was too developed for the role. Overall, my recruitment experience with RHP was positive, they were both very friendly, committed to promising feedback and got back to me quickly after the interview. They deserve the positive recognition as not all companies work this way.", "Interview Questions": "Why do you want to work in HR? "}, {"date": "24 Jul 2018", "title": "Caretaker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at RHP (Teddington, London, England) in Jun 2018", "Interview Descriptions": "A interactive site visit to outline the nature of the job and ascertain potential areas of improvement. This was followed by an interview and online multiple choice test that covered work related scenarios and challenges", "Interview Questions": "Why do you want to work for RHP?"}, {"date": "11 Jun 2018", "title": "Customer Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at RHP (Teddington, London, England) in Apr 2018", "Interview Descriptions": "This was the most interesting and fun interview I have ever been to! For that reason it didn't even feel like an interview! It was quite unconventional, different and they wanted to see the real you and get a sense of your personality so I think it was really great. They had activities, rotating between people to be asked a question each, just very different and enjoyable, nothing like a typical boring interview where you are asked the same questions every time and its almost rehearsed!", "Interview Questions": "Tell me about a time when you have been put out of your comfort zone and how you dealt with it"}, {"date": "15 Jun 2018", "title": "Administrator Co-op Homes Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at RHP (Teddington, London, England) in Apr 2018", "Interview Descriptions": "An interview with a few exercises done at a computer. More fun than stressful! Interviewed with a few others at the same time. We had three exercises to complete while the others were interviewing.", "Interview Questions": "If I knew about Co-ops"}, {"date": "15 Jun 2018", "title": "M & E Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at RHP (Teddington, London, England) in Mar 2018", "Interview Descriptions": "The process was a mix of interview panel questions and computer tests. Approx. 1 hour panel / group interview and two computer aided tests. Word document based test and an excel based test", "Interview Questions": "What am I bringing to the role"}, {"date": "11 Jun 2018", "title": "PA - Ops Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at RHP (Teddington, London, England) in Jan 2018", "Interview Descriptions": "It was an assessment centre, three candidates sharing time between IT tasks and the interview itself. We were all welcomed promptly and were introduced to the Ops Director and PA to the CEO who held the interview.", "Interview Questions": "What skills could you bring to this role that would make you stand above the other candidates?"}], [{"date": "28 Nov 2017", "title": "Customer Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at RHP (Teddington, South West England, England) in Oct 2017", "Interview Descriptions": "I applied online and was invited for an assessment day at RHP. This was very unique, and consisted of different activities such as 'story telling' , group work, and a mini 'sales' pitch. This was enjoyable and eased me into the actual interview at the end.", "Interview Questions": "'Can you provide an example of a time that you have been satisfied with a customer service experience?'"}, {"date": "28 Nov 2017", "title": "Customer Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at RHP (Teddington, South West England, England) in Oct 2017", "Interview Descriptions": "Started with a group introduction and then followed up by computer tests and then finally a traditional interview. We also had to do a video explaining why we would be good for the job.", "Interview Questions": "Describe a time that you handled a difficult situation and what you would do differently in the future."}, {"date": "7 Aug 2017", "title": "Compliance Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at RHP (Teddington, South West England, England) in Aug 2017", "Interview Descriptions": "Strong interview process, with presentation required on a task as details supplied, then  a two hour discussion and general competence interview, all questions answered about the organisation and role", "Interview Questions": "What do you think is the reason you have applied for the role "}, {"date": "12 Dec 2016", "title": "MBA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at RHP (Teddington, London, England) in Sept 2016", "Interview Descriptions": "1. As this was a University sourced internship, there was a first round pre-interview with the MBA careers department and a review of my CV.\r\n2. A 10 minute presentation on how I would approach the assignment and what value / insight I could bring, followed by 10 minute Q&A.\r\n3. Then, a 30 minute skills based interview with the Executive Director of Corporate Services and Executive Director of Finance.\r\n4. Finally, a 15 minute office tour.", "Interview Questions": "Experience of Business Development, examples of marketing experience, how I would approach certain tasks, project management related skills, Etc."}, {"date": "2 Aug 2016", "title": "Customer Service Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at RHP (Teddington, London, England) in Jul 2016", "Interview Descriptions": "The interview process was quick and easy. The first stage was a web chat interview where I was asked several questions and then tasked with finding out various bits of information from around the website. I then received a call and was asked to come into the office for the second stage which was a face to face interview. The actual interviewers Michael and Freddie were great and welcoming, it was a straight forward interview where they did throw some unusual questions, which made me stop and think; but it was a relaxed interview and I didn't feel stressful or pressured at all.", "Interview Questions": "What annoys you?"}, {"date": "12 Jun 2016", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at RHP (Teddington, London, England) in May 2016", "Interview Descriptions": "An initial meet and greet; followed by an interview with 3 interviewers; a series of questions in a Word document to prioritise in order of importance; sample minute taking; writing an email response to a complaint; a discussion with interviewers and other applicants re. relevant current affairs. We were all well looked after and shown the offices and were encouraged to ask as many questions as we liked.", "Interview Questions": "How would you respond to a difficult and angry customer?\r\nCan you explain your career break?\r\nWhy do you want the job?\r\nWhat do you know about the Company?"}, {"date": "12 May 2016", "title": "Human Resources Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at RHP (Teddington, London, England) in Apr 2016", "Interview Descriptions": "The interview process was well structured and fun. I had to complete a number of exercises, including: a role play with a challenging manager, a group discussion, online testing as well as an interview. By the time we got to the interview I felt more relaxed than at the start of the day, so was able to answer questions more clearly and with less nerves!", "Interview Questions": "Can you provide an example of how you have influenced the performance of a function – how did you do this and how did you measure the success?"}, {"date": "23 Feb 2016", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at RHP (Teddington, London, England) in Feb 2016", "Interview Descriptions": "The process was interesting, challenging and fun! All candidates met for an assessment day and we were asked to let our fellow candidates know some great things about us and what made us perfect for the job. We then spent the day doing individual exercises, group exercises, an online assessment as well as the individual interview. We were all made to feel welcome, talented and special and RHP staff were attentive throughout.", "Interview Questions": "What makes me perfect for the job"}, {"date": "16 May 2016", "title": "Estate Services Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at RHP (London, England) in Aug 2014", "Interview Descriptions": "Assessment Centre followed by Interview. It was a very robust process and clearly was formulated to test the candidates and assess them to ensure that they are the right fit for the organisation. Although it was quite tough the standard of the staff interviewing was excellent and certainly made me feel very comfortable and \"at home\"", "Interview Questions": "How would you deal with a tree that was causing problems in a customers garden"}, {"date": "31 May 2016", "title": "Graduate Scheme Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at RHP (Teddington, London, England) in Aug 2014", "Interview Descriptions": "The interview process involved completing an application form which was focused around customer service. Following from that was an assessment centre where there were around 10 applicants chosen. Those who progressed from the assessment centre were invited to interview a week later. Pretty tough I'd say but worth it in the long run!", "Interview Questions": "What would you like to ask us?"}], [{"date": "18 May 2016", "title": "III Customer Facing Roles Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at RHP (Teddington, South West England, England) in Sept 2013", "Interview Descriptions": "Challenging, engaging, fun, lively, and assessments designed to really test a broad range of skills. It is great as everyone has a chance to show their strengths and the atmosphere is really friendly.\r\nI wanted to work at rhp so much that i interviewed 3 times over the space of a year. 3rd time lucky and the 3rd time it was the right role for me so i am glad i was not successful the first 2 times. They admired my resilience and passion to work here.", "Interview Questions": "a presentation all about me and my skills"}]]