[[{"date": "19 Apr 2023", "title": "IT Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northeastern Illinois University (Chicago, IL)", "Interview Descriptions": "They're not only very professional but also welcoming and great teachers as well. If not so underfunded they would be a company I'd loved to have worked with for years.", "Interview Questions": "If I had experience or at least the ability to learn their systems/way of processing work?"}, {"date": "18 Mar 2022", "title": "Assistant Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northeastern Illinois University", "Interview Descriptions": "All day interview with presentation, multiple meetings with admin, and lunch. Hiring academics with a need to learn about their specialty, the ability to present and teach, and asking questions about how their research fits into the research of other parts of the university,", "Interview Questions": "How do you prepare to teach a one-shot. "}, {"date": "14 Jan 2022", "title": "TRIO Student Support Services Academic Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northeastern Illinois University", "Interview Descriptions": "Professional, timely, punctual, accurate. Phone interview, then with Dean,  followed by a 30 min presentation then a 1 hr long interview. Questions at the end followed by a conversation.  Felt as if it was well thought out.", "Interview Questions": "3 issues facing higher education "}, {"date": "22 Nov 2021", "title": "Customer Service Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northeastern Illinois University", "Interview Descriptions": "Very informative, a lot of good details given upfront and the recruiters were extremely nice. It was an overall pleasant experience, very communicative and timely as well. I recommend applying there as it was a seamless process.", "Interview Questions": "N/A"}, {"date": "7 Jul 2021", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northeastern Illinois University", "Interview Descriptions": "The interview took place on campus in a classroom. There were two interviewers. The tone was relatively informal. Questions included prior experience as well as questions about various classroom scenarios.", "Interview Questions": "How will you address diversity and inclusivity in your teaching."}, {"date": "29 Jun 2021", "title": "Research Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northeastern Illinois University (Chicago, IL)", "Interview Descriptions": "It was a group interview that I would say was very professional and informative. They interviewers laid out their expectations for the position. There was a simply oral test of research and data methods that I have used in prior research.", "Interview Questions": "What systems are familiar with in analyzing research data."}, {"date": "11 May 2021", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Northeastern Illinois University (Chicago, IL)", "Interview Descriptions": "The interview process was very straightforward.  I was asked about experience and ability to teach courses. Also asked to provide a resume for review.  Scheduling and income was discussed and most everything was completed electronically.", "Interview Questions": "Please provide a resume for review."}, {"date": "19 Feb 2020", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northeastern Illinois University", "Interview Descriptions": "Started off with a phone interview which later led to an in person interview with two of the branch librarians. Very casual and comfortable, nothing out of the ordinary question wise. I received and offer a week or so later.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "13 Dec 2019", "title": "Grad Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northeastern Illinois University", "Interview Descriptions": "It was easy we did not have to go through a lengthy process and we did not have to go through anyone but our supervisor. I would say the experience was easy and it was not intimidating.", "Interview Questions": "Does not apply"}, {"date": "27 Jul 2019", "title": "Orientation Leader Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Northeastern Illinois University (Chicago, IL) in Jun 2019", "Interview Descriptions": "Phone interview - conference style; difficult to hear most of the people speaking. The interviewers were unable to answer many of my questions - I was told \"We'll get back to you with that answer\", never heard back. My questions included things such as...what's the current graduation and retention rates, attrition rates, the primary responsibility for the position, what are the 3-6-9 month goals/benchmarks for the position, etc. I was then contacted later and asked to come to campus to interview. I mentioned that I did not receive answers to my questions, when I would like to determine if this is the right fit. Again, no answers. It was obvious they were embarrassed or hiding their student success metrics; or they were completely unprepared or unaware of the university's success or lack of success. Too many red flags. I declined the campus interview.", "Interview Questions": "What is your approach to orientation? "}], [{"date": "17 Nov 2018", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Northeastern Illinois University", "Interview Descriptions": "After getting my graduate degree I talked to the chair of my department. I asked them to allow me to teach full time. For sometime the chair wasn't sure, he first wanted me to teach part-time but knowing that I am a self-driven work crazy person they gave me the job. It also helped that our department was growing.", "Interview Questions": "They asked me if I could handle to workload."}, {"date": "17 May 2018", "title": "Librarian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Northeastern Illinois University", "Interview Descriptions": "good, pleasant, quick and i was very good interested in a very good position, what a wonderful place, i was very very impressed by the library and the co workers and others", "Interview Questions": "how are you"}, {"date": "15 Sept 2017", "title": "Inventory Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Northeastern Illinois University", "Interview Descriptions": "Civil Service Testing via online.  You need to pass the test before you are even considered for the interview.  Most times they pick those with the highest grades on the test.  Whether or not you had more experience then some, if you don't pass the civil service test (you mostly need 100% but rarely they go below that) they wont even consider you for an actual interview.  This is for 99% of the any position you are going for.  It all complies to the State rules on hiring individuals.", "Interview Questions": "How would you organize several tasks?"}, {"date": "10 Feb 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Northeastern Illinois University", "Interview Descriptions": "Short interview, very friendly. Met in a conference room with the director one on one. Casual business attire was worn. Reviewed my resume and asked a few questions to get to know my personality.", "Interview Questions": "Why are you looking forward to interning here?"}, {"date": "16 Aug 2016", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Northeastern Illinois University", "Interview Descriptions": "Reviewed resume for qualifications yes yes yes but then there was a process where I had to wait because someone else was trying to accept or decline the offer. Overall it was an interesting experience i took a lot from it thankfully and added it to my resume Reviewed resume for qualifications yes yes yes but then there was a process where I had to wait because someone else was trying to accept or decline the offer. Overall it was an interesting experience i took a lot from it thankfully and added it to my resume", "Interview Questions": "What was my past experience like? yes yes yes Reviewed resume for qualifications yes yes yes but then there was a process where I had to wait because someone else was trying to accept or decline the offer. Overall it was an interesting experience i took a lot from it thankfully and added it to my resume Reviewed resume for qualifications yes yes yes but then there was a process where I had to wait because someone else was trying to accept or decline the offer. Overall it was an interesting experience i took a lot from it thankfully and added it to my resume"}, {"date": "2 Jun 2016", "title": "Admissions Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Northeastern Illinois University", "Interview Descriptions": "Telephone Interview, talked about a variety of topics involving experience as an admissions counselor, territory, relationships with counselors, and how I created opportunities to get more prospects.  The next step in the process was an interview with the entire admissions team, admissions director and also the important partners that worked with admissions to help achieve the department goals.", "Interview Questions": "What did I do to increase prospects for enrollment?"}, {"date": "5 Jun 2017", "title": "Student Caller Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Northeastern Illinois University (Chicago, IL) in May 2016", "Interview Descriptions": "It was pretty easy, they were looking for an individual to work in the office a couple of hours a week. The boss walked me around school to show me everything", "Interview Questions": "What's your major?\r\n"}, {"date": "28 Mar 2016", "title": "Student Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Northeastern Illinois University (Chicago, IL)", "Interview Descriptions": "it is an easy interview; also pretty straight-forward. You have to be confident, and don't slack because it is an easy job. The experience can definitely look good on a resume, especially if you can find a student-aide job that relates to your major. You also get the chance to build a good network through student-aide jobs by meeting other students and faculty along the way.", "Interview Questions": "Availability, Class Schedule, Major, Experience"}, {"date": "11 Dec 2017", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Northeastern Illinois University (Chicago, IL) in Jan 2016", "Interview Descriptions": "Asks technical questions about Business Analytics and statistics because I am teaching those classes plus Operations Management. I am doing my MBA at that school so for me it was easy to get hired as an teaching assistant.  Dean was so nice asking questions politely and helped me even before the interview.", "Interview Questions": "what does significant variable mean?"}, {"date": "17 Aug 2015", "title": "Campus Rec Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Northeastern Illinois University", "Interview Descriptions": "the interview process itself for me was very brief. I was referred by a friend who worked there and applied there.Got a call to come in for an interview the next day. the interview itself was very brief with them just asking me general questions about myself and my interests and status as a student. as hired right away", "Interview Questions": "all the questions were easy"}], [{"date": "28 Jul 2015", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Northeastern Illinois University (Chicago, IL) in May 2013", "Interview Descriptions": "Phone interview, Onsite interview, call back. The screening process was tough they made sure you knew your stuff. Make sure you are well prepared for both the phone interview and the in person interview", "Interview Questions": "Know things around working with Hispanic population"}, {"date": "18 Jan 2015", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Northeastern Illinois University in Aug 2011", "Interview Descriptions": "The interview process was relaxed and simple. This was due to the application process. It involved a series of questions and assignments to test your knowledge of Microsoft office and technology. If your submitted work was done correctly, you pretty much got the job.", "Interview Questions": "Not really any difficult questions asked."}, {"date": "9 Aug 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northeastern Illinois University in Feb 2011", "Interview Descriptions": "There was a phone interview followed by a campus visit to include a teaching presentation, a research presentation and meetings with various faculty and administrators. It was very much like other academic interview processes.", "Interview Questions": "Nothing was unexpected or difficult."}, {"date": "24 Apr 2014", "title": "Office Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Northeastern Illinois University (Chicago, IL) in Nov 2010", "Interview Descriptions": "You get called to take a test on vocabulary, typing 35 wpm, basic math, and computers. If you have the top three ranking score you get an interview. Interview is very standard.", "Interview Questions": "Non, it was pretty basic."}, {"date": "12 Jun 2010", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Northeastern Illinois University (Chicago, IL) in Mar 2009", "Interview Descriptions": "Interview process is very well organized.  There is a search and screen process which involves a scripted phone interview.  Be prepared to answer questions about the university, student-body, etc.  The second phase is an on-campus interview.  This is a full-day event.  There will be a public seminar (on research) and individual interviews with the faculty, dean, and provost.  These meetings are less scripted; often the interviewer is trying to decide if the candidate is a good fit for the department/university.", "Interview Questions": "Describe your doctoral research to an 8th grade student."}]]