[[{"date": "15 Sept 2022", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ithaca College in Aug 2022", "Interview Descriptions": "The interview process was long and some of the questions were vague.  I had a nice conversation with the people interviewing me.  I wish salary was talked about in the interview.", "Interview Questions": "tell me about yourself and where you see yourself in 5 years"}, {"date": "22 Jun 2022", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Ithaca College", "Interview Descriptions": "I asked a professor if I could TA for them. They went to their department head and asked for me to be put on pay role. I had to do some harassment training that everyone is required to do and fill out some paper work", "Interview Questions": "There were no interview questions"}, {"date": "2 Feb 2022", "title": "Productivity Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Ithaca College", "Interview Descriptions": "The interview was a quick and easy process. I met with the current manager and discussed my resume and past experience. Salary and benefits were not discussed but the day to day work load was.", "Interview Questions": "What was a challenge you had to overcome?"}, {"date": "22 Jan 2022", "title": "Content Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Ithaca College", "Interview Descriptions": "They reached out to me quickly after I submitted my application. The interview was a 30 minute zoom call. Overall, it was pretty simple and I was just asked about my past experience and my role in a team.", "Interview Questions": "What is your role in a team?"}, {"date": "10 Nov 2021", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ithaca College in Apr 2021", "Interview Descriptions": "Send in a resume with 2 references (one being a current RA and other being a professional reference) and answer a few short response questions.  Most of the short response questions are re-asked in the interview.", "Interview Questions": "If given an unlimited budget, how would you program around social justice and diversity/inclusion?"}, {"date": "15 Sept 2020", "title": "Anthropologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ithaca College (Ithaca, NY) in Mar 2020", "Interview Descriptions": "The Search Committee was very kind, asked good questions, and made my research and experience feel worthy and valued. I did not get the job ultimately, but interviewing with their team boosted my confidence for the next interview elsewhere!", "Interview Questions": "Teaching, ethnography, student and mentorship "}, {"date": "5 Jul 2020", "title": "Executive Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ithaca College (Ithaca, NY) in Oct 2019", "Interview Descriptions": "I was called by an HR rep for a phone screening interview.  I was then asked to come into the office for a group interview.  Finally, I had a one on one interview.   My references were then checked and I received an offer.", "Interview Questions": "What will you do to manage time when you have competing priorities?"}, {"date": "5 Aug 2019", "title": "Administrative- Office of the President Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "The process took 2 weeks. I interviewed at Ithaca College (New York, NY)", "Interview Descriptions": "Professional,  welcoming and prepared. The team is energized and focused, striving for the very best educational environment for students.  Diversity,  Inclusion and Equity is also a high priority in their fast paced office.", "Interview Questions": "What interested you in this position?"}, {"date": "17 Jun 2019", "title": "Dining Hall Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Ithaca College (Ithaca, NY) in Jan 2019", "Interview Descriptions": "There wasn't an interview, I just applied online and then HR called me for my class schedule so they could find shifts with openings that worked within my class schedule for the semester", "Interview Questions": "They didn't have an interview"}, {"date": "7 Feb 2019", "title": "Part-Time Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Ithaca College (Ithaca, NY) in Dec 2018", "Interview Descriptions": "very professional and very nice professors, I will recommend people who want to gain more teaching experience to apply here. Students are very friendly too. Questions are very standard and be prepare to express your emthusiam for this position", "Interview Questions": "Tell me about yourself"}], [{"date": "20 Dec 2020", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Ithaca College (Ithaca, NY) in Aug 2018", "Interview Descriptions": "An application was put out and then once submitted it online I received an email very promptly asking for my availability to interview. I came in waited in the waiting room and was called in, took 30 minutes and boom", "Interview Questions": "What was my availability like?"}, {"date": "11 Apr 2019", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Ithaca College in Apr 2018", "Interview Descriptions": "This was an online email submission. Hire students based off word of mouth and favoritism in the department. They could do a better job hiring for talent and grades versus notariety.", "Interview Questions": "None-hired by name and familiarity only"}, {"date": "29 Mar 2017", "title": "Career Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ithaca College (Ithaca, NY) in May 2016", "Interview Descriptions": "Interview process was smooth, but took a while from start to finish. This interview began with a phone interview, then one on one, then a full-day interview with many individuals.", "Interview Questions": "What does diversity mean to you?"}, {"date": "9 Jan 2016", "title": "Administrative Assistant III Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ithaca College (Ithaca, NY) in Jan 2016", "Interview Descriptions": "Interview process was good. They reviewed job description in great length. Asked about my prior experience to bring into position. Responsibilities would enhance my current skills knowledge. Professional interview. Advised them I would have questions regarding events I would be planning", "Interview Questions": "If I had tasks to complete due in 1/2 hr and somebody demanded my time now, how would I handle"}, {"date": "4 Sept 2014", "title": "Psychologist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Ithaca College", "Interview Descriptions": "Comprehensive interviewing, general approach was finding the best person to serve the client population.  Met all the relevant stakeholders, spend a full day and night in the process.  Also communicated a sense of the environment and place.  Very friendly and open.  Relevant questions, appropriate inquiry into what I brought to the job.", "Interview Questions": "What would be my greatest limitations in fulfilling the job."}, {"date": "1 Nov 2015", "title": "Student Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Ithaca College (Ithaca, NY) in Apr 2014", "Interview Descriptions": "The questions weren't very hard however they were 3 people who were asking me questions and evaluating me. The interview took place in the manager's office and it was around an hour long. They asked me questions about my resume and past job experiences that I have had. They also asked me about my involvement on campus.", "Interview Questions": "Why do you think you are qualified for this position?"}, {"date": "20 Jan 2016", "title": "Marketing Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Ithaca College (Ithaca, NY) in Feb 2014", "Interview Descriptions": "Three different interviews. First with the manager then the next two with the account executive. Behavioral questions asked along with prior experience questions. Mainly broad, then went into specific questions. Funnel interview process", "Interview Questions": "Explain how your prior experience can help you here?"}, {"date": "13 Sept 2013", "title": "Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ithaca College", "Interview Descriptions": "Took about one month to hear anything about the position, was e-mailed by the person I would be working directly for, had a 90 minute written exercise, then a 30 minute phone interview, an in person interview with HR, and in person interviews with 5 constituents.", "Interview Questions": "Most of the in person interviews were more of \"conversations\" rather than the standard interview questions. There were definitely lulls in the conversations that proved to be difficult to recover from at times."}, {"date": "9 Jul 2015", "title": "Annual Fund Phoner Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ithaca College (Ithaca, NY) in Jul 2013", "Interview Descriptions": "30ish minute phone call. The person speaking was stepping down from a managerial position but was very helpful in informing about what they are looking for. This was a student position so only current students of Ithaca College can apply.", "Interview Questions": "Why do you want this position?\r\nWhat about Ithaca College do you enjoy the most?"}, {"date": "9 Aug 2012", "title": "Coordinator of the OAL ISP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Ithaca College (Ithaca, NY) in Aug 2010", "Interview Descriptions": "The hiring process was an internet application which followed with a phone interview.  It was at two phone call interview which also included a meeting to check off my skill sets for the job.", "Interview Questions": "How my amount of experience would give me the edge over other individuals experience?"}], [{"date": "8 May 2011", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Ithaca College (Ithaca, NY) in Jan 2010", "Interview Descriptions": "Minimal interview - just brief meeting; think hiring supervisor's boss had already decided to hire me for a temp position and wanted me to meet hiring supervisor to make it official.", "Interview Questions": "don't remember any specific questions -- interview as such was pretty perfunctory"}, {"date": "22 Feb 2013", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Ithaca College (Ithaca, NY) in Nov 2009", "Interview Descriptions": "They are going to put flyers throughout campus about information sessions.  Attend one then they will give out information for application process.\r\nAfter applying, qualified candidates will be invited to individual interview with one current RA and one RD.  Questions are mostly behavioral questions to see how you manage with dealing people.  Prepare to provide specific examples of dealing with difficult types of people, how you manage your stress and time.  After that, candidates will be invited to the group process that is about 3hour long.  You will get a chance to express your thought and show RAs and RD how you interact with others.", "Interview Questions": "Not too many surprising questions.  But \"Why do we have to hire you?\" questions might be hard."}]]