[[{"date": "21 Jul 2021", "title": "Internship Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sound (Seattle, WA) in Jul 2021", "Interview Descriptions": "The interview was unorganized, the person was very cold and unwelcoming. The interviewer sat with his back turned to me for 15 minutes while he typed on his computer not communicating and then took us another 10 minutes to find a private room to even do the interview in. Once we sat down, he proceeded to point out only the flaws in my resume.", "Interview Questions": "What are you looking for in an internship?\n\nWhy do you want to work with high-needs people with mental illness?"}, {"date": "4 May 2021", "title": "Counseling Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sound", "Interview Descriptions": "It went great, my interviewer was very kind and thoughtful. They prioritized my interests and made sure I had space to make a decision that was best for myself along with the agency's interests.", "Interview Questions": "What qualities are you looking for in your supervisor?"}, {"date": "17 Mar 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sound", "Interview Descriptions": "The interview was professional and the questions were challenging. I did feel comfortable in the process and felt they asked relevant questions for my position. I also felt I was given ample opportunities to inquire about Sound too.", "Interview Questions": "What was my preferred modality when working with clients?"}, {"date": "2 Nov 2018", "title": "Crisis Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Sound", "Interview Descriptions": "The interviewer was not very friendly and did not smile very much at all. The interview was long and she said I could not get feedback on how I did afterward. It was very extensive.", "Interview Questions": "I was asked to respond to vignettes."}, {"date": "19 Aug 2018", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sound (Seattle, WA) in Jun 2018", "Interview Descriptions": "Interview was set up with the manager on site and two others. They were very prepared and had specific questions set up for me. The interviewers were kind and seemed at ease interacting with my answers and giving me time to ask questions as well. They had clearly reviewed my resume and brought up a few things from it that they wanted to hear more about.", "Interview Questions": "They asked about my therapeutic orientation. "}, {"date": "6 Jan 2017", "title": "Clinician/Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Sound (Seattle, WA) in Aug 2016", "Interview Descriptions": "The interview was conducted with 3 members of the program team and the program director and in a round table fashion.  The interviewers took turns asking pre-selected questions.  Very friendly and pleasant experience.  Total time of interview was approximately 20 minutes.", "Interview Questions": "What experience do you have working with this particular population? "}, {"date": "15 Aug 2016", "title": "Child & Family Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Sound (Bellevue, WA) in Jul 2016", "Interview Descriptions": "I secured an interview with hiring manager and team for the Child & Family clinical group in Bellevue through company site with the assistance of my current manager (at the time), the department manager for the Community Networks Program in Seattle.  This was following my desire to move more into the area of child and family therapy for both IDD and non IDD children from developmentally disabled adults.\r\n\r\nThe two women whose teams were in need of additional members I met with first.  That seemed to go well.  The hiring manager was then excited to speak with me until she realized I wasn't as far along with my hours as she desired I be for the open position.  At that point, she suggested I interview for another position in their group focused more in case management than clinical therapy.  I showed interest, she passed my resume along, I interviewed and, though the interview went fine, the hiring manager and I (along with my current boss) collectively decided the position was not what I was looking for.", "Interview Questions": "Do you have your LMHC license yet?  Are you CDP certified?"}, {"date": "18 Sept 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Sound (Tukwila, WA) in Mar 2016", "Interview Descriptions": "A little difficult to set up with the director, as his duties take him out of the office frequently, but a good experience once I was in. The setting was relaxed and casual without pretense or expectation. The director was courteous and professional, and made me feel at ease.", "Interview Questions": "Why would you like to work at this particular office?"}, {"date": "7 Mar 2016", "title": "Forensic Mental Health Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sound (Seattle, WA) in Jan 2016", "Interview Descriptions": "I applied online and received an e-mail the next day asking if I would be interested in an interview a week later. It was more casual, conversational than other interviews I have been in. I was then asked (the same day) for a follow up interview another week later, so the whole process took a little over 2 weeks, so not a bad time frame", "Interview Questions": "Q: How do you incorporate self care into your routine?"}, {"date": "1 Dec 2015", "title": "Licensed Mental Health Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sound (Seattle, WA) in Jan 2015", "Interview Descriptions": "The interview was ironically the best one I have ever had.  Unfortunately the \"hooplah\" did not match the actual outcome.  I was promised the salary would match the cost of living in Seattle.  I did my own research as well and there were mixed reviews regarding \"liveable\" salary.  Once I accepted the job and began working, it was clear I missed the mark.  Looking back on the interview it was in hindsight; too good to be true.  That should have been a red flag.", "Interview Questions": "Experience in which categories"}], [{"date": "25 Jul 2015", "title": "Clinical Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Sound (Seattle, WA) in Oct 2014", "Interview Descriptions": "I interviewed with the program director, direct supervisor, and two case managers.  They asked about my clinical experience, interest in the position, knowledge of the client population i.e. homelessness, mental illness, and chemical dependency.  They also asked me about how my approach fit in with Sound Mental Health's mission statement.", "Interview Questions": "What are three reasons someone becomes homeless?"}, {"date": "20 Aug 2015", "title": "Facilities Maintenance Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Sound (Seattle, WA) in Feb 2013", "Interview Descriptions": "I interviewed with the Director of Facilities. Prior to my interview they talked to my references and asked about my previous experience. After the formal interview we toured the facility. The questions were pretty standard, whats your experience, why do you think you'd be a good fit etc. we also talked about the nuances of working with tools in an environment that serves folks with extreme mental illness.", "Interview Questions": "Do you have any experience working with diverse populations including folks with chronic mental illness?"}, {"date": "20 May 2016", "title": "CDP Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Sound (West Seattle, WA) in Jan 2013", "Interview Descriptions": "asked when I failed what did I do to get through it. panel of interviewers. good interview. it is good to understand the WAC codes, ethics, ASAM criteria. good future growth in other departments", "Interview Questions": "how do I handle stress and self care"}]]