[[{"date": "23 Feb 2022", "title": "Training Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Kaplan University", "Interview Descriptions": "Application, call from HR Recruitment followed up with emailed information and instruction, submission of screening questionnaire; handoff to management for face-to-face interview and delivery of presentation; reference check and job offer.", "Interview Questions": "What do you think is the most interesting current focus in the field?"}, {"date": "15 Aug 2020", "title": "Classroom Operations Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Kaplan University in Aug 2019", "Interview Descriptions": "One on one interview with the person that supervises all Classroom Operations Coordinators. Very informal conversation with standard questions about previous work experience and education.  Interview took less than an hour.", "Interview Questions": "Walk me through your resume. "}, {"date": "10 Aug 2018", "title": "Senior Marketing Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Kaplan University (La Crosse, WI)", "Interview Descriptions": "I was scouted through LinkedIn then submitted my application online. The person who scouted me called to give me more details then recommended me for an interview. About two weeks later I had an interview with the hiring manager. I followed up that same day with a thank you email. I then followed up about 1.5 weeks later asking for an update (I was told to contact the interviewer if I did not hear from them within a week). No response to my follow up. I believe the recruiter accidentally told me the position was remote when it was not. None the less a response would have been appropriate.", "Interview Questions": "How do you handle stress? How do you organize and prioritize projects?"}, {"date": "12 Mar 2018", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kaplan University", "Interview Descriptions": "Dean of school called me and interviewed me online.  He asked for a teaching philosophy to be emailed to him.  He also asked for official transcripts.  He was very professional and pleasant, and was not intimidating.  I have loved working for Kaplan, but wish I had more classes to teach and would like to be full time.  I had more classes at first.", "Interview Questions": "What do you consider one of your weaknesses"}, {"date": "3 Jun 2018", "title": "Financial Aid Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kaplan University (Fort Lauderdale, FL) in Oct 2017", "Interview Descriptions": "The interview process was standard like other companies. After applying through Glassdoor I was asked to apply through the company's website, then I received a phone call from the recruiter with quick questions regarding my work experience and interests. After about a week a follow up call was received scheduling a face-to-face interview with the hiring manager and the Financial Aid Director, after another week a phone call was received from the recruiter informing that an offer was going to be made but they could not pay the amount I was asking for. It was not going to be much difference than my previous job so I accepted their offer.", "Interview Questions": "Tell me about your day to day routine?\r\nWhy did you change jobs so often?\r\nTell me about a situation you had to go to HR?\r\nWhy do you want to leave your current job?"}, {"date": "11 Apr 2017", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Kaplan University (Orlando, FL) in Mar 2017", "Interview Descriptions": "I first had a Kaplan recruiter contact me after I applied for the position to do a phone interview. She basically stated the job description and set me up for an in-person interview the following week on at their Orlando, FL location near the campus of UCF.  \r\n\r\nRed Flag #1 The recruiter followed-up several times prior to the interview. She called the day before to ask if I was ready or nervous. She even called the morning of the interview while I was attempting to get to my interview. The recruiter  she was pushing you to be sure you attend your interview because I'm guessing it's part of their pay plan.  I honestly spoke to the recruiter more times than I did my own friends and family during the process. There's a big difference between follow-up and overkill, I felt like I was answering the phone from a telemarketer.\r\n\r\nI walked through a very crowded call center into the interview room. There were 3 people present. The Director of Admissions, a manager and a superior of the admissions director that was observing there work.  The interview were your typical behavior STAR questions.\r\n\r\nRed Flag #2:  I inquired as to why the position was open and they stated it was due to growth. Unfortunately, I prefer honest answers.  They layoff every year in this department and they give you cold leads. I also made sure I did not let them know I knew many employees that are currently employed with the company all of which said they would not recommend working of the company. They were also seeking someone to Tuesday-Sunday.  (So that means you'll never be compensated for holidays that are observed on Mondays).\r\n\r\nRed Flag #3  I asked why have their enrollments decreased year over year and what is their target enrollment numbers for year-end 2017.  The response from the director was it is due to the guidelines/restrictions from the department of education.  The accurate information is that Kaplan University has been cited for improper recruitment practices and has been riddled with lawsuits. I also have a friend that has been paid out in a class action lawsuit because of this.\r\n\r\nRed Flag #4 The interviewers asked about my years of employment, which felt like an age discriminatory question.  At this point though, I knew that they were threatened by an individual with so much work experience.", "Interview Questions": "Explain a time personal/professional in which you went above your duties to help someone feel better."}, {"date": "24 Mar 2017", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Kaplan University (Orlando, FL) in Mar 2017", "Interview Descriptions": "I was recruited and agreed to have an interview with the director and another associate.  I was advised it would be an Behavioral type interview and prepared accordingly.  I have had many interviews of this type.", "Interview Questions": "Name a time when you failed and what you did about it.  Tell me about a time when you didn't listen and what happened.  Every question was negative!  On and on...sorry, but I would rather talk about my achievements and successes in life.  "}, {"date": "4 Jan 2017", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 7 weeks. I interviewed at Kaplan University", "Interview Descriptions": "Phone Interview with Corporate HR person which was followed by both a phone interview and an in-person interview with the hiring manager. Lastly, I was brought in to speak with the regional VPs. Most were pretty basic and simple common interview questions. The interviews were very laid back and conversational at all stages of the process.  Very hesitant to answer questions I asked about biggest internal challenges or frustrations.", "Interview Questions": "How would you approach your job?"}, {"date": "15 Apr 2018", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kaplan University (Indianapolis, IN) in Sept 2016", "Interview Descriptions": "I was emailed after I submitted my application, and I then spoke with the Dean of Kaplan University Indianapolis via email about an interview. I was called afterwards randomly by phone and asked how much I would like to ask for.", "Interview Questions": "When was a time that you dealt with a difficult customer?"}, {"date": "16 Aug 2016", "title": "Medical Assistant/Spanish Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Kaplan University (Broomall, PA)", "Interview Descriptions": "The interview process was based in multiple questions regarding the position, future goals and practices to engage and apply tools to motivate the ratio of student motivation and graduation commitment.", "Interview Questions": "Where would you see in 1 year your goals as an Medical Assistant Instructor?"}], [{"date": "27 May 2016", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Kaplan University", "Interview Descriptions": "Submit application online. Confirmation email received immediately. I received an HR preliminary interview within one week. After a few days, I received a Chair interview. Position was offered. Have transcripts verified. Attend online training to experience the classroom (3 weeks in length). Begin teaching.", "Interview Questions": "What is my teaching philosophy?"}, {"date": "31 Mar 2016", "title": "Career Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Kaplan University (Chicago, IL)", "Interview Descriptions": "The process was very straight forward. I had a few interviews with the recruiter, hiring manager and also a follow up interview with the VP. I also had a skill test as well.", "Interview Questions": "Tell me about yourself."}, {"date": "5 Sept 2019", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Kaplan University (Fort Lauderdale, FL) in Jan 2016", "Interview Descriptions": "The interview process was very smooth. They made it very pleasant, easy and enjoyable. I was called by a recruiter that helped me by screening and preparing me with examples of questions. I went in with the confidence to get the job after having been helped by the recruiter.", "Interview Questions": "Why do think you are the right person for this job?"}, {"date": "21 Dec 2015", "title": "Receptionist Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Kaplan University", "Interview Descriptions": "Got interview from a third party recruiter. It was a group interview on site so it was different than a phone interview. There were about 15 of us. We met with 3 managers from the student records department. After quick introductions we had about 45 minutes of questions from them. Then the last 30 minutes we could ask our questions. They were very open to answering them and made sure to stress open lines of communication.", "Interview Questions": "What is something you are trying to improve in your life? And discuss a current opportunity and steps to achieve your goal."}, {"date": "25 Sept 2015", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kaplan University", "Interview Descriptions": "The interview was very friendly and open, we had a good conversation and they did a good job of getting in to the specifics of my background and expertise.  We also talked about the value and contribution that professionals can contribute to the learning environment of the students.", "Interview Questions": "Summarize your professional experience and the types of roles and projects you have worked on."}, {"date": "4 Sept 2015", "title": "Operations Research Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kaplan University (Miami, FL)", "Interview Descriptions": "2 interviews, one with Manager and then with Director of operations.They were knowledgeable, detailed oriented and observing. At first they were all business but then they try to get your personality and check if you are a good fit for the team.", "Interview Questions": "Computer skills"}, {"date": "19 Sept 2016", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Kaplan University (Orlando, FL) in Sept 2015", "Interview Descriptions": "First is a phone screen interview via recruiter typically internal, then a face to face with 1 or 2 managers. It was more of a situational interview, very straight forward. Both managers I interviewed with had little eye contact and took notes almost the entire time. Overall it can feel slightly intimidating with the interview style but if you're prepared it's not bad.", "Interview Questions": "Give me a scenario in which you had to overcome an objection and it was successful."}, {"date": "25 Sept 2016", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kaplan University (Orlando, FL) in Sept 2015", "Interview Descriptions": "After completing my application, I was contacted a week later. After completing 2 phone interviews, i was called for an in person interview. I was hired 2-3 weeks later. The training was about 4 weeks long and benefits were available the first day of training.", "Interview Questions": "How do you build a rapport with potential students?"}, {"date": "29 Aug 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Kaplan University (Fort Lauderdale, FL)", "Interview Descriptions": "Very specific into details of tasks needed to perform role.  Interwier was knowledgeable and knew the exacts talent to look for to attractive an individual that can help them get to their goals without having to baby sit.", "Interview Questions": "Are you comfortable with several projects active at the same time?"}, {"date": "29 Jun 2015", "title": "SAT/ACT Teacher Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kaplan University in Jun 2015", "Interview Descriptions": "First, apply online. Then, there's a link for a first round screening online.\r\nOnline self-recorded interview is followed by a Skype interview with a current Kaplan employee and finally a Skype interview with the regional recruiter.\r\nThen, you wait until the recruiter emails you about whether they hire you or not.", "Interview Questions": "What would you do to emphasize the Kaplan teaching method?"}], [{"date": "4 Jul 2015", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Kaplan University (Orlando, FL) in Jun 2015", "Interview Descriptions": "I applied for the job via the Kaplan website. About one day later if not the same day, I received an email from a recruiter who provided a link via email. The link was to a virtual interviewing site that the interviewee was to acesss with a device that has a camera. I used my laptop. I was given an essay question to answer first, where I had to type out a response. The rest of the interview consisted of me answering about six interview questions on camera with no one at the other end. Its just you looking at yourself for two minutes at a time which is very distracting by the way. I also had to fake sell them a product as an answer to one of the interview questions.\r\n\r\nI did not get the in person interview. However, based on the reviews they saved me a headache so I am thankful. I actually interviewed for this position back in 2011 and was invited back for a second interview where I met with one of the directors. I did not get the job because well...you can fill in the blanks. The HR rep actually called me back and said she did not agree with his decision not to hire me and that she felt I was a good candidate for the position. However, bias lurks everywhere so what can you do. \r\n\r\nKaplan, you should loose that video process that you do. Its ineffective and shows you are cutting corners. I did not get the job and yet never got to actually speak with a human being? Come on now. Give people a fair shot and allow them to come in and interview in person. Like I said, you guys saved me a headache because you have a plethora of complaints on this website from current employees. Plus I read that the pay has changed to a low base plus commission, rather than a straight salary. Your people are misrable.", "Interview Questions": "One question I remember is the age old question of tell me about yourself."}, {"date": "31 May 2019", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Kaplan University (Fort Lauderdale, FL) in Mar 2015", "Interview Descriptions": "It was laid out that you are asked questions by phone and then they have you come in for face to face interview. You then shadow people on the floor and hear back on a decision or not.", "Interview Questions": "What is your sales experience?"}, {"date": "27 Dec 2015", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Kaplan University (Fort Lauderdale, FL) in Feb 2015", "Interview Descriptions": "The interview process was actually over the telephone. Then I had to submit a photo so that they see what I look like. It took about a week before I finally heard from someone regarding a face-to-face interview.  That interview was as easy as the phone interview, but it was shorter in person.", "Interview Questions": "How important is customer service."}, {"date": "5 Jun 2015", "title": "Full Time Adjunct Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Kaplan University in Jan 2015", "Interview Descriptions": "Very easy going and effective.. relaxing, telephone. My interviewer was the chair for my department, which was calming as our chair is an intelligent and very effective leader. Our chair is personable and knows who I am. We communicate on regular basis.", "Interview Questions": "Do I use the rubrics"}, {"date": "31 May 2016", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Kaplan University (Portland, ME) in Jan 2015", "Interview Descriptions": "Interview began with a member of the interview committee greeting me at the door, having a short and professional conversation as we walked to the conference room. Committee members were all present, individually introduced themselves and greeted me kindly. The overall conversation was excellent, informative, comfortable and honest all around. The committee members clearly love their university!", "Interview Questions": "Q: What is the most important aspect of academic advising?"}, {"date": "4 Sept 2014", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Kaplan University", "Interview Descriptions": "I have interviewed for three different positions in my time at Kaplan and received two of three job offers. The interview process typically starts with a recruiter calling you and conducting a phone interview, if passed on then a manager of the division you are applying to will conduct another phone interview and if that is successful you will receive a third and final in person interview thereafter with about three managers. Some time after that you will get a call from the recruiter about an offer and an e-mail with offer details.", "Interview Questions": "There questions are mostly typical of what the students will ask and how you respond to them and various behavioral questions. "}, {"date": "13 Oct 2017", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kaplan University (Fort Lauderdale, FL) in Sept 2014", "Interview Descriptions": "3 interviews in total ... general background questinos, behavioral based questions...phone screen interview, interview with recruiter face to face, interview with director of admissions face to face\r\nwait for follow up calls, shadowing, discuss offer letter, negotiated terms, started, trained", "Interview Questions": "Behavorial based"}, {"date": "17 Aug 2014", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 days. I interviewed at Kaplan University", "Interview Descriptions": "Interview process - there were so many candidates that they brought in all candidates in to one room. Staff explained the company and the position available. I did not realize that our 2 min introductory speech would be the only communication on skills and what the candidate brings to the position. There was no warning that this would be the only time to pitch ourselves and I was disappointed.", "Interview Questions": "Giving a 2 min pitch on yourself in front of the rest of the candidates. "}, {"date": "22 Jul 2014", "title": "Admission Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Kaplan University in Jul 2014", "Interview Descriptions": "I was given a phone interview by a recruiter  and ask some behavioral questions, at the end of our 25 minutes interview she offer to set me up for a second interview with a manager. I had the interview and was interviewed by the ADOA and the DOA. They threw behavioral questions requesting to give examples and outcomes.", "Interview Questions": "Name a time when I plan something that back fired on me, honestly I have never made an work related plans that back fired"}, {"date": "10 Jan 2016", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Kaplan University (Plantation, FL) in Apr 2014", "Interview Descriptions": "Sat with the Asst Director of Admissions and was asked general admissions questions. How do you overcome objections, how do you get someone to open up & relate while on a 15-20 min conversation.", "Interview Questions": "How do you overcome objections?\r\nHow long do you wait to discuss school?\r\nWhen do you talk about finances?"}], [{"date": "22 Apr 2016", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Kaplan University (Plantation, FL) in Mar 2014", "Interview Descriptions": "Several phone screenings, then 2 face to face interviews with management. This can take some time, it took over 2 weeks for me to complete from start to finish. They do request a great deal of documents and this can take time as well.", "Interview Questions": "What do you think you would contribute to Kaplan University, your Admission Team, and your potential students?"}, {"date": "18 Jan 2014", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Kaplan University", "Interview Descriptions": "Was called to set-up what I believed to be an interview after I submitted my resume' and application online.  What it turned out to be was a \"group\" interview with about 9 other candidate.  During our hour long presentation, the director explained that this position though it is titled \"Admissions Ad visor\" it is not inf act an advisory position, rather it is a sales position.  During the presentation we were told that there would b e a short break and if the job wasn't for us or what we had expected then we could leave at that time.  \r\n\r\nI found this to be an odd procedure.  Wouldn't it just be easier to be upfront in the job description rather than reverting to a certain amount of deception to get candidates in the door?\r\n\r\nI felt this to be an unfair way of handling a position, though I do give points for creativity!", "Interview Questions": "N/A"}, {"date": "3 Jan 2014", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kaplan University (Saint Louis, MO)", "Interview Descriptions": "I interviewed for the job, although the interview was pretty casual. Once I passed that step, I had to come back in to audition for the job by delivering a short lesson. Attendees completed a written evaluation of my presentation, then the Dean discussed my scores with me. I was evaluated on presentation style, vocal projection, use of the whiteboard, clarity of the lesson itself, and more. Once hired, I had to submit official transcripts and complete a lot of onboarding paperwork and required online training (sexual harassment, security, etc.). The whole process from the call for the interview to being ready to teach my first class was probably close to three weeks.", "Interview Questions": "I was graded down for mentioning that I was tired (I worked a night job at the time, so I had had very little sleep) to a few people before the actual lesson began. Since I had not been aware that I was already being evaluated, I was somewhat taken aback by this."}, {"date": "16 Jul 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Kaplan University (Fort Lauderdale, FL) in Jan 2014", "Interview Descriptions": "behavior based interview.  They ask you about past experiences so be prepared to discuss the STAR format.  Situation, Task, Action, Result.  Stay away from hypothetical, use experiences that you specifically impacted.  No vague or high level answers, be numbers oriented.", "Interview Questions": "Tell me about a time you had to make a difficult decision?"}, {"date": "5 Feb 2016", "title": "Financial Aid Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Kaplan University (Lincoln, NE) in Jan 2014", "Interview Descriptions": "Applied online, contacted by phone about a week later. In person interview lasted about 30 minutes, was offered the position approximately a week later, negotiated higher salary. Interview was thorough and I was asked job appropriate questions.", "Interview Questions": "Do you have experience working in customer service?"}, {"date": "25 Nov 2013", "title": "Associate Director of Admission Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Kaplan University (Boca Raton, FL)", "Interview Descriptions": "Very easy as long as you are honest.", "Interview Questions": "What was your greatest acconplishment on your previous job"}, {"date": "14 Oct 2013", "title": "Admissions Advisor II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kaplan University", "Interview Descriptions": "I applied online and was then contacted by email to set up a phone interview.  The phone interview was about 30 minutes with standard behavioral questions after which I was invited in for a 1:1 interview.  The in person interview was more of an information session about the position and a tour of the learning center.  I was asked some questions about my background and specifics about my last position.", "Interview Questions": "Describe a challenging situation and what you did to overcome it.  "}, {"date": "3 Sept 2013", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kaplan University", "Interview Descriptions": "Name a time when you didn't get along with your employee and how did you handle it?", "Interview Questions": "N/A"}, {"date": "7 Aug 2013", "title": "Training Position Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at Kaplan University (Fort Lauderdale, FL)", "Interview Descriptions": "The interview process was very organized and the recruiter had excellent follow up with me leading up to my first face to face interview.", "Interview Questions": "The most challenging questions had to do with actual scenarios that were happening in the company.  "}, {"date": "8 May 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Kaplan University (Orlando, FL) in Aug 2013", "Interview Descriptions": "Started with the application. Then a phone interview with a corporate recruiter. Situation based questions were asked. After the phone interview I was asked to interview with the director of admissions and the associate director of admissions. More situation based questions and behavior based questions.", "Interview Questions": "Tell me about a time when you closed a deal and how did you do it?"}], [{"date": "10 Sept 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Kaplan University in May 2013", "Interview Descriptions": "The recruiter calls and does a phone interview using behavioral-based questions. They explain the job which is basically being on the phones all day receiving calls or calling prospective students. There is usually a monthly enrollment goal. Next is an in-person interview with front-line managers which may include job shadowing. These questions are also behavioral-based. The job offer is typically given within 24-48 hrs.", "Interview Questions": "Tell me about a time that you had a disagreement with your supervisor. How did you handle it?"}, {"date": "8 Apr 2013", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Kaplan University", "Interview Descriptions": "Highly unprofessional hiring process. I was called for an interview and the initial personality questionnaire. However, they never actually followed through and scheduled an interview. When I called to follow up, the receptionist hung up on me.", "Interview Questions": "There were odd questions on the personality assessment regarding political affiliation. "}, {"date": "2 Apr 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kaplan University (Fort Lauderdale, FL) in Apr 2013", "Interview Descriptions": "Initial interview was done over the phone and online. It was very casual, and the staff were professional.  The final interview was done with two Admissions Advisors that were very cordial and made the experience pleasant.  The period of time from initial contact to being offered the position was in a timely manner.", "Interview Questions": "How would you apply past experience working with adult learners in the classroom (campus setting)to this position?"}, {"date": "26 Mar 2013", "title": "Executive Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Kaplan University", "Interview Descriptions": "Pretty standard. Initial screening interview with HR, and follow up by phone by member of management team. A series of in-person interviews follow, mostly in Chicago. Kaplan believes that it's best to have many opinions on a hire. There wasn't really any specific order or hierarchy in interviewers; more based on their availability that day.", "Interview Questions": "There were no unusual questions. A few behavioral (STAR) questions by HR, but otherwise pretty open and general. Some interviewers preferred to describe their own role and abilities."}, {"date": "7 Feb 2013", "title": "Senior Admissions Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Kaplan University", "Interview Descriptions": "Single interview by HR w/testing and then with ADOA and then DOA or EDOA", "Interview Questions": "None, all standard"}, {"date": "13 Jun 2017", "title": "Financial Aid Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kaplan University (Chicago, IL) in Feb 2013", "Interview Descriptions": "Went through 3 rounds of interviews. Most of the questions centered around background experience in education and financial aid processes as well as customer service skills. The time to hear the decision was reasonable.", "Interview Questions": "There was a question regarding ethics. "}, {"date": "14 Nov 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Kaplan University (Omaha, NE) in Jan 2013", "Interview Descriptions": "Standard process:  Telephone interview, meet with the director (immediate boss) and a meeting with the entire team, which was entirely unexpected, but nice, president, and then a meeting with the regional VP.", "Interview Questions": "Why is the position important to you?  \r\nDiscuss a work conflict that you were faced with and had to overcome.\r\nWhat does work ethic mean to you?"}, {"date": "27 May 2015", "title": "Career Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Kaplan University (Omaha, NE) in Jan 2013", "Interview Descriptions": "i submitted a resume and completed an application. Phone interview, then panel interview followed by a presentation that I would give to students on any employment related topic. Interviewed with the President.", "Interview Questions": "Why should we hire you?"}, {"date": "8 Nov 2012", "title": "Financial Aid Servicing Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kaplan University (Orlando, FL)", "Interview Descriptions": "The interview process consisted of a phone interview and then two face to face interviews with hiring managers. The interview process was good. I received a phone interview about a week after applying online. It was about 10-15 minutes long. During the phone interview, the recruiter informed me of the salary (not that competitive). Then the recruiter invited me for a face-to-face interview. Since, I was coming from out of town, the manager conducted the initial interview and then requested I stay for the second interview since she was please with my skills. Before the second interview, the manager gave me a tour of the facility (nice facility) and explained what I'd be doing there in depth. After the second interview, I was offered the job on the spot.", "Interview Questions": "All of the questions were pretty straigt forward. I will say that they did like the fact that I knew background infrmation about the company."}, {"date": "21 Jul 2012", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Kaplan University (Orlando, FL)", "Interview Descriptions": "I was recruited by Kaplan's inside recruiter and they called me for a phone screen.  They then asked me to come in for my first interview with the recruiter only.  I did, and I was given a tour of the site.  I sat and listened to an Admissions Advisor as they did their job to see if it would be something I could see myself doing.  They then called me for a second interview, this time with an ADOA and a DOA.  I was then asked some basic interview questions and sold myself.  I was offered the job the next day via a phone call from the recruiter.", "Interview Questions": "I didn't really have an unexpected question, they were pretty standard interview questions.  An example was: Tell me about a time in your career where you ran into an obstacle, and how you overcame that obstacle.  "}], [{"date": "19 Feb 2016", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Kaplan University (Fort Lauderdale, FL) in Jul 2012", "Interview Descriptions": "several interviews, standard questions, mock sales calls, Met with recruiter then several hiring managers before final decision. Had to met with all the of the people within a day. Hiring decision was day in the same day.", "Interview Questions": "How I found the job"}, {"date": "4 May 2012", "title": "Admissions Advisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Kaplan University (Des Moines, IA) in May 2012", "Interview Descriptions": "Applied online for the Admissions Advisor position and about two weeks later I received a phone call asking if I could come in for an interview later in the week. I showed up to interview and was placed in a room with 8 other individuals. Someone in the group asked why it was going to be done as a group and the Director of Admissions said it was very informal and first initial meeting was for them to talk about Kaplan and the position. She mentioned that she would speak about the position for about 20 minutes and then take a break and at that time if anyone was no longer interested they were free to leave. I knew once she said that it was not going to be the typical admissions job I was hoping for. She spoke a couple of minutes about what the University has to offer to students but the majority of the time she spoke about how this was going to be a SALES position not a counseling position. Everyone is given daily, monthly, and yearly goals that will be monitored very closely. She said in order to meet the goals you are given overtime is highly encouraged. She said anyone stepping into Admissions role will have to work two nights a week until 8pm, two nights until 6pm (Fridays the office closes at 4pm) and then usually come in for overtime on Saturdays 2 or 3 weeks out of the month. After she went over it being a SALES position, goals, and hours you would be required to work it was time for our \"Break\". I did not stay to listen to the rest of her presentation. I do not want to be in a position where I am constantly micro-managed and given goals that are set so high it is pretty much mandatory that you have to work overtime or else you are canned. Thanks but no thanks. I will say though that it is very respectful of them to let people know a head of time so they do not get into a position and not realize what is expected of them.", "Interview Questions": "Tell me something about yourself?"}, {"date": "10 Feb 2014", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kaplan University (Fort Lauderdale, FL) in Mar 2012", "Interview Descriptions": "Thorough and detailed with multiple interviews.", "Interview Questions": "Same as most companies."}, {"date": "1 Jul 2016", "title": "Assistant Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Kaplan University (Fort Lauderdale, FL) in Mar 2012", "Interview Descriptions": "I applied online and was called within a few days to meet. The interview was brief and informal. The manager was easygoing so she made the interaction comfortable and not stressful. I was hired immediately.", "Interview Questions": "I was asked how much I wanted to be paid per hour."}, {"date": "21 Feb 2012", "title": "Financial Aid Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Kaplan University (Fort Lauderdale, FL) in Feb 2012", "Interview Descriptions": "I applied online and the recruiter contacted me the next day. We talked for approx. 30 minutes which made up a \"pre-interview\" or screening. We discussed job qualifications, requirements and salary expectations.Then that week I had my first official phone interview with someone in the financial aid  office in Chicago. After that I had a 1:1 interview with the director of financial aid that was really simple and lasted 10 minutes. Overall not too stressful.", "Interview Questions": "What do you expect to me the most difficult part of your job if you were hired by Kaplan?"}, {"date": "24 Aug 2012", "title": "Admission's Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Kaplan University (Orlando, FL) in Jan 2012", "Interview Descriptions": "Very detailed interview process and long.  I had to wait over a month for a training class to begin.  Pretty typical interview process except toward the final 3 interview felt like an interrogation with two directors who tag teamed you with questions about your past.  They would spite out questions and write down everything you answered.  Very strange experience and felt like I did something wrong.", "Interview Questions": "Tell me about a time when you where faced with a difficult situation and your outcome was negative because you made the wrong choice?  What? Really?"}, {"date": "11 Jul 2014", "title": "Director of Career Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Kaplan University (Omaha, NE) in Jan 2012", "Interview Descriptions": "Traditional hiring process you apply on-line, follow-up and schedule meetings. Non-Traditional interviewing process it took multiple interviews completed a 1:1, then a group, then a lunch, then a presentation. You have to then complete an on-line application and background check release which can take up to minimum one week and maximum 30 days. Be prepared to share all previous employers, length of employment, and the time period. They will consider applicants with criminal convictions on case by case basis", "Interview Questions": "What do you know about Kaplan University and with that why do you want to work here?"}, {"date": "26 Mar 2016", "title": "Accountant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Kaplan University (Alpharetta, GA) in Jan 2012", "Interview Descriptions": "Apply online and they will call you in for an interview if your resume' meets the requirements. Then once you are there you file out a standard application and then meet with two interviewers.", "Interview Questions": "What is one of your weaknesses?"}, {"date": "23 Feb 2012", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 5 days. I interviewed at Kaplan University (Fort Lauderdale, FL) in Jan 2012", "Interview Descriptions": "Contacted by a recruiter-phone interview\r\nCalled back by the recruiter and set up a one on one with the manager\r\nInterview with the manage 1:1", "Interview Questions": "I cant remember the questions to the interview"}, {"date": "29 Apr 2014", "title": "Financial Aid Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kaplan University (Fort Lauderdale, FL) in Nov 2011", "Interview Descriptions": "I was interviewed by 6 different members of financial aid management at the same time, with them all sitting around me and starring me down from the end of the table.  It was a very nerve racking experience and meant to intimidate you.  Luckily I don't scare easily.  It took them about a week to get back to me and I had to make my decision right away.", "Interview Questions": "Where do you see yourself in 5 years"}], [{"date": "21 Apr 2012", "title": "Librarian Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Kaplan University (Sacramento, CA) in Nov 2011", "Interview Descriptions": "I was interviewed by two different administrators. The first one was the usual questions and a tour of the place. Then I was invited for a second interview/meeting with the vice-president. He told me there was one more candidate other than me that was being considered. The decision was expected to be made \"in a few days.\" I wrote thank you messages to both people, said that I was looking forward to hearing about the decision. I did not hear _anything_ back. That's bad manners and bad professional behaviour. I wonder how they run the daily affairs of the school.", "Interview Questions": "This is not a question, but a comment made about the previous person in the position. Was I able to get along with people, because there had been a problem with the librarian before and it had not worked out."}, {"date": "5 Oct 2015", "title": "Director of Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Kaplan University (San Diego, CA) in Jun 2011", "Interview Descriptions": "Met with Campus President and SVP of Operations. First interview focused on my background and what I saw a 30 day, 60 day plan and what I felt I could to help the school.  My 2nd interview with the SVP was much more focused on seeing my thoughts on enrollment and retention strategies.   Overall, it was not the hard:)", "Interview Questions": "What would you do to impact the school first?"}, {"date": "27 Apr 2014", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Kaplan University (Fort Lauderdale, FL) in May 2011", "Interview Descriptions": "Applied online thru indeed.com and received a phone call back the following day. (told I was being interviewed in light of my previous experience with Kaplan Test Prep after asking why they were interested in me) Went through a 3-step interview process...took about 2-weeks and met with a recruiter, potential supervisor after a 'floor' observation, and then the department manager.", "Interview Questions": "How did I handle rejection from a potential client after putting a significant amount of work into trying to 'sell' him or her on my opportunity...?"}, {"date": "23 Feb 2011", "title": "Admission Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Kaplan University (Fort Lauderdale, FL) in Feb 2011", "Interview Descriptions": "Filled out  for the position approximately a week ago, and got a call the following week to set up a phone interview, after initial phone interview a request was asked of me to come in to take a timed  assessment test. This is as far as I've gotten. I have my assessment today.", "Interview Questions": "Why do you want to work here?"}, {"date": "19 Dec 2015", "title": "Financial Aid Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kaplan University (Orlando, FL) in Jan 2011", "Interview Descriptions": "Phone Call, after the call it's 2 face-to-face interviews, and at the second interview they offer you the position contingent on your background. The background check consists of a criminal background as well as whether or not you're default on student loans. Credit check (not very hard even with bad credit), and reference check", "Interview Questions": "\"How do you cope with stress?\""}, {"date": "29 Sept 2010", "title": "Assistant Admissions Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Kaplan University (Houston, TX) in Sept 2010", "Interview Descriptions": "When I arrived to the interview, there was a man who took me up to a room that had about 20other people in the room.  When the speaker entered the room she told us that we were not here for an individual interview but a group interview.  She told us a little about the position as an admissions advisor and then told us that each of us had to give a 2 minute presentation in front of the class on why we were the best canidate for the job.  Then we had to say what we would be doing if we didn't get the job.   \r\n\r\nAfter everyone was finished we were told that if we were still interested that we should go home and take the Chally test and they would then call us for a one on one interview if we passed the exam.", "Interview Questions": "why was I the best canidate for the job"}, {"date": "19 Jul 2010", "title": "Director, Call Center Operations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Kaplan University (Orlando, FL) in Jul 2010", "Interview Descriptions": "The recruiter made a cold call; asked if this was a good time to talk.  Covered every aspect and position on my resume, wanted more detail.  Spent over an hour reviewing my jobs and my background.  Interesting technique – using a cold call.", "Interview Questions": "Why I left a previous employer...."}, {"date": "4 Mar 2011", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kaplan University (Boca Raton, FL) in Jul 2010", "Interview Descriptions": "During the interview process the Contracted Recruiter mentioned benefits and a pay scale that was never implimented and not true; the interview process was a two-part process, one with the Recruiter/Interviewer and another day with a Director of Admissions. I had to prove my education criteria, background, etc with the Recruiter/Interviewer and prove my previous skills, selling abilities in detail with the Director of Admissions.", "Interview Questions": "N/A"}, {"date": "30 Oct 2013", "title": "Senior Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Kaplan University (Fort Lauderdale, FL) in Jul 2010", "Interview Descriptions": "Phone Interview and then a face to face - easy process", "Interview Questions": "N/A"}, {"date": "1 Mar 2014", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Kaplan University (Fort Lauderdale, FL) in Jun 2010", "Interview Descriptions": "Very rigorous with a thorough background check and extensive online training.", "Interview Questions": "There was no liberty in teaching. Everything was done exactly the same way with no leeway for instructor liberty in teaching. Short time schedule to grade several assignments. Overloaded instructors with work. The compensation really comes out to a negative with all of the time spent. They require weekly live sessions (Adobe Connect) with slides with online students as well. Some people may like working for them because everyone has different tastes and expectations. Personally, I was glad to get out of there and would not look back!"}], [{"date": "8 Apr 2014", "title": "Education Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Kaplan University (Chicago, IL) in May 2010", "Interview Descriptions": "I started out working in the admissions office. I interviewed with the advising office as a group interview- there were 5 people present. There were a couple role-play scenarios...how would I advise a student with xyz issue or handle a certain situation. They also asked typical questions like why I wanted to be an advisor/why should they hire me", "Interview Questions": "I thought they were pretty typical questions...nothing difficult comes to mind"}, {"date": "18 Mar 2014", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Kaplan University in Apr 2010", "Interview Descriptions": "1. You speak with a recruiter. 2. You speak with a Associate Director. 3. You start training during the next training session.", "Interview Questions": "They just want to know that you can hold a personal yet professional conversation."}, {"date": "7 Apr 2010", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kaplan University (Orlando, FL) in Mar 2010", "Interview Descriptions": "I applied online for a different position in Kaplan and was contacted by recruiter stating that I don't have enough experience for this position, but they would like to interview me for the Admissions Advisor position. She scheduled the interview for the same day few hours later. The recruiter was very friendly and interview went very well. Standard questions about my experience, examples of selling something, describe difficult situation and how I deal with it. Also she asked what I know about Kaplan. I was invited for the second in person interview wi recruiter. The first part of the interview was a simple Outlook test: to compose an email, attach file and send it. The second part of the interview were standard behavioral questions. Make see you use STAR method (situation, task, action, result). She said she would contact me within 2 weeks and the next and last step is an interview with HR manager. Very sales oriented job. Make sure you dress up very conservative.", "Interview Questions": "Tell me a situation when you filed"}, {"date": "6 May 2010", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Kaplan University (Plantation, FL) in Feb 2010", "Interview Descriptions": "phone interview then in person. I decided I didn't want the job.", "Interview Questions": "what has been your biggest dissappointment in business"}, {"date": "27 Mar 2014", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Kaplan University (Baltimore, MD) in Jan 2010", "Interview Descriptions": "Nothing interesting to report here", "Interview Questions": "Mostly concerned with transcripts"}, {"date": "4 Dec 2009", "title": "Admissions Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Kaplan University (Orlando, FL) in Dec 2009", "Interview Descriptions": "Recruiter found my resume on Monster.com.  He was very straight forward about what to expect on the job which I respected very much so.", "Interview Questions": "How do you deal with an internal conflict with a Manager?"}, {"date": "31 Jul 2013", "title": "Admissions Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kaplan University (Fort Lauderdale, FL) in Nov 2009", "Interview Descriptions": "Kaplan interviews thru Human Resources then allows the candidate to sit with reps and listen to calls. KAPLAN (in South Florida) MOSTLY HIRES JAMAICANS, CARIBBEAN BLACKS AND HISPANICS. Very few white applicants are hired, because ethnic Managers have last approval.", "Interview Questions": "Ethnic Managers will ask embarassing questions about how a white applicant \"gets along\" with workers of different backrounds. Unethical and quite illegal."}, {"date": "22 Sept 2009", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Kaplan University (Orlando, FL) in Sept 2009", "Interview Descriptions": "Phone Call Brief explanation of Job position conditions,hours,whats expected,benefits.\r\nAwaiting Full phone interview.Will advise outcome.", "Interview Questions": "Can you work the shifts and evening untill 9:00PM"}, {"date": "30 Oct 2009", "title": "Financial Aid Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Kaplan University (Arlington, TX) in Aug 2009", "Interview Descriptions": "I was contacted through email to interview for the company.  I had a one on one interview for my first and second interview.  I had to fill out a seven page application in the receptionist area.  Make sure you know all your past employer information including address and phone numbers.  You need to list four professional references and their addresses and phone numbers.", "Interview Questions": "What do you about financial aid?"}, {"date": "12 Sept 2013", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Kaplan University (Orlando, FL) in Aug 2009", "Interview Descriptions": "apply online, do phone interview first then do face to face interview with associate directors then face to face with senior director.  they hire often due to high turnover.  if you don't excel in the job position you might want to consider other alternatives.", "Interview Questions": "apply online, do phone interview first then do face to face interview with associate directors then face to face with senior director.  they hire often due to high turnover.  if you don't excel in the job position you might want to consider other alternatives."}], [{"date": "7 Mar 2013", "title": "Financial Aid Servicing Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Kaplan University (Orlando, FL) in Jun 2009", "Interview Descriptions": "It was a basic interview with basic quesstions asked by most interviewers. Done with a panel.", "Interview Questions": "How did you personally contribute to your previous position?"}, {"date": "25 Sept 2009", "title": "Admissions Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 1 week. I interviewed at Kaplan University (Miami, FL) in May 2009", "Interview Descriptions": "I applied online. An HR rep promptly got back to me wanting to set up the interview over the phone for 30 minutes first. After the phone interview which was a screening of whether I fit the position or not he said that someone would call me if the manager decides to interview me. I got called in by the manager who then asked me why was I interested in the position. At first I did not think much of them. They were not dressed in suits or something fancy as I would say people would dress during the interview process. Very tidy place but the rest of the people seemed like they needed to work hard to keep the job. Very good interview process. Very interesting questions. Advice would be, be punctual, answer the questions realistically and think about what you are saying. It helps to make sure they truly understand your answers and also helps you make a decision of whether you would want to work for that company or not.", "Interview Questions": "What makes you a good sales person?"}, {"date": "18 Aug 2012", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Kaplan University (Orlando, FL) in Mar 2009", "Interview Descriptions": "Kaplan's recruiter called me for 2 months trying to entice me into an interview.  I wasnt interested at the time. The salary that they were offering was less than I was currently making. Then a friend accepted a position there and ranted and raved how great they were.\r\nSo I went for an interview and was referred to a SDOA and hired that afternoon.", "Interview Questions": "There were no difficult questions. However it was unexpected that this was a SALES position and not an ADVISOR position"}, {"date": "29 Nov 2012", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kaplan University (Phoenix, AZ) in Feb 2009", "Interview Descriptions": "It was a three stage process.  Submit resume, interview with HR, interview with first line manager.  Since I was hired they've moved to \"group\" interviews where a candidate will sit with three to four managers.", "Interview Questions": "No difficult questions if you have solid sales experience"}, {"date": "5 Aug 2012", "title": "Financial Aid Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Kaplan University (Fort Lauderdale, FL) in Nov 2008", "Interview Descriptions": "This process was very simple initially and comparable to most other companies but once you get hired and you want to move around internally there is a ridiculas interview process. They even verify degrees if you're moving around internally even though they verified the degree before", "Interview Questions": "I can't remember too long ago"}]]