[[{"date": "10 Mar 2023", "title": "Community Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of San Francisco", "Interview Descriptions": "Specific questions about how you would manage the desk in emergency or unforeseen circumstances. Pretty straightforward. If you can answer questions about what to do in an emergency desk shutdown or answer how to communictate with supervisors, you will do great.", "Interview Questions": "What would you do if someone came up to you at the desk and you needed to answer a call?"}, {"date": "5 Nov 2022", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of San Francisco (San Francisco, CA) in Nov 2022", "Interview Descriptions": "the interview process was engaging. Everyone was extremely friendly and personable. There was regular communication and transparency throughout the process. I have not yet received an offer of employment, however, I am in the running for a position within the company.", "Interview Questions": "What is one of your personal values? Describe a time when you were challenged to uphold it."}, {"date": "8 May 2022", "title": "Librarian Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of San Francisco (San Jose, CA)", "Interview Descriptions": "I was on a panel to interview three librarian candidates. One man on the interview panel - it was clear the panel had made their choice before the interviews  - objected to the one young woman around thirty years old saying that \"she could go on maternity leave.\" He objected to the woman in her fifties saying \"she could retire soon.\" (She got a much better job in a much larger library and has yet to retire.) I was shocked that he made these statements. I was even more shocked that my supervisor said nothing to correct his statements. The woman they did hire let me do her job since I had been doing it for half a year (Yes, they wouldn't give me an interview for the job I had been doing). \r\n\r\nI left USF several years ago. If you apply to USF and don't get an interview or a job offer, please don't take it personally. They have the screwiest way of hiring people.", "Interview Questions": "What is your understanding of Jesuit values?"}, {"date": "31 Jan 2022", "title": "Teaching Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of San Francisco", "Interview Descriptions": "Easy and quick because I have taken that class with that Professor. Everything went as planned and was really good. Easy and quick because I have taken that class with that Professor. Everything went as planned and was really good.", "Interview Questions": "what is your major and?"}, {"date": "5 Oct 2021", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of San Francisco", "Interview Descriptions": "2 stage very easy process. \r\nStage 1 requires you to submit a Financial Analysis test. \r\nStage 2 follow up on test & common financial statement questions . \r\nAnd finally you hear back from processor in 2 days", "Interview Questions": "Describe different types of depreciation approaches?"}, {"date": "14 Mar 2023", "title": "IT Help Desk Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at University of San Francisco in Oct 2021", "Interview Descriptions": "In a conference room with IT managers (Field Support/Help Desk Asked if I prefer a manager that checks in on you everyday or once a week Asked how I worked with others", "Interview Questions": "What would I do if a printer wasn't working? Asked me scenarios to find out how my troubleshooting thinking/skills were.. Forgot the rest of questions"}, {"date": "18 Aug 2022", "title": "Front Office Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of San Francisco in Aug 2021", "Interview Descriptions": "Two interviews: one with the team and one with the director both conducted virtually. Very kind staff who were excited to speak with me. They came prepared with great questions, and they created a warm and encouraging environment.", "Interview Questions": "As you know, USF is a Jesuit university. What are your thoughts on Jesuit Values?"}, {"date": "12 Jul 2021", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of San Francisco", "Interview Descriptions": "A pre-screening 30 min Zoom interview with a panel of faculty and staff asking questions on teaching, research, and service. Followed by a one-day in-person interview that included interviews with leadership (program director, department chair, dean, associate dean, etc),  another interview with the search committee, meetings with students and faculty,  a scientific presentation with Q&A.", "Interview Questions": "Why do you want to work at USF?"}, {"date": "3 Aug 2021", "title": "Comm Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of San Francisco in Apr 2021", "Interview Descriptions": "Fill application. Contacted for an interview. Positive experience. Social justice focused. Great interviewers that made the experience exciting. Situational questions to be answered from experience. Took about 45 minutes interviewing for two positions.", "Interview Questions": "Tell us about a time when..."}, {"date": "21 Mar 2021", "title": "Community Office Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of San Francisco", "Interview Descriptions": "Interview process included multiple phases with interviews and a presentation detailing your approach on implementing an original training project you would like to see used in future training days for new Community Assistants.", "Interview Questions": "How would you handle X situation?"}], [{"date": "18 Jan 2021", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of San Francisco", "Interview Descriptions": "I got contacted thru email directly by the hiring manager (lab PI). This is after a few weeks of resume submission. We then scheduled to call and went thru general resume questions. The PI then asked for 3 references and contacted them thru email. Then, I was given an opportunity to onsite.", "Interview Questions": "Give a technical presentation about one of my previous projects, challenges encountered, and how I approached them. Code review. "}, {"date": "14 Jan 2021", "title": "Network Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at University of San Francisco (San Francisco, CA) in Dec 2020", "Interview Descriptions": "Was contacted by a staffing agency recruiter who setup the interview.  First interview with network manager was supposed to be a zoom video conf but instead called me on the phone 30 min earlier than the scheduled start time and we had an hour long discussion.  Discussed my background and the duties of the position. No technical questions. Second interview was with an engineer/architect who admitted he did not even look at my resume beforehand. Asked me to give him the basic overview of my background. Asked two very basic technical questions. The second interview lasted fifteen minutes.", "Interview Questions": "What does it mean to \"roll the fiber\" to a switch?\n\n"}, {"date": "14 Mar 2021", "title": "Assistant Director of Admissions Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of San Francisco in Nov 2020", "Interview Descriptions": "First round panel phone interview - panel included a student (amazing), and partners from various departments on campus. Questions were heavy on values-based questions and asking about personal approach/philosophy with students. Panelists were open to addressing current climate on the campus.\n\nFinal round included preparing a presentation within their \"virtual\" on-campus interview day. Appreciated their frankness with the salary before the final round.", "Interview Questions": "What is your approach to students in this work? What is your definition of \"X\"? How do you partner with other departments on campus? "}, {"date": "27 Aug 2020", "title": "TEACHERS ASSISTANT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of San Francisco", "Interview Descriptions": "Relatively simple once you build a rapport with a professor; need to just ask if they're looking for TA/RAs for their next semester's class, then you go from there. There are problems with budget cuts even if you have financial aid, so some professors can't offer as many hours as others may.", "Interview Questions": "How many hours are you available for?"}, {"date": "3 Mar 2021", "title": "Designer for Thacher Gallery Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of San Francisco (San Francisco, CA) in Jul 2020", "Interview Descriptions": "Very conversational. The managers I interviewed with were super kind and understanding, and asked about previous design experience through education and work. They asked simple questions, and asked about experience with Adobe CC tools, specifically Illustrator, InDesign, and Photoshop.", "Interview Questions": "What is your experience with Adobe CC?"}, {"date": "23 Mar 2020", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of San Francisco", "Interview Descriptions": "I applied via USF online website, and then had a Phone interview with the hiring manager.  Following the phone interview I came in for a panel in-person interview. The panelists were the hiring manager and members of faculty from the department I was interview for.", "Interview Questions": "What is your past experience that applies to this role?"}, {"date": "23 Oct 2020", "title": "Marketing Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of San Francisco in Feb 2020", "Interview Descriptions": "The interview process has been pretty easy and straightforward, the atmosphere was friendly. You’re mean questions for above my previous experiences and my ability to perform certain tasks. Overall has been a pleasant experience.", "Interview Questions": "How many years of experience do you have in Photoshop. "}, {"date": "18 Mar 2020", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of San Francisco (San Francisco, CA) in Oct 2019", "Interview Descriptions": "I was first contacted via phone by a student assistant who had a few questions, I was happy to answer them all and we had a good conversation that was followed by an email asking me to reply on a mock-up request just to see how I would handle it.\r\n\r\n2 weeks later I was invited for an interview at the office of the school of management", "Interview Questions": "How would you reply to an email from a prospective student?"}, {"date": "9 Aug 2019", "title": "Associate Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of San Francisco (San Francisco, CA) in Aug 2019", "Interview Descriptions": "I had a Zoom interview with the hiring committee which consisted of six people. After the Zoom interview I was invited to interview in person with several small groups. The interviews were a few days apart and well organized. Communication with the host was easy.", "Interview Questions": "Why was I interested in this role and how has my experience prepared me."}, {"date": "19 Jan 2021", "title": "Events Management Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of San Francisco (San Francisco, CA) in Aug 2019", "Interview Descriptions": "The interview is only 1 round and the hiring manager is very warm and easy to talk to. You are not required to have much in experience, you just have to be able to do physical activities on the job.", "Interview Questions": "Are you able to carry heavy objects on the job? "}], [{"date": "14 Jul 2019", "title": "Koret Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of San Francisco", "Interview Descriptions": "Very well.  The interviewer was nice and kind.  Overall, the vibe was nice and chill.  They really seek thoughtful employees who want to contribute to the workforce and say that they belong in this gym.", "Interview Questions": "How do you fit in our company?"}, {"date": "17 Jan 2020", "title": "Grad Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of San Francisco in Jul 2019", "Interview Descriptions": "It was precise. Applied online used a refferal. Got a phone interview and then was called in for an inperson interview. it was 30 minutes and 45 minutes with skill test and some basic screening questions.", "Interview Questions": "Why This job?"}, {"date": "26 Jun 2019", "title": "Program Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of San Francisco", "Interview Descriptions": "Applied , Week later received a phone interview. Phone was one of the weirdest interviews ever. Zero enthusiasm, Rude and Blunt. Cut me off numerous times. Literally sent me the reject email for the position while I was interviewing. I don't know if they needed it hit a quota for interviews or what but one of the most bizarre and unprofessional experiences. Only asked two questions.", "Interview Questions": "Why USF? "}, {"date": "15 Apr 2019", "title": "Event Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at University of San Francisco", "Interview Descriptions": "I was interviewed by the Director of Development at the McCarthy center and then hired the next week. I am in the graduate program which gave me a leg up in the process.", "Interview Questions": "They asked my prior communications and writing experience including examples and samples."}, {"date": "18 Feb 2020", "title": "Funding Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of San Francisco (San Francisco, CA) in Apr 2019", "Interview Descriptions": "A video interview. I was told it would be a phone interview, so I didn't prepare for a video call. This wasn't idea. The person who interviewed me was warm and friendly.", "Interview Questions": "How much money have you raised."}, {"date": "14 Jun 2022", "title": "ITS Student Help Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of San Francisco (San Francisco, CA) in Aug 2018", "Interview Descriptions": "Quick and easy-going. They have a lot of care for students' time and work around your schedule. The interview itself was done by one staff member who mostly assesses your ability to problem solve/ people skills.", "Interview Questions": "Name a time you had to solve a difficult problem with no guidance."}, {"date": "20 Feb 2020", "title": "Front Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of San Francisco (San Francisco, CA) in Mar 2018", "Interview Descriptions": "The process was online, got an email back for a 1:1. he interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates and making a hire", "Interview Questions": "Walk me through your resume"}, {"date": "24 Jun 2021", "title": "Media Services - Student AV Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of San Francisco (San Francisco, CA) in Jan 2018", "Interview Descriptions": "Applied online through campus jobs page. Received a phone call to interview in person a week after applying. Very kind, straightforward interview about experience using video cameras and editing software.", "Interview Questions": "Do you have experience editing on Adobe Premiere?"}, {"date": "3 May 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of San Francisco (San Francisco, CA) in Jan 2018", "Interview Descriptions": "Asked questions and they took notes as I was answering them. There were two interviewers, and we were sitting on a table in a quiet room. The interview was about 30 minutes.", "Interview Questions": "What superhero would you be and why?"}, {"date": "22 Sept 2020", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of San Francisco (San Francisco, CA) in Aug 2017", "Interview Descriptions": "The interview process was fairly easygoing. I submitted my resume and received a call for an intern about 2 weeks later. I was interviewed by 2 current employees and was mainly asked questions about myself, why I wanted to work for them, and what I hope to get out of this job.", "Interview Questions": "Can you tell us about yourself? "}], [{"date": "9 May 2017", "title": "LWC Tutor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of San Francisco (San Francisco, CA) in May 2017", "Interview Descriptions": "Interviewed in office. Asked me a bunch of questions pertaining to tutoring situations and how I would deal with them. Got a job offer a few days later, but then got REVOKED for reasons unspecified!!!! Unbelievable! Do not hire students first then turn back on the job offer without even putting them on the spot!!!", "Interview Questions": "What types of teaching styles are you comfortable with?"}, {"date": "10 May 2017", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of San Francisco in Apr 2017", "Interview Descriptions": "Really wonderful experience interviewing with the school. There were two rounds, met with different panels of administrators and students. They were very thorough with their questions, thoughtful in hire, and was a really good experience.", "Interview Questions": "What was one life experience that changed your way of thinking? "}, {"date": "18 Jan 2017", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of San Francisco", "Interview Descriptions": "I had a brief phone interview and she asked me about why I applied for this job and what made a good fit. She was friendly and it was short.", "Interview Questions": "Do you have customer service experience?  What do you do in a disagreement with a coworker? "}, {"date": "14 Sept 2016", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of San Francisco (San Francisco, CA)", "Interview Descriptions": "This was a support role so interview process was straight forward without any questions meant to trip you up. I met with about 5 people in a group panel setting.", "Interview Questions": "Describe a difficult professional situation and how you dealt with it?"}, {"date": "20 Jun 2016", "title": "Program Assistant IV Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at University of San Francisco (San Francisco, CA)", "Interview Descriptions": "Recruited by external employment agency HR Options for initial interview then phone interview with hiring manager, initially hired as a temp then asked to interview for full-time position with group panel. Basic university admin role questions, first interview with Administrative Director (Hiring Manager) then with panel including the faculty that admin roles support.", "Interview Questions": "The usual university admin questions - about experience supporting faculty, student services and university policies, etc. Discussed computer proficiencies, time management skills, attention to detail, etc."}, {"date": "4 Nov 2016", "title": "Graduate Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of San Francisco (San Francisco, CA) in Nov 2015", "Interview Descriptions": "Guy who worked there before and was about to leave introduced me to the chair of Admission office. Also I worked as a Volunteer - Graduate Student Ambassador so they already knew me. \r\nIt was only one interview on campus, friendly talk, we shake hands and start document process.", "Interview Questions": "Why do you want to work with us?"}, {"date": "5 Nov 2015", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at University of San Francisco (San Francisco, CA) in Mar 2015", "Interview Descriptions": "Casual but professional. This may be due to the fact that it was a posting for internal candidates only. The whole process was fairly smooth. The initial email contact by the program assistant was not received so that delayed the process just a little bit. Overall, it was a straight forward interview process.", "Interview Questions": "What can you bring to the department?"}, {"date": "8 Dec 2017", "title": "Operations Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of San Francisco (San Francisco, CA) in Feb 2015", "Interview Descriptions": "Send resume and cover letter with school schedule. Received an email back to set a 1 on 1 appointment with first manager. Then after 1st round another manager another day.", "Interview Questions": "Why do you want to work here?"}, {"date": "24 Aug 2014", "title": "Residence Hall Front Desk Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of San Francisco", "Interview Descriptions": "The application process was simple. It is on the Residence Life website; just be wary of deadlines. Beyond that, you were scheduled an interview with one of the Residence Life managers and he/she asks pretty basic questions such as: 1. How would you handle a conflict with a resident 2. How would you respond to someone who has a question that you do not know how to answer 3. Name a time you worked well with others 4. What would you do in an emergency, etc.", "Interview Questions": "Name your biggest strength/weakness"}, {"date": "28 Oct 2015", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at University of San Francisco (San Francisco, CA) in Aug 2014", "Interview Descriptions": "I met with the two people I would eventually be working for. We had more of a casual conversation more than anything else. They looked at my previous projects and had those to reference during my interview, which was nice. There weren't many stereotypical interview questions, I think they just wanted to see if I was someone they could work with.", "Interview Questions": "What is your schedule like?"}], [{"date": "6 Aug 2015", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of San Francisco (San Francisco, CA) in Jul 2014", "Interview Descriptions": "It was very smooth, the person who interviewed me over the phone was knowledgeable not only about the data construction but also the management an analysis, which was surprising for the first conversation. When I met in person with the manager (future manager) the questions were more applied and touch on personality/work style points.", "Interview Questions": "Most questions were about my skills constructing and managing datasets"}, {"date": "21 Jul 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at University of San Francisco (San Francisco, CA) in Jun 2014", "Interview Descriptions": "It started off as a quick email to check my schedule because first priority is my availability.\r\nAfterwards was a phone screen. The questions revolved around how dedicated and committed I was, how much I care about helping others and what I was able to offer to help change and improve the class in a beneficial manner. There were some questions about how I felt about the class when I took and how I would have improved it through various fronts.", "Interview Questions": "What skills do you bring to the table that will help you in this position?"}, {"date": "9 Nov 2015", "title": "Online Course Designer Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of San Francisco (San Francisco, CA) in Mar 2014", "Interview Descriptions": "I had a phone-screening first. They asked me many questions regarding my experience with educational technology. The interview was average in difficulty, and the interviewers were very friendly. Then, I was asked to have a one-on-one interview in the office. It was pretty laid back.", "Interview Questions": "What is your experience with video-making?"}, {"date": "17 Jan 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of San Francisco", "Interview Descriptions": "My professor asked me to choose either RA or TA, and I chose RA. That's all.", "Interview Questions": "Not at all. "}, {"date": "15 Jan 2014", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at University of San Francisco (San Francisco, CA)", "Interview Descriptions": "I met my supervisor at a local volunteer organization (we were both volunteers). She found out I had a masters, and that was it. There wasn't really an interview per se (though she did speak with someone I had worked under as an intern).", "Interview Questions": "N/A"}, {"date": "27 Feb 2014", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at University of San Francisco in Jan 2014", "Interview Descriptions": "Appllied online. Heard back over 2 months later to arrange initial 1 hour phone interview with hiring manager, who seemed very pleasant and friendly in emails. On phone interview, she did a lot of the talking and her questions seemed to be read off a template list. She didn't seem to be listening well my amswers, as she often would follow up to a respons asking the same exact thing I just discussed in detial with examples (not sure if that was intentional to throw me off, but it didn't seem very professional, specially since her background was in Career Consulting). So I didnt feel the first interview went great, but I felt I handled myself well and was articulate. But I didnt think I would move forward in the interview process, instead I was asked to come in for what was intended to be a 1/2 hour interview meeting with each staff member individually...The interview started with a tour of the department (nice touch, which put me at ease)...then all my interviews lasted an hour each (so 3 hours total) and included me showing them my professional portfolio (in which they seemed quite impressed), some interesting scenarios and also a sense of humor. I got a good feeling from all of them, but again didn't feel the hiring manager was a great listener. But overall, it went well and they told me about next steps to meet upper management, so I thought I would hear from them soon. I immediately followed up with each staff member individually with very thoughtfull thank you emails detailing our discussions, to which not even one of them replied...I found this awkward and off-putting considering what seemed to be a strong interview, to not even send a quick reply...I know university hiring processes can be slow, so I waited 3 weeks after not hearing back to confirm my interest, let them know I had another potential offer and needed to respond within a week and politely asked for a status update...a week later and still nothing. I just find it very unprofessional, not in standing with the university's mission and misleading, specially when you are working in Student Services where you need to be responsive and are not allowed to just ignore emails...but it's better to see what kind of people you're dealing with before hand and realize that first impressions are not always sincere.", "Interview Questions": "How would you guide an international student to package him/herself against US students applying for the same positions?"}, {"date": "27 Sept 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of San Francisco (San Francisco, CA) in Jan 2014", "Interview Descriptions": "Initial phone interview, then in person. It was the usual behavioral questions followed by technical ones. The interviewer was friendly and engaging. The questions were fair. The interview style was conversational.", "Interview Questions": "Why do you want this job?\r\nWhat are your long term goals?"}, {"date": "21 Aug 2014", "title": "Student Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of San Francisco in Jul 2013", "Interview Descriptions": "The interview questions were like: 1. Why you apply for this job? 2. If your coworker cannot finish his or her job, how will you help him or her? 3. If you don't know how to do the work assigned from  your supervisor, what would you do?", "Interview Questions": "The questions were not difficult. It's all about your personality."}, {"date": "24 Apr 2013", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of San Francisco", "Interview Descriptions": "Student Assistant for ITS, Just asked some common questions", "Interview Questions": "what will you do when you have different opinions with your manager"}, {"date": "4 Sept 2015", "title": "Cafe Cashier Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of San Francisco (San Francisco, CA) in Apr 2013", "Interview Descriptions": "very easy and simple, ask you if you can do work on specific day, we had an interview in recruiter's office, he just briefly talked about what work needed to be done for a cashier", "Interview Questions": "Have you had this kind of job before ?"}], [{"date": "24 Dec 2015", "title": "E-communications Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of San Francisco in Mar 2013", "Interview Descriptions": "One of the quickest interview processes I've been through. I had a phone interview, a week later a Skype interview, then I was asked to fly to SF to formally accept the job offer. The hiring manager was very pleasant and was genuinely curious about who I was and what skills I could offer the position. My Skype panel interview was with three staffers, all of which I ended up working very closely with. They asked very direct questions that covered the everyday aspects of the job, including the emotional overwhelm that happens (which I appreciated).", "Interview Questions": "How would my skills apply to the position?"}, {"date": "18 Oct 2012", "title": "Office Assistant VIII-Academic & Enrollment Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of San Francisco (San Francisco, CA) in Oct 2012", "Interview Descriptions": "I applied online and 3 weeks later got called in for an interview.  The job I applied for was very different from the job I was interviewed for. \r\n\r\nThe job posting didn't even contain the word billing yet I was being interviewed as a billing specialist.  So basically be prepared to go over every part of your experience because you will have no idea why they picked you. \r\n\r\nThe interview consisted of three people asking different questions. Some related to the job some not. They  said they would get back to me by next week, then I got an e-mail shortly after I got home saying they were not interested. \r\n\r\nI still would like the job that was posted and I applied for but I'm guessing that job never existed.", "Interview Questions": "N/A"}, {"date": "17 Apr 2015", "title": "FST Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of San Francisco (San Francisco, NM) in Apr 2012", "Interview Descriptions": "easy and simple, asked me a few questions about leadership and that was it. It was a one on one meeting with the residence hall director. everyone on the staff is really nice. job is fun because you are out and about on campus interacting with people. It is the ideal job for a busy college student with limited time. Shifts are only 3 hours.", "Interview Questions": "What roles does a good leader portray?"}, {"date": "27 Jan 2011", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at University of San Francisco (San Francisco, CA) in Oct 2009", "Interview Descriptions": "It was very efficient and easy. With schedule matched up, job description given. I got the job right away. After a few weeks of training, I can basically just work on my own", "Interview Questions": "Brief talk about previous experience"}, {"date": "19 Mar 2013", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of San Francisco in May 2009", "Interview Descriptions": "I was hired after a very basic interview with the head of the department.  He had a great deal of freedom in hiring and because we already knew each other, there was really little question of whether I would be hired or not.  The interview mainly consisted of going over my graduate school experience and the focus of my grad school work.  Then there were questions about how comfortable I was teaching the basic classes that would be available to me.", "Interview Questions": "The hardest questions were about dealing with difficult students and pedagogy."}, {"date": "29 Apr 2009", "title": "Gym Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of San Francisco in Jan 2009", "Interview Descriptions": "They take you in for a one on one interview, and ask you the typical interview questions. Why do you think you are qualified for this position? What past jobs/education have you had that prepared you for this position? Very laid back and easy going interview, took one session and got hired immediately.", "Interview Questions": "What jobs/education qualify you for this position?"}]]