[[{"date": "5 Feb 2022", "title": "Registration Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Saint Francis Medical Center", "Interview Descriptions": "Two interviews were conducted, one with my direct supervisor and the other with the head of registration. Very thorough and informative!! All of my questions were answered with ease! Negotiable on pay as well.", "Interview Questions": "Why did I choose Saint Francis?"}, {"date": "4 Nov 2020", "title": "Human Resources Development Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Saint Francis Medical Center (Cape Girardeau, MO) in Oct 2020", "Interview Descriptions": "Whole process took maybe two weeks total from the time I applied to when I was rejected. Spoke on the phone with the HR director, she asked me about myself but didn't really seem that interested in my actual responses and what I had to say. She called me late and then took up most of the time talking about what she wants to do in the medical center rather than how I could fit into it.  When I told her how I constructed employee review processes, she already shut down toward me because I did it the traditional way (which is, to be fair, the only way to get measurable/reliable  results).  We probably would have been a horrible fit anyway.", "Interview Questions": "Tell me about yourself; asked about my experience doing certain tasks and my methodology"}, {"date": "27 Jan 2021", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Saint Francis Medical Center (Lynwood, CA) in Jan 2020", "Interview Descriptions": "Very simple interview process. I had to answer a few basic questions and that's it. The interviewer was nice, and got back to me quickly. I would recommend applying! Even if you don't have a ton of medical experience, they are still very comprehensive.", "Interview Questions": "Do you have any questions for us"}, {"date": "15 Jun 2020", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Saint Francis Medical Center (Lynwood, CA) in Dec 2019", "Interview Descriptions": "Applied and received phone call from HR in about one month. Was interviewed by unit assistant director and director.  Recruiter was really helpful whenever I had questions during the hiring process.", "Interview Questions": "Describe goals."}, {"date": "2 Dec 2019", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Saint Francis Medical Center (Cape Girardeau, MO) in Mar 2019", "Interview Descriptions": "The interview was routine and uneventful. I spoke with a member of HR about pay and benefits before speaking at some length with the director of the department to which I applied. Though there were two open positions for which I qualified, neither was offered to me. To my knowledge, neither position was filled in the immediate future.", "Interview Questions": "Why are you applying here?"}, {"date": "3 Mar 2019", "title": "EMR Trainer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Saint Francis Medical Center in Feb 2019", "Interview Descriptions": "Applied, called that day to talk about the position and setup interview. Interviewed and they told me they would be making a decision quickly. Knew within a week of interviewing the results.", "Interview Questions": "How would you handle someone who was a distraction during training?"}, {"date": "18 Mar 2017", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Saint Francis Medical Center (Cape Girardeau, MO) in Feb 2017", "Interview Descriptions": "It was a short interview with hiring manager and COO.  They failed to ask good questions that would highlight their needs and behaviors sought.  Poor interview skills.  I could not gather what they wanted in the candidate.  I am not sure they knew.", "Interview Questions": "what services does your current organization provide?"}, {"date": "13 May 2016", "title": "Graphic Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Saint Francis Medical Center (Cape Girardeau, MO) in Feb 2016", "Interview Descriptions": "The interview itself was pretty massive. The first part was a basic interview with HR asking the standard \"where do you see yourself\" kind of questions. Immediately after that I was interview by the department head I was applying for and that one was much meatier and specific. The whole thing took about 1.5-2 hours but everyone was nice and it felt professional but not too intense.", "Interview Questions": "What is your greatest weakness"}, {"date": "7 Nov 2016", "title": "Communications Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Saint Francis Medical Center in Apr 2015", "Interview Descriptions": "I met with someone in H.R. and we went over the standard interview questions. Then I met with the manager, assistant manager, and another coworker from the department where they explained more in detail of what the job was and asked me questions about how I would perform. I was then shown the office area where I would be working to make sure I would be comfortable in this department.", "Interview Questions": "What is one thing you could improve on?"}, {"date": "1 Feb 2016", "title": "Registered Nurse, Critical Care Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Saint Francis Medical Center (Cape Girardeau, MO) in Jan 2014", "Interview Descriptions": "It was kind of difficult but, the overall experience was great. I talked with the director of the department as well as another registered nurse. As long as you have the credentials and some experience the process should not be too hard. It helps to have a positive attitude and report with the medical center, but it is not essential.", "Interview Questions": "What was your previous experience like?"}], [{"date": "27 Dec 2015", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Saint Francis Medical Center (Cape Girardeau, MO) in Jul 2012", "Interview Descriptions": "I felt like I was interviewing the officer that interviewed me. False promises were made on schedules. Claimed to work every other month and holiday. Spoke with other officers and this is not the case. They also commented that the already small department can never stay staffed.", "Interview Questions": "I was asked if I was an introvert or an extrovert. Other than that it was 45 minutes of them telling me what kind of work to expect in the position. Dealing with things from patient and family fights to assisting in moving and releasing the expired patients."}]]