[[{"date": "20 Jul 2023", "title": "Apprentice Guide Dog Mobility Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Guide Dogs for the Blind Association", "Interview Descriptions": "Completed an application online and got invited to the interview with two senior members of the organization. The process was relaxed and friendly. Was asked questions based on their behaviours.", "Interview Questions": "Give an example of a task that went wrong. What would you change/do differently next time?"}, {"date": "28 Jun 2023", "title": "Dog Well-being Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Guide Dogs for the Blind Association (Cardiff, Wales) in May 2023", "Interview Descriptions": "Very quick process from application. First interview conducted was a meeting based interview over zoom with two managers. The managers would ask questions in turn based on their behaviours. This interview was fast paced due to them running late (10 mins) with technical difficulties. You have around 4 minutes to answer per question with 7 questions in total. The interview felt less relaxed than the others I have done with them. They mentioned at the start that they are looking for exact and certain answers only which unfortunately added so much pressure. The managers seemed nice of course and gave time to think about answers.", "Interview Questions": "All questions were based off of their 6 behaviours."}, {"date": "29 Mar 2023", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Guide Dogs for the Blind Association (Reading, England)", "Interview Descriptions": "The whole process was very professional. It was a 2 stage process: The first was a behavioural interview and for the second, I had to give a presentation. I received feedback promptly", "Interview Questions": "To provide an example of a particular challenge I had faced"}, {"date": "11 Feb 2023", "title": "Puppy Development Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Guide Dogs for the Blind Association", "Interview Descriptions": "There was initially a competency based interview on Zoom. I was asked around 6 questions. This was then followed by a written exam which included watching a video and assessing the training that was displayed.", "Interview Questions": "What is your experience with Safeguarding"}, {"date": "7 Oct 2022", "title": "Digital Producer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Guide Dogs for the Blind Association (Reading, England) in Jul 2022", "Interview Descriptions": "The Interview was a 3 part process. \r\n\r\n1. First round was face to face in the office with a panel of three members.  It went on for 45 mins and was a pleasant experience.  There was a question I wasn't sure about and the panel offered to come back to it later if it suited me. But I chose not to and answered the best I could.  A lot of example based questions were asked and situational questions to test your conflict management skills. \r\n\r\n2. The Second round was a task to be completed about the job and I was given 5 days to do it at home. It was to be emailed to the panel before the final round.\r\n\r\n3. The final round was a teams interview with Senior members of the team 2 hiring managers and 1 panel member from the previous round. So I had a familiar face there. This was much informal and more like a chat about what the job was about and a chance to ask any questions I had. \r\n\r\nOverall experience was lovely and I felt heard. While I was asked a lot of questions it didn't feel like I was bombarded with them.", "Interview Questions": "Something along the lines of - How do you create trust in people / stake holders you are working with? \r\n\r\nExamples of when I was asked to change something on my work and how did I handle it?  \r\n\r\nQuestions about my CV and website. \r\n\r\n"}, {"date": "14 Mar 2022", "title": "Puppy Development Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Guide Dogs for the Blind Association (Exeter, England) in Mar 2022", "Interview Descriptions": "Straightforward on zoom , based on the 6 behaviours , thirty minute interview with 6 questions . Areas covered person centred, Positivity, Collaborative, Teamwork , Safeguarding , problem solving . Opportunity to clarify questions , very relaxed .", "Interview Questions": "They asked for an example of problem solving "}, {"date": "9 Nov 2021", "title": "Guide Dog Trainer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Guide Dogs for the Blind Association", "Interview Descriptions": "CV and covering letter upload, video call interview and video clip submission of a training activity.  The final stage was a full day assessment centre with practical activities, interview and group activities.", "Interview Questions": "They asked about the key guide dog behaviours and questions around putting yourself in other people's shoes."}, {"date": "31 Oct 2021", "title": "Puppy Development Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Guide Dogs for the Blind Association (London, England) in Oct 2021", "Interview Descriptions": "Online form, followed by interview invitation to a 3 hour in person interview. \r\nConsisted of a face to face interview, a 50 minute dog handling assessment and a 50 minute written assessment.", "Interview Questions": "Emphasis was placed on experience with volunteers, so there were multiple questions around this topic. "}, {"date": "22 Jun 2021", "title": "Puppy Development Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at The Guide Dogs for the Blind Association", "Interview Descriptions": "online interviews via zoom due to COVID. initial phone call,  zoom interview with questions then written assessment, practical assessment over zoom and then another practical assessment in centre.", "Interview Questions": "What skills can you offer? "}, {"date": "10 May 2021", "title": "Dog Wellbeing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at The Guide Dogs for the Blind Association", "Interview Descriptions": "2 interviews and a written assessment then a practical assessment with 2 people. Nice and informal the managers that interviewed was really nice. You 30 minutes for written assessment on a scenario given.", "Interview Questions": "How would someone describe you as a person.\r\nName a time when a situation didn’t go as expected and what did you do to change it next time. \r\n"}], [{"date": "30 Jan 2021", "title": "Dog Wellbeing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Guide Dogs for the Blind Association (London, England) in Jan 2021", "Interview Descriptions": "2 stages of interviews. \nFirst stage was a zoom interview with 2 managers.\nI found out by the end of the week that I was successful to stage two.\n\nSecond stage involves a physical assessment interview in the center. I haven't done this one yet.\n\nSo far there has been no questions on Guide Dogs themselves and more about the candidate as a worker in case study based questions.\n\n\nI accepted the offer for the next stage! :)", "Interview Questions": "Tell us a time you went the extra mile"}, {"date": "4 Sept 2020", "title": "Trainee Guide Dog Mobility Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Guide Dogs for the Blind Association in Aug 2020", "Interview Descriptions": "Online application, short phone interview before a full day of 3 x 1.5 hour assessments via Zoom (longer interview, microteach assessment and guide dog owner conversation) followed by a practical dog training assessment.", "Interview Questions": "Why do you want to apply for this job?\r\n"}, {"date": "13 Jan 2021", "title": "Access Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Guide Dogs for the Blind Association (London, England) in Feb 2020", "Interview Descriptions": "An incredibly informative, accessible and speedy interview process.  It was clear from the outset who would be in the interview, the length. At the start, they both explained how the interview would be structured and what roles each person would have.  They were accommodating if I need time to think about my answer. They were happy to answer questions, going overtime a little to help me understand.  It was only one round and they offered me the role the next day.", "Interview Questions": "What would you do if someone came to you with an issue where the person was not being safeguarded?"}, {"date": "16 Feb 2022", "title": "Operations Support Coordinator I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Guide Dogs for the Blind Association (Bristol, England) in Sept 2019", "Interview Descriptions": "A classic interview with two panel members, followed by an administrative (Excel and printing a spreadsheet, including formatting) and situational (formulating a response to a difficult letter) test exercise. This was a one-step process and I was offered the job the following day.", "Interview Questions": "Asked about my experience and my priorities. Very much based on their PEOPLE ethos, and whether my traits matched that."}, {"date": "5 Jun 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Guide Dogs for the Blind Association", "Interview Descriptions": "Professional, efficient, straightforward.  Whole process took approx 3 weeks from application to taking position.  Was with the line manager and their Director.  Presentation and set questions.  Opportunity to ask questions at the end.  Fairly relaxed and friendly atmosphere.", "Interview Questions": "N/A"}, {"date": "6 Oct 2022", "title": "Kennel Assistance Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Guide Dogs for the Blind Association (Redbridge, England) in Nov 2018", "Interview Descriptions": "Had to know lots about the company, was asked a lot of questions about the company history. very basic questions- how do you manage situations, name a situation you took the lead etc.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "6 Nov 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at The Guide Dogs for the Blind Association (Belfast, Northern Ireland) in Jul 2018", "Interview Descriptions": "organized through my university for an internship with guide dogs. Submitted an application, met my supervisor and was given a research post for a few months. very straightforward to complete overall.", "Interview Questions": "Why I wanted to work for them."}, {"date": "24 Jan 2018", "title": "Business Support Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Guide Dogs for the Blind Association", "Interview Descriptions": "An interview & assessment of replying to an email & completing a speadsheet. It was a good interview experience and although I wasn't offered the role I would still re-apply in future.", "Interview Questions": "Nothing unexpected"}, {"date": "14 Aug 2017", "title": "Dog Care and Welfare Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at The Guide Dogs for the Blind Association", "Interview Descriptions": "Online application process. I received an automated thank you, we've got your application and we'll let you know asap if you're through to the next stage. Then I heard nothing for two weeks. I eventually called the HR department who said I should have received an email saying I had been unsuccessful and promising to send me a copy via email the next day. The email never arrived.  Considering they require candidates to complete a very comprehensive and time consuming questionnaire this lack of follow-up is very poor.", "Interview Questions": "All job experience including overview statement, timeline and salary\r\nExperience of dogs\r\nUnderstanding and identification of illnesses"}, {"date": "21 Feb 2018", "title": "Street Fundraiser Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Guide Dogs for the Blind Association (Bristol, England) in Jun 2017", "Interview Descriptions": "Was met up in a café, it was a \"Casual Interview\" two people, one the region manager and the other a team leader. Asked basic Questions, and informed me of the company.", "Interview Questions": "What makes you good for this role?"}], [{"date": "29 Apr 2017", "title": "Dog Care and Welfare Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at The Guide Dogs for the Blind Association", "Interview Descriptions": "After the written application there was an interview. This was a three stage process involving written questions, an oral interview by 2 members of staff then a practical part involving an examination of a guide dog.", "Interview Questions": "What type of personality type do you find challenging to work with?"}, {"date": "3 Apr 2018", "title": "Tele Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at The Guide Dogs for the Blind Association (Reading, England) in Apr 2017", "Interview Descriptions": "Very easy. Applied through a recruiter. 15/20 minute phone interview.  Very basic questions. Experience, what I know about the company etc. Came in for a training day after that with a couple of other people- was very easy, one person didn't pass because they were slightly argumentative.", "Interview Questions": "How have you provided exceptional customer service in the past? example? "}, {"date": "18 Aug 2017", "title": "Charity Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Guide Dogs for the Blind Association (London, England) in Jun 2016", "Interview Descriptions": "Very casual interview at Starbucks. Interviewer seemed warm and didn't ask any difficult questions; no curve balls. Applied for a summer job, so interviewer asked me about what I did at university and why I was interested in working for Guide Dogs for the Blind", "Interview Questions": "Why are you interested in this role?"}, {"date": "11 Mar 2016", "title": "My Guide Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Guide Dogs for the Blind Association (Winnersh, England) in Mar 2016", "Interview Descriptions": "Online application form plus CV and cover letter, brief telephone interview and group assessment day. The assessment day had a group exercise focusing on communication, a guiding exercise and a one-to-one interview. The day ran between 9.30-2.30 with a fair amount of waiting around. All the staff members were very approachable and friendly.", "Interview Questions": "What is your knowledge of safeguarding and how would you treat a safeguarding issue in the workplace"}, {"date": "9 May 2016", "title": "Marketing Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Guide Dogs for the Blind Association (Reading, England) in Mar 2016", "Interview Descriptions": "Competency interview, involved written test and face to face interview. All interviewers were very nice. \r\n\r\nI was offered the short term position which I couldn't unfortunately take. I was promised feedback but I had never heard anything since this was promised.", "Interview Questions": "Why do you want to work here?"}, {"date": "6 Apr 2016", "title": "Digital Marketing Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Guide Dogs for the Blind Association in Jan 2016", "Interview Descriptions": "2 team members conducted the interview, all competency based questions. The interview was formal.  Competency based questions related to digital marketing and measurement of campaigns, particularly google adwords.  The role was a job share although this wasn't included in the job advert or description.  The initial online application process was very dated.  The interview was conducted at their pleasant Burghfield headquarters.", "Interview Questions": "What do you understand by the term mobile armageddon?"}, {"date": "28 Mar 2015", "title": "Community Fundraiser Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Guide Dogs for the Blind Association (Shrewsbury, England) in Jan 2015", "Interview Descriptions": "Panel and competency based interview. Interview was helpful and a very positive experience. They took the time to explain what the role entailed, how it fitted in with the rest of the team, and how an average week would pan out. They had put a lot of thought into helping a candidate get a feel for whether they would want to work with them. They then took turns asking questions. Unfortunately this was my first interview for several years and I don't think I did a very good job of explaining what I am capable of so, unsurprisingly, I didn't get the post. However, the interview process made me feel I would have liked to work with them.", "Interview Questions": "How do you inspire volunteers?"}]]