[[{"date": "13 Mar 2023", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Pomona College", "Interview Descriptions": "It was a casual rather than a formal interview. In fact, interview went longer than planned. It eventually became a conversation where we talk about specific ways I could contribute.", "Interview Questions": "What is special about you?"}, {"date": "10 Jan 2023", "title": "Assistant VP Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pomona College (Pomona, CA) in Jan 2023", "Interview Descriptions": "Very thorough, organized interview. VP was very professional and honest about my experience and the qualifications of the job. have peers that work here and enjoy the work very much. Great benefits. Time off could be better. Would have loved to work here!", "Interview Questions": "Where do you see yourself in 5 years."}, {"date": "24 Oct 2022", "title": "Assistant Athletics Director, Operations & Events Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pomona College", "Interview Descriptions": "A phone call was given to establish the time of the first interview with the Executive Athletic Director, Sports Information Coordinator, and Coaching staff. The first interview was given through zoom and after followed up with a virtual interview through SparkHire.", "Interview Questions": "How have you dealt with a difficult situation?"}, {"date": "1 Oct 2022", "title": "Sr Management Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Pomona College (Los Angeles, CA)", "Interview Descriptions": "Heard within a reasonable amount of time after applying, was invited for an interview and did not proceed to a second interview. Process was fine, we both realized over the course of the conversation that we were not a fit. This is a sign of a good interview - it goes both ways.", "Interview Questions": "Tell me about your experience."}, {"date": "24 Mar 2022", "title": "Peer Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pomona College", "Interview Descriptions": "Very great environment! Felt extremely welcomed and comfortable. There was one staff member and a current Peer Advisor that interviewed me. Communication was phenomenal, they were incredibly responsive to all my emails, questions, and concerns.", "Interview Questions": "Can you please tell me about yourself? "}, {"date": "2 Feb 2022", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pomona College (Claremont, CA)", "Interview Descriptions": "Had a full day of interviews via zoom from 8:15 -2:45.  Met with various stakeholders my position interacts with: staff, students, search committee, deans.  I had 8 separate Zoom session with some breaks in between.  I was told the interview usually happens on campus but due to COVID they have been online.", "Interview Questions": "Seeing that you have a background working at large research universities,  why do you want to work at a small, liberal arts college?"}, {"date": "12 Nov 2021", "title": "Project Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pomona College", "Interview Descriptions": "Very thorough process involving stakeholders from across the organization and partner institutions. Half day interview typically includes a lunch and social time. Beginning with meeting the leadership team, and then moving on to meetings with other groups, each interview window lasts no more than one hour, depending on who you are meeting with.", "Interview Questions": "What questions do you have about this position?"}, {"date": "15 Jun 2022", "title": "Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Pomona College (Los Angeles, CA) in Oct 2021", "Interview Descriptions": "The process was well-organized and easy to navigate. The hiring manager provided background information to review in preparation for the next level of interview. Everyone I encountered was professional, friendly, and respectful.", "Interview Questions": "They asked about previous positions and experience."}, {"date": "3 Jan 2022", "title": "Assistant Manager of Coop Store Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Pomona College (Claremont, CA) in Sept 2021", "Interview Descriptions": "Felt rather free form. The other managers and head manager sat in a circle with me and asked career related questions such as how to handle particular conflicts and why this job.", "Interview Questions": "How would you handle an upset customer? How would you handle conflict between clerks?"}, {"date": "10 Sept 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Pomona College", "Interview Descriptions": "Basically comes down to knowing the right people and being confident, well-researched, and sure of your abilities. Pomona is a a good school and working here is part of the work-study program, so the application process is not complicated or strenuous", "Interview Questions": "What is one challenge you have faced? "}], [{"date": "3 Nov 2020", "title": "Director, Annual Giving Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Pomona College in Jul 2020", "Interview Descriptions": "The interview process was extensive and extremely drawn out for a Director level position. It was posted in July and that's when I had my first interview with the head of the department via Zoom. Great initial convo and clear direction for the department. \r\n\r\nOne of the clear problems with this interview process was the lack of communication. Several weeks would go by with no response to emails, then you'd hear from them with another round of interviews scheduled, followed by 3 more weeks of silence. This went on from July - November.\r\n\r\nIn total, I had 8 interviews in a 4 month time span for this position.  3 interviews with the head. 3 group interviews and 2 single interviews. All an hour each via zoom.\r\n\r\nAnother off-putting thing was I heard from a former colleague that the head of the department had cold called one of my old jobs asking for candid feedback, but from someone who was not employed there when I was. Had this person asked, I would have been happy to provide my previous supervisors information. \r\n\r\nLastly, after being told by the head that they'd be making their decision on a Monday, that Wednesday I received an email from Pomona HR asking for my references. This was the first time HR was ever involved in the entire 4 month process. Again, complete silence after they were completed for 2 more weeks, only to find out I did not get the position. \r\n\r\nTo summarize, they have a huge communication problem and their hiring process needs to be severely reviewed. HR should be included much earlier in the process. Do not string along multiple candidates for several months in the middle of a pandemic.", "Interview Questions": "Tell me where you see yourself in 5 years. \r\nWhat does diversity and inclusion mean to you?"}, {"date": "2 Mar 2019", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Pomona College", "Interview Descriptions": "Very casual, conversational setting. Some generic questions and you can take it to the direction you want to. Make sure to be prepared about your interest in Project Management and some anecdotes of where you demonstrated your PM skills.", "Interview Questions": "Why are you interested in Project Management?"}, {"date": "28 Oct 2019", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Pomona College (Claremont, CA) in Sept 2018", "Interview Descriptions": "The hiring manager spoke to me about my background , major, etc.  She then explained the kinds of work they did in the office, the schedule, events, etc., as well as the kinds of work I would be doing (answering phones and ad hoc tasks).", "Interview Questions": "Why are you interested in this position? "}, {"date": "9 Jun 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Pomona College", "Interview Descriptions": "Very easy hiring process. As long as you have work study, you will get an on campus student worker job. You just walk up to the supervisor of the position and ask if they are hiring.", "Interview Questions": "Are you on work study?"}, {"date": "26 Jun 2018", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Pomona College (Claremont, CA) in Feb 2017", "Interview Descriptions": "It was a lengthy for an entry level position.  I spent a half an hour one-on-one with each staff member and then final group interview.  I wasn't aware of the length of time and wasn't fully prepared to do so.", "Interview Questions": "What can you contribute to our office?"}, {"date": "2 Dec 2015", "title": "Business Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Pomona College (Claremont, CA)", "Interview Descriptions": "Pretty simple process. Interview with the director of the store and the other student managers. They each took turns asking the applicant questions about their experiences at the store. Applicants are given different possible scenarios and asked how they would respond/react to them.", "Interview Questions": "What will you do to improve the store?"}, {"date": "28 Nov 2016", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Pomona College (Claremont, CA) in Aug 2014", "Interview Descriptions": "They emailed me a time to schedule the interview and I drove to the college to meet with my interviewer; who would late be my boss. It was very calm, almost conversation-like and very low pressure.", "Interview Questions": "How long had I been working at my previous job."}, {"date": "13 Jan 2014", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Pomona College", "Interview Descriptions": "There was no interview process. You apply through professors, and generally if you have taken the class before, you have a higher chance of getting the job. \r\nFor Computer Science, there is a application that has to be filled out. It is often difficult to fill out as it is given earlier in the previous semester when schedules are not yet finalized, but giving a ballpark estimation of your schedule should be fine", "Interview Questions": "No Questions!"}, {"date": "17 May 2013", "title": "Gallery Attendant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Pomona College", "Interview Descriptions": "There was, to my recollection, very little of an interview process. The job of which that was previously mentioned was recommended by an acquaintance, also in attendance of the college, that also happened to work at the before mentioned place of employment. The interview, as best I can recall, was short and to the point.", "Interview Questions": "No difficult questions"}, {"date": "10 Dec 2015", "title": "Student Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Pomona College (Claremont, CA) in Oct 2012", "Interview Descriptions": "* Interview with Student Supervisor (unfortunately, there's no training for the interviewers, making these somewhat nebulous)\r\n* Interview with Matt Walker (if you get this, you're very, very likely to receive the position)\r\n\r\nUnfortunately lag time between steps is significant.", "Interview Questions": "Why do you want to work at ITS?"}], [{"date": "16 Oct 2015", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Pomona College (Claremont, CA) in Jan 2011", "Interview Descriptions": "Long, but well worth it. They have great benefits and the staff in HR and through the campus are truly some of the best in the world. Truly living up to the #1 ranking!", "Interview Questions": "Tell us about yourself?"}]]