[[{"date": "10 Feb 2020", "title": "Area Sales Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at LifeStream Blood Bank (San Bernardino, CA) in Dec 2019", "Interview Descriptions": "Interview was very  thorough. Recruiter asked a lot of questions.  Mostly behavioral based.  Used situations that required problem solving and excellent customer services.  Sales experience is desired and good driving record.", "Interview Questions": "Tell me about a time that you had to resolve a problem at your previous place of employment?"}, {"date": "27 Sept 2018", "title": "Hst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at LifeStream Blood Bank (La Quinta, CA) in Sept 2018", "Interview Descriptions": "I applied on the LifeStream website and a recruiter called me. She asked me preliminary questions and then sent me two personality type assessment tests. She then scheduled an in person interview with the supervisor at the La Quinta location.", "Interview Questions": "Describe a time you had difficulty with a manager. "}, {"date": "16 Nov 2017", "title": "Donor Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at LifeStream Blood Bank", "Interview Descriptions": "Got a call about the position then had a phone interview. They called back to schedule an in person interview with a manager who was really nice and at the end of it I was told they would call within a week about a decision. Thought all went well but haven't heard back.", "Interview Questions": "How would you handle workplace drama?"}, {"date": "28 Nov 2017", "title": "Area Sales Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at LifeStream Blood Bank (San Bernardino, CA) in Feb 2017", "Interview Descriptions": "Applied using indeed, got a call from the HR person. Had an interview via phone call then was invited in for a interview with manager and District mgr. was called later that week with the offer from HR", "Interview Questions": "“Tell me about a time when” type questions"}, {"date": "27 Jan 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at LifeStream Blood Bank (San Bernardino, CA)", "Interview Descriptions": "Was contacted within a couple of days by the staff recruiter.  She conducted a brief phone interview of about 5 questions: Explain your prior three jobs, why Lifestream?, Where do you see yourself in 5 years?, Is the starting salary X acceptable to you?\r\n\r\nThe second step was an in-person interview conducted by two fellow team members (one from HR the other a manager).  Both were very friendly and made me feel comfortable enough to take the time I needed to answer their questions.  The whole process lasted about 45 minutes- this included time after to answer my questions and discuss the job position in more detail- about 12 to 15 questions total.\r\n\r\nThe third and final step was another interview with a mobile manager.  This was less of an \"interview\" and more of a clarification of what my job duties would be day to day and what to expect as far as scheduling.  I was offered a position immediately after.", "Interview Questions": "If we called a prior employer how would he/she describe your work ethic?"}, {"date": "19 Dec 2016", "title": "HR Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at LifeStream Blood Bank (New York, NY)", "Interview Descriptions": "Met with 2 people, interview was pretty standard in terms of what questions were asked. I tend to get very nervous during interviews, but they were both nice and helped put me at ease.", "Interview Questions": "Name a time that you went above and beyond the call of duty in your job. "}, {"date": "14 Jan 2017", "title": "HR Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at LifeStream Blood Bank (San Bernardino, CA) in Dec 2016", "Interview Descriptions": "Applied online and got a call the next day to schedule a phone interview for the following day. After the phone interview I was given appointment for a formal interview (panel with two head HR women) they asked several questions and said they would let everyone who was interviewing know by Friday is they would be chosen for the second face to face interview. Needless to say, nobody ever called, they said someone would call regardless if your moving forward or not to let you know.", "Interview Questions": "What would you do if you were told you had to finish an important assignment by the end of the day but you knew it was impossible."}, {"date": "12 Jan 2017", "title": "Mobile Phlebotomist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at LifeStream Blood Bank (San Bernardino, CA) in Dec 2016", "Interview Descriptions": "Applied online, got a phone interview, then person interview. Everything went well so I thought. No call back yet, it's been 2 weeks, and no one has called me back in reference to if they chose someone for the position yet", "Interview Questions": "What makes you a good candidate for this position, what do you expect from your supervisor, give an example of a scenario you had with Conflict at your previous supervisor, General basic questions"}, {"date": "2 Mar 2016", "title": "Employee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at LifeStream Blood Bank (San Bernardino, CA) in Feb 2016", "Interview Descriptions": "I was called by HR for an over-the-phone interview. After the over-the-phone interview, I was invited to do an in-person interview. It went well. The person interviewing me is my new supervisor. I'm glad I got along with them because it made the interview fun.", "Interview Questions": "What would your former employer say about your work ethic?"}, {"date": "1 Apr 2016", "title": "Employee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at LifeStream Blood Bank (San Bernardino, CA) in Feb 2016", "Interview Descriptions": "Applied online, and got a call back for a phone screen in about 2 days. Went in for a face to face, and then a second interview. Whole process took approximately 3 weeks.", "Interview Questions": "Describe a time when you had a disagreement with a supervisor and how did you handle it?"}], [{"date": "21 Mar 2017", "title": "Donor Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at LifeStream Blood Bank (San Bernardino, CA) in Oct 2015", "Interview Descriptions": "The interview I had was supposed to be held with all 3 managers and someone from HR, I interviewed with only one manager, some questions were about my skill set, some on availability, most were on how I would handle work place drama.", "Interview Questions": "If you had an issue with a fellow staff member would you gossip about them, talk to them to resolve the issue, head to management to discuss issue, or go to HR?"}, {"date": "22 Aug 2015", "title": "Mobile Supervisor, RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at LifeStream Blood Bank (San Bernardino, CA) in Sept 2014", "Interview Descriptions": "Panel interview, Interview was with two of the mobile managers who would be my direct supervisors, as well as the collections manager. It was a friendly interview, all managers participated in asking questions. Managers allowed me to ask questions, and were very honest about the answers. Hired on the spot.", "Interview Questions": "How do you handle conflict?"}, {"date": "28 May 2015", "title": "Donor Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at LifeStream Blood Bank (San Bernardino, CA) in Aug 2013", "Interview Descriptions": "Brief phone interview with HR, was called back weeks later, and after over a week of phone tag was invited to do a personal interview with managers. Went back for a second panel interview.", "Interview Questions": "Can you describe a situation when you disagreed with your supervisor and what did you do?"}, {"date": "7 Sept 2012", "title": "Manager, Donor Operations Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at LifeStream Blood Bank (San Bernardino, CA) in Apr 2011", "Interview Descriptions": "Was contacted by a very friendly screener, who apparently was a staffer working on behalf of someone on vacation. She progressed me to the panel interview. \r\n\r\nThe office complex is nice - appeared new - and the receptionist was friendly.Three-person panel; the primary person arrived more than 15 minutes late and the other two persons as much as ten minutes later. Nothing extraordinary in terms of the questions; they were basic. What was extraordinary, however, was that near the end of the interview one of the panel raters (who was the least friendly from the start) literally glared at me for nearly a minute.\r\n\r\nInitially, I waited for him to comment. He did not, so I broke my visual engagement and glanced at the other two people to see if they noticed - but they were apparently unaware, writing commentary. I looked back...the intense staring had continued. I am uncertain as to whether this was some sort of tactic, but after thinking \"Hmm...hostile...\" I tuned my focus to the other two persons. The glarer never looked me in the eye again. He had been introduced as ex-military, hence, that is the only thing to which I can attribute his actions. Even as I shook hands when departing, that gentleman did not look me in the eye.\r\n\r\nOdd, and my most unique interviewing experience to this day. The process was slow. The HR contact never issued any type of pre- or post-interview communication and did not appreciate follow-up. I did manage to extract the response that they decided to fill the post internally. There appears to be considerable turnover because I noted the same position posted again within four months and several months later. \r\n\r\nI believe it was a blessing in disguise not to have been hired. Unfortunate, because I thought the work as described was very attractive.", "Interview Questions": "Questions were basic and primarily behaviorally-based."}, {"date": "3 Aug 2015", "title": "Donor Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at LifeStream Blood Bank (San Bernardino, CA) in Mar 2011", "Interview Descriptions": "After applying online, a representative from the agency called me in for an interview about a week later.  I was interviewed 1:1.  It was a very comfortable atmosphere.  I was asked about 10 questions. The interviewer said that they would be in touch.  I received a call for me to go sign the papers for my background check and was given an appointment for my drug test and physical. I started as soon as everything had cleared which was less than 2 weeks.", "Interview Questions": "Why would I be a great fit for the agency."}]]