[[{"date": "30 Jun 2023", "title": "Technology Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wentworth Institute of Technology (Boston, MA)", "Interview Descriptions": "Good process quick, people are very nice and they hired quickly. Good work while during school and taking college classes for first jobs. Good process quick, people are very nice and they hired quickly. Good work while during school and taking college classes for first jobs.", "Interview Questions": "What technologies do you work with"}, {"date": "23 Jun 2023", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wentworth Institute of Technology (Boston, MA)", "Interview Descriptions": "Very Straightforward nothing out of the ordinary. I was asked about my competency with 3D printing and other manufacturing processes that I was comfortable with. They told me that I would be a great candidate since I had plenty of experience before.", "Interview Questions": "How much experience do you have with additive manufacturing?"}, {"date": "21 Mar 2023", "title": "Help Desk Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wentworth Institute of Technology", "Interview Descriptions": "Easy, not really professional as they are hiring students that may not have any experience prior. Great team to work with and constantly changing due to semesters. Great place to learn if you haven’t dived into information technology too much.", "Interview Questions": "What are some things you want to learn"}, {"date": "9 Aug 2022", "title": "Director of Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Wentworth Institute of Technology", "Interview Descriptions": "I was contacted on LinkedIn by an internal recruiter and had a phone screening with them before interviewing with the hiring manager. He was very excited to be building out the marketing team and we seemed to share a lot of strategic thinking in common. Finally I met the team and they were great. They seemed to be genuinely engaged and answered all of my questions.\n\nFrom there I was told that I would be informed if I had got the role with a few weeks. Nothing. I reached out them to confirm and was told that they had pushed this back a few more weeks (at this point I’m aware I haven’t got it). Again, no actual confirmation until I contacted them a final time. At this point I got a copy and paste email about them going with someone else.\n\nJust tell the truth to people who put hours of time into the interview process.", "Interview Questions": "Mainly around how to bring their outdated marketing techniques into the digital age and make an impact on the market."}, {"date": "1 Aug 2022", "title": "Associate Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wentworth Institute of Technology (Boston, MA) in Jun 2022", "Interview Descriptions": "I was contacted about 5-mo after applying to schedule an interview with the committee.  I met with the group via Zoom and all seemed great with the meeting. A few weeks more past and I was told on a Monday that they wanted me to have an all day interview with several administrators and fellow educators, then a student panel. On the next day, I would have to create a 30-min lecture and then give a 30-min lecture to students via Zoom. Everything seemed to go very well and I even received a small applause from a couple of students.  It has been about 6-weeks since and I have not heard anything from anyone. I believe the term is ghosting, and now they have reissued the position. I was excited to go through the process, but underwhelmed with the lack of professionalism with the college. Poor communication and not professional.", "Interview Questions": "What would you like to teach and would you not like to teach?"}, {"date": "19 Feb 2022", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wentworth Institute of Technology (Boston, MA) in Jan 2022", "Interview Descriptions": "It was smooth and amicable. The search committee made me feel comfortable. I was able to showcase myself naturally without having the fear of rejection. All in all, the interview conducted was superb.", "Interview Questions": "Why are you applying to Wentworth?"}, {"date": "3 Apr 2022", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wentworth Institute of Technology (Boston, MA) in Jan 2022", "Interview Descriptions": "Phone interview was 30 minutes. They asked me all the typical questions for a faculty position: why would I pick this particular college, how would I do research with a limited budget, what is my approach to teaching, how would I contribute to diversity, equity and inclusion, etc.", "Interview Questions": "They asked me what kind of classes I could imagine teaching. Also, what was my biggest success in teaching and why I am proud of it."}, {"date": "22 Aug 2021", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wentworth Institute of Technology in Aug 2021", "Interview Descriptions": "First round was a 30-minute zoom call with the search committee. The second (and final) round was a 4 hour zoom call with various campus partners and committee members. I received a call the next day from the hiring manager, asking to check my references.", "Interview Questions": "Describe how you have demonstrated commitment to DEI"}, {"date": "7 Sept 2021", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wentworth Institute of Technology in Jul 2021", "Interview Descriptions": "This was a very transparent process. They did an initial zoom, typical screen call, but then when you move on they provide a list of questions to prepare for of which they ask a handful. It helped for things to go smoothly.", "Interview Questions": "What is one time you encountered a program challenge and what you did to resolve it?"}, {"date": "3 Mar 2021", "title": "Embedded Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wentworth Institute of Technology", "Interview Descriptions": "ok good I enjoyed it, not many difficulties.\nVery easy and straight forward, very ok ok ok ok o k ok\nI liked it very much and cannot complain at all\nasked me technical questions and I provided answers to them, based on classes I tutor", "Interview Questions": "what is your strenght and desire"}], [{"date": "27 Apr 2020", "title": "Department Chair Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wentworth Institute of Technology", "Interview Descriptions": "Communication prior to the interview was very efficient. The accommodated my concerns while scheduling it.  Interview process was smooth and someone was always available to  help with thechncal/logistical issues.", "Interview Questions": "Past experience in similar roles?"}, {"date": "3 May 2023", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Wentworth Institute of Technology (Boston, MA) in Aug 2019", "Interview Descriptions": "Most roles are hired using a committee who reviews resumes using a matrix that objectively looks at the candidates qualifications against the job description. Phone screens are the starting point, then an interview (in person is preferable) which often has the candidate meeting with numerous constituents in a variety of meetings.", "Interview Questions": "How can you make a positive impact in this role?"}, {"date": "14 Jun 2018", "title": "Associate Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Wentworth Institute of Technology (Boston, MA) in Mar 2018", "Interview Descriptions": "Full day interview.  Met faculty/staff.  Short 30 min interviews, couldn't really get a feel for the people or institution.\r\n\r\nNew department is not organized well, they have too many \"bosses\" and no clear direction.  They couldn't get students to show up to scheduled interview times.  Referred to their own students as \"good, but not great\".  What an insult to the students.", "Interview Questions": "Typical faculty search questions.  What research do you want to do, what classes can you teach."}, {"date": "29 Jul 2022", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Wentworth Institute of Technology (Boston, MA) in Jan 2018", "Interview Descriptions": "The interview consisted of sitting down with the dean of the department I was interviewing for. We reviewed my past work as an architect and talked about the vision for the school's curriculum.", "Interview Questions": "What are you most passionate about teaching in architecture?"}, {"date": "26 May 2017", "title": "Visiting Assistant Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wentworth Institute of Technology", "Interview Descriptions": "Taught a mock class in front of panel based on the subjects I was interviewing for. Tried to show how I would engage students in a real classroom, how grading would be, activities and homework policies.", "Interview Questions": "How would you get students engaged?"}, {"date": "14 Jul 2017", "title": "Technical Support Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Wentworth Institute of Technology (Boston, MA) in May 2017", "Interview Descriptions": "Apply by email, and got called in for the interview. The process did not take more than a week to get the offer. The offer then be sent over email with a schedule of work.", "Interview Questions": "Tell us about the previous work experience"}, {"date": "15 Oct 2017", "title": "Academic Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Wentworth Institute of Technology (Boston, MA) in Jan 2017", "Interview Descriptions": "I was not interviewed initially, but was hired through an agency (Professional Staffing Group) on a temp to perm basis. After 3 months, I was able to transition to permanent status. I had to submit a cover letter and resume, but the department chair was happy to hire me based on my work so far. Then I had an interview with HR about my expectations and goals for a career at Wentworth, which focused around my strengths and weaknesses, the areas of the job I liked the most and where I saw myself in 5 years.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "17 Mar 2016", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Wentworth Institute of Technology (Boston, MA) in Oct 2014", "Interview Descriptions": "My interviewer was very friendly and nice. It was a very simple interview for work study. It was pretty much a guaranteed job if you fit in the schedule. The interview did not last that long either, it was a short 5-10 minute interview. Overall, it was simple, easy and to the point.", "Interview Questions": "Did you have any technical experience in dealing with electronic devices before?"}, {"date": "14 Oct 2016", "title": "Circulation Desk Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Wentworth Institute of Technology (Boston, MA) in Sept 2014", "Interview Descriptions": "The first time I did the interview, it was easy going. My interview was like how many applicants hope for, a conversation that feels less one-sided. The second time I did the interview, the library was re-done and the new boss wanted to get to know the work-study workers. Same thing. Easy going. Light. Either I'm good at interviews or I just talk too much (probably the latter), but in the end, the interview wasn't too serious.", "Interview Questions": "Q: Why do you want to work here? \r\nQ: Do you have any outside jobs that we should know about?"}, {"date": "14 May 2015", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wentworth Institute of Technology (Boston, MA) in Jul 2014", "Interview Descriptions": "Online application. Phone interview with two people from department. In person interview with two Human Resources personnel. In person interview with Director of Library and a senior Library. Tour and introductions to all staff members, which was also part of the interview. The opinions of these co-workers factored into the decision-making process. Overall an average process.", "Interview Questions": "Do you have experience with course reserves?"}], [{"date": "6 Feb 2014", "title": "Admissions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Wentworth Institute of Technology in Aug 2013", "Interview Descriptions": "Applied for a position through WIT's online application process, which was fairly standard in that regard.  Eventually was approached for a phone interview via email.  However after replying to the email about the scheduled interview appointment time I did not receive a replied confirmation until the day before the day before the actual interview (i.e. I was given several dates and times that were available and after my selection I was not notified until just before that we would be speaking at the one I had chosen).  This may just be a pet peeve of mine, as they did contact me and I was given my chosen time slot, but  was sitting on pins and needles leading up to that.  \r\n\r\nThe interview itself was standard and average in most respects, with nothing out of the ordinary with regard to this position.\r\n\r\nAfter the completion of the interview we discussed the schedule for the process.  I was told a time frame, I believe it was to be within two weeks, that I would be informed if I was to move on or not.  Two weeks came and went without a word.  After the third week I emailed the person I interviewed with, but I heard no reply for over another week.  Eventually I received a standard \"Sorry, but...\" email from a different administrator.\r\n\r\nIt is very easy to send out a \"No\" to someone if they are not in the running, either by yourself or have the automatic system do it for you (even easier), instead of wasting everyone's time not replying to inquiries.  Simple as that.", "Interview Questions": "Nothing unusual or particularly difficult was asked outside of typical admissions interview questions."}, {"date": "9 Apr 2014", "title": "Assistant Professor - Computer Science Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Wentworth Institute of Technology (Boston, MA) in Jul 2012", "Interview Descriptions": "Expect a rigorous phone interview with management and HR. Except a sample lecture to a class. Have names of three references available, all will be called and rigorously questioned before an offer. Expect to meet the rest of the faculty members and have a lengthy campus tour. Look interested and amazed.", "Interview Questions": "Why are you leaving your current job? "}, {"date": "21 Jan 2012", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Wentworth Institute of Technology (Boston, MA) in Oct 2010", "Interview Descriptions": "I was first interviewed  by phone with a hiring manager in Human Resources.  After this initial screening, I went on campus for a multi-part interview.  First, with the person on the phone, next with the senior officer in the department and finally with the manager I would report to.  I felt the interview with the senior manager went very well and she all but made the offer official in our chat.  The manager that I would report to was luke warm.  I did not get to interview with colleagues in the department or campus partners.  I did, on a subsequent visit, meet with the one subordinate staff member reporting to the position I applied.  The information given was positive and reflected very well on the Institution.  However, in looking back, the information was not accurate or truthful for the position after the initial Human Resource meeting.  The office environment was cold, not welcoming.  The space was quiet and not conducive to collegial partnerships.  Those were first impressions.", "Interview Questions": "What was my experience with this type of industry specific institution; tell my story, etc"}, {"date": "24 Apr 2010", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wentworth Institute of Technology (Boston, MA) in Aug 2009", "Interview Descriptions": "I was interviewed by a former department head.  This person looked at my resume and hired me on the spot.  Seemed as if they were desperate for people.", "Interview Questions": "There are no questions that stand out in my mind per se.  "}]]