[[{"date": "29 Jun 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Excela Health", "Interview Descriptions": "One on one with manager and asked questions about value brought to the team, preparedness for the position, and interest in company role. Fairly quick, fair interviewing process.. overall great experience", "Interview Questions": "How did you handle a negative patient experience"}, {"date": "15 May 2023", "title": "Practice Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Excela Health (Latrobe, PA)", "Interview Descriptions": "First round interview via phone w HR Second round interview in person with team Third round panel interview with docs and sr leadership included They then call in follow up with offer", "Interview Questions": "General healthcare and leadership questions"}, {"date": "9 Oct 2022", "title": "Appointment Setter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Excela Health (Greensburg, PA)", "Interview Descriptions": "Took a long time to hear back between stages of interviews. Did well on phone interview (according to the woman I spoke with) but then had to take some test on the computer (from home). Was expecting a typing test, but instead it was some sort of personality test. Not one of the scenarios in that test related in anyway to the job that I was applying for. After the test, I received an email saying that I was not a candidate. I think an in person interview would be a much better judge of wether or not someone should be considered. Excella Health has a ton of job openings, and it's no wonder. They are dismissing good people based off of a take at hone computer test that doesn't even relate to the job.", "Interview Questions": "What customer experience did I have"}, {"date": "21 Sept 2022", "title": "Payroll Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Excela Health", "Interview Descriptions": "Interview went great, interviewer was vey nice, the position just wasn't for me.  I never heard back from the company which was ok.   I think this is standard these days.", "Interview Questions": "What would make you an asset here?"}, {"date": "25 Mar 2022", "title": "Customer Service Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Excela Health", "Interview Descriptions": "Two over the phone interviews and I was offered the job. Low stress and not too long of a process. Everyone I spoke to was very nice and helpful and informative. They were quick to offer me the job", "Interview Questions": "How do You handle dealing with difficult coworkers?\r\nWhy do you want this job?\r\n"}, {"date": "7 Jan 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Excela Health", "Interview Descriptions": "The interview process was overall well. They made me feel comfortable and asked reasonable questions. I was an internal transfer and they made the transfer very easy. Wage is competitive too.", "Interview Questions": "Describe a hard situation in the workplace and how you managed it. "}, {"date": "20 Jan 2022", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Excela Health (North Huntingdon, PA) in Jan 2022", "Interview Descriptions": "Great experience from start to finish. Got the job offer within 20 minutes of leaving the interview. Professional, welcoming, and very positive environment. Cannot wait to start my new career!", "Interview Questions": "What job or position have you had that you liked the most, and what job or position did you like the least; and why?\r\n\r\nExplain a time when you had to deal with a very rude or unruly customer, client, or patient; and how did you handle the situation?\r\n\r\nExplain a time when you had a disagreement with a coworker and how you handled the situation?"}, {"date": "22 Oct 2021", "title": "Data Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Excela Health", "Interview Descriptions": "This consisted of a panel interview that lasted about 45 minutes. There were various questions about experience, hardships, and solutions. \r\n\r\nThe role was described with daily activities, as well as the work streams that would be worked with.", "Interview Questions": "Difficulties in previous work experiences"}, {"date": "11 Feb 2021", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Excela Health (Latrobe, PA)", "Interview Descriptions": "Very simple, short, looking for disciplined and punctual individuals. Interviewer was very straightforward and offered a job right away. Didn’t speak to coworkers until after interview. Overall very pleasant. Would apply again,", "Interview Questions": "Strengths and weaknesses? How well do you in know this hospital?"}, {"date": "22 Jan 2021", "title": "Patient Safety Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Excela Health", "Interview Descriptions": "The first interview was in person, about 30 minutes in length; this one was more general and it seemed as if the main point was trying to know me as a person. Then another interview was conducted in person with more job specific questions and a different interviewer.", "Interview Questions": "What leadership roles/situations have you experienced?"}], [{"date": "19 Feb 2020", "title": "Talent Acquisition Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Excela Health in Feb 2020", "Interview Descriptions": "Quick feedback time, answered a lot of questions, clear understanding of job description, knowledgeable of role, interviewer was able to answer any questions I had, did  not mention salary on phone", "Interview Questions": "Why are you looking to work with Excela"}, {"date": "7 Jan 2019", "title": "Tech Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Excela Health (Greensburg, PA) in Dec 2018", "Interview Descriptions": "Met with w people. Both were informative and kind. They told me what would be expected of me and what training I would need. They gave me an opportunity to set up a job shadowing.", "Interview Questions": "Asked about my experience and how I'd deal w conflict "}, {"date": "11 Oct 2018", "title": "Technologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Excela Health", "Interview Descriptions": "Talked to HR, manager and tech in the lab. In the one on one with the tech part, they probably ruled hiring me out already when they asked things like do you have kids and other more personal questions that I thought were not allowed.", "Interview Questions": "Did you ever have a problem with a physician?"}, {"date": "16 Nov 2020", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Excela Health in Aug 2018", "Interview Descriptions": "My experience was great! I followed up after my interview and got immediate response. The employment office was very friendly. They kept me in the loop throughout the entire interview process.", "Interview Questions": "Tell us about a difficult situation you had in the work place and how you overcame. "}, {"date": "11 Jul 2018", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Excela Health", "Interview Descriptions": "Recruiter gave me a call to come in for a interview.  On interview day was interview by Human Resources one person.  Next Day was called in for 2nd interview this time with  department manager.  Very informative  and gave description of the job position and requirements.", "Interview Questions": "Tell me a time when you dealt with a difficult person how did you handle it?"}, {"date": "4 Feb 2019", "title": "Supply Chain Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Excela Health (Greensburg, PA) in Apr 2018", "Interview Descriptions": "Pretty brief and straightforward. Director of Supply Chain and HR employee for thirty minutes. About ten questions, nothing too difficult. I would not stress too much over it. Not a stressful interview.", "Interview Questions": "What makes you ready for this job?"}, {"date": "14 Feb 2018", "title": "Behavioral Health Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Excela Health (Greensburg, PA)", "Interview Descriptions": "Applied online, received a phone call in three days to fill out a self evaluation.  Received an invite to interview for the position by an appointment setter. Met with HR talent acquisition specialist and the hiring manager (the process took 2-hours). Very positive experience. They were so nice. Then a day later I was invited to shadow in the Crisis Center.  The supervisor and the other therapist were super nice. They had other people to consider. The following week they called to negotiate my salary and check my references. They then called and offered me the job. All total it took about a month from interview to job offer.", "Interview Questions": "Tell me a time when you were faced with a difficult task and excelled. (Paraphrased)"}, {"date": "2 Jun 2016", "title": "Patient Coordinator/Front Desk Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Excela Health", "Interview Descriptions": "Interviewed at several locations for this position, not exactly sure what the issues where that i didn't get hired, however, i will take that as a blessing in disguise. I had to fanangle missing work to go these interviews. Complete waste of time! The employment center and it's staff has alot to be desired. Rude people to say the least. Need people who are a little more professional in personality. In an interview in Ligonier, the two supervisors pretty much talked amongst themselves. Total waste of my time and aggervation trying to get permission to arrive at work a little late.", "Interview Questions": "What is it you currentley do."}, {"date": "15 Jul 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Excela Health (Greensburg, PA) in Jun 2015", "Interview Descriptions": "Pretty standard job interview with HR.  The same went with interviewing with the department manager.  HR was not willing to negotiate any salary or benefits.  In my opinion, I don't want to work for a company that is not willing to negotiate anything.  I was going to decline their benefits because my spouse already has a better option and they would not give better pay for declining.  The salary for starting all starting new nurses is about $23.", "Interview Questions": "Name a time you had to work with a difficult person and how did you over come that?"}, {"date": "18 Nov 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Excela Health in Jan 2015", "Interview Descriptions": "Apply online. Got a call from HR a week later to schedule interview. Met with the HR hirer for first interview. Next met with the unit manager at hospital. Then shadowed on unit.", "Interview Questions": "Why did you apply for this position?\r\nTell me about a patient whom really stuck out to you during your experiences & why did they?\r\nWhat are your job duties now, explain your current position.\r\nTell me about a unhappy customer & how you handled the situation.\r\n"}], [{"date": "7 Mar 2014", "title": "Ancilliary Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Excela Health", "Interview Descriptions": "Delayed contact between submitting resume and initial contact for interview. Total process from submission to job offer over 1 month.  Three part interview with HR, department manager and peer interview taking a majority of the day.  HR most concerned with availability,  credentials and anticipated salary.  Make sure you have a firm value in mind.", "Interview Questions": "Name an experience with a difficult co-worker and how you handled it."}, {"date": "13 Feb 2014", "title": "Non Clinical Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Excela Health", "Interview Descriptions": "Interviews are a joke.  The process drags on forever (over a month).  Management doesn't want to hire anyone that could be a threat to their job in the future.  Questions did not help to see if the candidate was a good fit.  Managers need more training in interviewing skills.", "Interview Questions": "N/A"}, {"date": "1 Aug 2013", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Excela Health", "Interview Descriptions": "initial contact and scheduling of interview with dept manager was through a human resource representative.  interview was with the department manager and a clinical coordinator. it felt somewhat awkward because i believe the coordinator had been in the department longer so had a better feel for how things really work: self-scheduling and how many hours and shifts are required, for example.  the manager was coming off more restrictive and i could tell the coordinator was trying to be a buffer through out the interview.", "Interview Questions": "there was not one particular difficult question.  it was disappointing because it focused more on personality than skills and experience.  for example, \"name a situation where you were a good listener and how it affected the situation.\""}, {"date": "17 Jun 2015", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Excela Health (Greensburg, PA) in Feb 2013", "Interview Descriptions": "I applied online.  I had a phone interview with the hiring manager.  Weeks later I had an in person interview with the team.  Then it took over a month to hear back about whether I got the job or not.", "Interview Questions": "Are you good at Excel?"}, {"date": "14 Jan 2016", "title": "Technical Partner Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Excela Health (Greensburg, PA) in Oct 2012", "Interview Descriptions": "It was a two phase interview. First with HR then with the Department Nurse Manager. I tried to negotiate starting pay based on my experience and was told. The starting pay is what it is, take it or leave it.", "Interview Questions": "What is my greatest strength?"}, {"date": "14 Oct 2015", "title": "RN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Excela Health (Greensburg, PA) in Mar 2012", "Interview Descriptions": "The interview was very intense, be prepared! they ask alot of the same questions you would think in a normal interview, but it is a two part interview. they have you come in and talk to the HR rep, then they have you report to the floor and job shadow for an hour or two.", "Interview Questions": "Why did I want to work for them"}, {"date": "4 Apr 2012", "title": "Escort Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Excela Health (Greensburg, PA) in Jun 2011", "Interview Descriptions": "I applied online for the escort position and was called within one week.  One week later, I interviewed with the human resources manager and my department lead.  I was hired on the same day.  Just look nice, be professional, and smile.", "Interview Questions": "N/A"}, {"date": "30 Aug 2010", "title": "Systems Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Excela Health (Greensburg, PA) in Mar 2010", "Interview Descriptions": "Interviewed with Human Resources first, was very informative.  Then interviewed with Manager which was very informative about the position applied for.  Listened to all my qualifications and was very informative of equipment and processes that Excela Health was using.  Unfortunately was looking for specific experience.", "Interview Questions": "Explain an experience in your previous employment that showcases your abilities?"}]]