[[{"date": "16 May 2023", "title": "Policy Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Society of St. Vincent de Paul", "Interview Descriptions": "Was relaxed and enjoyable. Involved STAR questions. Focused on capacity to immediately contribute to role and previous experience in the role's requirements. Emphasis on bringing a strong current skillset as opposed to capacity to develop, with this pretty common in non-for-profit/charity organisations with limited resources. Both interviewers were kind and attentive.", "Interview Questions": "Name a previous policy project you worked on"}, {"date": "27 Aug 2022", "title": "Business Office Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Society of St. Vincent de Paul (Phoenix, AZ)", "Interview Descriptions": "1st interview was standard. 2nd interview was weird - the lady doing the hiring for her office decided that the other ladies should have a group interview with me. They were very negative and even asked questions regarding my religion and a lot of personal questions. Since one of my duties would be to create the newsletter they send out to their volunteers and donors I brought a few samples that I had created at a previous job. They told me that they look awful and that I didn't know what I was doing (2 years of design would tell me differently, but what ever old ladies.) Turned out their newsletters were 20+ pages, double spaced, literal cut and paste photocopied single side pages. and my professional looking newsletter was a mess. LOL", "Interview Questions": "What religion are you / are you catholic?"}, {"date": "13 May 2022", "title": "Digital Marketing Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Society of St. Vincent de Paul", "Interview Descriptions": "The interview was decent,  it was a panel interview and lasted about an hour. One of the interviewers didn't make it who was critical for data analysis questions. Asked about previous experience, why this role and general questions about how I would handle certain situations.", "Interview Questions": "How would you maintain security of data you were working with?. "}, {"date": "15 Feb 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Society of St. Vincent de Paul", "Interview Descriptions": "Very easy process, super relaxed but engaging, everyone was really positive and lovely, they need volunteers so are happy to work around your schedule. General questions as work is volunteer", "Interview Questions": "Why do you want to work with us?"}, {"date": "12 Apr 2022", "title": "Case Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Society of St. Vincent de Paul (Tampa, FL) in Feb 2022", "Interview Descriptions": "Brief and quick. She seemed to be constantly distracted and really didn't seem to be interested in an interview with anyone.  Very disorganized and lacked structure. There didn't seem to be any real process of interviewing.  Very random unorganized question that you would expect from an interview at a fast food place from a teenage manager", "Interview Questions": "How i felt about working homeless people"}, {"date": "9 Mar 2021", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Society of St. Vincent de Paul", "Interview Descriptions": "Overall exactly what you’d expect  from an assistant manager interview. I also had another meeting with the DM. Was not stressful at all. Wanted to know specific answers to certain scenarios.", "Interview Questions": "My customer service experience pretty much "}, {"date": "13 Aug 2018", "title": "Volunteer Retail Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Society of St. Vincent de Paul (Melbourne) in Mar 2018", "Interview Descriptions": "Got a call from store manager next day after applying. went for interview. was asked 2-3 generic questions.  like how did u hear about this. why would you like to join. was given the application form after that.", "Interview Questions": "Why do you want to work here"}, {"date": "2 Mar 2020", "title": "Disaster Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Society of St. Vincent de Paul (Baton Rouge, LA) in Mar 2018", "Interview Descriptions": "Submit resume.  Receive phone interview.  Schedule appointment for face-to-face interview.  Review date and location to begin employment.  Arrived for 1st day of employment.  Completed hiring documentation for employment and health insurance.  Assigned to a supervisor, cubicle work area, laptop and work phone.", "Interview Questions": "How long have I been participating in disaster case management."}, {"date": "23 Feb 2021", "title": "Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Society of St. Vincent de Paul in Nov 2017", "Interview Descriptions": "Quite a fast and easy process. Just had to hand in my CV into my local shop and got called back for an interview after a few days and very easy questions", "Interview Questions": "Why do you want to work here?"}, {"date": "10 Jan 2017", "title": "Retail Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Society of St. Vincent de Paul (Perth, Western Australia) in Dec 2016", "Interview Descriptions": "First one interview with the manager and the one working in the role, then second interview with social enterprises. Professional but relaxed. They ask questions about you and a lot about your previous roles. Good if you have previous knowledge about the company.", "Interview Questions": "What do you know about the company?\r\nWhat changes have you done in previous roles?\r\nMotivate your attributes"}], [{"date": "23 Aug 2016", "title": "Store Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Society of St. Vincent de Paul (Enniskillen, Northern Ireland)", "Interview Descriptions": "I applied via CV which i handed in at the shop.  I was then invited for an interview at the Westville Hotel.  I was then selected to do a second selection process.  I had to dress the mannequin for window display and explain my reasons why i choose that particular outfit and accessorize.  I then had to sort out quality from quantity garments.  Quantity were send for recycling. The quality was priced, put on hangers, steam cleaned and then put on the shop floor.  I then had to answer questions related to the selection i made and why.  The second part of the interview was specific to my job duties that was expected from me.  I received a phone call later that day informing me that i was the successful candidate.", "Interview Questions": "To rate the value of an item and then to price it."}, {"date": "6 Jul 2016", "title": "Thriftstore Floor Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Society of St. Vincent de Paul", "Interview Descriptions": "I filled out an online application to volunteer at the thrift store. After they reviewed my online application, I had a phone interview to know me better and to explain volunteer expectations.  The Interview was with a very kind woman. I was able to work as a volunteer at the store very soon after the application and interview.", "Interview Questions": "Why do you want to volunteer at St. Vincent DePaul."}, {"date": "31 Mar 2017", "title": "Retail Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Society of St. Vincent de Paul (Phoenix, AZ) in Mar 2016", "Interview Descriptions": "Interview was relaxed and easy. They did not go into detail about previous experience.  They care more about telling you about protecting their assets which are donations.  Most of items donated are priced too high.", "Interview Questions": "What are your weaknesses and strengths."}, {"date": "14 Aug 2015", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Society of St. Vincent de Paul (Saint Louis, MO) in May 2014", "Interview Descriptions": "very brief, 1 or 2 members of management, It was very casual, Usually meet with the store manager & assistant manager. Store manager cold shouldered and assistant manger happy and friendly, assistant store manager asks majority of questions. They talk more about what you will be doing and if you can perform those things then they actually ask you personal questions.", "Interview Questions": "what is your available schedule and do you have open availability?  "}, {"date": "31 May 2016", "title": "Food Service Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Society of St. Vincent de Paul (La Jolla, CA) in Jan 2014", "Interview Descriptions": "was interviewed at various restaurants in San Diego, California that open two new restaurants every day with Chipotle Mexican Grill in San Diego County, California. I have experience a food service worker at St. Vincent de Paul for nine months in 2014 and 2015. I enjoyed the interviews at various restaurants in San Diego County, California for employment.", "Interview Questions": "What do I like about Chipotle Mexican Grill in San Diego, California.  I love their huge size burritos that can be served in a bowl instead of a tortilla if the huge burrito is too big to eat."}, {"date": "13 Nov 2013", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Society of St. Vincent de Paul (Waunakee, WI) in Sept 2013", "Interview Descriptions": "Interview was a couple stages but nothing over complicated and I felt like they really listed to what I was looking for to make sure I was the right fit for them and vice versa.", "Interview Questions": "What is your biggest weakness?"}, {"date": "8 Nov 2015", "title": "Store Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Society of St. Vincent de Paul (Dallas, TX) in Jul 2013", "Interview Descriptions": "Background and why do you want to work here questions how can you incorporate your prior experience to this job. What are your five to ten year goals? How long do you plan on having this job, would you like to open up another store  do you have inventory experience", "Interview Questions": "Why do you want to work here"}, {"date": "3 Jun 2015", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Society of St. Vincent de Paul (Madison, WI) in Jul 2011", "Interview Descriptions": "One-on-one interview with the store manager. Approximately 40 minutes outlining the details of the job, the mission of the company, and opportunities for growth. The company posts openings internally and likes to promote from within. There was an eye on growth potential in the interview. Questions were pretty straightforward with a few psychological interview questions as well.", "Interview Questions": "Where do you see yourself in 5 years?"}]]