[[{"date": "4 Jan 2023", "title": "Public Relations Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at SCORE", "Interview Descriptions": "Pretty standard interview over Zoom. They ask about your background, analytics, and what you would contribute. Be prepared to come up with a strategy on the spot for one of their audiences.", "Interview Questions": "Be prepared to talk about analytics and develop a strategy on the spot."}, {"date": "24 Jun 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at SCORE", "Interview Descriptions": "Thorough, professional and friendly. Met with HR first and had to complete a writing / editing timed test, then direct supervisor, then team, then finally a follow up to answer any questions I had.  All conducted by Zoom. Each time the interview started on time and was very smooth.", "Interview Questions": "What would you do if an employee that reports to you did not complete assigned work on time? "}, {"date": "18 Jul 2018", "title": "Designer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 6 days. I interviewed at SCORE (Grand Rapids, MI) in Jul 2016", "Interview Descriptions": "Met as a freelancer at a Panera Bread, talked about what was needed and what the job was, then went on to talking me through what SCORE did and what they were trying to accomplish through the brochure.", "Interview Questions": "Are you interested in doing some freelance work for us and designing a brochure and bookmark."}, {"date": "6 Sept 2011", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at SCORE in Jun 2011", "Interview Descriptions": "PHONE INTERVIEW\r\n\r\nstandard interview question i.e describe yourself, your last project, your availability,", "Interview Questions": "describe your last project?"}, {"date": "20 May 2012", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at SCORE in Apr 2011", "Interview Descriptions": "After submitting my cover letter and resume for the position, I was called for an interview with the Director. It was a pretty relaxed interview basically reviewing the duties and responsibilities of the position and discussing how my skills and previous experience would apply. We also discussed how I would react in certain situations that were likely to occur such as being given an assignment that required team collaboration to meet a short deadline or working more than 40 hours in a week to complete a project. The interview lasted about 40 minutes and I heard back from the Director within a week.", "Interview Questions": "Of the responsibilities listed, which do you think will be the most challenging?"}], []]