[[{"date": "1 Sept 2022", "title": "Suicide Prevention Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Didi Hirsch Mental Health Services", "Interview Descriptions": "The interview process considered of a 3 part interview with program coordinator via zoom. The interview included standard interview questions, as well as some role-playing scenarios to work through for crisis line.", "Interview Questions": "What was one time you had conflict with a coworker or supervisor and how did you resolve it?"}, {"date": "30 Aug 2022", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Didi Hirsch Mental Health Services", "Interview Descriptions": "Went well was asked to demonstrate Spanish skills and provide client examples. Was encouraged to ask questions and they were transparent with salary and position expectations. Was offered within a week of interview", "Interview Questions": "What brings you to this work "}, {"date": "7 Jul 2022", "title": "Text Chat Operator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Didi Hirsch Mental Health Services", "Interview Descriptions": "Know thier mission, know the mental health field and process.  Know how to actually help someone in the field, it's not about giving advice or telling someone what to do, it's to listen and guide them to their own conclusion.", "Interview Questions": "Why do you want to be a text/chat operated "}, {"date": "2 Jun 2022", "title": "Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Didi Hirsch Mental Health Services", "Interview Descriptions": "Phone interview with recruiter, video interview team, video interview with team management. Both interview were very long and particular. The longest and most questions I've been asked in an interview process. I noticed everyone was white.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "18 May 2022", "title": "Therapist I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Didi Hirsch Mental Health Services (Los Angeles, CA) in Apr 2022", "Interview Descriptions": "The interview process was straightforward, consisting of three interviews: one with the recruiter, one with the clinical supervisors, and one with the FSP team. I also had to submit 5 references and do a quick assignment of a hypothetical case after the second interview.", "Interview Questions": "How would your coworkers describe you?"}, {"date": "15 Mar 2023", "title": "Bilingual Mental Health Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Didi Hirsch Mental Health Services (Los Angeles, CA) in Feb 2022", "Interview Descriptions": "Recruiter reached out, told me I was what they were looking for and took 1-2 to schedule interview with program director and program assistants both lmft. In the video interview via zoom they focus on your clinical skills and present a vignette to \"test\" you. As you about your future goals and if you're comfortable going to schools as this was for a children's therapist role. Noticed the program assistant didn't know much about msw programs, focused on the clinical skills a bit too much and had some interesting answers and responses. No diversity in the people I spoke to, I also notice not much diversity in upper management etc which is concerning. Ok process but glad I did not get the offer. After what it seemed like they simply didn't like me, I didn't get the job which I am grateful for as lack of diversity seems very concerning.", "Interview Questions": "I'm going to present this vignette, what would you do?"}, {"date": "13 Sept 2021", "title": "Volunteer Crisis Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Didi Hirsch Mental Health Services", "Interview Descriptions": "It was great! Short and sweet. Went through 3 rounds over the phone and virtual (since the pandemic). You go through an intense training period after you are hired so you will be pretty prepared by the time you go live.", "Interview Questions": "They were more practice scenarios. "}, {"date": "16 Mar 2022", "title": "Suicide Hotline Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Didi Hirsch Mental Health Services (Los Angeles, CA) in Aug 2021", "Interview Descriptions": "Easy, personable, and does a practice role play to explore your natural instincts with certain events. You cannot get it wrong instead they show you how see a certain situation through a place that is not judgmental and shows empathy.", "Interview Questions": "Role Played a Scenario - Practice Call - based on the story you get to ask a question about the situation and reflect the emotion back to the \"caller\""}, {"date": "15 Sept 2022", "title": "Therapist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Didi Hirsch Mental Health Services (Los Angeles, CA) in Aug 2021", "Interview Descriptions": "Initially recruiter reaches out then you go through two interviews. One is with the program director and assistant program director. The other is a group interview with a team.  Everyone was kind and questions asked were basic interview questions", "Interview Questions": "How do you stay organized?"}, {"date": "13 Sept 2021", "title": "Special Events/Fundraising Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Didi Hirsch Mental Health Services in Sept 2020", "Interview Descriptions": "Very difficult interview with woman who seemed not to like me before I even spoke to her. Kept asking how I would deal with a difficult colleague who was hard to work with. I could only guess that person was her. I sensed some ageism too.", "Interview Questions": "\"How do you deal with difficult colleagues?\""}], [{"date": "2 Jul 2020", "title": "Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Didi Hirsch Mental Health Services", "Interview Descriptions": "Easy to apply online. Staff asks questions about the various populations they work with, your ability to handle stress and self-care, and your teamwork capabilities. First, you will interview with the program manager and then with the team you may or may not be on.", "Interview Questions": "What is your experience with individuals with borderline personality disorder?"}, {"date": "2 Apr 2020", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Didi Hirsch Mental Health Services (Los Angeles, CA) in Jan 2020", "Interview Descriptions": "After applying online, I received a call a couple of weeks later to ask to schedule an interview. The interview was scheduled for the next week and it was held on site. \nThere were two interviewers, who were both friendly. Asked primarily about my previous experiences.\nNext step was submitting multiple references.", "Interview Questions": "Some strengths and weaknesses"}, {"date": "26 Sept 2019", "title": "MFT Trainee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Didi Hirsch Mental Health Services", "Interview Descriptions": "Interview with potential supervisor and answering more situation-based questions and vignettes. The interview took about 1 hour and was geared towards the crisis residential treatment program and the type of specific situations that might arise and how I would go about it.", "Interview Questions": "Tell me about a time you resolved conflict with a coworker?"}, {"date": "3 Nov 2018", "title": "Therapist I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Didi Hirsch Mental Health Services (Los Angeles, CA)", "Interview Descriptions": "Recruiter set up a Phone interview and passed my information on to clinics with openings. One clinic scheduled a one-on-one in person interview. After the one on one interview, the recruiter called me for a final panel interview. I received a job offer about one week after the panel interview. Offer was non-negotiable.", "Interview Questions": "Can you explain one time that you disagreed with a clinical supervisor and how did you handle it?"}, {"date": "25 Feb 2021", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Didi Hirsch Mental Health Services (Inglewood, CA) in Sept 2018", "Interview Descriptions": "After applying online and submitting a resume: I was invited for a phone screening, followed by an initial in-person interview, then a final in-person interview. I was offered the job about 1 week after the final interview.", "Interview Questions": "Q: Describe a difficult client situation.\nQ:  What is your therapeutic orientation.\nQ: What trainings are you interested in? What trainings have you completed?"}, {"date": "15 Jul 2018", "title": "Trainer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Didi Hirsch Mental Health Services", "Interview Descriptions": "Unprofessional, poor communication and I love how companies don’t put out pay information and when asked dances around claiming not to know. If you advertise for a position it means a requisition was approved and a budget was set in place.", "Interview Questions": "Tell me about yourself and your work experience."}, {"date": "9 Apr 2018", "title": "Bilingual Clinician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Didi Hirsch Mental Health Services", "Interview Descriptions": "I drove an hour in half for the interview.  The interview was an hour in half, she asked a lot of detailed questions including how I was going to manage on getting to work. I didn't see that question quite appropriate since I had already told them I would consider relocating. She also had me do a sample progress note to test my my knowledge or see if what I said was true on my resume.", "Interview Questions": "Think of a successful client and share that experience?"}, {"date": "6 Jun 2018", "title": "Therapist I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Didi Hirsch Mental Health Services (Los Angeles, CA) in Apr 2018", "Interview Descriptions": "I applied online, had a phone screening, and 2 interviews along with a bilingual exam over the phone.  I meet with two sets of supervisors and really got a feel for how the program is ran.", "Interview Questions": "What is your theoretical framework?"}, {"date": "3 Apr 2018", "title": "Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Didi Hirsch Mental Health Services (Los Angeles, CA) in Mar 2018", "Interview Descriptions": "This was set up through my grad school’s field placement program.  I was able to get an interview quickly. It was one-on-one with structured questions. The intervier was friendly but stuck to her list of questions.", "Interview Questions": "What’s a challenge that you’ve had?"}, {"date": "12 Feb 2018", "title": "Therapist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Didi Hirsch Mental Health Services", "Interview Descriptions": "Asked about qualifications, expectations, theoretical orientation, and gave vignette. The interviewers seemed nice. Also, there will be bilingual exam if applying for that position. The scariest part is just that there are multiple people interviewing you, not just one.", "Interview Questions": "How would you handle an angry client? \r\nHave you dealt with crisis?"}], [{"date": "16 Nov 2017", "title": "Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Didi Hirsch Mental Health Services", "Interview Descriptions": "It was a positive process. There were 2 people interviewing and asking questions mostly about my qualifications. The interview process was close to an hour and the those interviewing were nice.", "Interview Questions": "asking for experience "}, {"date": "1 Jun 2017", "title": "Support Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Didi Hirsch Mental Health Services (Los Angeles, CA)", "Interview Descriptions": "Interviewed with the hiring manager and their supervisor, process of hearing back with an offer took about a week from interview date. They were pleasant, provided a lot of information about the agency and also what to expect as far as responsibilities and the culture of the agency.", "Interview Questions": "What are your strengths and how would you handle a difficult client "}, {"date": "17 Jul 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Didi Hirsch Mental Health Services (Los Angeles, CA) in Feb 2017", "Interview Descriptions": "The interview process is just like any other interview, with the same basic questions every interviewer will ask. They focused on excel skills, however failed to mention or ask about my Microsoft Access skills. After my first interview I went in to take a skills test (i thought it was going to be on Excel), it was on Access. No one bothered to mention what the test was beforehand, even after I asked. Both interviews went great and they wanted to check my references. My references had to take an online survey of my skills..... Extremely unprofessional and unheard of. I know this place is a research facility but be professional and call like any normal professional business would do. This wasted about a month of time that i didnt have but thankfully I found employment elsewhere. Extremely slow interview process even though they were hoping to \"move forward quickly.\" That same position is still open 6 months later, gee I wonder why. I let them know i found something else.", "Interview Questions": "I dont remember."}, {"date": "22 Oct 2016", "title": "Bilingual Mental Health Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Didi Hirsch Mental Health Services (Inglewood, CA) in Sept 2016", "Interview Descriptions": "In terms of difficulty, the interview is average. It was a one on one interview with a very professional and kind LCSW. The hiring process is about 3 weeks, which includes a live scan, 5 references, bilingual fluency exam, and computer literacy test. All the afore mentioned steps must be completed before receiving an offer. The offer came in at $53,400 with a bilingual deferential.", "Interview Questions": "Using an evidence based practice, tell me how you helped a client with mental illness."}, {"date": "20 Sept 2016", "title": "Lead Psychologist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Didi Hirsch Mental Health Services (Inglewood, CA) in Sept 2016", "Interview Descriptions": "Applied online and was contacted for a phone interview within a few days. Completed the phone interview with a panel of people (including the clinic manager and training director). I was invited for a tour of the facility a few weeks later. Offer was extended about three days after the tour and all my background stuff cleared. I ultimately declined because I didn't feel this job was a good fit for my career goals at this time, but the people I spoke with at the clinic were fabulous and I would certainly apply again if I'm in a different place in the future.", "Interview Questions": "What is your theoretical orientation?"}, {"date": "22 May 2016", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Didi Hirsch Mental Health Services (Los Angeles, CA) in Nov 2015", "Interview Descriptions": "I was called to have an in-person interview, and called about 10 days later for a second interview. The first interview was with 2 managers and an HR person observing, the second was with those same 2 managers plus 2 other employees who worked in the department. The second interview also included a skills-based portion. Unfortunately, the company was not professional enough to contact me in regards to the outcome of the interview.", "Interview Questions": "Tell us about your previous experiences building and managing data sets."}, {"date": "21 May 2017", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Didi Hirsch Mental Health Services (Los Angeles, CA) in Oct 2015", "Interview Descriptions": "Called and went through a brief phone screening. In person interview was offered. Met with Supervisor and one of the current Therapists in the program. Brought back for a 2nd interview with Supervisor and the Therapist I would be replacing.", "Interview Questions": "Describe some of the conditions you have worked with/treated. Have you experienced and/or how would you handle counter-transferance?  What populations are you comfortable working with? What EBPs are you certified in?"}, {"date": "1 Apr 2018", "title": "Peer Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Didi Hirsch Mental Health Services (Los Angeles, CA) in Jan 2015", "Interview Descriptions": "As an internal candidate, I was very familiar with the interview process.  I felt confident that I would be selected, even though there were some changes to our documentation system.  I had started as a volunteer.", "Interview Questions": "How would you address a situation where one client in a group was crying or yelling?"}, {"date": "10 Oct 2014", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Didi Hirsch Mental Health Services", "Interview Descriptions": "I applied by email. In two weeks a member of staff called me, asked me my interests and set an onsite interview. Many candidates came for an interview on the same day.", "Interview Questions": "how can you deal with emergency situations?"}, {"date": "7 Mar 2014", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Didi Hirsch Mental Health Services (Culver City, CA) in Jul 2010", "Interview Descriptions": "I was offered the current position", "Interview Questions": "How would I handle a client who has become angry and disruptive?"}]]