[[{"date": "2 Jul 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Froedtert Health", "Interview Descriptions": "My initial phone interview was calling the provided number and answering a pre recorded series of questions. They were nornal interview questions like describe a situation when…you went above and beyond, when you handled a difficult situation; etc but it was so weird that there was no contact with an actual person, just the answering machine with pre recorded questions. Interviews can be nerve wracking enough, and sitting down for unknown rapid fire questions is worse. The whole thing felt very impersonal and quite frankly, lazy.", "Interview Questions": "Typical interview questions: deceive a situation when….you went above and beyond; describe how you handed a difficult situation; describe how you handled a conflict, etc"}, {"date": "23 May 2023", "title": "Security Officer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Froedtert Health", "Interview Descriptions": "Starts with two phone interviews and then an in-person interview with the hiring manager. Then it takes about two weeks for them to contact you to let you know results.", "Interview Questions": "Why do you want to work here?"}, {"date": "1 May 2023", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Froedtert Health", "Interview Descriptions": "Th first step after applying online was a very basic phone screening interview with a recruiter. The phone screen was scheduled 3-4 weeks after application. Recruiter was about 5 minutes late and seemed indifferent. The interview was brief.", "Interview Questions": "Tell me about your background and interest in the position."}, {"date": "18 May 2023", "title": "Solutions Architect Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Froedtert Health (Milwaukee, WI) in Apr 2023", "Interview Descriptions": "I truly enjoyed the interview process. The interview was a 3-stage process. First the recruiter, then the hiring manager and last technical (my peers). Once you make it past those stages, then there was an offer.", "Interview Questions": "Tell me about yourself? Give me a scenario were you worked with StaaS (Storage as a Service? Explain the process of a high-level infrastructure design?"}, {"date": "8 Jun 2023", "title": "Guest Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Froedtert Health (Wauwatosa, WI) in Apr 2023", "Interview Descriptions": "Easy the first shift sup is very personable!! such a smooth process as soon as I met the sup I didnt feel anxious at all. The interview starts with ice breaker questions and given the job, a tour of the job is given as well!", "Interview Questions": "why do you want to work here?"}, {"date": "16 Mar 2023", "title": "Medical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Froedtert Health in Mar 2023", "Interview Descriptions": "It was very easy and very fast. They answered all my questions in a timely fashion. They gave complete and though answers to all my questions and opened up my understanding of the lab position", "Interview Questions": "Where do you see yourself in 5 years? What is your biggest flaw? What is your biggest strength?"}, {"date": "16 Feb 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Froedtert Health", "Interview Descriptions": "A meeting with unit manager. Asks about previous experience, how you problem solve, and career goals. Will give you a unit tour and offer a job shadow if you would like.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "3 May 2023", "title": "HUC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Froedtert Health (Milwaukee, WI) in Feb 2023", "Interview Descriptions": "Great process, quick and straight to the point. The questions were typical interview questions. It took a total of 3 weeks to process everything and start working. The training took 1 1/2 months. It was very detailed but you will learn things as you go further into the position.", "Interview Questions": "Please tell me about yourself."}, {"date": "31 May 2023", "title": "Sr. Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Froedtert Health (Milwaukee, WI) in Feb 2023", "Interview Descriptions": "It was a three step process: HR screening, Hiring Manager Interview, Panel Interview. It was welcoming and I moved through the stages of interviews about every week. I felt that they valued diversity and wanted to get to know me on a personal level.", "Interview Questions": "What does professionalism mean to you?"}, {"date": "10 Jan 2023", "title": "Ophthalmic Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Froedtert Health (Milwaukee, WI)", "Interview Descriptions": "They will have a recruiter reach out to you and schedule an phone interview at a convienent time for you. Once you get accepted, you will have an in-person interview with the manager.", "Interview Questions": "Q: What is your biggest weakness?"}], [{"date": "17 Aug 2022", "title": "Clinical Documentation Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Froedtert Health", "Interview Descriptions": "Screening call from a recruiting assistant of some kind. Then a phone call with a recruiter which was basically scheduling the interview with the hiring manager. Then an interview with the hiring manager.\n\nThey want 4 references and 2 have to be managers. I was not informed of this by the recruiter on the phone, just got a random email from an outside company with no information about how/when the references are used or anything about  the process. You have to give so much information about your references (email, phone, what years you worked together, job titles).  Then the recruiter ignored my emails asking questions about the process\n\nAfter the interview I got no email letting me know I was out either, just a status change on the site.\n\nI have applied to so many jobs, had multiple interviews…this was one of the worst experiences I’ve had.", "Interview Questions": "Nothing difficult. “Tell me about yourself” etc."}, {"date": "11 Aug 2022", "title": "Chaplain Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Froedtert Health in Aug 2022", "Interview Descriptions": "I was notified by text  about the initial screening process. I was given a few different dates and times for a 30 minute screening interview.  They sent multiple reminders of the interview . The phone interview was screening me asking for salary range, my personal goals and career aspirations; reasoning for leaving past two positions. Phone interview was", "Interview Questions": "What are your career goals and aspirations?"}, {"date": "7 Jun 2022", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Froedtert Health", "Interview Descriptions": "There was an initial call with HR. Once completed, availability was requested so that an appointment could be scheduled with on site manager.  I met with the manager and a team member for approximately 45 mins.", "Interview Questions": "To identify several strengths and weaknesses "}, {"date": "26 Apr 2022", "title": "Patient Transporter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Froedtert Health (Milwaukee, WI)", "Interview Descriptions": "I applied and got an email for a phone screening request. After doing that, w recruiter reach out to me and scheduled an interview with a department supervisor. I went to the interview and was told that I would hear back in about a week or so to find out if I got the position. My application still says that it’s under review til this day and I never heard anything back.", "Interview Questions": "Tell me about yourself.\nTell me about a problem you’ve faced. "}, {"date": "16 Mar 2022", "title": "Human Resources Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Froedtert Health", "Interview Descriptions": "This was a difficult process, and very automated. I didn't feel part of the process, and reached out for feedback. I didn't get an answer for 4 months. I felt a little slighted during the entire process, especially given my experience.", "Interview Questions": "How to consider Diversity, How to handle stressful situations"}, {"date": "22 Feb 2022", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Froedtert Health", "Interview Descriptions": "Interview process was really easy. Met with HUC manager at that time in person and we met in her office for interview process. She was really kind and just gave me lots of facts about the position I was applying for.", "Interview Questions": "Tell me about yourself?\r\nWhat did you do before applying here?\r\nWhy do you believe you’d be a great fit?"}, {"date": "4 Feb 2022", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Froedtert Health", "Interview Descriptions": "good and fast they invited over to the site and ask question about my past experience . I think as long as you have some sort of experience they would accept you as long as you have the certificate to work as a CNA", "Interview Questions": "They ask about your past experience"}, {"date": "2 Feb 2022", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Froedtert Health", "Interview Descriptions": "very simple and amazing loved it a lot, very easy to do and easy to comprehend, would do again if I needed another job, loved the option of having a virtual interview due to COVID", "Interview Questions": "why do you want this position"}, {"date": "14 Jan 2022", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Froedtert Health", "Interview Descriptions": "First there was an automated interview. Then an in person/ virtual interview where they asked typical interview questions. The questions are easy to answer if you prepare and practice your answers.", "Interview Questions": "Tell me about a time when you had a difficult patient ?"}, {"date": "6 Jan 2022", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Froedtert Health", "Interview Descriptions": "It was a two step procedure, with the hiring manager's mind already made up that I should be hired I think after I had a handful number of questions from HR.", "Interview Questions": "Please tell me about yourself. "}], [{"date": "13 Mar 2023", "title": "Speech Language Pathologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Froedtert Health in Jan 2022", "Interview Descriptions": "I applied online to a pool position, had a robot phone interview, and then five days later was asked to do an interview with the hiring manager. I received an offer 20 minutes after the interview. They hire all FTE positions from the float pool so everyone starts PRN. I was told there is no negotiating pay, everyone is paid a flat rate.", "Interview Questions": "Phone interview : Behavioral questions (describe a time when you…) manager interview: clinical questions, what type of deficits would you expect to see with a L sided CVA/resume experience etc."}, {"date": "1 Feb 2022", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Froedtert Health (Milwaukee, WI) in Jan 2022", "Interview Descriptions": "Automated scheduling of interview. Contacted on time for interview. Informed did very well and would hear back in 5 days. No response 3 weeks later.   Difficult to find a way to contact individual who interviewed me.", "Interview Questions": "Why did you choose Froedtert."}, {"date": "16 Sept 2021", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Froedtert Health", "Interview Descriptions": "There is along process to get hired through this company and then once in you have to tread lightly to keep your job. There are three interviews held. They take forever to call you back and will have you reapplying forever to get in just to treat you like crap once you're in.", "Interview Questions": "The normal questions are asked."}, {"date": "4 Sept 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Froedtert Health (Milwaukee, WI)", "Interview Descriptions": "The entire interview process has been weird and unprofessional - nothing like I've experienced before.\n\nThe recruiters didn't answer any of my emails or phone calls when I had questions about open positions, references, or what times were available for scheduling an interview when I was invited to one. \n\nMy first interview went well, or so I thought, and the hiring manager seemed to really like me and said there was a good chance I'd get the position. \n\nI got to the second interview and it seemed like they already made up their mind that I wasn't getting the position before the interview even started. The staff conducting the interview didn't seem interested at all in what I was saying and even laughed at me. I left feeling like they just invited me for an interview as a joke. I was nervous and didn't do my best with the interview, but still, I shouldnt be treated in a condescending way.  Additionally, if they already decided to pick someone else - just cancel my interview. It's a waste of my time.", "Interview Questions": "All behavioral questions, like \"describe a time when...\""}, {"date": "12 Nov 2021", "title": "Supply Chain Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Froedtert Health (Milwaukee, WI) in Sept 2021", "Interview Descriptions": "They email you about your availability for an interview and you RSVP for a time. You then wait by your phone for them to call and they don't.  You call the HR the department which is impossible to get through and have to leave a message. They call you back at their convenience to reschedule (no apology for missing the interview). They then run you through an interview with no real substance. They inform you we'll let you know either way about our decision and you wait 3 months and hear nothing.", "Interview Questions": "Name a time when you had a conflict with another employee and how was it resolved."}, {"date": "7 Aug 2021", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 5 weeks. I interviewed at Froedtert Health", "Interview Descriptions": "recruiter reached out \nanother recruiter liaison reached out and scheduled a date\nmet with medical director and providers at the practice and ate lunch with some of them\nsent thank you letters \nreceived benefits package the next day\nthe next day told i didnt get the job", "Interview Questions": "tell me about a time you said something wrong to a patient"}, {"date": "28 Sept 2021", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Froedtert Health in Jul 2021", "Interview Descriptions": "A lot of people in the room, kind of laid back. They asked a lot of the same questions but worded it differently. Ver nice and willing to work around my school schedule", "Interview Questions": "Asked a lot about costumer service "}, {"date": "21 Sept 2021", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Froedtert Health (Milwaukee, WI) in May 2021", "Interview Descriptions": "It is extremely disappointing that despite its professed values Froedtert has resorted to outsourcing \"screening\" interviews to \"20 something year olds\" located in Japan - presumably for the sake of efficiency.", "Interview Questions": "\"Describe a moment when you resolved a conflict\"."}, {"date": "19 Jan 2023", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Froedtert Health (Milwaukee, WI) in Apr 2021", "Interview Descriptions": "It was a very laid back friendly environment. They made me feel comfortable and also made it more of a conversation environment. They also were very flexible and upfront. It was one of my favorite interviews I have had.", "Interview Questions": "They asked me a few situational questions."}, {"date": "28 Apr 2021", "title": "Histology Lab Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Froedtert Health (Menomonee Falls, WI) in Apr 2021", "Interview Descriptions": "About a 3 week process, and still undergoing it at the moment. They communicated effectively. I started off with a phone interview, then was invited to a second round of interviews. I also am waiting to perform a third part. Hopefully it works out! Wonderful staff.", "Interview Questions": "Tell me about a time you faced a difficult situation and how did you handle it?"}], [{"date": "10 May 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Froedtert Health (Milwaukee, WI) in Apr 2021", "Interview Descriptions": "I called a number and responded to several questions, essential voicemail style. It was a big rushed but I’m assuming that’s the point. I only had 60 seconds to respond to each question and no redos. The questions were fairly simple.", "Interview Questions": "Describe a time you went above and beyond for a patient"}, {"date": "30 Mar 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Froedtert Health", "Interview Descriptions": "Very standard with the questions and they only asked a few of them i thought it was great and i think that i will get the job if it was even a real interview", "Interview Questions": "if i was going to work there forever"}, {"date": "10 Mar 2021", "title": "RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Froedtert Health", "Interview Descriptions": "The staff was very helpful with setting up the interview. Easy to navigate and set me up with everything I needed to know. Made it a comfortable experience and made me confident going into it.", "Interview Questions": "When did you face adversity "}, {"date": "13 May 2023", "title": "Medical Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Froedtert Health (Menomonee Falls, WI) in Mar 2021", "Interview Descriptions": "My boss was genuine and got to know me on a personal level. I was taken on the floor to meet some of my future coworkers. The HR/recruiting process before the actual interview is a bit daunting.", "Interview Questions": "Name a time you had to deal with a difficult customer, client or patient in the past? How did you resolve the issue?"}, {"date": "18 May 2021", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at Froedtert Health in Feb 2021", "Interview Descriptions": "The initial phone interview was awkward, like talking to a robot. \n\nThe next 3 interviews I had were great. Everyone I talked to was very kind and informative. This was the first job interview I’ve ever had where one of the interviews was just with people who would be my peers, which I appreciated. \n\nHowever, my experience took a nosedive when it came time to actually find out if I’d been selected. After not hearing from Froedtert for a few weeks, I finally got an email from the recruiter. But it was to tell me about a few other open roles within the organization, not about the role I’d interviewed for! I replied to the recruiter to ask about that role and if it had been filled and she said yes. \n\nIt was really disappointing, awkward and honestly quite unprofessional to find out that way. What a disappointment.", "Interview Questions": "Tell us about a time when you’ve had to work with someone with a different communication style than you."}, {"date": "14 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Froedtert Health", "Interview Descriptions": "Two rounds of interviews. One was with HR who then set me up with the hiring manager. The interview included a job shadow of the unit which was helpful in deciding if I should take the job", "Interview Questions": "Where do you see yourself in 5 years "}, {"date": "23 Nov 2020", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Froedtert Health", "Interview Descriptions": "Recruiter interview confirmed questions that were completed in the application (e.g. are you eligible to work in the US), and was not able to answer any questions regarding the position. \n\nThe interview with Vice President was unstructured (e.g. tell me about yourself) without any behavioral or job-related questions.", "Interview Questions": "Tell me about yourself.  What type of leader do you want to work for? "}, {"date": "27 Mar 2021", "title": "Nurse Extern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Froedtert Health (Milwaukee, WI) in Nov 2020", "Interview Descriptions": "Upon application, you receive a link to phone into. This link is an automated computer system that asks you questions and allows a short amount of time to answer. Very impersonal.", "Interview Questions": "Why do you want to work for Froedtert?"}, {"date": "19 Oct 2020", "title": "Systems Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Froedtert Health", "Interview Descriptions": "It is difficult to get a interview when applying online.   Submitted resume to a couple positions newly posted on company website that my background and skills matched. \n Received automated system notifications within an hour of submitting application online.  Notifications read: \"Upon review, the decision has been made to pursue other candidates for this position who best match the current department needs\".", "Interview Questions": "No interview questions were asked"}, {"date": "22 Jan 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Froedtert Health (Milwaukee, WI) in Oct 2020", "Interview Descriptions": "Phone interviews throughout entire process due to Covid! The first one is automated. The second one is with a recruiter,  and the third is with a manager/supervisor. Pretty straightforward. If you apply to multiple roles be sure that you are interviewing for what you want.", "Interview Questions": "What interest you in working for Froedtert Health?"}], [{"date": "28 Aug 2020", "title": "ICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Froedtert Health", "Interview Descriptions": "It was very intimidating at first, but luckily I worked through Froedtert already and had build great experience and work ethics. The interview was very fast and they called right back the same day with an offer. They are in need of nurses so definitely a great place to start out your career", "Interview Questions": "How do you handle difficult situations involving patients family?"}, {"date": "25 Aug 2020", "title": "Manager, Leadership Development Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Froedtert Health (Menomonee Falls, WI) in Aug 2020", "Interview Descriptions": "Very odd...  Ran  hot and cold.  On the front end.  zoom  video call,  full  reference check ,  then a big push to get  a 2nd video interview scheduled,    then a technical issue caused  the  2nd interview to  need to be rescheduled..   then...  Ghosted.     Finally got a  system generated email saying  they were moving on with other candidates.   No  other feedback.", "Interview Questions": "What are your salary expectations?"}, {"date": "31 Jul 2020", "title": "Systems Education Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Froedtert Health", "Interview Descriptions": "Call from recruiter, very generic questions.  then in person with hiring manager and then some team members.  Waited for a phone call after that to get my offer", "Interview Questions": "Tell me a time when you had a conflict"}, {"date": "31 Aug 2020", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Froedtert Health (Milwaukee, WI) in Aug 2020", "Interview Descriptions": "Recorded phone interview for an RN position in the Emergency Department .\r\nTook an online assessment prior to being offered the recorded phone interview. It was not with a live person, rather a series of 5 questions I had 3 minutes to answer.  The 5 questions were all the basic ones the internet tells you to know when applying for nursing jobs.", "Interview Questions": "How do you stay organized?\r\nHow do you deal with stress?\r\nHow do you deal with a bad co-worker?"}, {"date": "5 Aug 2020", "title": "IT Security Asset Management Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Froedtert Health in Jul 2020", "Interview Descriptions": "I was contacted by a third party recruiter regarding this position. \r\n\r\nProcess took about 2.5 weeks. I had a panel interview which lasted 7 hours. Yes, 7 hours of my day was taken for this interview and what a complete waste of time it was. Interview went very well and the hiring team even suggested I interview for another position to which I did. \r\n\r\nAfter 7 hours of interviews, the hiring manager said feedback was very good and they would make their decision in a couple of days. \r\n\r\nGot a call 3 days later saying that they had passed and didn't provide a valid reason as to why. No feedback was given. Even the recruiter was baffled. \r\n\r\nOverall, a terrible experience. DO NOT waste peoples time by conducting 7 hour long panel interviews. You wasted my time and energy. The HR department should really look into breaking this process down. \r\n\r\nI will never apply to this company again and will never use their hospital/services.", "Interview Questions": "Why were you interested in this position? \r\n"}, {"date": "25 Aug 2020", "title": "Leadership Development Program Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Froedtert Health in Jul 2020", "Interview Descriptions": "Very odd...  Ran  incredibly hot  on the front end.  zoom  video call,  full  reference check ,  then a big push to get  a 2nd video interview scheduled,    then a technical issue caused  the  2nd interview to  need to be rescheduled..   then...  Ghosted.     Finally got a  system generated email saying  they were moving on with other candidates.", "Interview Questions": "Standard Screening  and  \"tell me about a time\"  questions."}, {"date": "14 Jul 2020", "title": "Sterile Processing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Froedtert Health (Milwaukee, WI) in Jul 2020", "Interview Descriptions": "Very Good. Positive. Friendly Manager made me feel comfortable. Took me for a tour of the department and let me shadow as well. Professional and team work atmosphere. Really had no negative experience.  Great department and People.", "Interview Questions": "Are you certified in your skill set"}, {"date": "10 Jun 2020", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Froedtert Health", "Interview Descriptions": "The directions to the campus were very helpful and easy to follow. The interviewing manager was 35 minutes late for my interview, which was very frustrating as I cam from out of state for this interview.", "Interview Questions": "What was your favorite and least favorite clinical of nursing school?"}, {"date": "24 Jun 2020", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Froedtert Health (Milwaukee, WI) in Jun 2020", "Interview Descriptions": "I applied to 5 different RN positions at Froedtert Hospital on a weekend, received email with request for virtual interview on Monday (4  automated telephone situational based questions, had 3 minutes to answer per question) and brief online questionnaire (confirming resume type information), received brief call from HR rep a few days later (to confirm additional information and clarification about which jobs I wanted to prioritize), next was an email from HR telling me I was eligible to schedule phone interviews with two separate departments. I attended one phone interview and was invited to come onsite to interview for the second (this was just as Froedtert's COVID on-site interview policies changed). Both interviews lasted about 30 minutes, both were group interviews (consisting of nurse manager, assistant nurse manager, and unit educator). I was offered shadowing opportunities for about an hour in the departments following both of the interviews.  Waited 2 business days from second interview to receive call from recruiter stating I was offered a position in one of the two departments. I accepted the offer.\r\n\r\nOverall, I thought Froedtert's application process was simple and straightforward (easy to duplicate and apply for multiple jobs at once).  There were multiple people I dealt with over the course of the 18 days, but all were very coordinated in the handling of everything. There was not much dead time between each stage in the process, I always felt that I was informed about what would be happening next in the interview process. I was very pleased and impressed with Froedtert's onboarding process.", "Interview Questions": "Mostly situational based questions -- Tell me about a time when you went above and beyond for a patient. Tell me about a time when you had a disagreement with a coworker and what you did to resolve it. Why did you choose Froedtert? \r\n"}, {"date": "22 Jun 2021", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Froedtert Health (Milwaukee, WI) in May 2020", "Interview Descriptions": "Via Phone, short direct questions, casual and easy conversation, be prepared with why you would make a quality employee and you plan to make an impact in the healthcare field.", "Interview Questions": "What was one instance where you overcame an obstacle that impeded your work?"}], [{"date": "13 May 2020", "title": "HR Business Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Froedtert Health (Milwaukee, WI) in May 2020", "Interview Descriptions": "Robotic!  No questions were asked other than to verify information on the resume and it sounded like she was just reading from a page.  Did not give me the opportunity to ask any questions or engage in conversation.  Did not even take the time to speak about the company.  Probably one of the most disappointing phone screens I have ever had.  Seemed like they had someone else in mind and were just pushing through the applicants.  I've heard great things about this company so I'll call this a fluke.", "Interview Questions": "Just verified application information (Mostly Resume)"}, {"date": "18 Mar 2020", "title": "Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Froedtert Health", "Interview Descriptions": "I applied online and was then contacted to do a phone interview with an automated recorder. The process was a bit awkward. I then had an another phone interview and an in person interview.", "Interview Questions": "Why did you choose this career?"}, {"date": "20 Mar 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Froedtert Health (Milwaukee, WI) in Mar 2020", "Interview Descriptions": "The application was fairly simple. You do a phone interview first then meet with a nurse manager. Only negative thing was that it took over two weeks to get a response after the interview.", "Interview Questions": "Describe a time when you had a difficult patient/coworker. "}, {"date": "16 Feb 2020", "title": "EMT-B Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Froedtert Health (Milwaukee, WI)", "Interview Descriptions": "I got an email saying I got an in-person interview and it took them a week to schedule it. Then, when the day came for my interview I got there a half an hour early but the people interviewing me we’re almost an hour late and they also weren’t the people listed on the email that I was supposed to be interviewing with.", "Interview Questions": "All of the interview questions had to do with their values"}, {"date": "14 Mar 2020", "title": "Cancer Center Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Froedtert Health (Wauwatosa, WI) in Feb 2020", "Interview Descriptions": "I did a online application first about 2 or 3 days later i was requested to do a phone interveiw. The phone interveiw was general interveiw questions over the phone by a automated system. Then about a week later i did a face to face interview i was also asked to shadow to see how the job was which I did . The process took about 4 weeks all together.", "Interview Questions": "Where do you see yourself 5 years from now."}, {"date": "17 Dec 2019", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Froedtert Health", "Interview Descriptions": "Applied online and then was contacted for a phone interview, during which they asked questions for you if you’re okay with doing xyz. After that there would be an in person interview", "Interview Questions": "Why are you leaving your current job?"}, {"date": "28 Nov 2019", "title": "CT Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Froedtert Health", "Interview Descriptions": "Short and sweet. They asked the general questions, and then took me around the department for a shadow. I also shadowed another day to make sure it was the right fit.", "Interview Questions": "Give me a time you didn't agree with an employee and how did you handle it?"}, {"date": "7 Nov 2019", "title": "Executive Director Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Froedtert Health (Milwaukee, WI)", "Interview Descriptions": "The automated interview questions were awkward.  I liked that I could call for the screening questions when my schedule allowed. The email replies were very quick but a little too pushy with how quickly they wanted an answer.", "Interview Questions": "Why do you want to work at Froedtert?"}, {"date": "23 Oct 2019", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Froedtert Health", "Interview Descriptions": "2 over the phone interviews 1 in person interview. Over the phone interview consisted of multiple questions, they record your responses. The in person interview consisted of the nurse manager and educator for the floor I was applying to.", "Interview Questions": "what makes you qualified for this position?"}, {"date": "3 Aug 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Froedtert Health", "Interview Descriptions": "I had a phone interview with HR then moved on to an interview with the hiring manager then some of the nurses in the department. Most of the questions were typical interview questions that I was prepared for.", "Interview Questions": "Describe yourself in 5 words"}], [{"date": "31 Mar 2021", "title": "Supply Chain Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Froedtert Health (Milwaukee, WI) in Aug 2019", "Interview Descriptions": "Took about 5 weeks in total to start from point I applied online. Orientations are only once a month which delayed it. I spoke on phone first and then I was brought in for an interview. It took abouta week after to get the offer.", "Interview Questions": "What I liked and didn't like about last job"}, {"date": "9 Dec 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Froedtert Health in Jul 2019", "Interview Descriptions": "The interview process was fairly easy. Had direct contact with the floor manager and it was a quick process. It was easy to set up the interview and had a chance to shadow the floor.", "Interview Questions": "What was a time you had a difficult situation with a coworker?"}, {"date": "29 May 2019", "title": "Scheduling Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Froedtert Health", "Interview Descriptions": "Quickly got phone interview but it has been weeks and still waiting for a call. I received the phone interview only 2 days later but haven’t heard since. It would be nice to know wether or not I am still being considered", "Interview Questions": "They asked to name a time I had to be inclusive"}, {"date": "9 Jul 2019", "title": "Insurance Verification Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Froedtert Health in Jun 2019", "Interview Descriptions": "The interview process is overly automated.  If you are looking to get your foot in the door and only fit the 80/20  rule for qualifications (generally acceptable for non-clinical position), good luck. Failing to meet ANY of their requirements 100 percent through the beginning stages of their automated online process won't even get you an automated phone interview.   What a shame.", "Interview Questions": "Was asked if I had experience with several different online insurance interfaces and listed them. "}, {"date": "15 Jul 2022", "title": "Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Froedtert Health in May 2019", "Interview Descriptions": "Phone screen was like talking to a robot. Nothing personal and barely said hello before saying “do you meet the min quals and do you need sponsorship”. Then it took months to hear back about coming in for another interview. I had already accepted another job. But I wouldn’t have moved forward even if I was still searching. Poor experience.", "Interview Questions": "Do you meet the min quals? Do you require sponsorship?"}, {"date": "18 Jun 2019", "title": "In-Room Dining Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Froedtert Health in May 2019", "Interview Descriptions": "They have you done a phone screen interview for your first interview which takes 15 about minutes.\r\nEven though I waited 30 minutes for my interview to start, the interview process was very easy and quick for the in-person interview.\r\nBut still for some reason no was not hired.", "Interview Questions": "What would your current manager or supervisor describe you as?"}, {"date": "29 Apr 2019", "title": "Cancer Center Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Froedtert Health (Milwaukee, WI) in Apr 2019", "Interview Descriptions": "Applied through the company website. Once you have applied to one job, it will save your info so it is much easier to apply to other jobs. You first have a phone interview with a general recruiter, who then sends your info to the departments. If they like it, they will schedule an in-person interview. My interview was scheduled to be an hour long and took about 45 minutes. They then had be come back for 2 hours to shadow people doing the job I wanted to see if I liked what they did and if I was a good fit with the other workers there.  Once I had all my references submitted (they have a survey for them to fill out), I heard back the next day with an offer. Still waiting to see how the on-boarding process goes.", "Interview Questions": "What is one thing you could improve about yourself/one thing you are good at?"}, {"date": "22 Mar 2019", "title": "Information Systems Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Froedtert Health", "Interview Descriptions": "Initially this went well.  Recruiter contacted me and then I had a phone interview.  I was invited to in person interview with supervisor and a person that would be a peer.  All went well with that and I was told I would hear something about next steps the next week.  I received a call the following week to come back and meet with a Director and a Manager in person.  When I came to that one, only one of the two showed up to the interview.  The interview with the Director again seemed to go really well and he said to me \"With your experience and knowledge, you would be a great fit here\"  He said he wanted to have me talk to the Manager as well and that could be a phone interview.  This was a Friday.  The following  Monday I had a call to set up the phone interview - which I set up for Friday of that week.  That evening I received a system generated email telling me I was no longer being considered for the role.  I contacted my recruiter to find out of that was accurate since it conflicted with the activity from Monday.  He checked and found out they didn't feel I had enough experience in part of the position role.  However, I am certified in that area.  \r\nThe whole thing was confusing and frustrating.  I took two half days off of work to interview and it felt like the whole thing was a joke to the hiring team in the department I interviewed with.  The recruiting team was professional with me and I had no complaints other than the system generated rejection after two in person interviews and another phone one scheduled.", "Interview Questions": "The questions were typical"}, {"date": "30 Nov 2019", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Froedtert Health (Milwaukee, WI) in Mar 2019", "Interview Descriptions": "It was very laid back, but did include a brief technical assesment.  Met with 5 different people over 2 hours.  Would have liked to have more time to ask questions.  Meeting 5 people in such a short time took away ftom time I would have had to ask questions at the end of the interview.", "Interview Questions": "Tell us about yourself?"}, {"date": "22 Jul 2021", "title": "ICU Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Froedtert Health in Feb 2019", "Interview Descriptions": "Short, easy, HR was very quick to answer all my questions and get back to me.  The interview asked detailed questions related to ICU nursing including prior job experience, qualifications and why ICU", "Interview Questions": "Name a time you disagreed with a former coworker, and how did you resolve it"}], [{"date": "9 Jan 2019", "title": "Customer Insight Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Froedtert Health (Menomonee Falls, WI) in Jan 2019", "Interview Descriptions": "Very limited availability for phone interview slots for which you have to register online. First phone interview, the recruiter never showed. When I called back, they put me on with an interviewer that had no specific information about the position i.e. was it hourly or salaried, exempt/non-exempt, etc. \r\n\r\nRadio silence for a month, then out of the blue I get an email for an in-person interview. After a week (in which I had to follow up with the recruiters twice) I finally managed to get on their schedule. I was then sent a link to fill out my references - at least 4, 2 of which needed to be managers - within 24 hours. Once I did (not an easy task as this was the week of Christmas), my references were sent a link to a 25 question (!) survey that I was encouraged to hound them to complete.\r\n\r\nThe in-person interview  with the hiring manager was fine, although they stuck to canned questions from a piece of paper as opposed to more of a conversational approach. I was told that there would be yet ANOTHER  interview with a peer and senior management if I moved forward.  \r\n\r\nI did not, and honestly I was relieved when I got the email. To be made to jump through so many hoops before even getting an in-person interview to determine fit was a red flag for me, and I would be highly unlikely to apply for any positions as Froedert in the future unless I become unemployed and have all kinds of time to spend on the process. It's not really worth the effort unless you're desperate for a job, and was outside of the norm for similar jobs I've interviewed for in the past.", "Interview Questions": "What is something that frustrated you?"}, {"date": "18 Dec 2018", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Froedtert Health (Wauwatosa, WI) in Dec 2018", "Interview Descriptions": "Applied online late October 2018, received an invitation for a phone interview a week later, had the actual phone interview mid-November with standard questions, face-to-face interview with hiring manager in early-December with verbal tentative job offer 2 days later.\r\n\r\nFMLH gives 3 business days to complete drug test and fill out new hire paperwork, but background check processing vendor seems to be overwhelmed/takes awhile. I haven't been able to put in my leave notice yet because I'm not even sure if I \"really\" have a new job yet.", "Interview Questions": "What interested you about this position?"}, {"date": "12 Oct 2018", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Froedtert Health", "Interview Descriptions": "Online application, phone interview, in person interview. Very quick turnaround on everything. Hired quickly after submitting the online application. Everyone was pleasant to work with, and orientation started as soon as possible.", "Interview Questions": "Rank in order the importance of seeing patients."}, {"date": "29 Apr 2020", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Froedtert Health (Menomonee Falls, WI) in Oct 2018", "Interview Descriptions": "The interview was easy, I was very comfortable. I had a phone interview and then a in person interview. I was offered the job the following week  and I accepted.", "Interview Questions": "Tell me about a time when you have dealt with a angry patient."}, {"date": "12 Nov 2018", "title": "Housekeeper Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Froedtert Health (Milwaukee, WI) in Sept 2018", "Interview Descriptions": "My interview was scheduled for 3:00 P.M. but the interview started over forty minutes later due to the recruiter being on an important phone call.  I completely understood that it gets quite busy at the hospital so I didn't mind waiting.  After the interview, I was told they would reach out within a few weeks with a decision but as of yet I haven't received a response.", "Interview Questions": "Can you name some of your strengths?"}, {"date": "29 Aug 2018", "title": "Assistant Nurse Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Froedtert Health", "Interview Descriptions": "I had multiple interviews with the team. The interview questions were standard behavioral interview questions, and then opened up a little for additional questions. \n\nThere was a lot of passion and commitment from the teams that I interviewed with. They asked great questions and demonstrated clear engagement in their jobs. \n\nVery prompt and timely, clear timeline expectations.", "Interview Questions": "What is your leadership style?"}, {"date": "23 Jul 2018", "title": "Rehab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Froedtert Health", "Interview Descriptions": "My friend already worked at Froedtert Hospital so I sent my resume to her boss, and applied online through HR. I then got a phone interview through HR, and met with the supervisor of the department for another interview. I was offered the job the next business day by HR. The overall process took one week.", "Interview Questions": "Tell me a time when you have to handle a conflict at work?"}, {"date": "21 Jun 2018", "title": "Dietitian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Froedtert Health", "Interview Descriptions": "Formatted, based upon standard question set. Department manager and supervisor interviewed together. Also had a peer interview afterwards. Interviews lasted a total of 1 hr. Interviewers were all friendly and outgoing, I did about 60% of the talking, interviewers 40%", "Interview Questions": "Describe yourself in 3 words"}, {"date": "22 Apr 2018", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Froedtert Health (Wauwatosa, WI)", "Interview Descriptions": "Applied, HR scheduled a time to have a phone interview, spoke with the HR recruiter. Basic interview questions with many situational questions. Then info was passed on to hiring manager and within two weeks I had a scheduled interview with them in person. This was more position specific. After the interview I was offered the ability to shadow. Later, HR extended an offer far below average pay for the position but the hiring manager informed me of the rate prior to the extended offer. HR was not open to negotiation.", "Interview Questions": "What would an employer say is a characteristic you could improve upon?"}, {"date": "9 Mar 2018", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Froedtert Health (Wauwatosa, WI) in Jan 2018", "Interview Descriptions": "I applied for many PACR position and my submissions were responded to within a day or 2 with either an email “pursuing other applicants” or “please call in for a phone interview “. Then the “pursuing other applicants” email arrives between 2-24 hours. \n\n\nPhone interview process is awful. The instructions included: “take you time” and “allow you personality to come through”.  There are 3-4 prerecorded questions and then you record your answer without being able to pause before answering or starting over/re-recording. The question is stated, then repeated, then “beep”.. Beware, even though they say take your time, you have a limited time to answer and it will beep/cut you off without a warning.", "Interview Questions": "If you were walking down the hall and you saw someone looking lost or confused what would you do?"}], [{"date": "7 Feb 2018", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Froedtert Health (Milwaukee, WI) in Feb 2018", "Interview Descriptions": "Applied on-line. Invited for phone interview within 1-2 days. Automated scheduling system was not accessible so had to call to set up interview thru life person; and was told system not capable of scheduling more than seve days out. Job posting placed heavy emphasis HRS competencies but phone interview did not live up to billing. Started with questions that were clear from application that didn't seem necessary. Skipped to unclear seque about last three positions; questioned reasons for leaving ; asked about years of experience in healthcare; awkward battery of behavioral questions. No real sense of purpose behind questions or desire /ability to give insight into Froedtert Health or the relevancy of the HR culture or function.", "Interview Questions": "Do you have a PHR certifications in HR?"}, {"date": "5 Dec 2017", "title": "Health Unit Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Froedtert Health", "Interview Descriptions": "Applied online, took about a week to get an email response back. Proceeded to have a phone interview. Website and phone interview failed to disclose what experience is needed, for which I was sent a denial email a day later.", "Interview Questions": "Strengths, weaknesses, how did you promote inclusion of different people, name a time you dealt with a difficult situation, typical questions."}, {"date": "25 Aug 2017", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Froedtert Health", "Interview Descriptions": "The recruitment firm they retain is subpar at best. They don't know what they are doing. Get through them to the hiring managers, and you're gold. Unfortunately, the recruitment firm doesn't move fast enough. It's a competitive market, they need to move quicker! Involve the hiring managers. The fact that the recruitment firm is analyzing all applicants before presenting them to the team is ridiculous. I'm certain that many excellent applicants are being passed over", "Interview Questions": "How do you handle change?"}, {"date": "2 Sept 2017", "title": "Radiology Department Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Froedtert Health", "Interview Descriptions": "Applied and got a call back within a week I think. Initial interview screening process was filled with normal interview questions; what are your strengths, what would you do if, etc. Then they proceeded to tell me about the job a little more, how it was casual part time just picking up other people's schedule on different shifts when they need vacations, etc. The job description did NOT say it was that type of schedule, I reminded the interviewer what specific job position I applied for and she was clueless... The job description I applied for said part time third shift specific hours listed. I said I don't think I can do that.", "Interview Questions": "What are your two strengths and weaknesses."}, {"date": "27 Jul 2017", "title": "Buyer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Froedtert Health", "Interview Descriptions": "Applied online.  Two months later they contact me for a phone interview.  A month later they ask me in to interview with the department heads.  Weeks later I ask if there has been any progress made on an applicant.  They finally respond that they have decided to \"re-describe\" the position.  They do within days and I re-apply.  They tell me within a week that they are  looking at other candidates.", "Interview Questions": "N/A"}, {"date": "22 Aug 2018", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Froedtert Health (Milwaukee, WI) in Aug 2017", "Interview Descriptions": "When I went for an interview it was quite casual. We just went into the nurse managers office and she asked a few questions. She didn’t ask me for my resume.", "Interview Questions": "Tell me about a time you had conflict and how you dealt with it"}, {"date": "28 Jul 2017", "title": "Team Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Froedtert Health (Milwaukee, WI)", "Interview Descriptions": "I hadn't applied, I received an email asking me for a phone interview because a recruiter had seen my resume somewhere. Phone interview went well, so they sent me information for an interview with the hiring manager and to give references. The interview with the hiring manager was great, she was very nice, made me feel welcome, and asked me to return for another interview with the other Team Leads. I must have done well there as well because I got a call the same day!", "Interview Questions": "Tell me about a time that one of your coworkers was doing something against policy and how you handled it."}, {"date": "13 Jul 2017", "title": "Ultrasound Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Froedtert Health (Milwaukee, WI)", "Interview Descriptions": "I applied online and was called by a recruiter less than a week after putting in the application to set up a phone interview. She basically went over my resume and qualifications step by step and asked me the usual scripted questions. As I was trying to answer questions, a child started screaming loud enough that I couldn't even hear myself talk. She apologized and said she was at home with a sick child. Not a huge deal to me, but I thought it was a little distracting and unprofessional. Overall, the interview went well, and she said I did a great job and explained the the next step in the process. She said she would send the info to the hiring manager and for me to expect a call within a week. If I hadn't heard anything, I was supposed to give her a call and she'd return my call promptly. I never received a call for a second interview, so I called her to checkin as she'd asked me to, and I never heard back from her. I was a little disappointed and unimpressed. If someone tells me they will return my call, it's my expectation that they will do that even if it's to let me know they aren't interested.", "Interview Questions": "What things do you look for in an employer?"}, {"date": "26 Jul 2017", "title": "Nurse Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Froedtert Health (Milwaukee, WI) in Jul 2017", "Interview Descriptions": "Five rounds of interviews totalling nearly 50 people. Each interview averaged 1 hour. HR started the process with a phone interview, then the director, multiple manager's, educators, and then employees for the department.", "Interview Questions": "How do you describe success?"}, {"date": "5 Aug 2017", "title": "Scheduling Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Froedtert Health in Jun 2017", "Interview Descriptions": "A good interview means absolutely nothing at this company, I believe they have already selected candidates and your application is already dead before you walk in the door. Then they let you twist in the wind for a month or two before they inform you that they hired someone else. They also request references before any interview, putting your current employer on the alert that you are looking for a new job.", "Interview Questions": "How do you deal with a difficult situation?"}], [{"date": "7 Jun 2017", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Froedtert Health (Milwaukee, WI) in Jun 2017", "Interview Descriptions": "Unfortunately, Froedtert has a habit of posting jobs which they have already scouted and hired internal candidates.   The interviews are frequently cancelled and outside candidates who would like to work there, never get the opportunity to interview for a position.", "Interview Questions": "N/A"}, {"date": "6 Apr 2017", "title": "Medical Laboratory Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Froedtert Health", "Interview Descriptions": "It was pretty relaxing. None of the questions were that stressful. The interviewers were very pleasant and seemed very passionate about their jobs. The position, however, didn't really fit what I was looking for.", "Interview Questions": "They asked a lot of situational questions"}, {"date": "2 Feb 2021", "title": "Customer Service (CSR) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Froedtert Health (Milwaukee, WI) in Mar 2017", "Interview Descriptions": "The interview was via phone and was pleasant. They have a scouting team that screens you first before you speak with a department manager or lead of the department in which you apply for.", "Interview Questions": "I can remember the questions but they were pretty common"}, {"date": "5 Jan 2017", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Froedtert Health (Milwaukee, WI)", "Interview Descriptions": "After having a phone interview it can take one to two weeks to see if you get called in for an in person interview.\r\nThe phone interview is done at a time that you choose, the caller was on time. The interview itself is very relaxed, there were no trick questions.", "Interview Questions": "The phone interview just asks the basics. What hours/ shifts do you prefer. What pay level you are seeking. What you have heard about the hospital."}, {"date": "5 Oct 2020", "title": "Rehab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Froedtert Health (Milwaukee, WI) in Jan 2017", "Interview Descriptions": "Formal, Short, and to the point.  The department leader asked some questions and gave a brief tour of the facility. The interviewer asked direct questions mostly related to patient care and multitasking.", "Interview Questions": "If I have ever had conflict with a situation at work and how I handled it."}, {"date": "18 Oct 2016", "title": "Patient Care Assistant (PCA) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Froedtert Health (Milwaukee, WI)", "Interview Descriptions": "Had a phone interview twice, both times the recruitment team was very nice and professional. They sent my info to the hiring manager and she asked me for an interview. Had the interview and she then went over my schedule and everything to see if I was the right fit for the job and they contacted me the next day with an offer!", "Interview Questions": "Have you ever had a disagreement with a coworker and if so what was it and how did you handle it?"}, {"date": "5 Nov 2016", "title": "Patient Access Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Froedtert Health (Menomonee Falls, WI) in Oct 2016", "Interview Descriptions": "I went to the interview for a full time position doing something similar, and during the interview the lady just said i really have this position for an internal applicant, but there is a position that I know you will be great at and just sounds like it may work out. She asked me if she can give the hiring manager my information. I said yes of course.  After leaving the interview about 3 hours later I received a call from that hiring manager  and set up a face to face for the following week. \r\nThe interview went seamless and they really seemed to like me. We talked about many different things i just did my best to let her know I am the right choice. .So feeling confident bc the lady told me how impressed she was... i left. About a week and half went by and I receive informations from the HR department  asking me to fill out the background check information. About 15 mins after I checked my email i received a call offering me the position.\r\nYayyyy", "Interview Questions": "Why do i want to work for the company?"}, {"date": "17 Oct 2016", "title": "Patient Access Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Froedtert Health (Milwaukee, WI) in Aug 2016", "Interview Descriptions": "Three interviews: \r\n1. The first was a phone screening with an HR representative (easy standard questions, about 15-20 minutes), \r\n2. The second was an in-person interview with the clinic manager (ten simple questions, about 10 minutes), and\r\n3. The third was an in-person interview with a physician and staff members (fairly basic questions, about 30 minutes, it was apparent that the physician was not very prepared going into the interview and had to come up with questions on the fly).", "Interview Questions": "Q: What are your strengths?\r\nQ: Why are you interested in the position?\r\nQ: Why should we hire you?  etc."}, {"date": "28 Apr 2017", "title": "Systems Education Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Froedtert Health (Menomonee Falls, WI) in Aug 2016", "Interview Descriptions": "The interview process went very smooth and quick. I was emailed with interview times and able to use an internet portal to select times that worked. Both the phone and in person interviews went well, all parties involved were knowledgeable.", "Interview Questions": "What type of instructional design models have you used? "}, {"date": "13 Jul 2016", "title": "Staff RN-Cancer Center Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Froedtert Health (Milwaukee, WI)", "Interview Descriptions": "HR conducted first interview. Asked questions that related to patient privacy. I gave example from previous employment in dialysis unit. I stated a curtain would be pulled around patient for privacy. The information was shared with my future manager as being \"not pt centered; the patient should have been moved to a private location\". Dialysis machines are not movable and so that was not even remotely possible. This would have counted against me and no further interviews would have happened had the manager not already known about who I was.", "Interview Questions": "Give an example of how you provided for patient privacy in your last position."}], [{"date": "16 Aug 2016", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Froedtert Health in Jul 2016", "Interview Descriptions": "Applied online for a couple of medical assistant positions.  Received email to ask for telephone interview. Had both interviews and was told that I will receive a call or email back with any response, no response but my applications per the website is still under review after nearly a month.", "Interview Questions": "What did you like about your last employer?"}, {"date": "21 May 2016", "title": "Nurse Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Froedtert Health (Milwaukee, WI)", "Interview Descriptions": "The interview process began with a phone screen interview with a recruiter. My information was then forwarded to a hiring manager and then I was scheduled for an in-person interview. I had the phone interview, then an in-person interview with HR, then an in-person interview with the management team. Following the in-person interviews, I was contacted by the nurse recruiter and given benefit information to review. I was asked to contact the recruiter if I reached offer status with another company so they would have time to respond. It sounded like they were very interested and I found it encouraging that I was contacted by the recruiter and given benefit information. I did as the recruiter asked and contacted her when I reached offer status with another company. I never received a response at all, and one week later I was e-mailed a stock e-mail thanking me for my interest and declining the position.", "Interview Questions": "Many typical interview questions such as greatest strength, greatest weakness. Also situational questions regarding issues with co-workers or resolving an issue with a patient and how you handled it. The interview process and questions were very structured with the phone screen and HR."}, {"date": "14 Jul 2016", "title": "Specialty Department Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Froedtert Health (Milwaukee, WI) in May 2016", "Interview Descriptions": "I interviewed with a girl who  had no information about the job I was to fill. The girl spoke broken English and I wondered if she was comprehending what I was saying. I was very disappointed in the lack of knowledge about the company and the job. It helps me to answer the questions  if I can understand the position and what the company is looking for in a candidate.", "Interview Questions": "Describe a challenging situation?"}, {"date": "13 Feb 2018", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Froedtert Health (Menomonee Falls, WI) in Mar 2016", "Interview Descriptions": "One on one at the clinic. Lasted about 30 minutes. HR department was very nice and flexible in setting up time for the interview. Loved working there but had to leave because of relocation.", "Interview Questions": "Tell us about a time when you had to deal with a difficult situation and how did you handle it. "}, {"date": "9 Jan 2016", "title": "Dispatch Clerk Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Froedtert Health", "Interview Descriptions": "Applied online through there sight. First interview was with HR and then department supervisor. Everything took a little over a month, so the process was fast. Will take longer now, though.", "Interview Questions": "Why do you want to work here?"}, {"date": "7 Oct 2015", "title": "CNA Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Froedtert Health (Milwaukee, WI) in Oct 2015", "Interview Descriptions": "I applied for this position online via their website. They emailed me back within a week of submission. I needed to take a survey of about 103 questions. The email said the application was not complete without it. The second email was to set up a phone interview with HR. They asked for three dates and times that would work. This was set up quickly. I liked how quickly and easy this process was. HR was very nice and friendly. I enjoyed speaking with her.", "Interview Questions": "What are your 3 must haves in a job?\r\nTell me about a time you went above and beyond for a patient.\r\nWhat is the absolute lowest salary you can accept?\r\nWhat is your strength?"}, {"date": "2 Jun 2016", "title": "Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Froedtert Health (Milwaukee, WI) in Oct 2015", "Interview Descriptions": "There was an HR screening interview and then an interview with the hiring manager. The hiring manager didn't have too many questions prepared and we spend the majority of the time fielding my questions on the role.", "Interview Questions": "Tell me about a time when you had to handle a difficult customer."}, {"date": "23 Jun 2016", "title": "Environmental Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Froedtert Health (Milwaukee, WI) in Jun 2015", "Interview Descriptions": "When you first arrive to the facility you will stop by HR to complete additional paperwork and get checked in. Your interviewer will then pick you up from HR and walk you to their office. Very easy and laid back. Felt more like talking to a friend then an actual interview. My inteviewer was real sweat and very likable. She understood where I was coming from when ask about past employers.", "Interview Questions": "What sets you apart from other candidates?"}, {"date": "2 Aug 2018", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Froedtert Health (Milwaukee, WI) in May 2015", "Interview Descriptions": "Phone interview with HR and basic questions followed by meeting with pharmacy manager, follow up meeting with pharmacy manager, and job offer over the phone. Once offered job, required to take drug test within 48 hours and start hiring process.", "Interview Questions": "How do you resolve intrapersonal conflicts with other employees?"}, {"date": "26 May 2015", "title": "Respiratory Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Froedtert Health (Greenfield, WI) in Apr 2015", "Interview Descriptions": "My first interview with them was over the phone.  I was called by human resources where they set up a preset time for me to receive the call.  She called me right on time and we started the interview right away.  She asked me the standard questions usually asked about strengths and weaknesses.  She also asked me behavioral type questions.  She asked several questions that hinted at how I work as a member of team or how I liked working as a collaborative member of the team.  I found it pretty hard to interview effectively this way as I could not see the person with whom I was speaking and I was also unable to read her body language in order to gauge whether I was answering her questions properly.", "Interview Questions": "Tell me why there is a gap in your employment history."}], [{"date": "20 Jan 2016", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Froedtert Health (Milwaukee, WI) in Feb 2015", "Interview Descriptions": "Applied online, went for in person with HR recruiter at office center, called again for interview with hiring manager.  Overall it was a very easy process and not intimidating at all.  Hiring manager was very easy to talk with and made me actually feel like I was talking with my friend and not interviewing Very relaxed.", "Interview Questions": "Mix of behavioral and personal questions/get to know you questions."}, {"date": "25 Nov 2016", "title": "Non Clinical Position Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Froedtert Health in Jan 2015", "Interview Descriptions": "The hiring process took far too long and did not result in a quality match for the organization or the candidate. Unqualified management played a key role in the matter.", "Interview Questions": "Explain a time when you....basic situational situational questions."}, {"date": "12 Nov 2014", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Froedtert Health (Milwaukee, WI)", "Interview Descriptions": "Froedtert's hiring process is slower and more difficult that its competitors. HR is not very approachable. I have referred friends to work at Froedtert only for them to accept another position before Froedtert HR got back to them.", "Interview Questions": "Froedtert did not ask me any unexpected questions. The interviewer was cold and disinterested."}, {"date": "10 Nov 2014", "title": "Diet Clerk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Froedtert Health in Oct 2014", "Interview Descriptions": "I applied online and the whole process has taken a month (4+ weeks).  I have not been offered yet but made it to the final peer interview, so I am waiting to hear from them.  If they are interested, a member of HR will contact you and set up a phone interview.  After the phone interview, if they feel you are a good fit they will send you directions to complete references and a survey.  The references are submitted by email to the individuals of your choice.  They must be at least two managers in your list of references.  I suggest you send a quick email, text, or call to your references to tell them to check their email and complete the reference check ASAP.  You have to complete this within 24 hours.  The survey consists of many, many, repetitive questions about yourself that you rate \"agree, slightly agree, slightly disagree, disagree\" etc.  Once this is completed you will move on in the interview process which I explain below.\r\n\r\n4 interviews total:\r\n\r\n1st - Phone interview with HR rep who asks about your employment history and a brief background about yourself.  This is really to make sure that you are a normal human being and to weed out anyone who applied for a job they don't care about.  Everyone in their HR department is extremely friendly, easy going, and give you a great first impression of what it would be like to work there.\r\n\r\n2nd - A week went by and I had an in person interview with head of food service department (she is a Dietitian) and a manager in the food service department.  They have a sheet of paper with about 10 questions on it that they ask you. Questions range from, \"tell me a time you disagreed with your manager\" and \"a patient calls and they have a hair in their soup, how do you handle the situation\" also \"what is your greatest accomplishment/success\" and \"tell me about a time you did not get along with a peer\" etc.  The head of the department is incredibly genuine and sweet and you can tell she loves her job.  We chatted about other topics as well that were individualized to me, not just interview questions, which made me feel comfortable.  I was not informed there would be any additional interviews.\r\n\r\n3rd - A week went by and I had a phone interview with who I believe was the administrative head for the department but I can not remember specifically what her role was other than she had a large role.  She called and it caught me off guard because she immediately introduced herself and asked me if she could ask a few questions regarding how well I work with other people.  If you are not great at thinking on the spot I suggest you tell them it is not an ideal time and schedule a time for them to call back.  All the questions were behavior and situation based. \"tell me about a time you disagreed with a manager and with a peer,\" \"how do you feel about unethical behavior,\" \"do you work well with many projects,\" \"do you work well with a deadline,\" etc.  I believe this interview was in reference to the survey you complete and this is a way for them to clear up any confusion they might have based on your answers that you gave.  This lasts about 30 minutes and the woman at the end of the call stated, \"well it is so clear that you truly value and enjoy working with other people.\"  It went extremely well and I was not informed there would be any additional interviews.\r\n\r\n4th - A week went by and I had an in person peer interview.  This interview was with two Diet Clerks (direct peers) and consisted of the same exact interview questions that were addressed in the first in person interview.  It was a little disappointing that the same questions were asked.  Both individuals were extremely nice but seemed inexperienced in the interview process.  The focus was on asking me the questions, making a few notes of my answers, and moving to the next one.  After the last question they stated they did not have any questions for me.  I asked them a few and that was the end of the interview.  Very, very quick interview.  One of the diet clerks stated that she would be surprised if I was not offered the job.\r\n\r\nSo far my experience has been extremely positive and I look forward to working for this hospital.", "Interview Questions": "A patient calls and states they found a hair in their soup.  How do you handle the situation? (not difficult at all)"}, {"date": "22 Jul 2014", "title": "Corporate Office Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at Froedtert Health (Menomonee Falls, WI)", "Interview Descriptions": "Had 3 separate interviews for the position. Was told I would be contacted regarding their decision after I made the top 3 candidates. Was not contacted nor notified of their decision after spending several hours of my own time interviewing in person at the office. I called to check on the status of their search and a call was never returned. They were highly unprofessional and I would not consider applying for this company in the future. I would assume that a company in the helping profession would have at least a sliver of professionalism.", "Interview Questions": "Was asked to give a presentation without any previous notice."}, {"date": "23 Jul 2014", "title": "Admitting Registrar Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Froedtert Health", "Interview Descriptions": "For the interview process you will meet with the hr manager and the admitting manager. You will also be required to take a typing test as well. Other tests are required to test your competency and abilities to process information correctly. It is a piece of cake.", "Interview Questions": "It wasn't a difficult interview"}, {"date": "9 Jul 2016", "title": "Radiology Technologist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Froedtert Health (West Bend, WI) in Jun 2014", "Interview Descriptions": "I was first contacted by HR and had a phone interview. Next I meet with the hiring manager and staff members. I was later called back for an additional interview. HR contacted following that interview and offered me the position.", "Interview Questions": "How would you react to an angry patient."}, {"date": "17 May 2014", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Froedtert Health", "Interview Descriptions": "It took about a month from the time I submitted my application for HR to call with an interview request. Took another 2 weeks to be offered the job. Now that I work here I see how slow HR is. Physical examine and proof of vaccinations are required for employment as well as drug testing. There was a two day hospital orientation. The rest of my training was in my unit.", "Interview Questions": "Nothing was unexpected."}, {"date": "2 Dec 2014", "title": "Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Froedtert Health in May 2014", "Interview Descriptions": "The initial interview involves speaking with the HR recruiter and then later receiving a formal invitation to interview. The first round interview was a little odd since it became a double interview at the time as another interviewer joined seeking someone for a similar position, At this point, the interview became an audition to impress one or both interviewers for two possible jobs.", "Interview Questions": "How would you behave under XYZ circumstances with ABC resoruces? How does that apply to what you believe will be assigned to you here?"}, {"date": "27 May 2014", "title": "Office Assistant Support Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Froedtert Health (Menomonee Falls, WI) in Feb 2014", "Interview Descriptions": "Got a call to set up an interview. Interview took an hour. Interviewed with the recruiter and than the manager. Didn't hear back from them at all and kept checking my application online to find out job has been reposted.", "Interview Questions": "All questions were fairly easy"}], [{"date": "20 Jan 2014", "title": "Radiology Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Froedtert Health", "Interview Descriptions": "The whole process took a few months due to one of the hiring managers being on maternity leave and coming back right in the middle of the hiring process.   I had several interviews (4 TOTAL) with various people before being offered the position.   I thought the hiring process took a very long time!", "Interview Questions": "Of course there were the usual get to know you questions but then there were lots of situational questions ie \"tell me a time that....\"  \"what would do do if...\"  etc.  There were no unexpected questions."}, {"date": "20 Jul 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Froedtert Health (Milwaukee, WI) in Jan 2014", "Interview Descriptions": "It was short and exciting. They all were very nice and understanding to all of my answers. They don't make me feel intimidated. They did not ask questions that could not be answered. They came off as normal everyday people that I would love to work with.", "Interview Questions": "Was there every a time were you regretted something?"}, {"date": "19 Oct 2018", "title": "Housekeeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Froedtert Health (Milwaukee, WI) in Jan 2014", "Interview Descriptions": "It was fast professional they told me about the company I also told them about myself it went great I've had tours met staff seen the location I'll be working was able to do drug test also tb testing I got asked about my strength and weakness n answered truthful n professional", "Interview Questions": "What could I bring to froedtret "}, {"date": "7 Aug 2013", "title": "Industrial Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Froedtert Health", "Interview Descriptions": "There will be two rounds of interviewing.  The first includes a basic meeting with the hiring manager and HR manager.  Standard format, not many twists or turns.  The second round interview is a case study in a panel discussion format with the current team members.", "Interview Questions": "Analyze data provided during the interview and tell the panel what you think of the provided case study."}, {"date": "14 Nov 2013", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Froedtert Health (Wauwatosa, WI) in Aug 2013", "Interview Descriptions": "The hiring process was very basic.  All of HR was very friendly. I first interviewed with one person in HR and then had a panel interview with 3 managers in the department I had applied to work in. The interview seemed very natural with a minimum amount of pressure.", "Interview Questions": "I dont recall being asked any questions being unexpected or difficult."}, {"date": "10 Apr 2013", "title": "Nursing Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 days. I interviewed at Froedtert Health", "Interview Descriptions": "St. Joseph's Hospital - West Bend, WI\r\n\r\nI applied online and recieved an email the next day requesting a phone interview. The woman from HR called on time, and was relaxed and friendly. The questions I was asked were a bit tedious, though; almost all could be answered by actually reading my application or resume. She did give me ample time to answer and elaborate and ask any questions. I got the impression the point of the interview was to convince me to work second or third shift.", "Interview Questions": "Nothing was difficult or unexpected."}, {"date": "16 Nov 2012", "title": "Clinical Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Froedtert Health (West Bend, WI)", "Interview Descriptions": "Went through HR for first interview. Basic questions asked ie what would you do in this situation, name a time when _____ and what did you do? Then met with RD's separately. Took a while to hear back from anyone on position. I waited about a month before receiving a response", "Interview Questions": "They were all very basic. A lot of the questions were repeated, just in different words. "}, {"date": "21 Mar 2011", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Froedtert Health (Milwaukee, WI) in Jan 2011", "Interview Descriptions": "I saw the position on the hospital's website, and a former colleague recommended me to the hiring manager.  My first interview with the HR department was scheduled promptly and went well; the follow up interview with the hiring manager a couple of weeks later also seemed to go well.  However, there was also a \"peer\" interview with a group (5 -6 ) of employees who were not peers but were actually supervised by this position.  Questions seemed way out in left field and the whole set-up did not seem quite appropriate.  I was scheduled for yet another interview with a physician team at least a month later.  However, by the time I walked into the last interview, it was pretty clear within minutes that the hiring manager had actually already selected another candidate and this was a sham interview.", "Interview Questions": "\"What do you like to do for fun at work?\"  (Asked by a member of the \"peer\" interview team, all of whom are actually direct reports to the position I was interviewing for.)"}, {"date": "20 Sept 2011", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Froedtert Health (Milwaukee, WI) in Feb 2009", "Interview Descriptions": "I was hired through a recruiter.  The first step was to meet with the recruiter to discuss the position and evaluate if the job fit both the company's and my needs.  The second step was an HR interview which involved the standard questions such as: list your strength, weaknesses, why do you want to leave your job, ect.  The third interview I talked with with the hiring manager and the Service Desk manager.  The questions were laid back and easy to discuss.  The hiring manager admitted he was more interested in someone who's personality would fit rather than the experience.  After about 45 minutes, we walked around the IT department as he showed the layout of the organization, occasionally throwing more questions around.  Near the end, we met with the person I would replace, as he gave me some very specific questions to the application I would support.", "Interview Questions": "What are your short term goals?"}]]