[[{"date": "12 May 2023", "title": "Field Experience Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Point Loma Nazarene University", "Interview Descriptions": "I applied for one position as a secretary, and they called me back a few days later and recommended me for another, so I decided interviewed for this position. They asked me a few questions to get to know me better, like why I was interested in working for the education department and what drew me to Point Loma. I was then emailed an interview date a few days later. The interview was a panel format with 12 questions. It was held on Zoom. The interviewers opened up with prayer, which made the whole experience more comfortable. It was very nice experience, and the interviewers were very friendly.", "Interview Questions": "Tell us about your faith journey. Why drew you to Point Loma? What skills/experience do you bring to this position? How do you handle situations with a person who may be angry with you. Tell me something about yourself that's not on your resume."}, {"date": "13 Sept 2022", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Point Loma Nazarene University", "Interview Descriptions": "Met up for coffee with the department head, nice and friendly interview, she seemed to care about me as a person vs. just a candidate. Didn't end up getting the position, but was able to connect with the department head on LinkedIn and she even sent me a different position she thought might interest me.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "6 Jun 2022", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Point Loma Nazarene University", "Interview Descriptions": "Very long and drawn out. Really consider whether it’s an environment that you want to work in before you commit this amount of time to the process. I love the school but it has become very liberal and base their hiring on that as well.", "Interview Questions": "They will ask you about specific sales force software "}, {"date": "25 Jun 2021", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Point Loma Nazarene University", "Interview Descriptions": "I went to the building and spoke to the hiring manager who asked me to come in for an interview. The interview felt a little challenging since some questions related to the job were asked. However, the hiring managers were very welcoming to the potential candidates.", "Interview Questions": "Can you tell us about yourself?"}, {"date": "29 Aug 2020", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Point Loma Nazarene University", "Interview Descriptions": "Panel Interview asking basic questions about yourself and office culture. There were three other employees interviewing me at the same time which included who would be my supervisor and two other employees I would potentially be working with.", "Interview Questions": "Tell me about yourself, describe a positive work environment, and situational questions "}, {"date": "19 Jul 2019", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Point Loma Nazarene University", "Interview Descriptions": "5 people panel interviewed 4 candidates, gave scenarios and asked how we would approach the situations. Everyone took turns being first to answer. Being honest and answering based on personal experience helps", "Interview Questions": "How has your experience prepared you for this position?"}, {"date": "14 Jan 2023", "title": "Yearbook Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Point Loma Nazarene University (San Diego, CA) in Apr 2019", "Interview Descriptions": "Smooth process with department heads of LJML. They ask questions about vision for the yearbook, how will you lead a team, how to handle conflict, and your work style. Can be a little intimidating having several people in the room asking questions, but they were all there to support you and encourage you.", "Interview Questions": "What is your work style? How do you handle conflict within a group? How do you see yourself leading a team? How well do you work under pressure? What is your vision?"}, {"date": "13 Nov 2018", "title": "Associate Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Point Loma Nazarene University (San Diego, CA) in Oct 2018", "Interview Descriptions": "The interview process was pleasant and quality, equally focused on both the organization, individuals and candidate. There was time for questions after. Receptionist was very friendly and encouraging. Very down to earth and kind group.", "Interview Questions": "Why did you apply with the University?"}, {"date": "5 Nov 2021", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Point Loma Nazarene University (San Diego, CA) in Oct 2017", "Interview Descriptions": "I interviewed with groups of staff plus faculty members and administrators as well as the president. It is a beautiful campus with friendly people, and the students are very good, too.", "Interview Questions": "Why are you interested in the position, what your prior experiences were, how you would approach certain situations, etc."}, {"date": "28 Mar 2017", "title": "Systems and Security Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Point Loma Nazarene University (San Diego, CA) in Mar 2017", "Interview Descriptions": "Phone interview and Panel interview.  Interview went well and the IT staff seemed great.  One hiccup was the salary was low.  It would have been a 23k drop in pay.", "Interview Questions": "Religious Beliefs"}], [{"date": "26 May 2019", "title": "Alumni Engagement Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Point Loma Nazarene University (San Diego, CA) in Feb 2017", "Interview Descriptions": "The Application was easy to fill out and I was contacted shortly after applying to come in for the interview. I interviewed in from of 5 employees from the department.", "Interview Questions": "Do you have experience with database management?"}, {"date": "25 Sept 2017", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Point Loma Nazarene University (San Diego, CA) in Jan 2017", "Interview Descriptions": "You were video recorded while 2 to 4 people asked you questions.  The video was for the director to evaluate and he/she would decide for a second interview.  The second interview is less stressful because they are no longer recording you and are just eager to talk to you again about the position.", "Interview Questions": "They want to know your experience"}, {"date": "22 Oct 2015", "title": "Assistant Director of Corporate Education Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Point Loma Nazarene University", "Interview Descriptions": "The interview was short. I went to two interviews one with who I would report to and the other was with the Dean. The process was very smooth and fair. I felt that PLNU's interview process was very professional and process oriented.", "Interview Questions": "What are your best/favorite accomplishments?"}, {"date": "22 Sept 2019", "title": "ASB Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Point Loma Nazarene University (San Diego, CA) in May 2015", "Interview Descriptions": "I applied for the job thorugh a friend's recommendation and was soon scheduled for an interview after submitting my application. Met with ASB Director and previous year graphic designer for the interview to discuss the job qualifications and expectancies of work to be produced.", "Interview Questions": "What is your design process like?"}, {"date": "31 Jan 2015", "title": "Community College Site Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Point Loma Nazarene University", "Interview Descriptions": "I received an email the day I applied inviting me to interview for a job that I didn't apply for. Received another email right after correcting the mistake. Set up a time for a phone interview. Waited for 45 minutes and did not receive a call. Contacted the person who set up the interview and she said the hiring manager was free now or on Friday. I was a little turned off and didn't respond. On Friday I got a call even though I did not confirm the time for an interview. The next week, the initial person I dealt with emailed me saying I missed my phone interview (even though I never confirmed it) and was I still interested?\r\n\r\nAbout a month later, I get a call/email from a student worker looking to set up my second interview! Very strange. I understand making mistakes and running late but this just seemed beyond disorganized and also having someone wait for 45 minutes without calling them doesn't show that they feel their time is important. This position also had a lot of responsibility but was low balled with the \"coordinator\" title so that it would pay less. Between that and the other things, no thanks.", "Interview Questions": "N/A"}, {"date": "22 Feb 2017", "title": "Director of Outdoor Leadership Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Point Loma Nazarene University (San Diego, CA) in Jul 2014", "Interview Descriptions": "I submitted an on-line application, had a phone interview with direct supervisor, I flew out to San Diego for an on-site interview with VP, direct supervisor, student panel, student development panel, and I gave a presentation to 25 student development professionals.  They put me up at the Humphrey's hotel on shelter island.", "Interview Questions": "Can you build/ create academic programs?"}, {"date": "23 Aug 2009", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at Point Loma Nazarene University in May 2008", "Interview Descriptions": "Interview with Director,Ass.Director, and Senior Counselor then came back the next day for a group interview and presentation. They then did a thorough background check which took about a week and a half. After that was cleared I was offered employment.", "Interview Questions": "How do you handle difficult situations in the office or things that are uncomfortable?"}]]