[[{"date": "1 Jun 2023", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at West Chester University (West Chester, PA)", "Interview Descriptions": "I reached out to the Learning and Resources Center about the job. They emailed me about scheduling an over the phone interview. During the interview they confirmed that I had received a good grade in the class I was to tutor and asked a few basic questions.", "Interview Questions": "What experience do you have teaching or tutoring? How do you remain organized?"}, {"date": "4 Nov 2022", "title": "Clinical Psychologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at West Chester University", "Interview Descriptions": "Interview with current psychologists on staff. Asked a set of standard questions that are the same for each interview. Clinical case vignettes were used to assess clinical thinking. This was a good interview process.", "Interview Questions": "How would you approach this case?"}, {"date": "1 Jun 2023", "title": "Masters Student Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at West Chester University in Nov 2022", "Interview Descriptions": "Email - receive from hiring Call - schedule a good time Interview - Zoom video offer - accept/decline cannot say it can be the same process for everyone, also ask them relatively questions as you want to know.", "Interview Questions": "IST troubleshooting questions? Basic Internet functioning Basic hardware troubling Printer setup"}, {"date": "27 Oct 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at West Chester University", "Interview Descriptions": "It was average difficulty. I really liked the interviewer! It was over zoom due to the covid pandemic. I’m being forced to sign up for Glassdoor in order to use the website and I strongly dislike it", "Interview Questions": "They asked many things I don’t like this website"}, {"date": "12 Aug 2020", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at West Chester University", "Interview Descriptions": "We had a series of group interviews, overall it was a great experience and low pressure.  Come prepared and look business professional, make sure to bring extra copies of your resume.", "Interview Questions": "Tell me about your strengths and weakness"}, {"date": "21 Jan 2020", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at West Chester University", "Interview Descriptions": "I was provided a set of questions about technology and had to fill out a form. I also was interviewed by the ResNet head and his assistant. Easy interview process to be honest.", "Interview Questions": "Whats a cat 5e cable?"}, {"date": "17 Jan 2020", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at West Chester University", "Interview Descriptions": "Process included application submission with cover letter and reference list followed by phone interview followed by a campus visit if you were a top candidate. They didn't ask very many questions and kept asking me to ask questions which suggested toe they were wasting my time.", "Interview Questions": "How have you encountered and approached diversity in your work?"}, {"date": "23 Aug 2022", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at West Chester University in Jan 2020", "Interview Descriptions": "4 people group interviews with a discussion piece. Then a group work activity where you are judged on working with others. The second part seems useless but just try to show how you work in different situations.", "Interview Questions": "How would you contribute to the wcu community?"}, {"date": "3 Feb 2020", "title": "Night Custodian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at West Chester University (West Chester, PA) in Jan 2020", "Interview Descriptions": "It went pretty well. The Manager was very personable and the interview was conducted more like a conversation. He then ordered a backround check and a start date a few weeks away.", "Interview Questions": "What is one time you went above and beyond for a customer?"}, {"date": "16 Dec 2019", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at West Chester University", "Interview Descriptions": "Phone interview, in person interview, skills test were used for the interview process. From start to finish the process took about 2 weeks. It was an average interview, nothing unexpected was asked.", "Interview Questions": "No unexpected questions."}], [{"date": "27 Jul 2022", "title": "Human Resources Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at West Chester University in Jul 2019", "Interview Descriptions": "Very structured, group interview.  Well thought out questions that could easily help me be compared to other candidates.  Group consisted of co-workers and managers from the HR department.  Time was about an hour or so.", "Interview Questions": "Typing test required for position"}, {"date": "18 Mar 2021", "title": "Undergraduate Admissions Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at West Chester University in Jan 2019", "Interview Descriptions": "Extremely nice, Accommodating staff, Willing to adjust job to internship, Placement within different aspects of the office. The interview was fairly casual, and just was a nice way to be introduced into the staff and the culture of the office.", "Interview Questions": "What do you want to get out of your time working in undergraduate admissions?"}, {"date": "28 Jul 2018", "title": "Executive Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at West Chester University (West Chester, PA)", "Interview Descriptions": "Phone interview conducted first, then I was called back for a finalist interview. The finalist interview was an all day event with a number of different panels as well as a presentation and Q&A with stakeholders as well as a one on one lunch with the dean. Overall an enjoyable experience. Was one of 3 finalists and was given a timeline for a decision - when that came and went after a few weeks I emailed a follow up and was told one of the other candidates had been offered accepted the position. It would have been nice to have received that update without having to follow up on my end.", "Interview Questions": "A variety of questions asked on different topics related to the position"}, {"date": "29 Jan 2018", "title": "IT Security Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at West Chester University", "Interview Descriptions": "Panel interview. Questioners read from a paper of pre-determined questions. Showed little interest & asked almost no follow-up questions. I got the distinct impression that I was a place holder candidate & someone else was already selected for the position. Received a turn down letter within a week.  A small bit of Googling revealed the candidate who was hired -- a student intern without the industry experience & certifications that are standard for these type of positions. Hard to believe that was the most highly qualified candidate.\r\n\r\nAdvice: Don't bother to apply for IT related positions. They are clearly not serious about their hiring practices. Good luck to them.", "Interview Questions": "General questions related to the job description & a couple of behavioral questions thrown in."}, {"date": "18 Mar 2018", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at West Chester University (West Chester, PA) in Jan 2018", "Interview Descriptions": "Applied online and got a Skype interview with three people from the department. The  questions were round robin and  read directly from a paper.  The panel looked bored to say the least.  No follow up questions.  \r\n\r\nIt was obvious they were hiring from within and this was just a check mark on their list.    Didn't receive a \"thanks but no thanks\" until TWO MONTHS later.  \r\n\r\nGoolged who they hired and it was an adjunct.  Yep,  thanks for wasting my time.   Of course, their qualifications are lacking but that's their problem.  \r\n\r\nDon't apply for a professor position unless you're adjunct.", "Interview Questions": "Identify a creative approach to your teaching style.  "}, {"date": "20 Oct 2017", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at West Chester University", "Interview Descriptions": "You apply online with your resume and preferences. You have to get 3 reccomendations and then you go through 4 group interviews where a panel of 4 residence life staff interviews 4 students together. You have to create a visual aid for the interviews that describes who you are and you have a minute to present it at each interview. Then there is a group processing day where you do team building activities and you are evaluated during them. If you miss any deadlines, you are out of the running.", "Interview Questions": "Talk about a time you had to deal with a difficult situation working in a group"}, {"date": "1 Nov 2017", "title": "Field Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at West Chester University (Phila, PA) in Oct 2017", "Interview Descriptions": "After submission on line, an email was sent to set a phone interview. When that was determined to be positive, a panel interview was scheduled with preferred dates. That took one month to schedule. The panel was open to discussion but raised difficult questions.", "Interview Questions": "Scenarios for the position"}, {"date": "25 Feb 2019", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at West Chester University (West Chester, PA) in Oct 2017", "Interview Descriptions": "Phone interview followed by on campus interview.  The hiring process took a little over a month.  Orientation took almost 3 months.  Background check and finger printing was required.", "Interview Questions": "Experience working in admissions?"}, {"date": "6 Mar 2017", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at West Chester University", "Interview Descriptions": "There are about 5 panel interviews, with usually 4 RDs/GAs conducting the interview and 5 people being interviewed. The interviewers conduct these interviews back to back so many can seem disinterested in your answers, thus having a relevant and memorable answer is quite helpful.", "Interview Questions": "What are some of your concerns with working as a Resident Assistant (especially in regards to the work/school/life balance) and how will you handle those if hired?"}, {"date": "29 May 2019", "title": "Digital Media Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at West Chester University (West Chester, PA) in Jan 2017", "Interview Descriptions": "I applied through the school and there was one in-person interview with the Associate Director. Questions about your experience and some questions about social and the University's aesthetic. I heard back via email about a week later offering me the internship!", "Interview Questions": "What are some of the social accounts that I have worked on?"}], [{"date": "25 Oct 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at West Chester University", "Interview Descriptions": "you need to know someone to get a job. its basically an easy interview, they understand you are a student and it is perfect for students looking for a non pressure job.", "Interview Questions": "N/A"}, {"date": "18 Jan 2016", "title": "Student Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at West Chester University (West Chester, PA) in Apr 2014", "Interview Descriptions": "First, theres an online interview stream with prerecorded questions and the second interview is with 2-3 students and 2-3 administrators. It seems overwhelming at first but everyone is nice and welcoming. You become comfortable in no time. The questions were straight forward", "Interview Questions": "Are you more productive in an independent role or on a team?"}, {"date": "26 Mar 2014", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at West Chester University", "Interview Descriptions": "You need an three letters of recommendation (from faculty, current resident assistant and former employer), complete a survey/application, write an essay why you are interested in becoming an RA - Interview process is a series of 5 group interviews. Make sure you shine!", "Interview Questions": "There was no real hard question - I guess why do you want to be an RA?"}, {"date": "15 Nov 2015", "title": "Lead Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at West Chester University (West Chester, PA) in Jan 2014", "Interview Descriptions": "A bit overwhelming. Must be prepared with solid research proposal. IRB approval is difficult and tie consuming to achieve. But once you begin the research it is exciting. Must meet with lead professor and explain hypothesis and plan for data collection. Must then go through IRB approval process. SONA system can be helpful.", "Interview Questions": "How do you intend to research this topic?"}, {"date": "18 Jan 2017", "title": "Resident Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at West Chester University (West Chester, PA) in May 2013", "Interview Descriptions": "Great people to talk to. It was more of a conversation. I was nervous for a lot of interviews but this one was different. The in person interview was extremely relaxed for me. The process was formal with informal portions. I loved interviewing here.", "Interview Questions": "Tell us why West Chester University?"}, {"date": "18 Oct 2017", "title": "Psych Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at West Chester University (West Chester, PA) in Jan 2013", "Interview Descriptions": "Minimal - someone had a health emergency and I was brought in last minute. They asked about my degrees and my teaching experience. It was a temporary hire until they could sort out an emergency with another professor.", "Interview Questions": "Are you available tomorrow? What is your background and education?"}, {"date": "31 Jul 2013", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at West Chester University (West Chester, PA) in Apr 2009", "Interview Descriptions": "Initial communication was in response to an application for the job. It was somewhat of  a phone interview. I was invited to the campus a couple of months after this for  a full three day interview including a teaching demonstration", "Interview Questions": "Someone asked me about feminist theory - a little outside my field"}]]