[[{"date": "5 Jan 2023", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UAB Medicine", "Interview Descriptions": "Be prepared to answer questions about yourself and what would make you a good addition to the team. There may also be a second-round interview that goes more in-depth into the role that you are applying for.", "Interview Questions": "What is your prior experience?"}, {"date": "3 Nov 2022", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UAB Medicine", "Interview Descriptions": "I interviewed for a nurse practitioner position thiz past summer. I completed a Zoom panel interview with 3 other people. They sounded excited about me, so I was invited to complete a shadow day in the ICU. I drove from out of town to do this shadow day. When I got there, no one even knew I was coming. I was given a tour of the unit and the unit's protocols were explained to me. Other than that, I sat looking at the walls of the office, because everyone was too busy charting. That night, I drove back home, and I haven't heard from anyone since. It has been 3 months. No one even responded to my follow-up email. This was very unprofessional on the ICU and UAB's part (bad communication seems to be rampant with the ICUs from another past experience). Also, from seeing the unit's lack of diversity in person in terms of your APPs and overall staff, I was never going to get the job anyway. I dodged a bullet.", "Interview Questions": "Why do you want to work at UAB? Are you willing to commute?"}, {"date": "12 Nov 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at UAB Medicine in Nov 2022", "Interview Descriptions": "20 minutes interview via zoom. Pretty straight forward. Ask what is my strength and weakness. What is my long term plan. I received the result of the interview on Monday of the following week.", "Interview Questions": "What is your strength and weakness"}, {"date": "15 Aug 2022", "title": "Social Worker Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at UAB Medicine (Birmingham, AL)", "Interview Descriptions": "The interview was done over online video-I suspect this is due to Covid. The interview was me and 5-6 people that worked together in the department I was applying for. It was very conversational/informal in style…they asked me the normal questions like tell me about yourself/strengths/weaknesses. The whole time they kept stressing how they all took pay cuts to work in the program I was applying for and how worth it was because of the life/work balance. When I finally realized how little they were going to pay me (which wasn’t until the second interview and was In person at the facility and felt more like a tour than an interview) I was gobsmacked and immediately decided I wasn’t taking the job. I didn’t go into social work expecting to make tons of money but it was actually so low I wouldn’t have been able to pay bills and I have a masters degree. Expected more from such a prestigious place such as UAB.", "Interview Questions": "Tell me about yourself/elevator pitch"}, {"date": "18 Jul 2022", "title": "Medical Social Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UAB Medicine", "Interview Descriptions": "Interview was a panel interview--this went well.  Then they had me shadow a half day, I thought it went well.  I didn't get the offer which of course happens, no biggie. But my main complaint is that no one ever contacted me to tell me I didn't get the job-- I received a phone call from a department that I didn't even apply to which was NOT the schedule that worked for me (I had actually applied for the shift that worked for me)  and they \"invited me to apply to this position.\" I politely declined stating that I can only work this specific shift of the job that I had actually applied for.  Then the next day I receive an email stating I didn't get the job.  Left a bad taste in my mouth.  HR needs some work on communication.", "Interview Questions": "they started the interview by stating it's a very informal interview and multiple people in different departments  asked me questions about my social work experience, case management experience, and crisis intervention"}, {"date": "13 Apr 2022", "title": "Sterile Processing Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UAB Medicine", "Interview Descriptions": "Very informative, dedicated to the education of employees, cares about patients, work life balance, growth opportunities, great place to work,  learn and grow, diversity, cutting edge,  new technology, research driven.", "Interview Questions": "Why are should I pick you for the position. "}, {"date": "13 Apr 2022", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at UAB Medicine", "Interview Descriptions": "My interviewer was very easy to follow an detailed. He explained the job process and day-to-day so well.  The culture here is very well much community like. You’ll love the work environment.", "Interview Questions": "Tell us your job history"}, {"date": "3 Mar 2022", "title": "Call Center Remote Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at UAB Medicine (Birmingham, AL)", "Interview Descriptions": "I did my first interview it was ok then I did my second interview and I have 3 interviews on zoom I explained my skills and everything and  I had have the requirement they was looking for idk what else do they want I even had a degree experience from working in the call center Uab have play favoritism", "Interview Questions": "Tell little about about your self"}, {"date": "6 Feb 2022", "title": "PATIENT ENCOUNTER SPECIALIST Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UAB Medicine", "Interview Descriptions": "Interview process was wonderful and laid back. I really enjoyed the team that interviewed me. Very welcoming atmosphere. They were really interested in getting to know you and lasted about 30-45 mins", "Interview Questions": "What would be some characteristics someone would need to have in this role? "}, {"date": "17 Jun 2022", "title": "ICU Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at UAB Medicine (Birmingham, AL) in Feb 2022", "Interview Descriptions": "I was a student and Shadowed the nurse manager for the day, discussed the job and career goals throughout, was offered the job unofficially at the end of the day.", "Interview Questions": "What my future education goals post grad were"}], [{"date": "17 Feb 2022", "title": "Bio Statistician I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at UAB Medicine (Birmingham, AL) in Feb 2022", "Interview Descriptions": "directly get interviewed by professors and they are very supportive.  During the interview process, they asked me to pass the SAS base exam. Looks like SAS is the main software they use.", "Interview Questions": "basic statistical questions and SAS take-home questions."}, {"date": "22 Mar 2022", "title": "CRC II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UAB Medicine (Birmingham, AL) in Oct 2021", "Interview Descriptions": "Straight forward interview process: It is panel style with 3-4 individuals. It is fairly informal and casual, but still professional. Standard questions about background and future goals and thorough explanation of job role is provided.", "Interview Questions": "Do you have a background in clinical research/ working with clinical trials?"}, {"date": "7 Dec 2021", "title": "Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at UAB Medicine in Oct 2021", "Interview Descriptions": "The interview process was a bit confusing. I had a zoom meeting which was the first interview and then a second interview in-person. I was asked similar questions during both", "Interview Questions": "They asked me to Describe my work ethic "}, {"date": "24 Jun 2021", "title": "Enterprise Administrative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UAB Medicine", "Interview Descriptions": "Face to face interview with the whole team. They asked questions, I answered. I answered honestly and unfortunately(or maybe fortunately) that meant I did not get the job. They assumed I lied about multiple answers.", "Interview Questions": "Are you ok not smoking/ complying with UAB health guidelines?"}, {"date": "12 Jul 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at UAB Medicine (Birmingham, AL) in Jun 2021", "Interview Descriptions": "Mostly phone interview from the unit manager, went in for a tour of the unit and to meet staff, received an offer the same day, it was one of the easiest interviews ever. Just hope the job is good.", "Interview Questions": "Tell me about yourself was mainly it. It was more of a conversation"}, {"date": "5 Feb 2021", "title": "Registered Respiratory Therapist (RRT) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at UAB Medicine (Birmingham, AL) in Jan 2021", "Interview Descriptions": "Interview was relaxed with typical interview questions. Manager was nice and on time. Because of the pandemic, my interview was over zoom. I would rather have interviewed in person.  Base pay is decent for RRT PRN.", "Interview Questions": "Tell me about yourself. \r\nWhy do you want to work at UAB \r\nHow is your temperament \r\nHow do you resolve conflict "}, {"date": "12 Mar 2021", "title": "CRC I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UAB Medicine in Jan 2021", "Interview Descriptions": "I received an email to schedule an interview and had the first interview with the PI. Then received another email for a second interview with members of the team which lasted for like 30 mins.", "Interview Questions": "What do you hope to get out of this job?"}, {"date": "16 Jan 2021", "title": "PATIENT ENCOUNTER SPECIALIST Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UAB Medicine (Birmingham, AL) in Nov 2020", "Interview Descriptions": "The interview process was great. Of course they have to make sure you get set up with employee health to ensure you have a flu shot. They even checked to see that I was immune to Hep B. I wasn’t. Which they gave me a free vaccine for. Standard interview questions. Although HR said salary would range between $13-16 they did not honor that and was slightly lower ( even after trying to negotiate). I have a masters degree and so it’s not a long term role.", "Interview Questions": "What about this position drew your attention? "}, {"date": "26 Aug 2020", "title": "Certified Medical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UAB Medicine (Birmingham, AL)", "Interview Descriptions": "During the pandemic first it’s a Phone screen then you’ll receive an offer from HR. Turn around time approximately 2 weeks.  Interview fairly easy no pressure just be present your best self. Virtually interviews", "Interview Questions": "Where do you see yourself in 5years "}, {"date": "17 Oct 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UAB Medicine (Birmingham, AL) in Jul 2020", "Interview Descriptions": "I had a phone call screening then in person interview. It was all within a weeks time. The phone call was pretty much the interview, and the in person was more of a formality.", "Interview Questions": "How would you handle a difficult situation?"}], [{"date": "13 Aug 2020", "title": "Pharmacy Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at UAB Medicine in Jun 2020", "Interview Descriptions": "I sent in my online application through taleo. Within just a few days to a week, UAB Human Resources emailed me to schedule a virtual interview with a UAB pharmacy interview panel. The interview went well but it turned out they wanted a full time flex versus a part time flex tech position that I would need while in school.", "Interview Questions": "What is your biggest weakness?"}, {"date": "13 Feb 2020", "title": "Compliance Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at UAB Medicine", "Interview Descriptions": "Formal panel interview with several members of the compliance department from top to bottom stakeholders. Much of the interview consisted of key members describing what was needed as the organization was making structural change giving the compliance department a heavier workload.", "Interview Questions": "In what ways have you analyzed and used data sets to draw conclusions for a specific purpose?"}, {"date": "8 Nov 2018", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UAB Medicine (Birmingham, AL) in Oct 2018", "Interview Descriptions": "The interview went good. Very nice supervisor. She asked easy questions and was very friendly and professional.  She even showed me around the unit and gave me the chance to ask any question or concerns I might have.", "Interview Questions": "What is one of my strengths "}, {"date": "10 Sept 2018", "title": "Computer Programmer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UAB Medicine (Birmingham, AL)", "Interview Descriptions": "depends on what department you interview with it vary based on position and skill level and the position you have to get the money you can send to your kids and they are looking for something else", "Interview Questions": "N/A"}, {"date": "16 Aug 2018", "title": "PATIENT ENCOUNTER SPECIALIST Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UAB Medicine (Birmingham, AL) in Aug 2018", "Interview Descriptions": "I was emailed to call and schedule a face to face interview. I was interviewed by two really nice nurses over the department. Simple questions were asked...(how do you deal with stressful patients?) We talked and laughed (for 30mins) and lucky for me the job needed to be filled immediately so my interview ended with a nurse saying he will contact HR and tell them to call me to make an offer. It’s been two days and I have yet to hear from HR but I checked my job status on the website and it states that they are currently running a background check.  I was told there will be a week of orientation/training before working as well. I was basically talked to as if I had the job. I put I was offered the position because technically I was... BUT I’m nervous about the credit check , it’s listed in the job qualifications that you have to pass to be considered (idk if they have ran it or not). I believe I have the job from the way the conversation went but looks like it’s up to HR to clear me. My credit is “Fair” but idk what they are looking for, it was not brought up during the interview.  \n\n\nAdvise: just apply and check the job listings daily, smile A LOT during the interview, have a solid resume (I was complimented on how well my resume is), and don’t give up UAB is very competitive but a great company to work for.", "Interview Questions": "How would you deal with coworker conflict"}, {"date": "17 Aug 2018", "title": "Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UAB Medicine (Birmingham, AL) in Apr 2018", "Interview Descriptions": "Easy and fast process.  I submitted my online application, was contacted within two weeks of applying and scheduled an interview shortly therafter.  I was made an offer but unfortunately my circumstances changed and could no longer take it.", "Interview Questions": "What is your best quality?"}, {"date": "6 Feb 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UAB Medicine", "Interview Descriptions": "Apply online, have interview with unit manager, wait on HR to call with salary, accept/deny offer. Interview process was same as any other hospital. If you are going into leadership, you will have a panel interview.", "Interview Questions": "Tell me about yourself"}, {"date": "8 Dec 2017", "title": "Patient Access Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UAB Medicine (Birmingham, AL) in Nov 2017", "Interview Descriptions": "This was a fast process i did the application and the next week receive a call from HR to come in for an interview. I interviewed with three women they were all very nice. The next week i received a offer.", "Interview Questions": "Simple behavior question?\nWhy would i like to work there?"}, {"date": "18 Feb 2018", "title": "Medical Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UAB Medicine in Nov 2017", "Interview Descriptions": "I was offered an interview to come in within a few days of applying. Assignment information was given at that time and all of my questions were answered then. I did have to wait an hour to be seen though, even after arriving earlier than the scheduled time agreed apon", "Interview Questions": "What computer programs are you efficient in?"}, {"date": "14 Apr 2017", "title": "Clerical Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UAB Medicine (Birmingham, AL) in Apr 2017", "Interview Descriptions": "You apply all over the place. Different jobs. You don't get them. You don't know why. You get an interview occasionally. You go. I have to say that it seems to me that in this company interviewers are too warm. It leads one to think she has a chance. I think they need to work on their poker faces. It may be a Southern thing.", "Interview Questions": "Why do you want this job?"}], [{"date": "14 Feb 2017", "title": "PATIENT ENCOUNTER SPECIALIST Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at UAB Medicine (Birmingham, AL) in Feb 2017", "Interview Descriptions": "I applied online January 11th. Then I was called in to take the typing test and data entry a week later. I received a second phone call two weeks later for an interview. The second interview was the next day. A week and a few days later I received an offer.", "Interview Questions": "What is your definition of teamwork? "}, {"date": "7 Feb 2017", "title": "Lab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at UAB Medicine (Birmingham, AL) in Dec 2016", "Interview Descriptions": "I applied in August and got the job in January of the following year. Yes, it takes very long and yes, the process in lengthily. Also, UAB constantly upload and then delete job postings always. So keep applying and when you forgot about it, they'll call.", "Interview Questions": "Typical Lab questions, you'll be taught despite your experience."}, {"date": "4 Nov 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at UAB Medicine (Birmingham, AL) in Oct 2016", "Interview Descriptions": "got a call from the administrator to put in an application in order to begin the interview process. Once they received the application called me to come in to interview with all the staff. I interviewed with all staff but felt like I was just an affirmative action type interview just to interview someone of color. I never felt welcome in and from the beginning of the interview I felt like the staff didn't want me there. I was told I would hear something by the end of following week, but of course I had to email to find out that I didn't get it.", "Interview Questions": "Are you playing on going to grad school? Do you have any experience with testing? Do you have any experience with the population we served?"}, {"date": "15 Oct 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at UAB Medicine (Birmingham, AL) in Sept 2016", "Interview Descriptions": "Your interview with your direct supervisor and it varies depending on what they are looking for but make sure to be familiar with the job position. It was a great experience!", "Interview Questions": "Tell me about yourself?"}, {"date": "17 Aug 2016", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at UAB Medicine", "Interview Descriptions": "Normal interview! Best one I have had in awhile.  Do NOT give up applying for JOBS here. I applied 61 times since March & it is now August. But I'm so excited with the team that I will be working with.", "Interview Questions": "Normal interview questions"}, {"date": "21 Jul 2016", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at UAB Medicine (Birmingham, AL)", "Interview Descriptions": "Very good experience.  Nursing staff was very receptive. The whole entire process was great. The interview went according to plan and was well worth the wait. Some questions hard but had the capacity to answer them.", "Interview Questions": "Do you have any experience in busy unit?"}, {"date": "16 Nov 2016", "title": "Clinical Simulation Equipment Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at UAB Medicine (Birmingham, AL) in Jun 2016", "Interview Descriptions": "Very strange interview process. Only felt like a meeting and wasn't really asked any important questions. Showed me what their issues were and asked if i was willing to work there.", "Interview Questions": "Talk about your previous experiences and how they would relate to this job"}, {"date": "4 Sept 2016", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UAB Medicine (Birmingham, AL) in May 2016", "Interview Descriptions": "I was interviewed for UAB Callahan Eye Hospital primarily by my soon to be manager and the rest of the team. I was first called by HR and completed a small phone screen and within that week an interview was set up. During the management interview everything seemed ok.. It wasn't until I met with the team that I felt intimidated. One guy from the team asked questions that seemed inappropriate and childish. I interviewed with the I.T. Department.", "Interview Questions": "Where else are you interviewing?"}, {"date": "4 Apr 2017", "title": "Medical Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at UAB Medicine (Birmingham, AL) in May 2016", "Interview Descriptions": "Brief phone interview then in person interview one-on-one with supervisor, then interview with 3 people--upper level management. Most of it was 'tell me about yourself' type stuff and then a few questions about experiences...most of their concrete info about your resume will come from recommendations", "Interview Questions": "What experience do you have with Medicare and Medicaid?"}, {"date": "19 Apr 2016", "title": "Emergency Communications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UAB Medicine (Birmingham, AL)", "Interview Descriptions": "You get to interview with the department and get shown around.  Then HR calls you in and asks a few more questions and you turn in your certifications to them and they make copies for your file.  It's not a very quick process.", "Interview Questions": "Standard fair of questions.  Where do you see yourself in X years?  What can you offer the hospital?  Tell me a time of difficulty and how you overcame."}], [{"date": "24 May 2018", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UAB Medicine (Birmingham, AL) in Apr 2016", "Interview Descriptions": "The interview process was really easy. I came in and met with two of the HR personnel, we discussed my resume and they told me about the company and gave me an opportunity to ask questions. After the interview was over, they told me they would give me a call if they decided to offer me the position. Before I was able to leave the parking deck, they called me and offered me the position.", "Interview Questions": "Where do you see yourself in five to ten years?"}, {"date": "2 Mar 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UAB Medicine (Birmingham, AL) in Mar 2016", "Interview Descriptions": "Phone interview with managers.  two weeks later on site interview with 4 managers.  Hit and Miss on HR reps.  They were very accommodating with my schedule.  It was well organized and", "Interview Questions": "what are your strengths and weaknesses"}, {"date": "18 Apr 2016", "title": "PATIENT ENCOUNTER SPECIALIST Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at UAB Medicine (Birmingham, AL) in Jul 2015", "Interview Descriptions": "Interview was very simple and did not last very long if not 30 minutes. Simple behavioral questions were asked. I was offered the position soon after the interview for the float pool.", "Interview Questions": "What is your favorable work environment?"}, {"date": "24 Aug 2015", "title": "Fitness Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UAB Medicine (Birmingham, AL) in Jul 2015", "Interview Descriptions": "A preliminary phone interview with the HR department.   There was a mix up on the interview time.  i received an  email  late Monday evening asking if  was available Tuesday afternoon or Wednesday morning for a phone interview.  I sent my reply late Tuesday morning and did not receive a confirmation about the time to expect a phone call.  Luckily I was home to receive the call but felt I was not well prepared for the preliminary interview", "Interview Questions": "Questions about my last position, what salary I wanted;"}, {"date": "5 Aug 2014", "title": "PATIENT ENCOUNTER SPECIALIST Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UAB Medicine", "Interview Descriptions": "Originally was called for an interview, I live out of town so I drove in the night before and stayed in a hotel. Went in for my interview and skills test. After my skills test I was told that the woman doing my interview  was is a meeting and to go ahead and leave, that I would do a phone interview instead by the end of the day. I stayed in town for a few hours, just to offer to meet face to face but I never heard back. I called towards the end of the day to check in and got a message machine. Four days past and they called and said they had been tied up, and that I should have my interview by the end of the day or the following day....never heard back after that regarding that position. \r\nA month later I applied to a second position and received a call to confirm an interview the following day. I was hesitant to accept, but the company is well know, so I didn't think I had anything to lose. I  made to the actual interview this time and so far I love working for the company.", "Interview Questions": "Just standard get to know you questions, very laid back interview"}, {"date": "1 Oct 2016", "title": "ICU RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UAB Medicine (Birmingham, AL) in Aug 2014", "Interview Descriptions": "1st interview with HR and 2nd with nurse manager.\r\nyall will apply through Online.\r\nNurse manager has the authority to hire you at the end.\r\nHR'd ask about 10 questions regarding the hospital's general info and nursing", "Interview Questions": "core values of UAB medicine"}, {"date": "4 May 2017", "title": "Patient Account Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UAB Medicine (Birmingham, AL) in Jul 2014", "Interview Descriptions": "The hiring process takes some time at UAB. It is difficult to get an interview due to the number of applicants for any open positions. So if you are lucky enough to get an interview, make it count. Dress professionally and modify your resume to highlight key requirements listed in the job description.", "Interview Questions": "How do you react to constructive criticism?"}, {"date": "7 Mar 2014", "title": "Nurse Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at UAB Medicine", "Interview Descriptions": "the process is too long. too much paperwork", "Interview Questions": "where do you see yourself in 10 years? A little hard to project that far"}, {"date": "12 Dec 2013", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at UAB Medicine (Birmingham, AL)", "Interview Descriptions": "initial contact with HR. only hiring nursing students at this point.", "Interview Questions": "no difficult questions"}, {"date": "20 Sept 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at UAB Medicine (Birmingham, AL) in Aug 2013", "Interview Descriptions": "The interview process was laid back and calm. It was more like a conversation with the nurse manager asking a few questions here and there. I was transferring from another department, so it was not an entry style interview.", "Interview Questions": "Why do you want to work in this department? "}], [{"date": "23 Jul 2013", "title": "Development Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UAB Medicine (Birmingham, AL) in May 2013", "Interview Descriptions": "I submitted my application and resume online and was contacted by the hr department about 1 month later saying that my resume has been chosen for the interview process.  The interview process for me contained four rounds.  All rounds were very communicative and relationship based.  I felt even more empowered about my new job after every interview and by no means did I feel like I was being drilled or questioned for failure like some interviews go.  The first round I met with the Executive Director of Development, who is my direct supervisor.  This interview was basically to get to know me.  She wanted to know where I was from, what I did in college, what my hobbies were, and how I came across the position and why I chose to apply.  We went over the job description and how my resume/ experience is perfect for the position. We also discussed the next steps in the interview process and how many people I am competing against (6 first round-4 second round -2 third round.)  I killed the interview and at the end she told me to expect a call from her secretary within a day or two.  The second round was about 3 and half hours long.  I met with 5 people total.  I had a one-on-one with a director of development (DOD), then another one-on-one w/ another DOD, and then I had a group interview with a Major Gifts Officer, a Development Officer, and a fellow Development Coordinator.  The first two one-on-ones were very similar to the first interview.  They wanted to get to know me and why I chose UAB and development.  They loved talking about what they do, not in a bragging snobbish kind of way, but in a fulfilling way.  The group interview really got more in to the nitty gritty of the job description.  They talked more heavily and precisely on daily tasks and how the position works.  They were enjoyable people as well.  This interview was conducted in the same building as my previous so I dropped by and gave her my hand-written thank you note and asked my potential boss what the next steps would be.  She said the secretary will follow up within a few days.  The third interview was the toughest.  My interview was the Associate VP of Development and Major Gifts.  I was already heavily recommended by my previous 6 interviewers, so he just wanted to make sure why I chose this career path and if UAB would be a good fit for me.  I originally made it known that I initially wanted to go into marketing so every question was basically phishing around to see if was committed to the job since they are looking for a long term employee.  We talked a lot about personality types and how I would fit in/ how I would interact with patients and doctors, and how everyone would interact with me. The interview was still more relationship based, as I got to know him and how he likes to manage/operate, but it wasn't as relationship based as the other.  By the time I was called back for the fourth round, I already had the position. I was the number one candidate and they did not call anyone else back for the fourth round.  However, I did not know that at the time.  I thought I was still possibly competing with one other person, especially since my third round wasn't as great as I wanted it to be.  The fourth round, unbeknownst to me, was more of a formality than anything.  I met with the Executive Assistant for the Department of Surgery, he is basically the CEO for the department that I would be operating in.  The interview started and my boss, the EDOD, basically told him my qualifications and why I was being chosen. I thought it was going to be another one-on-one, but we all three sat together.  After hearing my qualifications, he just wanted to hear a little about me and then welcomed me to the team.  It was a 15 minute 'interview'.  I got the offer letter the next sent out to me the next day.", "Interview Questions": "After seeing your resume and understanding that you initially tried to go into marketing, why are you now choosing a path in development?"}, {"date": "21 Aug 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UAB Medicine (Birmingham, AL) in Jan 2013", "Interview Descriptions": "Met with the Unit manager and she introduced me to key staff, showed me the unit. Manager reviewed my portfolio that I had brought and asked questions about some projects I had been involved with.", "Interview Questions": "Why do you want to work here?"}]]