[[{"date": "17 Apr 2023", "title": "Clinical Dietitian Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Carson Tahoe Regional Healthcare (Carson City, NV)", "Interview Descriptions": "I was interviewed by a panel consisting of eight individuals. I was informed the interview would have a panel of a \"few people\". The questions were standardized and read off a script.", "Interview Questions": "Questions were standardized and read from a script. I didn't feel like they were truly interested in getting to know me as a candidate."}, {"date": "12 Feb 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Carson Tahoe Regional Healthcare", "Interview Descriptions": "Panel interview with managers and supervisors from multiple units. Very relaxed and was done via zoom. Was given the option to come in for the interview or to have one done through zoom.", "Interview Questions": "Typical HR questions. One being give us an example of the time you went above and beyond for a patient."}, {"date": "10 Sept 2022", "title": "Accounts Payable Clerk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Carson Tahoe Regional Healthcare", "Interview Descriptions": "Zoom interview with the entire team and manager.  It took about 35 minutes. typical interview questions.  They asked about previous experience. Interview was informal and more like a meeting. They did not discuss pay or benefits in the interview. Briefly described what job entailed and that it is a hybrid position.", "Interview Questions": "What was your previous experience with Accounts Payable and how much did you process in invoicing each day?"}, {"date": "5 Nov 2021", "title": "Nurse Apprentice Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Carson Tahoe Regional Healthcare in Oct 2021", "Interview Descriptions": "Unit manager called to set an interviewing after receiving my application. I was interviewed by four people in a close but comfortable office setting. Questions were asked by each person, and they built upon each other. Teamwork was a large focus of interview.", "Interview Questions": "What have you done/ what will you do if witnessing an error take place?"}, {"date": "6 Aug 2021", "title": "Surgical Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Carson Tahoe Regional Healthcare", "Interview Descriptions": "Usuals , what hours available , experience, how   I would handle different situations, talked with all  dept groups  via online chat and in person. Over all it was a good interview.", "Interview Questions": "If I Had a difficult situation with  co- worker, How would I handle it."}, {"date": "29 Sept 2020", "title": "Courier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Carson Tahoe Regional Healthcare", "Interview Descriptions": "Just awesome, amazing, greatness, powerful, loyal, human, loving, caring, joyful, peaceful, team work, culture of respect, gratitude, kind, special, great experience, leadership, good friends. I am grateful for people that care for one another like this.", "Interview Questions": "Asked about your credentials and experience "}, {"date": "14 Apr 2020", "title": "Medical Staff Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Carson Tahoe Regional Healthcare (Carson City, NV) in Dec 2019", "Interview Descriptions": "Any good interview should be about an hour long. Mine was just that. There was a panel of 4 people in my interview. They all had a lot of good questions.", "Interview Questions": "They asked all the typical interview questions. Study up and be prepared!"}, {"date": "7 Jul 2019", "title": "IT Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Carson Tahoe Regional Healthcare (Fernley, NV) in Sept 2018", "Interview Descriptions": "Applied Online and a couple of weeks later, I got email from somebody saying they were the IT Manager, who wanted to schedule a 30-minute phone interview the next day.", "Interview Questions": "The only question they asked me was if I was willing to do a 30-minute phone interview."}, {"date": "17 Aug 2018", "title": "Corporate Executive Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Carson Tahoe Regional Healthcare (Carson City, NV) in Jul 2018", "Interview Descriptions": "I had an initial telephone interview, followed by a panel interview with my immediate supervisor and immediate co-workers and finally a panel interview with Executive Team Members.  The panel members made me feel at ease.  The questions were clear and relevant to the position I was applying for.  Going through the multi-step interview process was effective for me, in that it allowed me to identify, without a doubt, that Carson Tahoe was where I wanted to work.  I was thrilled to get an offer!!", "Interview Questions": "How do I handle unexpected changes that my alter planned events during the workday?"}], [{"date": "27 Apr 2018", "title": "Clinic Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Carson Tahoe Regional Healthcare (Carson City, NV) in Mar 2018", "Interview Descriptions": "I had a wonderful interview. Very casual and comfortable. They were flexible with my schedule and stayed late so that I did not have to miss any work to attend the interview.", "Interview Questions": "How would I handle a disgruntled patient."}, {"date": "30 Apr 2018", "title": "Development Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Carson Tahoe Regional Healthcare (Carson City, NV) in Jan 2018", "Interview Descriptions": "The process was seamless from start to finish.  I was refered to the position though a friend who works at Carson Tahoe as well.  Once I submitted my resume I had a phone interview, then a face to face interview, and then one last face to face interview before they offered me the position.", "Interview Questions": "How will your skills from your previous job transfer to this current role?"}, {"date": "17 Aug 2017", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carson Tahoe Regional Healthcare (Carson City, NV) in Jul 2017", "Interview Descriptions": "I applied for the job online, and within a few weeks, received a phone call from a recruiter and later the office manager, to come in for an interview. I interviewed twice. First with what would become my immediate supervisor and later with a panel made of up Executive staff. I was contacted shortly after and offered the position.", "Interview Questions": "I was asked general interview questions. How I prioritize tasks. How I work under pressure.  "}, {"date": "12 Sept 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carson Tahoe Regional Healthcare (Carson City, NV) in Jun 2017", "Interview Descriptions": "I was called immediately after submitting my application to schedule and appt. I was introduced to many of the staff members and given a tour of the department. I was  offered the position at my interview.", "Interview Questions": "How often  I use the chain of command. "}, {"date": "12 Sept 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carson Tahoe Regional Healthcare (Carson City, NV) in May 2017", "Interview Descriptions": "Applied and was scheduled for a interview within 1 week.  Interviewed with the person that would be my supperviser, she was very friendly and was able to put me at ease during the interview.  Was offered the position a week later and started orientation within 2 weeks.", "Interview Questions": "what was my skill level and my experience"}, {"date": "9 Sept 2017", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carson Tahoe Regional Healthcare (Carson City, NV) in May 2017", "Interview Descriptions": "I got a phone interview by a recruiter,  they told me they were goign to send my application to severeal despertments wich ,oslty were adecuate for my experience. days later i got an interview face to face, it was pretty easy. im so happy to be wroking afor this hospital", "Interview Questions": "why do you want to wrok for carson tahoe"}, {"date": "26 Apr 2017", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carson Tahoe Regional Healthcare (Carson City, NV) in Feb 2017", "Interview Descriptions": "Typical application process, was contacted by recruiter in less than a week. Phone interview with manager, then phone interview with VP. Flown onsite for in-person interview about a week later and met with various stake holders, peers, and managers. Practical and professional itinerary was provided. The in-person interview was a full day with lunch;  everyone was very welcoming.", "Interview Questions": "Questions past experience, creativity, problem solving, career goals; specific examples were requested in most cases."}, {"date": "7 Feb 2018", "title": "UR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Carson Tahoe Regional Healthcare (Carson City, NV) in May 2016", "Interview Descriptions": "Most stoic interview ever. thought it went horrible. got the job. they ask the most basic questions and leave a lot of room for self direction in your interview answers.", "Interview Questions": "Why did you apply to work with Carson Tahoe Hospital?"}, {"date": "20 Apr 2016", "title": "CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Carson Tahoe Regional Healthcare (Carson City, NV) in Apr 2016", "Interview Descriptions": "Submitted my application online and received a call from the unit manager 5 days later to schedule an interview. Showed up to the unit about 5 minutes early, got interviewed by the charge nurse and the unit manager. Questions weren't too terribly difficult, and felt pretty run of the mill for most companies. Overall, the interview lasted about 20 minutes because other interviews were scheduled with 30 minute increments.", "Interview Questions": "Tell me about yourself"}, {"date": "21 May 2014", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Carson Tahoe Regional Healthcare (Carson City, NV) in Jun 2013", "Interview Descriptions": "The hiring and interview process was very straightforward.  I had an initial phone interview with the hiring manager, which lead to a followup face to face and then a panel interview with the employees within the department.  Once the position was offered I worked directly with a recruiter to finish the process.", "Interview Questions": "What are your weaknesses."}]]