[[{"date": "23 Feb 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Special Olympics", "Interview Descriptions": "Initial interview followed by extensive second interview. I was required to submit a strategic plan and present that plan. I spent several days working on the project. They took my work (got free labor) and ghosted me after that second interview.", "Interview Questions": "Please present a strategic plan."}, {"date": "5 Feb 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Special Olympics", "Interview Descriptions": "Very long process. Has about 4 to 5 interviews at varying levels. Each stage took about 4 weeks to move to next stage. Very little communication in between the interviews.", "Interview Questions": "Describe problem solving skills and project management"}, {"date": "22 Nov 2022", "title": "Marketing Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Special Olympics", "Interview Descriptions": "Very simple 3 part interview. All done over the phone and zoom. Felt very comfortable and was an easy conversation. Not intimidating at all. The questions were more so about experiences.", "Interview Questions": "How have your previous experiences helped you learn how to manage a lot of different tasks?"}, {"date": "24 Sept 2021", "title": "Program Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Special Olympics", "Interview Descriptions": "Time between application and request for interview was quick. First interview was great, basic situational and experience questions with the department head. Second interview with VP was similar in style. Position ended up changing after my interviews and I declined to move further in that process.", "Interview Questions": "Tell me about your experience leading teams of diverse people (cultures, experience levels, etc.)"}, {"date": "27 Aug 2021", "title": "Summer Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Special Olympics", "Interview Descriptions": "It was good, friendly, and timely. It was virtual and I feel it went well. They asked questions about passions and career ambitions, as well as what I would like to get out of working with their organization.", "Interview Questions": "What are your career ambitions?"}, {"date": "16 Jun 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Special Olympics", "Interview Descriptions": "It was a brief interview process where I met with 3 current employees. There weren't any difficult questions that really stood out to me or caught me off guard. Stress free!", "Interview Questions": "What are my career goals?"}, {"date": "7 Jun 2021", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Special Olympics", "Interview Descriptions": "phone interview and in person interview with 5 people. only two round over with in about a week and then they called to let me know i got the job", "Interview Questions": "what is one tiem you had to multitask"}, {"date": "26 May 2022", "title": "Communications and Logistics Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Special Olympics (Toronto, ON) in Jun 2021", "Interview Descriptions": "HR contacts you through email to set up an intro phone call. Ask you  introduce yourself explain your experiences and what you are looking for. From there they will set up an interview with a panel from which you will be working with directly.  They had asked me to do a homework assignment due for the interview based on a marketing plan on one of their campaigns / programming", "Interview Questions": "Ask you what you know about the company, the programs."}, {"date": "21 Apr 2021", "title": "Media Relations Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Special Olympics", "Interview Descriptions": "I had multiple interviews and really enjoyed the process. I met with people that would be on my potential team all the way to senior executives. Back to back interviews at times, and quick turn around for an offer.", "Interview Questions": "What type of work environment do you operate well in? "}, {"date": "7 Apr 2021", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Special Olympics", "Interview Descriptions": "3 rounds of interviews (one with a supervisor, one with the Manager, and the last with HR) and a written assessment. The usual questions about your background, interests, and knowledge. The assessment had competency-based questions.", "Interview Questions": "Tell me about your background"}], [{"date": "25 Feb 2022", "title": "Development Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Special Olympics (Denver, CO) in Feb 2021", "Interview Descriptions": "Easy process, typical first interview questions! Largely development strategy  based. Didn’t proceed to second interview becuase I ended up staying at current job.  Easy process, typical first interview questions! Largely development strategy  based. Didn’t proceed to second interview becuase I ended up staying at current job.", "Interview Questions": "How would you increase a monthly donor to a larger gift?"}, {"date": "27 May 2021", "title": "Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Special Olympics (London, England) in Jan 2021", "Interview Descriptions": "Very smooth,  the process was under 3 weeks total, two main behavioural interviews and one written assessment. Hiring team very professional and overall good experience. The ability to have a virtual interview when I was in another country was also very flexible and I appreciated that about the Company.", "Interview Questions": "What was a challenge you faced within the past year?"}, {"date": "14 Sept 2020", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Special Olympics", "Interview Descriptions": "3 interviews. Process took about 3 weeks in total Responded relatively fast. Interviews were on zoom and lasted around 30 minutes each. Questions were easy to answer and responses and or asks for future interviews were given about a week after each.", "Interview Questions": "Explain your relationship with the disability community and or special Olympics "}, {"date": "12 Oct 2020", "title": "Marketing Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Special Olympics (Madison, WI) in May 2020", "Interview Descriptions": "I applied through a job board and was contacted via email for writing samples that exemplified my work. After this, I received a virtual interview to speak on my skills and experiences, and I received a background check. After this, I was given an offer.", "Interview Questions": "What is your experience with Facebook Creator Studio"}, {"date": "16 Feb 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Special Olympics (Philadelphia, PA) in Feb 2020", "Interview Descriptions": "Shared my resume and then went straight into the interview process with two individuals. However, was not clear of the position being given until I directed the question to the two interviews at the time.", "Interview Questions": "What will you be bringing to the table?"}, {"date": "19 Aug 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Special Olympics", "Interview Descriptions": "The interview was very quick and easy. Was referred to by a contact. Went it and talked to multiple people within the organization from different levels. Got a verbal offer immediately following the interview.", "Interview Questions": "General questions about resume and experience"}, {"date": "1 May 2019", "title": "Marketing Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Special Olympics", "Interview Descriptions": "I had to send in my resume and CV via email and then do an interview.  Then I was requested to do a phone screen. After that it was a standard process.", "Interview Questions": "Tell me about your duties in previous marketing roles."}, {"date": "21 Feb 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Special Olympics (Madison, WI) in May 2019", "Interview Descriptions": "The in person interview process was as expected based off of job description. They asked for relevant experience based off of each job responsibility. Not too difficult if you come prepared.", "Interview Questions": "What marketing experience do you have whether it be through school or past professional experiences "}, {"date": "7 May 2019", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Special Olympics in Apr 2019", "Interview Descriptions": "It was very easy and quick. I heard from someone right away! They were very willing to answer any questions i may have had leading up to the interview. They were also very accommodating with my schedule.", "Interview Questions": "Why do you want this job?"}, {"date": "14 Dec 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 4 days. I interviewed at Special Olympics in Jan 2019", "Interview Descriptions": "It was good to meet with them. They had a lot to say about the job and i asked few questions. They were very nice and informative.  I will interview again next month.", "Interview Questions": "Why do you want to work here? "}], [{"date": "23 May 2019", "title": "Information Services Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Special Olympics (Toronto, ON) in Dec 2018", "Interview Descriptions": "Applied online. Was invited to an in-person interview several weeks later. This was a panel interview with 3 interviewers. A week later I was interview to a second in-person interview. This was another panel interview with 3 interviewers. The interviews felt a bit transactional, but was probably due to the fact that there were so many interviewers. \r\n\r\nOverall the process was straightforward and the people I interacted with were pleasant and professional.", "Interview Questions": "Typical interview questions"}, {"date": "6 Aug 2018", "title": "Sports Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Special Olympics in Jul 2018", "Interview Descriptions": "First round was a phone interview, my interviewer was super nice and kept the conversation fairly casual. He told me about his experience and background and the rest of the interview was essentially him going over my resume and asking about my experience.", "Interview Questions": "What do you know about unified sports?"}, {"date": "11 Oct 2020", "title": "Brand Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Special Olympics (Abu Dhabi, Abu Dhabi) in May 2018", "Interview Descriptions": "Brand Manager Abu Dhabi 2019\r\n\r\nHad an interview with several team members regarding various roles. The interview was a very positive experience. Interview for Venue manager, Brand manager and accommodation manager roles. It was a one on one with different Function Area manager.", "Interview Questions": "They asked about my experience background"}, {"date": "8 Feb 2021", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Special Olympics (Bloomington, IL) in May 2018", "Interview Descriptions": "The interviewers were very friendly! I felt very welcome and they were attentive to what I was saying! The interview itself went well and I was offered a job afterwards", "Interview Questions": "What are your strengths and weaknesses "}, {"date": "16 Oct 2018", "title": "Full Stack Web Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Special Olympics (Toronto, ON) in Apr 2018", "Interview Descriptions": "came in the company. Two people sat me in a round table. Started asking general behavioural questions then proceeded to tech support question about programming, lastly giving me a real case scenario about how to implement certain requirement.", "Interview Questions": "what is object oriented programming"}, {"date": "24 Jan 2017", "title": "Special Events Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Special Olympics (Denver, CO) in Jan 2017", "Interview Descriptions": "I applied for the position in the beginning of December and was contacted a month later to schedule an interview. I was asked to arrive 15 minutes early to fill out paper work. The actual interview was with 4 people that were from the development team. I was asked about my previous experience, skills, and why I was interested in the organization.", "Interview Questions": "What form of communication do I prefer (email, phone, in person etc.) and am I comfortable speaking in front of large groups?"}, {"date": "3 Apr 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Special Olympics (Chicago, IL) in Nov 2016", "Interview Descriptions": "The process was easy and simple. The interview was short and to the point. It was on time and wasn't a waste of time. It was a overall good experience.", "Interview Questions": "What is a strength/weekness?"}, {"date": "12 Jul 2016", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Special Olympics", "Interview Descriptions": "Applied online, was contacted within two days of applying. The interview was over the phone with ladies in the Chicago and DC office.  The interviewers were super friendly but some of their questions were challenging.  I was prepared but still felt unprepared.  If you're interviewing with them I suggest you look at their values!  They really want to hear how much you advocate for people with disabilities.", "Interview Questions": "What makes a good leader?\r\nDescribe a time that you've been in a situation where the results were not as you expected or planned for?"}, {"date": "12 Apr 2017", "title": "Data Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Special Olympics in Jul 2016", "Interview Descriptions": "I interviewed at the DC office. After the initial phone interview, I was invited to a in person interview. The interview process was long but everyone in the team was nice and welcoming. It took 4 hours for the in person interview.", "Interview Questions": "basic behavioral question"}, {"date": "4 Jun 2016", "title": "Special Projects and Events Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Special Olympics", "Interview Descriptions": "Originally, I found the posting on LinkedIn for Special Olympics Illinois and did that simple application process. After that, I had a quick, ten minute phone interview. In that interview, they were very straight forward. The HR manager (conducting that interview) told me that they narrowed it down from 100+ to 20 for a phone interview, and were narrowing it down again (I think about 8) for an in person interview. I was emailed again to schedule that interview, which was your basic, multi-person interview. I spoke conversationally with a 3-person board regarding traditional interview questions. They explained in that interview that, if necessary, they would ask 2-3 people in for a third interview, and ask them to prepare some projects. Again, I was asked for this interview, asking to prepare a couple projects. I came in again (one hour, one way) and presented my work, receiving positive feedback. This resulted in more questions regarding my work style. They said that they would be getting back to everyone shortly, regardless of the outcome. It has been over a month and a half, and I have yet to hear.", "Interview Questions": "Q: How would you handle many people from many departments asking you to do something?"}], [{"date": "12 Jul 2017", "title": "Internal Communications Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Special Olympics (Washington, DC) in Jun 2016", "Interview Descriptions": "The interview process was pretty straight forward but there were a lot of interviews. I had a phone interview, then was invited into the office for a series of individual interviews plus a group interview, then an HR interview. A week or so later I was asked to come in again for an interview with someone who was unavailable the first time I was in the office. Everyone I met was very friendly and most of the interviews were designed like get to know you conversations rather than a rigid, formal interview. It was one of the better interview processes I've participated in even though I didn't end up being offered the job.", "Interview Questions": "The questions were mostly conversational and creative. One of the panelists asked my favorite sports team. I was also asked about specific international experience I had and how that relates to Special Olympics."}, {"date": "11 May 2016", "title": "Community Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Special Olympics", "Interview Descriptions": "I submitted my app and received an email asking me to come in for an interview. I interviewed with four employees. It was mostly questions related to my skills and experiences.", "Interview Questions": "Please walk me through your resume."}, {"date": "28 Apr 2016", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Special Olympics (Washington, DC)", "Interview Descriptions": "Before even going in when were trying to schedule a time to interview the person  would takes days to respond to my email so I didn't care for that.\r\n\r\nAs far as the interview itself the questions were your standard interview questions but those asking seemed a little inexperienced. I liked the person interviewing but they didn't really go too much go over the basics of the job. \r\n\r\nMy big issue was after the the interview. They didn't address the next steps so I reached out about a week later and asked about the status of things. No response at all. To me this speaks volumes about their office. They took days to respond to set up an initial interview and then completely ignore a candidate afterwards. Clearly I did not get the job but quite frankly I am glad. I do not want to work for an organization that is disorganized and rude. Shame because the organization is awesome, but this particular office, not so much.", "Interview Questions": "Why the Special Olympics?"}, {"date": "6 May 2016", "title": "Data Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Special Olympics (Manchester, NH) in Apr 2016", "Interview Descriptions": "30 minute phone interview, skills and personality tests which took a chunk of time, and finally a face to face interview.  I walked into the room and one person was very engaged in the process and the other person couldn't have cared less.  She was rude, kept looking at the clock, and wouldn't make eye contact. I don't know if they two interviewers didn't like each other or what was going on. I knew the minute I walked into the interview room that I didn't stand a chance.", "Interview Questions": "N/A"}, {"date": "22 Jul 2015", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Special Olympics", "Interview Descriptions": "easy, just a quick check to see you aren't brain dead. Mostly just asked what my major was and where I wanted to go in the future. Also made sure I had an interest in the organization. I feel like they do most of the screening based off of the initial resume you send in.", "Interview Questions": "What experience do you have?"}, {"date": "15 Jun 2015", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Special Olympics (Washington, DC)", "Interview Descriptions": "The interview process was very efficient. They were looking to fill the position rather quickly so the process took less than a month. Contacted by the hiring manager, then interviewed with other team members as well as HR director. References and background check followed.", "Interview Questions": "What do you know about the organization"}, {"date": "21 Aug 2017", "title": "Team Lead Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Special Olympics (Los Angeles, CA) in May 2015", "Interview Descriptions": "Applied online for internship position for World Games in L.A. Constant emails back and forth, with hiring manager. Multiple phone interview process, with basic interview questions. Asked about availability, and how many hours I was willing to work.", "Interview Questions": "How do you handle fast paced environments?"}, {"date": "24 May 2016", "title": "Unified Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Special Olympics (Phoenix, AZ) in May 2015", "Interview Descriptions": "Three separate interviews and the staff that I interviewed with were great. Friendly and Family atmosphere. I toured the office and really enjoyed meeting all of the employees. I had a great experience working there and will always remember them as being there for whatever you would need.", "Interview Questions": "Tell me about yourself?"}, {"date": "30 Apr 2016", "title": "Senior Manager, Leadership and Program Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Special Olympics (Washington, DC) in Mar 2015", "Interview Descriptions": "I was contacted to set up a Skype interview after submitting an online application.  The interview lasted about 45 minutes.  The hiring manager let me know that he had several people he was screening in this phase of the process.  It was a typical screening interview and covered the basic questions--like why I wanted to work at SO and tell me about yourself--to questions that delved more deeply into what what my experience with leadership development had been.  I heard back from them quickly after I submitted my resume, but it took a few weeks longer after the interview to learn that I hadn't made it to the next round.", "Interview Questions": "Why do you want to work for Special Olympics?"}, {"date": "4 Nov 2015", "title": "Sports Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Special Olympics (Lansing, MI) in Nov 2014", "Interview Descriptions": "The interview and hiring process was very easy and quick.  I found out about the opportunity through my university, applied, and was called within the next couple of days.  I went into the office and the interview was more of a conversation.  I was shown around the building and then hired that day.", "Interview Questions": "Why are you interested in this position?\r\nWhat fields do you what to work in?"}], [{"date": "22 Sept 2014", "title": "Associate Director of Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Special Olympics", "Interview Descriptions": "Went through the job description. Spoke a lot about employee burn out and frequent turnover of the position. Told me they had 100 other applicants. Not a challenging interview by any means.", "Interview Questions": "How would you handle a rude committee member?"}, {"date": "30 Oct 2015", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Special Olympics (Washington, DC) in Jun 2014", "Interview Descriptions": "The interview processes are intense. It's unheard of for someone to interview with only one person unless they're being screened - via telephone. Be prepared to face even an 8 people panel.", "Interview Questions": "They are divided into your department and non-dept (but will still work together) departments. Non-depts will ask you more general questions - stereotypical questions (mistakes you made, etc.) Your department will ask you the detailed questions. Your experience, what you can do, etc. They ask tons of problem solving questions.  "}, {"date": "4 Dec 2015", "title": "Special Event Oordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Special Olympics (Portland, OR) in May 2014", "Interview Descriptions": "Interviewed with 2 ladies. They had me fill out a paper that had sentence/punctuation/grammar errors and fix them (IQ type test). Sat in a conference room. It was pretty standard and not too difficult.", "Interview Questions": "What experience do you have with event planning?"}, {"date": "10 Mar 2014", "title": "Development Department- Mid to Upper Level Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Special Olympics", "Interview Descriptions": "Initial communication was great- first a phone interview followed by an in-person interview. The interview itself went well, although the Executive Director arrived half-way through then preceded to check email on her phone the whole time. I was told they would be arriving at a decision by the end of the following week. Then nothing. No call. No email. Nothing to tell me whether I had or hadn't received \"made the cut.\" First employer ever to do that. Frankly, I was not impressed.", "Interview Questions": "N/A"}, {"date": "19 Aug 2015", "title": "Guest Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Special Olympics (Washington, DC) in Feb 2014", "Interview Descriptions": "I got the job description from the college alumni network and got a in person interview in 2 weeks after my application. The person who interviewed me was one of the alumni, I got lucky to get the job right away.", "Interview Questions": "There wasn't a question that I found difficult or unexpected"}, {"date": "20 Sept 2013", "title": "Senior Manager Internal Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Special Olympics", "Interview Descriptions": "They did not have their interview act together. They told me I'd talk to 5 people consecutively, with a break between 2 & 3.  My \"break\" was wondering what to do because the conference room I'd been marooned in was filling up w/ people gathering for a meeting, and I was supposed to wait to talk to somebody from HR before I took the \"break.\"  I gathered up my papers and waited in the hall for somebody to come find me.  HR person never did show up.  Then  I was marooned in a office for 40 minutes between #4 and #5 because #5 was \"running late\" and didn't send anybody to tell me and all the offices around were empty so there was nobody to ask.  I got out of there an hour later than scheduled and as I was about to go, the HR lady called and told me to come find her on another floor of the building.  The punchline was the email I got FOUR weeks later, turning me down because they'd seen so many great people during the preceding TWO weeks.", "Interview Questions": "Nothing very different from any other interview"}, {"date": "4 Jan 2017", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Special Olympics (New York, NY) in Mar 2013", "Interview Descriptions": "Long and hard.  There is a panel, and a presentation and additionally a computer test.  The presentation was the most difficult.  it was good however.", "Interview Questions": "Why I wanted to work there"}, {"date": "14 Jun 2017", "title": "Grants Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Special Olympics (Austin, TX) in Feb 2013", "Interview Descriptions": "Short interview that went over my resume and asked questions about my previous experience. Allowed me an opportunity to highlight my strengths and say why I would be a good fit. Overall positive experience.", "Interview Questions": "You don't have the experience we're looking for. Why should we hire you? "}, {"date": "9 Jul 2012", "title": "Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Special Olympics in Apr 2012", "Interview Descriptions": "I applied online after seeing a posting for  Marketing position at the Special Olympics of Massachusetts.  I received an email to set up a time for a phone screening.  I spoke directly with the hiring manager during the phone screening.  She let me know that I would receive an email telling me if I will have an in person interview.  I received the email and set up a time to come to the office for an in person interview.  The in person interview was with 5 people all at once.  I had to wait a little while to get into the room because they were conducting interviews back to back.  The interview was casual though some questions were tricky.  The group was very nice and it was clear they all worked very closely.", "Interview Questions": "What would you do to make our marketing better?"}, {"date": "11 Mar 2012", "title": "Special Olympics Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Special Olympics (Albany, NY) in Feb 2012", "Interview Descriptions": "I intereviewed in person and was told that within the week I would hear back, either way, as to whether or not I would be considered for a second interview. When a week and a half went by and I had heard nothing, I emailed my contact, was told the second interviews were delayed due to scheduling conflicts and they would be getting in touch with me soon. The next contact I got was over two weeks later which was a form letter telling me they went with a better-suited candidate. I was very disappointed that I was left waiting for such a long period of time after originally being told I would be called within a week.", "Interview Questions": "None of the questions were difficult or unexpected."}], [{"date": "24 Sept 2015", "title": "Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Special Olympics (Marlborough, MA) in Oct 2011", "Interview Descriptions": "Met with panel, waited several weeks and was later called in to invterview with with CEO. The first panel interview was intimidating, but the conversation flowed. The 1:1 interview with the CEO was more of a conversation explaining why I was passionate about the organization, hearing their perspective on the organization and why they joined.", "Interview Questions": "What are your strengths, weaknesses? How would you deal with \"X\" problem?"}, {"date": "10 Oct 2013", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Special Olympics (Edmonton, AB) in Aug 2011", "Interview Descriptions": "After sending in my cover letter and resume, I followed up with the office two weeks after the closing date. I was told that they were just looking at them and would be called I was shortlisted. I received a call later that afternoon from the president and we had 15-20 phone conversation which later was revealed to be a phone interview to catch my passion for this organization. I was called in for an interview and was offered the position two days later.", "Interview Questions": "My most difficult question came in the computer expertise. Not my strongest suit but I was willing to learn and have taken extra courses in that since starting."}, {"date": "24 Aug 2010", "title": "Senior Development Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Special Olympics (Houston, TX) in Aug 2010", "Interview Descriptions": "I completed an application on line and was called for interview within two days.  Was received in office and was greeted by staff.  I intervied with CEO for approximately 1 hour.", "Interview Questions": "There wasn't a question that I found difficult or unexpected"}, {"date": "25 May 2009", "title": "Program Development Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Special Olympics (Edmonton, AB) in Mar 2007", "Interview Descriptions": "After applying via e-mail, I was contacted the day of the closing of the posting.  Set up an phone interview for the next day as I was in a different city.  Phone interview was with two employees asking typical questions.  I was contacted the next day to set up a second interview with the President.  Second interview went much like the first, but with more direct, detailed questions.  I was offered the position the day (after negotiating salary for a hour or two).  I was flown out for a week in advance to work with an outgoing employee in a similar position.", "Interview Questions": "Describe a situation in which you feel you failed."}]]