[[{"date": "18 Mar 2023", "title": "IOP Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at PrairieCare (South Saint Paul, MN)", "Interview Descriptions": "Initially had a phone interview which went great. The teams interview, they were late and didn’t even apologize. I thought I did well. I interviewed the recruiter multiple times just to follow up and never received a response. That is so rude. Even if you went with someone else? I’ve heard terrible things about this company anyways so it’s probably for the best.", "Interview Questions": "Typical interview questions, cultural responsiveness was one"}, {"date": "24 Jan 2023", "title": "Operations Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at PrairieCare in Jan 2023", "Interview Descriptions": "The team asked good questions, and I was prepared for the full interview. They were nice, personable, and I felt great organizational leaders. The entire process was 45 minutes, and we left on a positive note. The next day I wrote a thank you email, mentioning specific strengths of the team and certain questions. After 2 weeks heard nothing, so I sent a follow up email listing who I was with other interview points. I asked for feedback if I would be moving forward or if the team has closed my selection. I'm sad to report that I was GHOSTED. This is disappointing for 2 reasons. 1: I interview people all the time in my current role and never do this 2: It speaks to the lack of professionalism in certain roles.", "Interview Questions": "What was some of the best advice a previous supervisor has given you?"}, {"date": "3 Jan 2023", "title": "Psychiatrist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at PrairieCare (Minneapolis, MN) in Dec 2022", "Interview Descriptions": "It was Engaging and Professional. On time. Very interested in my career goals (short and long term). Provided a clear overview of agency and what to expect as the interview progresses to different levels", "Interview Questions": "What are my career goals"}, {"date": "28 Oct 2021", "title": "Psych Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at PrairieCare (Brooklyn Park, MN)", "Interview Descriptions": "They ask questions regarding your mental health experiences and reason for applying there. Their questions are very basic, like tell me why you are interested in working here? They ask questions regarding your mental health experiences and reason for applying there. Their questions are very basic, like tell me why you are interested in working here?", "Interview Questions": "They ask questions regarding your mental health experiences and reason for applying there. Their questions are very basic, like tell me why you are interested in working here? "}, {"date": "22 Apr 2021", "title": "Psychiatric Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PrairieCare in Apr 2021", "Interview Descriptions": "Had two Microsoft Teams interviews as I was unable to have my second interview in person.  The process was simple, and the HR staff were quick to respond to questions.", "Interview Questions": "How would your current coworker describe you? "}, {"date": "8 Jul 2021", "title": "Help Desk Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PrairieCare (Brooklyn Park, MN) in Apr 2021", "Interview Descriptions": "Meet with team through zoom and then in person- I think their HR was a vendor sir coordinating an interview was kind of a mess. Wasn’t sure who I should really connect with or talk with since it seemed like I had an different HR person everytime.", "Interview Questions": "Asked basic questions how you would resolved some technical issues.\r\nAsked if you’re familiar with ticketing systems\r\nWanted to know why you want to work there \r\n"}, {"date": "23 Feb 2021", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PrairieCare (Brooklyn Park, MN)", "Interview Descriptions": "Asking basic scenario questions what if and what nots. Follow up behind my application was initially 3-5 days. And was offered employment the following day after interview. How would you handle your self with a violent client.", "Interview Questions": "How would you handle your self with a violent client. "}, {"date": "8 Aug 2019", "title": "Direct Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PrairieCare (Brooklyn Park, MN) in Jul 2019", "Interview Descriptions": "It was an awful experience. The supervisor interviewing me checked her phone multiple times during our meeting. She almost immediately \"warned\" me about the dark humor they use in the department and gave an abbhorent example; she made a joke about how young children that try to kill themselves using benedryl need to \"try harder.\" It was embarrassment to the field of psychology. Very happy I got employment elsewhere!", "Interview Questions": "Are you okay working in highly stressful situations? "}, {"date": "12 Feb 2020", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at PrairieCare (Brooklyn Park, MN) in Oct 2018", "Interview Descriptions": "Quick and to the point, fairly informal. I applied online and spoke to a human resources representative initially and then was referred on to the hiring supervisor for the interview process. The original position I applied for got filled internally, but they liked my interview so they referred me to another hiring manager for a second interview and that was where I was accepted.", "Interview Questions": "Why are you interested in this job?"}, {"date": "2 Sept 2018", "title": "Front Desk Receptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at PrairieCare in Aug 2018", "Interview Descriptions": "I applied online and received a voicemail to set up an interview.  I called back and she asked if I could do an interview over the phone right then.  I stated it was not a good time but she said it was the only time she could so I obliged.  She asked me no questions about my work history nor could she answer my questions when I asked what they expected from possible applicants.  She said “ummmm” and “I don’t know” for most replies and she seemed very unprofessional.", "Interview Questions": "Do you know what Prairiecare is?"}], [{"date": "14 May 2018", "title": "Groups Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PrairieCare (Brooklyn Park, MN) in Oct 2017", "Interview Descriptions": "I was contacted within 2 weeks of having applied for a phone screening interview. One confusing part is that the HR rep did not tell me which of the two jobs I had applied for was the one I was interviewing for, so I had assumed that I was interviewing for a particular job when I was, in fact, interviewing for a different job that I thought had already been filled (because of the expiration date).   The phone screen went well.  I then had a one-on-one interview with my future supervisor. The in-person interview was short (50 minutes), and I was largely asked to talk about my past work experiences and how they could help the organization.", "Interview Questions": "How does your past work experience relate to the job responsibilities of the job for which you are applying?"}, {"date": "3 Jul 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PrairieCare (Brooklyn Park, MN) in Jul 2017", "Interview Descriptions": "Had about two interviews, one over the phone with a recruiter and one with nursing supervisors; then offered a position. Overall it took about two weeks from the application to hiring.", "Interview Questions": "Tell me about a time you provided exceptional patient care?"}, {"date": "23 Jun 2018", "title": "Outpatient Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at PrairieCare in Jun 2017", "Interview Descriptions": "Phone interview then on site interview with hiring manager. The two were inconsistent regarding expectations of the position. hiring manager reported wanting several more years of exp than HR had indicated and the position posting had stated.  Since the hiring manager was the  VP, assume this points to both a  systematic communication issue and demonstrates lack of professional consideration . I did use a day of vacation to interview for a position which apparently I did not meet requirements for.", "Interview Questions": "Tell me about why you became a therapist. "}, {"date": "15 Aug 2017", "title": "Social Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at PrairieCare in Apr 2017", "Interview Descriptions": "The process was easy -- I applied, they called to offer an in-person interview, and I went.  The interview itself was okay, pretty easy questions, however the interviewers were late, and were yawning (probably due to the early time) throughout the entire time.  \r\n\r\nI was told I would be contacted within a few weeks, and if I hadn't heard back from them, to contact someone directly.  I didn't hear back at all, and even when I contacted them, didn't hear anything back.  Apparently this has happened to a lot of other individuals I have heard from as well, which just seems extremely unprofessional.  If not interested, fine, but say something and don't ignore communication that you specifically requested.", "Interview Questions": "N/A"}, {"date": "18 Sept 2017", "title": "Psychiatric Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PrairieCare (Brooklyn Park, MN) in Jan 2017", "Interview Descriptions": "They tag teamed me and asked a variety of situational questions, gave me a tour and went over my employment history.  I waited in the front lobby for 30-40 minutes past my scheduled time. I was introduced to HR and then escorted to a managers office where questioning took place. I was then escorted through the child general unit, admissions and adolescent general unit.", "Interview Questions": "How have you included people in a group who all have varying levels of ability. "}, {"date": "11 Dec 2017", "title": "Psychiatric Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PrairieCare (Brooklyn Park, MN) in Jan 2017", "Interview Descriptions": "I talked with two of the nurse supervisors in a room. They asked questions about my schooling and my experience. Where I want to be in the mental health field and how far I want to go. What I currently do in my career, and why I do not like it or why I am looking for another job.", "Interview Questions": "How would you handle a patient who becomes violent?"}, {"date": "4 Oct 2017", "title": "Psychiatric Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at PrairieCare (Maple Grove, MN) in Oct 2014", "Interview Descriptions": "They called me to set up an interview. I went in, they asked a few basic questions and then asked me to describe how I would respond to a couple different situations. It was brief and easy.", "Interview Questions": "What would you do if someone said they were going to hurt themselves?"}]]