[[{"date": "30 May 2023", "title": "Inpatient Coder I Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Sparrow Health System (Lansing, MI)", "Interview Descriptions": "One interview done with team lead and another coder, basic questions and then a coding test that was done on site, non formal process, seemed unprofessional, interview was in the back corner of the basement of the hospital", "Interview Questions": "Basic interview questions and experience"}, {"date": "11 May 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Sparrow Health System (Lansing, MI)", "Interview Descriptions": "It went well. Usual questions like strengths and tell me a time when you had a problem to solve etc. we went over work history also and experiences at each place", "Interview Questions": "What are your strengths and weaknesses"}, {"date": "4 Mar 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sparrow Health System", "Interview Descriptions": "Be aware that when you apply to Sparrow’s main hospital in Lansing, they do group interviews with a twist. Not only are 2 people often present, but when you apply for certain jobs on a specific unit, you often don’t even interview with that unit’s management and after the interview you then bid on a unit and hope they have the position on the unit you actually want.", "Interview Questions": "Tell us about a time you had to give a family hard news to accept, and how did you handle it?"}, {"date": "29 Jan 2023", "title": "Systems Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Sparrow Health System", "Interview Descriptions": "Awkward and required automated testing prior to learning about the position and requirements. Passed exam and then was put in an interview queue where I was basically told that I wasn't a good fit only a few minutes into the interview. I feel like I wasted a lot of time and they wasted money sending me through and automated test.", "Interview Questions": "Automated test which was supposed to test analytical skills."}, {"date": "4 Jan 2023", "title": "Housekeeper Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sparrow Health System (Lansing, MI)", "Interview Descriptions": "Got a call from HR setting me up with an interview with the manager. Had the interview over zoom and was offered the job on the spot. It took about two weeks after that to finish the physical and drug test.", "Interview Questions": "Name a time you dealt with a difficult customer"}, {"date": "18 Jul 2022", "title": "Human Resources Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sparrow Health System", "Interview Descriptions": "I applied online and took a long online assessment with a bunch of personality questions that were multiple choice, but then I never heard back, don't even think I got a rejection", "Interview Questions": "It was a lot of personality-type questions"}, {"date": "30 Mar 2023", "title": "Cardiac Rehabilitation Exercise Physiologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sparrow Health System (Lansing, MI) in Jan 2022", "Interview Descriptions": "Mine was virtual due to covid which no longer happens, but the managers were friendly and interested in what I had to say. Both the supervising manager and the director of the department were present for my interview.", "Interview Questions": "What was a mistake you made and how did you handle it?"}, {"date": "23 Nov 2021", "title": "Nurse Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sparrow Health System", "Interview Descriptions": "Very easy video interview with a panel of interviewers. Multiple questions asked. It was pretty simple but unfortunately not all had a good connection so it made it a little more difficult for them to hear my entire answer", "Interview Questions": "What type of budget experience do you have?"}, {"date": "9 Aug 2022", "title": "Laboratory Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sparrow Health System (Lansing, MI) in Nov 2021", "Interview Descriptions": "My interview process was faster than expected, probably because of the lack of manpower during the pandemic. We ended up talking about my university career more than the job in itself.", "Interview Questions": "Tell me about yourself \nWhat experience do you have in this position?"}, {"date": "1 Sept 2021", "title": "Resident Physician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sparrow Health System", "Interview Descriptions": "went smoothly. The interviewer was very professional, \n the helped me to understand what the position would teach me and how it would help me grow they also informed me  what was expected of me on the job", "Interview Questions": "what will you add to our team "}], [{"date": "4 Aug 2021", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sparrow Health System", "Interview Descriptions": "This was not a difficult interview process.. I was asked basic interview questions. Be prepared to tell about your strengths and also your weakness. Also research the company and know why you want to work for them and the qualities you will bring to the company.", "Interview Questions": "Tell me about yourself and why we should hire you"}, {"date": "28 Jun 2021", "title": "Entry Level Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sparrow Health System (Lansing, MI) in Jun 2021", "Interview Descriptions": "The interview was very informative, providing an overview of the variety of work that the position offers. Interviewer was very accommodating, and offered a dynamic conversation, which was enjoyable. Overall, an excellent interview", "Interview Questions": "What led you to choose your major?"}, {"date": "2 Apr 2021", "title": "IT Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sparrow Health System", "Interview Descriptions": "There is an online assessment, which is timed and proctored, then there are two rounds of interviews.  Each round of interviews included three people.  Good follow up and contact with their primary recruiting contact.", "Interview Questions": "What interests you about Sparrow?"}, {"date": "17 Mar 2021", "title": "Resident Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sparrow Health System", "Interview Descriptions": "Fair and casual in a good way. Conversations flowed easily and everyone was very candid about the program and their own experiences. I would certainly recommend this system to anyone interested.", "Interview Questions": "What would you do in this situation?"}, {"date": "25 Feb 2022", "title": "Hospice RN Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sparrow Health System (Lansing, MI) in Mar 2021", "Interview Descriptions": "Over the Phone Interview with two people. Was asked situational questions and how I would respond/act. There were probably 15 questions. Some were hard to answer as this was my first nursing job.", "Interview Questions": "How would you handle a situation where a patients family was angry with the care their family member was getting?"}, {"date": "9 Mar 2021", "title": "Patient Safety Sitter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sparrow Health System (Lansing, MI) in Feb 2021", "Interview Descriptions": "Easy, upbeat, and great interviewers. Normally two interviewers for this position. Phone interview because of pandemic but normally in person. Interviewers make you comfortable not intimidating. Probably one of the best interviews I’ve ever had.", "Interview Questions": "What makes you think you’re a good candidate to work here at sparrow?"}, {"date": "1 Mar 2021", "title": "Manager of Donor Relations and Volunteer Services Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sparrow Health System in Jan 2021", "Interview Descriptions": "I was contacted via e-mail to set up an interview on WebEx. I was interviewed by two individuals and it was a friendly experience of conversation back and forth. It was just over 30 minutes. It took about 2 weeks to hear back.", "Interview Questions": "What are some of your strengths that would set you apart for this position? "}, {"date": "1 Oct 2020", "title": "Practicum Student Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sparrow Health System", "Interview Descriptions": "applied online and emailed me that I had the opportunity for an in person interview. They asked about 10 questions which took about 20 min or so and then showed me around the hospital", "Interview Questions": "Why do you think you would be a good fit here?"}, {"date": "27 Aug 2020", "title": "Intern - Hourly Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Sparrow Health System", "Interview Descriptions": "A phone interview essentially walking through your resume followed by an hour long behavioral interview. The HR representative called after each to see how everything went. The interview was not necessarily difficult but it was detailed. Each member was very kind and not intimidating at all.", "Interview Questions": "Give three words that describe yourself."}, {"date": "9 Dec 2020", "title": "Membership Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sparrow Health System in Aug 2020", "Interview Descriptions": "The interview process began by a zoom phone call which was really relaxed, more of a get to know you interview. This was followed by a worksheet/take home quiz after which was a larger team interview which discussed more position specific experience.", "Interview Questions": "What are you looking to get out of this role?"}], [{"date": "9 May 2021", "title": "Patient Safety Sitter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sparrow Health System (Lansing, MI) in Apr 2020", "Interview Descriptions": "Received a phone call with 2 interviewers after applying. Asked very basic questions and wrote down my answers. They let me know that they would call back or email me when they decided.", "Interview Questions": "What is an example of a time you were asked to handle a task above your knowledge and how did you handle it?"}, {"date": "25 Jan 2021", "title": "Insurance Sales Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Sparrow Health System (Lansing, MI) in Mar 2020", "Interview Descriptions": "The interview process was a three step process but it was pretty straight forward. It consisted of speaking with the VP, the director, and a team member. The timeline was pretty long but that’s how it is at sparrow. It was pretty straight forward overall and a really great experience.", "Interview Questions": "Describe any experience you’ve had that will transfer to this role."}, {"date": "10 Feb 2020", "title": "Internship Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sparrow Health System", "Interview Descriptions": "Forced me to go through two hour, at-home proctored exam that had an outsourced company stare at me and make sure I made no noise during the entire exam. Really not great, and a lot of effort for something that is ultimately just another job application in a sea of potential. The more work you make me go through for a really minor job, the less I'm going to be compelled to actually do it.  Phone interview was incredibly dull and lengthy, but still standard for an interview.", "Interview Questions": "Why do you want this position?"}, {"date": "24 Jan 2021", "title": "Entry Level IT Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sparrow Health System (East Lansing, MI) in Feb 2020", "Interview Descriptions": "I initially got an email asking me to take analytical/technical aptitude tests online. They were rather lengthy - they say you should save two hours for these exams.  After completion, I was then asked to schedule an interview with the IT dept. lead.  I got an email several days after the interview telling me I was not going to be moving forward.", "Interview Questions": "What do you know about Sparrow/my position at Sparrow?\n\nWhat college classes did you enjoy most? What classes were most challenging? \n"}, {"date": "2 Dec 2019", "title": "Systems Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sparrow Health System (New York, NY) in Dec 2019", "Interview Descriptions": "Filled out an application/questionnaire on the Sparrow website, received an email explaining  that I had to take a proctored skill assessment. \n\n The assessment was disheartening, lots of word problems and questions based upon a made up programming language. I've been in IT for 10 years, I personally found it difficult. If you are good at school and have experience taking SAT style tests im sure you won't have an issue.\n\nI did not receive an offer, and that's ok. \n\nWhat bothers me is I don't know if its because I did poorly on a surprise SAT test or if my experience is not what they are looking for.", "Interview Questions": "(very rough recreation, you get the idea)\nBob is a plumber, he works at company A, bob lives in Texas. Joe is also a plumber and does not work at company A. joes has a wife and kids. which of the following statements are true/false/not enough information?\n\n.All plumbers have families\n.All plumbers work at company A"}, {"date": "31 Oct 2019", "title": "Patient Care Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sparrow Health System (Lansing, MI)", "Interview Descriptions": "Applied online and they called me back a week later to interview. The interview was with two nurse managers and asked situational questions to see what your reaction/response would be.", "Interview Questions": "Describe a time at work when you didn't finish everything you needed to by the end of the day."}, {"date": "9 Jun 2023", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sparrow Health System (East Lansing, MI) in Sept 2019", "Interview Descriptions": "Relatively easy. Kind staff. I was unfamiliar with the buildings so it made the first couple days tough for finding the office and training. It was a simple process overall", "Interview Questions": "What shift do you prefer"}, {"date": "22 Aug 2019", "title": "Nursing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sparrow Health System (Lansing, MI) in Aug 2019", "Interview Descriptions": "Basic questions regarding patient care situations. Interviewed with 2 managers at the same time. Took about 30 minutes. Took 3 weeks to get an interview & another week to get a call back.", "Interview Questions": "Name a time you handled a difficult patient load & how did you handle it"}, {"date": "19 Apr 2023", "title": "Clinical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sparrow Health System (Lansing, MI) in Jul 2019", "Interview Descriptions": "It was quick and painless. I sent in my application and a few weeks later, I got a time to come in and interview with the afternoon supervisor and lab manager. After a couple interview questions, I had a tour of the lab. I had to send in references and then I got a job offer shortly after.", "Interview Questions": "Why did you choose this career?"}, {"date": "25 Jun 2021", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Sparrow Health System (Lansing, MI) in May 2019", "Interview Descriptions": "General questions nothing too invasive about you. Many questions pertaining to your adaptability in unexpected situations. As well as your ability to work within a team and how well you interact with patients and donors.", "Interview Questions": "Name a time you had something difficult arise at work and how did you handle it?"}], [{"date": "14 Aug 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sparrow Health System in May 2019", "Interview Descriptions": "Very casual and comfortable. During your interview you will interview with two managers from different departments. The only thing i did not enjoy, was that I was not interviewing with a manager from the department I applied to.", "Interview Questions": "If you were taking care of a female patient and in her culture, females do not make their own decisions, when the husband leaves the room, the patient asks you to change the course of treatment, how would you handle this situation? "}, {"date": "11 Sept 2020", "title": "Occupational Therapist Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Sparrow Health System (Lansing, MI) in Mar 2019", "Interview Descriptions": "The interview was casual, yet professional and informative.  There was a genuine interest to get to know the candidate and match them with an appropriate supervisor.  A tour of the facilities was given as well.", "Interview Questions": "How much experience do you have with infants?"}, {"date": "22 Aug 2018", "title": "Applications Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sparrow Health System", "Interview Descriptions": "Phone call with the recruiter, then was brought in to do a proctored assessment. I passed and was brought in  for an on site interview.  1 hour with a couple of the managers, then a 1 hour interview with the director.", "Interview Questions": "Three qualities that best describe you , team experience, significant achievements "}, {"date": "28 Apr 2021", "title": "Human Resources Generalist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sparrow Health System in Jul 2018", "Interview Descriptions": "I was interviewed first by a panel of three managers as there were multiple roles available, then by two higher level managers. There was also a personality assessment and reference collection.", "Interview Questions": "What makes you successful in your role?"}, {"date": "1 Jun 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sparrow Health System", "Interview Descriptions": "Mostly situation based questions, but nothing too specific to a certain type of nursing. Nurse manager was very nice. Some of the questions were tricky but overall screened for the critical thinking that nursing requires.", "Interview Questions": "Give an example of when it would be okay to be late to work"}, {"date": "28 Apr 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Sparrow Health System (Lansing, MI)", "Interview Descriptions": "Waited four months to hear back from HR to then finally got an interview. Was interviewed by two nurse managers. They were very friendly and patient. It was a difficult interview where they ask situational questions and what my reaction would be for each.", "Interview Questions": "Why did you choose nursing?"}, {"date": "20 Feb 2018", "title": "Pct Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sparrow Health System (Lansing, MI) in Feb 2018", "Interview Descriptions": "I applied online and had an interview within about a week of the online application. They are very quick to decide if they would like to interview you or not.", "Interview Questions": "You are asked to complete a skill you don't know how to do, how do you proceed?"}, {"date": "3 Jul 2018", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Sparrow Health System (Lansing, MI) in Oct 2017", "Interview Descriptions": "One remote technical interview, one in-person interview, and multiple phone calls. The initial phone screen was very informal, and the interview was very much about the fit, rather than technical skills.", "Interview Questions": "Why Sparrow?"}, {"date": "17 Oct 2017", "title": "Business Systems Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sparrow Health System (Lansing, MI) in Oct 2017", "Interview Descriptions": "Fast and impersonal.  I was contacted by email quickly after applying online, letting me know I was moving forward in the process.  The next day I received another email to schedule time to test (Epic Sphinx).  I took the test on a Thursday and the following Monday I notified, via email, that I was NOT going forward in the process.  No phone contact at all.  Considering this is a hospital, which deals with people, I thought it was impersonal to do everything via email only, with generic group box id.", "Interview Questions": "Epic skills test that was easily google-able to find the right answers.  It wasn't hard, more annoying than anything.  On the IT portion - they made up a language and you had to 'code' in it."}, {"date": "6 Jul 2017", "title": "Recruiting Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Sparrow Health System (Lansing, MI) in Jun 2017", "Interview Descriptions": "The hiring process and interview went rather smooth. My interview consisted of two separate panels. It did not take long to hear back from the manager with an offer after I had interviewed.", "Interview Questions": "How do you work well with groups?"}], [{"date": "10 May 2017", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sparrow Health System", "Interview Descriptions": "Epic skills test that was easily google-able to find the right answers. It was a weird test, but not hard to do well on. They will also have a third party interviewing consultant call you to ask you screening questions.", "Interview Questions": "They ask you how you would feel about answering tickets all day."}, {"date": "12 Sept 2018", "title": "IT Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sparrow Health System in Jan 2017", "Interview Descriptions": "Didn't get far into the interview process. They started by giving you an assessment by Epic that took about 2 hours to complete. Then came a phone interview with a highly experienced recruiter that asked the usual behavioral questions.", "Interview Questions": "Why Sparrow? "}, {"date": "3 Mar 2021", "title": "Environmental Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sparrow Health System (Lansing, MI) in Jan 2017", "Interview Descriptions": "You meet with the supervisor and answer questions about how to handle curtain situations in the hospital. They want to make sure you do not have a problem working with all the personalities in the work place.", "Interview Questions": "Have you ever worked in healthcare before?"}, {"date": "22 Aug 2019", "title": "Patient Safety Sitter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Sparrow Health System (Lansing, MI) in Jan 2017", "Interview Descriptions": "The interview was very nice that has a couple questions they ask how you deal with patients that's how you can help people but I like to play so was a very good place to walk and experienced a lot and I have learned a lot I would love to be back then continue working for them but I'm no longer there for now.", "Interview Questions": "Where do you see yourself within the next 5 years?"}, {"date": "1 Dec 2016", "title": "Business Intelligence Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Sparrow Health System", "Interview Descriptions": "Very touch-and-go HR department. They reached out to me for the position and told me I would have to a skills assessment test. After that, there was absolutely zero communication. Despite multiple attempts to reconnect, I could never get anyone on the phone. Terrible experience overall.", "Interview Questions": "N/A"}, {"date": "4 Jul 2016", "title": "Help Desk Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Sparrow Health System (Lansing, MI) in Jun 2016", "Interview Descriptions": "Contacted by e-mail and was asked to take EPIC assessment. Following successful completion of exam was given quick phone interview then waited week for first in person interview. Interview was with two managers, and lasted about 90 minutes. Contacted later that week to schedule a second interview the following week. This one was with four people from different job roles to find best fit. After that was a few weeks of waiting while HR sorted through all the paperwork before a job offer was made.", "Interview Questions": "How do you deal with an irate customer"}, {"date": "6 Dec 2016", "title": "Diagnostic Medical Sonographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Sparrow Health System (Lansing, MI) in Jun 2016", "Interview Descriptions": "I interviewed with my direct supervisor and one of our upper management supervisors in our department. They sat across from me and started by getting to know me a little before they dove into the interview questions. They were very personal and both had smiles on their faces. They would ask a question and let me have a few minutes to think about it before I answered. They were very patient and understanding if I wasn't quite sure how to answer a question. I felt pretty good when I came out of my interview.", "Interview Questions": "They asked me what I thought my strongest skill as a sonographer was."}, {"date": "25 Apr 2017", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sparrow Health System (Lansing, MI) in Apr 2016", "Interview Descriptions": "Had to submit an online packet and then have 5 references take a survey on me. They called and offered me an interview and then I met with two random nurse managers and they asked me questions tailored to the answers on my personality quiz.", "Interview Questions": "If there is a nurse talking about a patient in the lunch room, how will you respond?"}, {"date": "28 Mar 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sparrow Health System in Mar 2016", "Interview Descriptions": "I received an email asking me if I was available for an interview at 1 PM two days later. I replied to the email and said that I was. I then received an email telling me where to meet. When I arrived for the interview about ten other people were at the meeting place dressed in interview clothes. More people continued to arrive. Interviewers came out an called each person one by one. I was interviewed by 3 managers from various units. They asked me six questions, gave me a folder with information about the hospital, and told me there would be a tour at the end if I wanted to attend it. The interview lasted fifteen minutes total. After the interview I sat in the meeting spot to see how long everyone else's interviews lasted, and the average time seemed to be 15 minutes. One week later I received a phone call telling me that I got the job!", "Interview Questions": "Tell us about yourself. Why are you interested in Sparrow?"}, {"date": "30 Jun 2016", "title": "Psychiatric Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sparrow Health System in Mar 2016", "Interview Descriptions": "Applied online and recieved a call about a week later asking me to come for an interview. I got there and waited for about 20 minutes before the floor manager and a current tech came to take me to the room. The tech was friendly but seemed very tired, but the manager seemed like I was inconveniencing her. They asked some basic questions and then asked me about my experience in the medical field. According to the online application information, no medical experience was required. However, I was asked about my medical field experience and when I said I did not have any, the manager became even more irritated. This is all after she called me, after seeing my resume (with no medical experience) to set up an interview. Left the meeting feeling like a burden and glad to be done with it. She said I would hear in 1-2 weeks about the position, but it took 2 months to get an email saying they were going in a different direction. I don't think it's a bad company, just think that their hiring process needs some work. I drove over an hour to interview for a job that I apparently wasn't qualified for in the first place, and felt like I was being punished for it. Wasted my time as well as the company's.", "Interview Questions": "What kind of medical experience do you have?"}], [{"date": "5 Jan 2016", "title": "Patient Access Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sparrow Health System", "Interview Descriptions": "Very simply and easy. I went in and met her and had a great time. She asked a few questions, and showed me around and I felt confident that I was getting the job.", "Interview Questions": "Whats one thing you dislike about your last job?"}, {"date": "12 Nov 2016", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sparrow Health System (East Lansing, MI) in Jan 2016", "Interview Descriptions": "A lot of steps but it's worth it in the end.\r\n\r\nThere were one prelimenary test. There were two phone interviews. Then there was one real interview. \r\n\r\nThen after all that there was even a drug test.\r\n\r\nEven so, it really wasn't too bad. Just refersh on databases and C# and you should be fine.", "Interview Questions": "If an apple is 40 cents and a grapefruit is worth 80 cents how much is a pear"}, {"date": "18 Dec 2015", "title": "IT Professional Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at Sparrow Health System", "Interview Descriptions": "First took EPIC test, then spoke with recruiter for about an hour, then had a reference check, then had an in person interview scheduled, then spoke with recruiter again. I heard absolutely nothing from the company until about a month after my actual in person interview and it was to see how I felt. Then another two weeks later an email explaining they were not offering the position. Overall it was very deceiving considering after my in person interview the recruiter called to say how well everyone received me. No matter, seems that they don't do well with IT retention anyway.", "Interview Questions": "Why would you be a good asset to the team?"}, {"date": "19 Nov 2015", "title": "Business Systems Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sparrow Health System (Lansing, MI) in Nov 2015", "Interview Descriptions": "Once passing intial screening was called in to take an Epic skills assessment.  After having done well enough on the exam the next step was a phone interview with their regional recruiter.  After having done well enough during that interview I was given an in person interview in Lanisng with three of their directors.", "Interview Questions": "Most of the questions were all job relevant, there were no oddball questions that seemed irrelevant"}, {"date": "25 Jan 2016", "title": "ER EMT Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sparrow Health System (Lansing, MI) in Nov 2015", "Interview Descriptions": "Interveiw is long and takes sometime you get a face to face inteveiw with managers and nurses and they ask situational questions.  Dress to impress and bring a resume.  I wore a suit to mine and made sure I was ready.  Answer the questions as honestly as you can.", "Interview Questions": "If you didn't know how to preform a task in the trauma room what would do and say and how would you fix it?"}, {"date": "28 Sept 2015", "title": "App Systems Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Sparrow Health System (East Lansing, MI) in Jun 2015", "Interview Descriptions": "It was a phone interview following a previous on-site programing skill test. I was interviewed by a consultant hired by Sparrow. Asked a few questions about me. She also told me more details about the job duties, which seemed to be quite different from their job description on the job application site. The interview lasted about 20min.", "Interview Questions": "What do you plan to do with you degree?"}, {"date": "28 Jan 2016", "title": "X-ray Tech Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sparrow Health System (Lansing, MI) in Apr 2015", "Interview Descriptions": "5 hrs of multiple ppl from coworkers and HR, Managment team and then a second interview with recruiter to go o ver benefits and pay etc. it was long and alot of repeated questions were asked", "Interview Questions": "how do you handle stress?"}, {"date": "25 Mar 2015", "title": "Sever Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Sparrow Health System", "Interview Descriptions": "It takes some time for them to get application because you have to apply through the Sparrow Hospital Website. HR decides whether or not to send it through... so thats annoying.\r\nMet with Restaurant Manager and Assistant manager. Its a pretty informal Interview.\r\n\r\nThe Hospital Tests for Nicotine!", "Interview Questions": "What experience do you have?\r\nWhats your availability?"}, {"date": "19 Mar 2015", "title": "IT Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Sparrow Health System (Lansing, MI)", "Interview Descriptions": "I first had to take the \"epic test\" in Lansing onsite. After I did that I was contacted by a recruiter who notified me that I was in the next steps of the process. She asked me what I was interested in and I let her know the positions I was interested in. An interview was then set up, which consisted of probably 6-7 different managers broken up 2-3 at a time. The interview lasted about 3 hours.", "Interview Questions": "How would you go about counting all of the stop lights in the city?"}, {"date": "17 Jun 2015", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Sparrow Health System (Lansing, MI) in Mar 2015", "Interview Descriptions": "Met with them at a career fair and then was contacted after the fair to apply to positions online.  Entire process was nice.  Had a team member of Sparrow that I could contact about the IT dept.  rather than having to ask HR.  \r\n\r\nBefore you are interviewed you have to a logic assessment on-site, which can be an inconvenience if you don't have a car or are applying from far away.  After passing the assessment, I received an interview.\r\n\r\nInterview was with their director of IT and two managers.  Nothing too difficult.  Just the normal interview questions.", "Interview Questions": "What experience do you have in healthcare?"}], [{"date": "9 Feb 2015", "title": "Full-Time CareGiver Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Sparrow Health System", "Interview Descriptions": "I was interviewed by Three different managers. I tried for a period of 3 months, to get in for any position. I was Not desperate , but was Very much in need of changing from my current job. Initially , I met with a manager to discuss my skills and she was very interested . She told me, that there was a New area being created and My skills and Personality would be a Perfect fit. I was contacted, when That position opened-up and that is when i was called in to meet with the Three Upper Managers and was offered the position.", "Interview Questions": "Can I work well with ill patients? Can i work well as a team player?"}, {"date": "3 Mar 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Sparrow Health System", "Interview Descriptions": "Nurse recruiter called to schedule an interview - only gave me one date and time, which I could not make due to a mandatory clinical. They offered to schedule a phone interview instead. The phone interview was with the nurse recruiter as well as a few of the unit managers.", "Interview Questions": "1. Tell us one time you doubted your career choice\r\n2. How would you document a pressure ulcer?\r\n3. Tell us the most stressful situation you were in as a nursing student"}, {"date": "8 Nov 2013", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sparrow Health System (Lansing, MI) in Mar 2010", "Interview Descriptions": "very diligent. two phone interviews and two one day interviews", "Interview Questions": "nothing out of the ordinary"}, {"date": "2 Jul 2014", "title": "Facilities Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sparrow Health System (Lansing, MI) in Mar 2010", "Interview Descriptions": "phone contact by Sparrow human resources. on site interview, followed by email references (minimum of 5). Processing was long and tedious including innoculation records and drug/TB testing. Took a total of nearly four weeks to be processed and cleared to work once position was accepted.", "Interview Questions": "what do you like least about your current job"}]]