[[{"date": "9 Jun 2023", "title": "Medical Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MultiCare Health System (Washington, DC) in Jun 2023", "Interview Descriptions": "Interview process was smooth. I was nervous at first but the interviewer was nice and smiled at me. The questions are basic.It was conducted at microsoft teams. It was a panel interview with 3-4 persons.", "Interview Questions": "Tell me about yourself How do you handle difficult situation"}, {"date": "28 Feb 2023", "title": "Compliance Auditor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at MultiCare Health System (New York, NY)", "Interview Descriptions": "I was invited to take a survey, one of the first questions was whether I was above or below 40 years old. The next 30-40 questions were all psychological, asking how you get along with coworkers, group projects, etc., and then the last questions were about how many times you looked for a job while employed at your previous job. It felt very probing and invasive, particularly for a position which is not even a leadership position.", "Interview Questions": "Are you over 40 or under 40?"}, {"date": "28 Mar 2023", "title": "SLP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MultiCare Health System (Tacoma, WA) in Jan 2023", "Interview Descriptions": "Very professional . Asked insightful questions that lead me to take the job. Lasted about an hour. They were able to answer all of my questions. At the end we talked through a mock evaluation.", "Interview Questions": "Have you ever participated in co-treatments or collaborated with OT/PT?"}, {"date": "1 Dec 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MultiCare Health System", "Interview Descriptions": "Prescreen-phone screen conducted by recruiter. Basic questions about work experience. Tell me about yourself. Moved onto next interview with management. Had time to ask recruiter question about how long she worked there and did she like it.", "Interview Questions": "How many years of management experience do you have?"}, {"date": "19 Nov 2022", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MultiCare Health System", "Interview Descriptions": "I filled out an application online through the Multicare website. I received a call from the clinic manager for an interview. After the interview, I was offered the job. The entire process took around 1 month or so.", "Interview Questions": "Name some of your strengths and weaknesses."}, {"date": "3 Dec 2022", "title": "Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MultiCare Health System in Nov 2022", "Interview Descriptions": "I have worked at several different hospital systems over the years, but Multicare takes the cake for worst HR department. They call you to set up an interview and then Human Resources never responds for confirmation or follow up.... or they forget to call you at your scheduled intake call time. No transparency or accountability at all. Medical personnel have busy schedules, and its a huge inconvenience to have to hunt down unresponsive/unreliable human resources reps. Its no wonder they have so many vacancies.", "Interview Questions": "N/A"}, {"date": "30 Oct 2022", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MultiCare Health System", "Interview Descriptions": "After speaking with a recruiter, who knew only a superficial amount of info about the job, I had a scheduled interview with the two directors of the position. They were kind and friendly and it was an engaged conversation. I didn’t hear back for over a week, getting a call from the recruiter that the job was given to an internal candidate. Suddenly it felt like my interview was required and I was never going to have gotten the job. A bit frustrating experience.", "Interview Questions": "They asked about strengths, my perspective on customer service in healthcare, and just an “about me” summary."}, {"date": "5 Aug 2022", "title": "Physician Assistant, PA-C Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MultiCare Health System", "Interview Descriptions": "The interview via Zoom lasted 15 minutes and the two medical directors I spoke with sped through the interview. I did not get a sense that they cared or wanted to get to know me at all. It seemed they needed to have a certain number of interviews to check a box. I did not get the sense that I would want to work for this company.", "Interview Questions": "Why are you interested in working for Multicare?"}, {"date": "16 Aug 2022", "title": "Mental Health Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at MultiCare Health System (Puyallup, WA) in Aug 2022", "Interview Descriptions": "Easy and down to earth. Somewhat predictable questions about why interests and experience with job duties and familiarity with the company. It begins with scheduling a phone interview, and if chosen as a finalist, an in-person interview at the clinic location is scheduled. Follow-up with the recruiter is timely.", "Interview Questions": "Where do you see yourself in 5 years?\nWhat are your goals?\nWhich of the company's core tenants are most important?"}, {"date": "23 Jul 2022", "title": "Patient Care Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at MultiCare Health System", "Interview Descriptions": "Very simple interviewing process and straight forward. good conversation and during the interview they gave me a tour of the facility to get a sense of how the job is.", "Interview Questions": "Tell me about a time where you have delt with a difficult customer or patient?\n"}], [{"date": "12 Apr 2023", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MultiCare Health System in Jun 2022", "Interview Descriptions": "Super quick and easy. They’re desperate for workers but at the same time picky on candidates. They want those who are willing to stick around longer and be apart of a team.", "Interview Questions": "What makes you a good employee? In a tough situation how would you handle it?"}, {"date": "8 Apr 2022", "title": "Clinic Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MultiCare Health System (Tacoma, WA)", "Interview Descriptions": "Basic interview over the phone with the recruiter. Send an interview with a regional manager over the phone. Then a panel interview. All of this took place in less than one business week.", "Interview Questions": "What makes you a good fit for Multicare health systems?"}, {"date": "28 Apr 2022", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MultiCare Health System (Tacoma, WA) in Apr 2022", "Interview Descriptions": "Very friendly, basic resume review. Focused heavily on team fit, asked many questions about my motivations to pursue this specific setting. No hard ball questions. I was a former intern at this location so that helped immensely. They reiterated that they prefer to higher former students as well.", "Interview Questions": "\"How do you think your experience as a Product Manager will influence your ability to perform well here?"}, {"date": "22 Apr 2022", "title": "Centralized Call Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MultiCare Health System (Spokane, WA) in Apr 2022", "Interview Descriptions": "Received emails to set up two video conference interviews (recruiter & future supervisor). Received offer w/in 1 week of submitting resume. Set up a tour and shadowed some calls. The Access Center was impressive with modern equipment & software. Seemed to be a fun and interesting place to work.", "Interview Questions": "Tell me about yourself"}, {"date": "22 Feb 2022", "title": "Senior Cybersecurity Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MultiCare Health System", "Interview Descriptions": "Standard interview phone screen with a recruiter who doesn't necessarily know much about the position. Afterwards a  scheduled initial greet with the manager of the team to get a feel for the job and for personality fit. A phone call with the CISO to discuss the team vision and future roadmap and what they are looking for in a new hire. Then an in-person (pre-Covid) interview with the larger team you'll be a part of.", "Interview Questions": "Standard security question and networking basics questions. Problem solving methodology is what they were really after, which I appreciate more than a pass/fail based on pre-canned questions that aren't relevant to the job per-say."}, {"date": "24 Mar 2022", "title": "Accounting Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MultiCare Health System in Feb 2022", "Interview Descriptions": "Interview process was totally great, but the follow through wasn't so great. Initially, I received an email from a recruiter to schedule a video interview, and then had the interview. I was informed I had made it to a second round video interview the following week. It was after this point that my experience declined a bit. I genuinely enjoyed speaking to the employees who were interviewing me, and felt like we had good discussions going on and were on the same page. Because we had such a great chat, I again emailed them the following week to thank them for their time and let them know I was still very interested. I did receive a response quickly letting me know they were still thinking things over. I decided I'd give them some space to decide, and then noticed online that the position was filled 3 weeks later... I opted to follow up once more just to check in and thank them again for their time and was ghosted. I can understand being busy and having things going on, heck, I'm busy with work right now, too. But it was disappointing to be ghosted after going so far in the process. Seems like a great place to work, and like they really are a family once you're in, but I just wish the communication had been better and that I could have been told I was no longer being considered instead of anxiously checking my email and phone for a call.", "Interview Questions": "How do you keep track of multiple projects?\r\n"}, {"date": "1 Mar 2022", "title": "Call Center Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MultiCare Health System (Auburn, WA) in Feb 2022", "Interview Descriptions": "Casey was nice! She asked really great in depth questions that made you really think. She was VERY informative, and made you feel very comfortable. Overall great interview experience, one of the most “at ease” interviews I’ve had. Very excited to join the team.", "Interview Questions": "Where do you see your self, what are your goals? "}, {"date": "16 Nov 2021", "title": "Health Screener Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MultiCare Health System", "Interview Descriptions": "Easy! They were welcoming and the formality of questions was little to none, if anything they wanted to know if you have the enthusiasm and characteristics to do good at the job.", "Interview Questions": "Do you work well under pressure "}, {"date": "20 Jun 2022", "title": "Patient Access Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at MultiCare Health System (Tacoma, WA) in Nov 2021", "Interview Descriptions": "Very short and simple. Got a call not too long after applying, talked to a hiring agent, and I was on board! Started as a float but eventually took an FTE at Parkland OCED and now I have moved to FW!", "Interview Questions": "What other hospital have you worked at?"}, {"date": "13 Jan 2022", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MultiCare Health System (Auburn, WA) in Oct 2021", "Interview Descriptions": "Virtual meeting to test communication skills and knowledge of definitions and information. Followed by an in person interview with a test on knowledge about databases and querying. Must have basic knowledge and database models and relationships. Need to know Sql", "Interview Questions": "Create a query to produce expected output."}], [{"date": "24 Mar 2023", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at MultiCare Health System in Sept 2021", "Interview Descriptions": "First I met with a recruiter via phone. They scheduled a Zoom interview with the director/manager of the facility. I interviewed with them and later that day I received a phone call and an email with a job offer.", "Interview Questions": "Basic questions such as \"Tell me about yourself,\" \"Strengths and weaknesses,\" etc."}, {"date": "4 Mar 2022", "title": "Senior Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at MultiCare Health System (Mesa, AZ) in Sept 2021", "Interview Descriptions": "I was referred by a current employee for the position and I was given the hiring manager's information.  I sent the manager my resume and I had a response from him within a day, asking me to formally apply.  The  interview was scheduled within a week, and although I was on vacation, I had a MS Teams meeting with the hiring manager and the Director.  The interview was up beat and vey pleasant.  I was nervous, but they made me feel at ease.  I had a phone call the evening ofthe interview with an offer.  I was surprised how quickly they responded and was very excited to join.  I had heard great things about MultiCare.", "Interview Questions": "I was asked if I was familiar with foundation accounting."}, {"date": "18 Jul 2021", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MultiCare Health System", "Interview Descriptions": "Quick response, very smooth, friendly, efficient.\n\nInterview itself took about 30 min long, nursing manager was very nice and answerd all my questions in detail. HR was nice, emails are answered quickly.", "Interview Questions": "can you talk about yourself\nwhy you choose the career"}, {"date": "8 Jun 2021", "title": "Mental Health Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MultiCare Health System (Puyallup, WA) in Jun 2021", "Interview Descriptions": "HR person helped to connect with a member of the team, who scheduled the interview; Group interview with the leadership team; Each person asked a handful of questions; Very nice folks; Reasonable questions", "Interview Questions": "What was one time you had to set boundaries with a client? How would you provide care for someone with trauma / what approach would you use? be specific. What do you look for in a supervisor? "}, {"date": "25 Aug 2022", "title": "Clinical Pharmacist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MultiCare Health System in Jun 2021", "Interview Descriptions": "Communication was pretty much automated and impersonal. Not sure how their recruiting works actually.  I’m sure resumes just get mass filtered.  Would try applying again if an interesting position opens.  Not sure remote is an option", "Interview Questions": "How did you hear about us? "}, {"date": "6 May 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MultiCare Health System (Tacoma, WA) in Apr 2021", "Interview Descriptions": "Initial phone call with recruiter to ask general questions, mostly about what I was looking for in my next nursing position. Interview via video call with two hiring manager of the department I was interested in. Very relaxed!", "Interview Questions": "Describe a time that someone you were supervising was not meeting expectations and what you did about it."}, {"date": "7 Mar 2021", "title": "PCT/CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MultiCare Health System", "Interview Descriptions": "2 round of interviews. One phone interview and one in-person interview. Very typical interview questions. About 30-45 minutes for each interview. Interviewer was very friendly and easy to talk to.", "Interview Questions": "What is something kind that you’ve done for a coworker?"}, {"date": "7 Jan 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at MultiCare Health System (Auburn, WA) in Jan 2021", "Interview Descriptions": "The interview process was nice. They asked me general questions like where do you see yourself in 1-5 years, where do you think you need more improvement or development and some situational questions.", "Interview Questions": "Tell us about a time you had a difficult situation with a patient."}, {"date": "27 Aug 2020", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MultiCare Health System", "Interview Descriptions": "Initial interview with the nurse manager, and then waited about a week to get a call from HR.  I was given a tentative offer at this time and asked for references.", "Interview Questions": "What are your five year goals for your career?"}, {"date": "23 Aug 2020", "title": "Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MultiCare Health System (Lakewood, WA) in Jul 2020", "Interview Descriptions": "After submitting my application I was contacted within a few days by the Director to arrange a video interview for the recruiter position. They worked around my work schedule for this first call to ensure I wasn’t having to step out at my current job. Our first call went great and we seemed to be on the same page with what we were both looking for. \n\nI was told I’d be scheduled for a second interview with the recruiting team’s manager. This call was scheduled a few days later and was conducted via phone call. It was scheduled for an hour during my work day but wasn’t a problem as I was able to move some things around to accommodate. Again, our conversation was enjoyable and seemed to line up well with the direction of the company.\n\nThe final interview was a week later with the recruiting manager and some tenured recruiters via video interview. This one was a bit harder to accommodate due to the fact that it was for 90 mins during the middle of the day. However, I came up with an excuse for my current employer and was able to take the interview. Once again, we all seemed to be in sync with our answers to each other’s questions. I was told at the end of the interview that other people were still being entertained and that a final answer would be given to me by mid week the following week.\n\nThroughout the entire process, I would say that it was a positive experience. What changed this to a negative experience is that they did not follow through with what they had told me. I was not contacted midweek the following week. I decided to send an email to the recruiting manager thanking them and their team while also asking about next steps. After not receiving a response, on Friday, I decided to send an email to the director and to the hiring manager to try and spark some kind of conversation. Again, no response from either the director or the recruiting manager.\n\nI completely understand that I may not have been what they were looking for exactly. What I’m upset about is the fact that I was never even sent as much as a denial email. It has been two weeks since I was told I would have an answer. I’ve sent two emails and there was never a response from either the director or the recruiting manager. I was put through 3 interviews and was “ghosted” by two professionals that have been in this field for decades. I’ve been in recruiting for 8 years and know that it is common courtesy to inform a candidate of a final decision within the timeframe that was given. This was my first time ever interviewing multiple times and not hearing back from a company. It is extremely disappointing to experience this from a company as large as MultiCare is.", "Interview Questions": "What are some external sources you utilize when application flow is low."}], [{"date": "22 Apr 2020", "title": "Medical Laboratory Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MultiCare Health System (Tacoma, WA) in Apr 2020", "Interview Descriptions": "applied online, received a phone call a few days later to schedule the interview and had an interview with three supervisors and had to get four references to proceed with the application process", "Interview Questions": "Why do you want to work as MLT?"}, {"date": "9 Feb 2020", "title": "RN Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MultiCare Health System (San Mateo, CA) in Feb 2020", "Interview Descriptions": "Initially saw job posting on indeed. Applied directly on their website. ~2 weeks later, received email from HR stating that they forwarded my app to department managers. ~2 weeks later, received call to schedule an interview. Flew up and interviewed with panel.", "Interview Questions": "Why nursing?"}, {"date": "22 Jul 2021", "title": "Registered Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MultiCare Health System (Seattle, WA) in Jan 2020", "Interview Descriptions": "Phone interview, and in person interview. Questions about personality, work ethics and experience. Was friendly experience .Process takes about a month with back ground check before hire one to job", "Interview Questions": "Tell something about yourself that makes you unique "}, {"date": "5 Nov 2019", "title": "Appointment Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MultiCare Health System (Airway Heights, WA)", "Interview Descriptions": "Interviewed by 2 call center supervisors for approximately 15-20 minutes. Questions were typical and I think they were only looking out for an obviously inappropriate or red flag answer rather than my actual answer. One question was something like, “What type of supervisor do you like most?” Apparently there was more than one interviewee that responded with, “One that doesn’t try to micromanage and tell me how to do my job”", "Interview Questions": "Have you ever been talked to about your attendance?"}, {"date": "1 Oct 2019", "title": "Anonymous Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at MultiCare Health System", "Interview Descriptions": "Multiple steps,  it was a long, drawn out, disorganized process,  interviewers seemed confused, recruiter was inconsistent.  No offer was made, they chose not to fill the position. Would not describe it as a positive experience and would not recommend to others.", "Interview Questions": "Why are we hiring this position?"}, {"date": "3 Jul 2019", "title": "RN Resident Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at MultiCare Health System (Tacoma, WA) in Jul 2019", "Interview Descriptions": "Somewhat formal sit down with  only one person. Scenario based questions and questions about myself.  We talked for about an hour.  The questions were not surprising but did test your critical thinking skills.", "Interview Questions": "What are your strengths and weaknesses? "}, {"date": "22 Jun 2019", "title": "RN Supervisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MultiCare Health System (Tacoma, WA)", "Interview Descriptions": "Was called and scheduled for an interview after a brief phone screening. Standard interview. Three people on interview panel. Very polite. Standard interview questions. Communication from Human Resources was timely.", "Interview Questions": "How have you resolved/dealt with a conflict with a colleague in the past?"}, {"date": "16 Aug 2022", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MultiCare Health System in Apr 2019", "Interview Descriptions": "The interview process is pretty easy. They ask typical questions. They explain what happens in the clinic and do let people ask questions along the way. They don't typically take to long to send either an offer or a \"no thank you\" email.", "Interview Questions": "Tell me about a time that you have dealt with an angry customer and what you did to resolve the situation. "}, {"date": "2 Jul 2019", "title": "RN Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MultiCare Health System (Spokane, WA) in Feb 2019", "Interview Descriptions": "several members of the team participated in the interview, over the phone, each asking pre-scripted questions. Everyone was very nice and friendly, with good follow up. they all answered my questions and it was an overall good interview", "Interview Questions": "why do you want to work for mulitcare?"}], [{"date": "30 Jan 2022", "title": "Health Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MultiCare Health System (Tacoma, WA) in Feb 2019", "Interview Descriptions": "called after two weeks, easy process everyone was nice and friendly. they had me interview two more times. They seemed to really like me, it was a great fit. I would recommend this company any time", "Interview Questions": "name a challange you had in a previous role"}, {"date": "15 Nov 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MultiCare Health System", "Interview Descriptions": "I had a 1 on 1 interview with the Nurse manager at the time.  It was very relaxed and informal and was more of a getting to know each other feel as opposed to putting you on the spot with hypotheticals.", "Interview Questions": "What are your goals down the line?  Why are you interested in this unit?  "}, {"date": "25 Sept 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MultiCare Health System", "Interview Descriptions": "Got invitation via e-mail. The interview was pretty easy. There were only two people.. Really informal. They asked me about 5 questions and went over my resume and especially my work history. In the end I wad allowed yo ask questions.", "Interview Questions": "What are you looking for and why do you like being (this specialty) nurse?"}, {"date": "23 Jan 2021", "title": "RN Supervisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MultiCare Health System (Tacoma, WA) in Jun 2018", "Interview Descriptions": "Called to schedule in person interview.  Met with medical director and administrative director.  Both spent most of the time talking about the position and company.  I was asked to describe things I would consider when caring for a patient with COPD in a outpatient clinic setting.  No other questions were asked.  Interview lasted >60 minutes", "Interview Questions": "Describe considerations you would make when developing a care plan for a patient with copd who is being seen in a primary care clinic."}, {"date": "18 Apr 2018", "title": "ARNP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MultiCare Health System (Tacoma, WA) in Apr 2018", "Interview Descriptions": "Pleasant and quick. The Recruiter was friendly and very responsive. Questions were standard interview questions.  They asked what my hobbies were which was nice and also what I look for in my coworkers.", "Interview Questions": "How would your coworkers describe you"}, {"date": "28 Mar 2018", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at MultiCare Health System (Lakewood, WA)", "Interview Descriptions": "I submitted application via Online Employment Website and received a call for an interview. My interview lasted about 1 hour and went over everything on my resume and things about myself, not inculded in my resume, that made me the best candidate for the job", "Interview Questions": "Previous Job History"}, {"date": "16 Apr 2018", "title": "Call Center Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 5 days. I interviewed at MultiCare Health System (Ocean Park, WA) in Apr 2018", "Interview Descriptions": "Had a phone screen and discovered that it was not a good fit for me. The job requirement as posted was a good fit but the team understandably had other requirements that were not clearly spelled out.   I looked at several reviews where HR responded and I have to say that they boarder l on some of the most unprofessional responses. I got the sense that HR is clearly out of touch.with its employees. Based on that, I don’t think I will be applying to Multicare", "Interview Questions": "Tell us about yourself"}, {"date": "25 Jul 2018", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MultiCare Health System (Tacoma, WA) in Apr 2018", "Interview Descriptions": "Apply online, phone screen, meet with team in panel interview. Contingent on offer was taking Sphynx test, 2 of 3 referral responses and passing drug test. Then waiting while HR completed all their processes. Whole process took about 3 weeks.", "Interview Questions": "Standard interview questions"}, {"date": "1 May 2022", "title": "REG NURSE Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MultiCare Health System (Honolulu, HI) in Mar 2018", "Interview Descriptions": "tele Phone interview with the clincal educator and the floor manager. They called me, asked me questions. It was a great experience. I really liked it. I also got to ask them questions after the intervew was over.", "Interview Questions": "N/A"}, {"date": "21 Feb 2018", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at MultiCare Health System (Spokane, WA)", "Interview Descriptions": "The entire interview process with MultiCare in Spokane was extremely unprofessional. My first interview was with the hiring manager, who continually asked questions about my personal life- why I moved to Spokane, who my significant other is, what does he do for a living, etc.  Very little of the hiring manager's questions were about my qualifications for the position. \r\n\r\nI was then asked to proceed to the next round of interviews, in a \"group panel\" format with the rest of the marketing team. The hiring manager, who was meant to attend this interview, failed to show up.  This entire interview was extremely awkward- hardly any of the team members asked me questions, as if they did not know how to handle an interview. I decided to take the reins and ask most of the questions. \r\n\r\nAfter this group panel interview, I was selected to proceed to the next round and speak with a local hospital's president.  This was the most positive part of the MultiCare interview process.  He was professional, asked great questions, and expressed enthusiasm over my qualifications and skills for the position.\r\n\r\nSeveral weeks passed and I had not received any communications from the hiring manager. I reached out to his admin, asking for an update, and she responded with, \"We are moving in a different direction. Thank you.\"  I expected that the hiring manager would have the decency to communicate directly with me and explain that I was not selected for the position and why. I did make it through all 3 interview rounds, and should have been spoken with directly about MultiCare's decision to move in a different direction. Again, completely unprofessional. Might I add that I was referred to this position- is this how the company treats referrals?", "Interview Questions": "What does your significant other do for a living?"}], [{"date": "6 Mar 2018", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MultiCare Health System (Tacoma, WA) in Feb 2018", "Interview Descriptions": "They're hiring pretty openly right now because of the merger. I got the impression that I would be walking into a situation I did not want to be a part of.", "Interview Questions": "How would your current coworkers describe you? "}, {"date": "7 Feb 2019", "title": "Security Systems CoOrdinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at MultiCare Health System (Tacoma, WA) in Jan 2018", "Interview Descriptions": "application process took about 4 weeks. Hiring manger reached out to me first most likely the head of security department, to setup interview. Relatively new manager and very young security supervisor. Interview was somewhat disorganized and a bit sloppy compared to the ones I've been through. Questions were pretty straightforward technical gauging questions. My take is that I was not a good fit in that the job title isn't necessarily what they were really looking for, a more security guard oriented candidate as opposed to a true technician. After interview waited about a week to follow up to find they are still interviewing candidates. fast forward 3 to 4 months and an update to on my application account changes to position filled. fast forward another year and apparently the position was reposted, my guess is whoever filled the position didn't work out. Which wouldn't surprise me with the tone of the interview and the perceived Multicare work culture. I did not reapply for the position.", "Interview Questions": "What is your greatest weakness? "}, {"date": "4 Feb 2018", "title": "Pharmacist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at MultiCare Health System (Seattle, WA) in Nov 2017", "Interview Descriptions": "The interview itself was good. It was the follow-up with HR that was awful and kept going on for months with several false starts. \r\nThe interview was a chat, more like a conversation for 25 minutes.", "Interview Questions": "Tell me about yourself.\r\n"}, {"date": "24 Jun 2017", "title": "Rad Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MultiCare Health System", "Interview Descriptions": "Interview went great. good, stand out group of care givers. Nice enviroment. One main thing I wish they made it clear. When they say non tabacco company, make sure you find out if there going to test for nicotine on the U.A.", "Interview Questions": "Experience, Education, They give you a good understanding what is expected from you. "}, {"date": "29 Jul 2017", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MultiCare Health System (Tacoma, WA) in Jun 2017", "Interview Descriptions": "Had a phone interview and an in-person interview. The interview was pretty much relaxed and more of a conversation with the team rather than a panel interview. Very diverse team.", "Interview Questions": "Mostly personality and how you can contribute to the group"}, {"date": "17 Apr 2017", "title": "Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at MultiCare Health System", "Interview Descriptions": "The interview process was extremely enlightening! I enjoyed every second of it, as it was professional but not completely serious the entire time. I was very comfortable in the setting. Afterwards it made me want to work for this company that much more than I already had!", "Interview Questions": "What is one of the hardest things I have had to deal with in an office setting"}, {"date": "2 Jun 2017", "title": "Senior Marketing Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MultiCare Health System (Tacoma, WA) in Mar 2017", "Interview Descriptions": "I applied in February 2017. Three in-person interviews, five reference checks and five months later, I found out I didn't fit what they were looking for. I interviewed with several different people and never twice with anyone. The only time I corresponded with a recruiter was to learn I didn't get the job (via voicemail).", "Interview Questions": "How do you handle disappointment? How do you handle change?\r\n"}, {"date": "8 Feb 2017", "title": "Finance Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MultiCare Health System (Tacoma, WA) in Feb 2017", "Interview Descriptions": "I received an email request to come in for an interview, and at the time of the interview the manager met me in the lobby.  The interview was 1:1 and I was made to feel comfortable.  The Manager conducting the interview was friendly and positive", "Interview Questions": "What techniques and tools do you use to keep yourself organized?"}, {"date": "7 Apr 2017", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MultiCare Health System (Tacoma, WA) in Jan 2017", "Interview Descriptions": "Average interview process. Not very hard questions - got the job immediately. Must have CNA certification before you start. Must be CPR certified. Having experience is a plus. Working for MultiCare will be nice because they have so many facilities in the NorthWest region. Easy to transfer to a different location if needed. Everyone i work with is very nice and helpful. Everyone is very friendly.", "Interview Questions": "Why do you want to work for MultiCare?"}, {"date": "23 Aug 2021", "title": "Radiologic Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MultiCare Health System (Puyallup, WA) in Jan 2017", "Interview Descriptions": "Phone screening and received invite to interview. Taken on tour of imaging department. Interviewed was held in the department with imaging supervisor and lead tech for day and night shift.", "Interview Questions": "Have you handled a trauma case?"}], [{"date": "1 Mar 2018", "title": "Human Resources Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MultiCare Health System (Tacoma, WA) in Jan 2017", "Interview Descriptions": "Apply, receive call, the screener told me pay range, set up interview, met with a few interviewers in panel interview. Upon arrival, I was surprised if was a panel interview, questions were standard and I got a feel for the different personalities there.", "Interview Questions": "A difficult work situation that you overcame and how"}, {"date": "16 Dec 2016", "title": "Licensed Practical Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MultiCare Health System (Tacoma, WA) in Dec 2016", "Interview Descriptions": "Applied by internet, automated responses for each process.  Called in for interview, request for references placed into automated process, emailed reference survey to previous employers.  If all goes well, will be asked to come in for final interview with hospital nurse managers for unit.", "Interview Questions": "What do you want to get out of this job?"}, {"date": "4 Nov 2017", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at MultiCare Health System (Tacoma, WA) in Sept 2016", "Interview Descriptions": "Phone interview followed by in person panel interview.   Phone interview was mostly informational.  In person interview was mostly the panel telling me about the positions.   Sry few questions asked if me.  Did have to complete a Harrison Assessment,", "Interview Questions": "What questions can we answer for you?"}, {"date": "13 Aug 2016", "title": "Licensed Mental Health Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MultiCare Health System (Puyallup, WA) in Jul 2016", "Interview Descriptions": "2 people with a series of questions that they asked back and forth.  They meet only 2 times a month to do interviews and it was afterhours.  They were accommodating to my schedule as I had to reschedule the first date.", "Interview Questions": "Describe a conflict you had with a co-worker and how did you resolve it? "}, {"date": "19 Jan 2018", "title": "Service Desk Spec II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MultiCare Health System (Tacoma, WA) in Jun 2016", "Interview Descriptions": "Relaxed with two person panel of team members. Spoke with recruiter through email to set up in person. Took several weeks, to find out I didn't get the position after I checked the online status for the position, no follow-up email or phone call. After the interview it was crickets. Was a huge waste of time that I'll never get back.", "Interview Questions": "Have you worked with a ticketing system? "}, {"date": "12 Apr 2016", "title": "Supply Chain Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at MultiCare Health System", "Interview Descriptions": "Applied online 2 months later received a phone call asking for an interivew. Interview consisted of basic questions on job, why I would like to work for the company etc.\r\nI thought that the interview went well, was told that I would have an answer in 2 weeks.\r\n3 weeks later, I called and left emails. Not one response from all 3 people I contacted.\r\nThe rejection came in a form of an email stating that I had \"met the minimum qualifications\" however they decided to go with other people.\r\nI would have been ok with a simple call stating that they chose someone else but to blatantly ignore someone's request for follow up is unprofessional to say the least.", "Interview Questions": "What is your favorite part of procurement?"}, {"date": "26 Sept 2016", "title": "Senior Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at MultiCare Health System (Tacoma, WA) in Mar 2016", "Interview Descriptions": "applied online. specifically requested to be contacted via email only.  received a CALL while commuting via Sounder from a prospective team member - also sr. administrative assistant; not Recruiting.  Invited  to on site interview. I arrived to the interview 15 min early.  via email, i'd asked for more information for the specific role as the job description was generic.  although assured i would receive prior to the interview, was not received.  the location's reception area smelled like bad plumbing -- very off putting for a first impression.  The physicians and executives were late and unprepared re: had not read my Resume and didn't think with my extensive experience would be the right challenge for me.  Physicians, executives and Admin team suggested I apply for the EA to COO position.  I sent thank you email and snail mail to all interviewers.  Recruiting only connected with form email that the position had been filled.", "Interview Questions": "You have great experience with very hard to get into companies.  Why do you want to work here?\r\nHow do you deal with difficult personalities.\r\nI don't think this role would be a big enough challenge for you -- what do you think?\r\nHave you applied for the EA to the COO position?\r\nHow soon could you start the assignment?"}, {"date": "4 Feb 2016", "title": "Patient Financial Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MultiCare Health System (Tacoma, WA) in Dec 2015", "Interview Descriptions": "A call from the department supervisor discussing the position. Set up a face to face with the supervisor and two leads. Very easy going. Questions were all customer service based", "Interview Questions": "Describe times when you went above and beyond for a patient. Describe your experience with EPIC"}, {"date": "22 May 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MultiCare Health System (Tacoma, WA) in Nov 2015", "Interview Descriptions": "Typical interview process. HR will be contacting you first that they have received your application and there is an open position that matches your skills and so on. Then they will set up a phone interview with the manager but that was only to know your availability for an actual in person interview. After the interview, the manager will show you around the area, introduce to some coworkers and all.", "Interview Questions": "Why MultiCare?"}], [{"date": "15 Nov 2015", "title": "CNA Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MultiCare Health System (Auburn, WA) in Oct 2015", "Interview Descriptions": "I was called in for an interview,  it went really well. A week later i was emailed asking for references.  I did that heard nothing from them.  But now the job says filled on the website does this mean I didn't get it? Shouldn't I at least received something from them saying yes or no about the job?", "Interview Questions": "They asked me why I want to work for them."}, {"date": "27 Nov 2015", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MultiCare Health System (Tacoma, WA) in Sept 2015", "Interview Descriptions": "Phone screen with recruiter, phone screen with supervisor, interview with team. I was an out-of-state candidate, so my experience is not likely typical. \r\n\r\nI spoke for a good amount of time with the recruiter initially. He was knowledgeable and friendly. I was a bit put off, though, as he asked my salary requirement within the first few minutes. I am a manager and understand the need to check salary, however, I felt it was too soon in the process since I had no understanding of the role or the department, and I was told the phone screen would only be 15 to 20 minutes. Because I was an out-of-state candidate, I did not feel comfortable giving a solid salary requirement, as I had not yet researched cost of living in a new state, etc. I gave him a ballpark number and let him know I did not feel comfortable giving a solid number because it was so early in the process. He said, \"I'm just going to put down $XYZ.\" Again, it was early in the process, so I wasn't too concerned (this comes into play later.) \r\n\r\nI then spoke with the woman who would be my supervisor if I got the job. She was great. Smart, obviously passionate, asked great questions, etc. I was very excited about the position as it seemed the perfect role for me, as well as the perfect location for my family. She invited me out to Tacoma to interview.\r\n\r\nThe travel arrangements were a bit rocky and hastily made, but I got there. I flew 8 hours out, stayed overnight, then interviewed all day the next day, then flew home about 10 hours. The interviewers were very thorough, and I was even more interested in the role after speaking to everyone. It seemed like MultiCare was in the middle of a positive culture shift, and I have experience with change management and was very excited to share my ideas. I hoped for the offer and began looking at houses in the area for my family and researching cost of living, etc. \r\n\r\nThe offer came! It was low. It was lower than I indicated to the recruiter from the onset. I researched, talked to friends in the area, as well as to executive recruiters who are in my family. I counter offered. At which point, things got rather unprofessional.\r\n\r\nThe recruiter's tone changed and became very passive aggressive and frankly, a bit unprofessional. All of my research was wrong (only his was correct), despite the fact that I talked to actual people living in the area, researched houses (which made it clear to me the cost of similar housing there would cost me much more than my current location), and spoke with a global executive search firm. The recruiter, \"I'm confused, you said you wanted to relocate and you said this $XYZ was your salary requirement.\" Me, \"Yes, I do want to relocate, but I cannot do so at a detriment to my family. While your data may say the cost of living is similar, I looked at houses, etc., and for the same living standard for my family, I would need to pay quite a bit more.\" \r\n\r\nThey were basically asking me to take a pay cut, a possible loss on my house, etc., to work there, and the recruiter was rather rude in the process. I was uncomfortable that he was not ccing who would be my supervisor on emails, as I wonder if I was misrepresented to her by the recruiter. \r\n\r\nI was very disappointed, as the role was perfect and I really enjoyed all the people I met there. I would advise the recruiter not to try to solidify salary within the first 10 minutes and also to watch tone in  emails.", "Interview Questions": "N/A"}, {"date": "5 Oct 2017", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at MultiCare Health System (Auburn, WA) in Jul 2015", "Interview Descriptions": "Networking helps.  As you network and volunteer in an organization, the interview becomes easier. Since I knew the department, the interview process was quick which helped. The manager did not know me so I had to go through an interview.", "Interview Questions": "What do you in a situation where you have a difficult coworker causing drama/gossip about another employee? "}, {"date": "13 Dec 2016", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at MultiCare Health System (Tacoma, WA) in May 2015", "Interview Descriptions": "Applied on MultiCare's Career Site and specifically requested contact via email only as I was currently employed and using employer cellphone.\r\nDay 3 post application, contacted by cell phone by peer EA within team.  I requested an email as I was currently en route to current job at 8a via public transportation.  I received the email close to 5p same day.  Peer EA [not company recruiter] asked for a date/ time to schedule an on site interview [no phone screen].  Received a confirmation of on site interview next day without any context.  I requested names and titles of interviewers and more specific job description [general job description only.]\r\nI researched interviewers and team objectives.  I requested a more specific job description two (2) days prior to interview [2nd request], without any response.  I arrived at company 15 min early - no one at reception.  Reception area had a very bad odor --  bad plumbing in a vintage building.  2 min prior to interview time, peer EA introduced herself and escorted to the conference room.  Again requested a more specific job description -- was told there was not one.  Panel interview with six (6) executives [mix of execs and physicians].  Waited 15 min until all interviewers joined.  Two were missing and when I asked if they would be joining, only then did they check with peer EA - who had not checked and interviewers assumed they would not and started the interview.  Unfortunately, they were all surprised at my experience and one physician commented several times on the size of the font.  After the 7th time, I finally spoke up in the form of one of my internalized EA behaviors -- always seeking to make my exec's \"life\" easier.  Example - seeing the font size would be difficult for my exec to read [due to MultiCare's Career Site restrictions], I would have upsized the font, checked for any format errors and provided the updated - easy to read - copy to the interviewers.  [I didn't mention that I come from a paperless environment and would have done the above but email to all interviewers.]", "Interview Questions": "#1 Panel Interview: Physicians and Executives\r\nQ:  With all your experience, why would you want this job?\r\nA:  I would not apply without a commitment to the company I have researched and aligns with my career goals.  I continue to challenge myself and with the Healthcare Industry fast growing, I wanted to become a part of it, together with coming to work each day knowing that I will be helping people.\r\nQ:  Did you know this would be reviewing and filing a lot of paperwork and forms from the Health Insurance side of the business?\r\nA:  No, I did not.  I received a general job description, but not a specific job description. \r\nQ:  There is an EA to the COO position, have you seen it?\r\nA:  Yes, I applied and was not selected to interview.\r\nQ:  I'll make a call to Recruiting if you're OK with that.\r\nA:  Yes; thank you. [no other answer would have been appropriate.]\r\n#2  Panel Interview:  Peer EA and AA from team\r\nQ:  Did you have any trouble finding us?\r\nA:  No, very easy to find.\r\nQ:  Did you park in he gravel lot or on the street?\r\nA:  Neither, public transportation.\r\nQ:  What questions did you have for us?\r\nA:  Could I have specifics on the role for which I am interviewing and also your roles within the team and the size of the team and goals.\r\nQ:  You seem to be overqualified for this position.  Have you applied for the EA to the COO position?\r\n"}, {"date": "24 Apr 2015", "title": "Speech Pathologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 7 weeks. I interviewed at MultiCare Health System", "Interview Descriptions": "Phone interview to learn more about company. In person interview with SLP team. 6 week long process from application to offer. Interview was a pleasant experience and took about 1.5 hours.", "Interview Questions": "Tell us about your proudest accomplishment."}, {"date": "28 May 2015", "title": "Director of Revenue Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MultiCare Health System (Tacoma, WA) in Apr 2015", "Interview Descriptions": "The application process is done through the MultiCare website. You attach your resume and then continue to fill out a full background of your job experience, education, why you left previous positions, and salaries.", "Interview Questions": "What is the difference between a Manager and a Director"}, {"date": "19 Feb 2015", "title": "Communications Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MultiCare Health System", "Interview Descriptions": "I was screened by a recruiter first. It took quite a while to get that call. After that, the next interview was set up fairly quickly. It was very low key, only with the direct supervisor. Received notice from the supervisor that a decision was delayed due to more interviews and eventually received an automated notice that I wasn't hired.", "Interview Questions": "How would you handle ambiguous requests"}, {"date": "17 Oct 2014", "title": "Patient SVC Representative Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MultiCare Health System (Auburn, WA) in Oct 2014", "Interview Descriptions": "Applied online and was contacted several months later via email asking if i was still interested in a job. A week later I had my interview, and not too long after that I was offered a job.", "Interview Questions": "When have you not been a team member? "}, {"date": "7 Sept 2014", "title": "IT Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at MultiCare Health System", "Interview Descriptions": "It went smooth. People are really friendly. I enjoyed a lot. \r\nInterview question were both technical and Non-Technical. All process completed in 5 days.. and my joining was with in 15 days.", "Interview Questions": "No difficult question as such. It was more of basic questions."}], [{"date": "24 Sept 2015", "title": "Security Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at MultiCare Health System (Tacoma, WA) in Sept 2014", "Interview Descriptions": "Recruiter called to schedule interview and give info for getting to the hospital.  Asked for a copy of my driving record to be emailed beforehand.  Asked to use the valet service for the interview.  Professional interview with tour of grounds.", "Interview Questions": "What motivates me"}, {"date": "29 May 2018", "title": "Call Center Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MultiCare Health System (Tacoma, WA) in Sept 2014", "Interview Descriptions": "Interviewed with department supervisor and manager. Both tag-teamed with a few job-related questions and more personality style questions. Lasted just shy of an hour. There was no structure ( the questions bounced from work-related to personality style). A Few \"what would you do\" and many \"what have you done\" questions", "Interview Questions": "If you knew a colleague was releasing secure information over the phone, would you immediately intercept or wait and then speak with department head?"}, {"date": "29 Oct 2014", "title": "Social Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MultiCare Health System (Tacoma, WA) in Aug 2014", "Interview Descriptions": "Interview process started with an email with contact information to schedule the interview if I was still interested.  It was easy to schedule and happened quickly.  Staff members were professional yet friendly throughout the interview.  Communication as to how candidates learn if they were hired or not were discussed at the close of the interview.", "Interview Questions": "Several behavioral interviewing questions were asked during the interview.  The most challenging question to answer was, how do you handle someone who is angry? As well as, questions about how do you handle situations when co-workers are not doing there job/pulling their weight."}, {"date": "6 Jul 2016", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MultiCare Health System (Tacoma, WA) in Sept 2013", "Interview Descriptions": "It was a very quick interview where they had a few key questions. I didn't feel intimidated by the two people interviewing. They just sat and chatted with me. They mainly wanted to know my background and intentions including where I wanted my career to go.  It was only about fifteen minutes long. I got a call back the next day offering me the job", "Interview Questions": "They wanted to know if I was going to continue my education to RN"}, {"date": "28 Mar 2017", "title": "Lifestyle Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at MultiCare Health System in Jul 2013", "Interview Descriptions": "Met with Administrator and the Doctor in charge of the program. This was a one time in person interview as the program was brand new. Since the program was new they just wanted to know my previous experience.", "Interview Questions": "N/A"}, {"date": "21 Apr 2013", "title": "ER Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at MultiCare Health System (Puyallup, WA)", "Interview Descriptions": "They pay close attention to body language. \r\nThey check your Facebook\r\nRealize, that when MHS took over GSH, it exploded into hospital wide (GoodSam) advancement opportunities AND significant early retirement offers, followed by massive new hires.", "Interview Questions": "What kind of animal best describes you and why?"}, {"date": "5 Oct 2016", "title": "Interface Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at MultiCare Health System (Tacoma, WA) in Apr 2013", "Interview Descriptions": "The interview was scheduled so it was one trip to Tacoma.  There were panel interviews and individual interviews thru the day.  It was a very positive experience.  The mission and values were clearly defined and explained.  This company has a very clear direction to where they want to be in the future and how they plan on getting there.  The hospitals are well laid out and fairly easy to get around considering they have merged several building over the years.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "5 Oct 2016", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MultiCare Health System (Tacoma, WA) in Jan 2013", "Interview Descriptions": "Asked easy questions, very informal. If they like you, they hire you. You may meet with an Assistant Nurse manager. Be prepared to talk about previous experience. They are very willing to hire new graduates, as they are the least costly to employ. You should ask about staff turnover, employee engagement and why you should want to work for them. You are the commodity, not them. They are hemorrhaging staff across the entire hospital. A good gauge of the unit you are applying to is, how many are you looking to hire? Ask why they have so many openings. Ask what support you will get and training.", "Interview Questions": "Previous experience."}, {"date": "21 Apr 2016", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MultiCare Health System (Tacoma, WA) in Oct 2012", "Interview Descriptions": "Interviewed with program coordinator and director. Both were very pleasant. While they took their time explaining the program and job responsibilities, they really took their time getting to know my talents. Allowed me the opportunity to demonstrate how best to utilize a program assistant. The program coordinator dove into what my strengths and skills were and explained the team she already had and what their strengths were. She wanted to build a team that had a broad skill level and diverse abilities to keep the program thriving.", "Interview Questions": "What skills could I utilize as a program assistant?"}], [{"date": "4 Oct 2015", "title": "Supply Chain Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MultiCare Health System (Tacoma, WA) in Mar 2012", "Interview Descriptions": "First was contacted by HR then sent to interview then sent to orientation. Thew interview was fairly easy just asked me why I believe I should be selected for the job. What could I bring to the job and what are some of my strong points.", "Interview Questions": "They asked me if I could perform job functions"}, {"date": "9 Jun 2015", "title": "Billing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at MultiCare Health System in Jan 2012", "Interview Descriptions": "Thorough and down to business. Lots of questions. Nice staff. Very detail on job description. Long if great candidate. Somewhat easy. Great vibes. Coworkers also part of interview panel. Great interview", "Interview Questions": "What is your name"}, {"date": "3 Apr 2015", "title": "Allied Heath Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at MultiCare Health System (Tacoma, WA) in Oct 2011", "Interview Descriptions": "Telephone interview with department manager that lasted 1 hour. Questions were experience and last work history and specialty that I was strong in.Also was asked if I was flexible and capable of supporting 2 other modalities.", "Interview Questions": "Expertise with special procedures and limitations of hardware and software used at specific site."}, {"date": "1 Jun 2011", "title": "Med Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MultiCare Health System (Tacoma, WA) in Mar 2011", "Interview Descriptions": "the hiring was super sichy and easy.. just show off all your qualification and abilities and youll be great", "Interview Questions": "N/A"}, {"date": "31 Mar 2015", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at MultiCare Health System (Tacoma, WA) in Jan 2011", "Interview Descriptions": "phone interview, forms, panel interview, background check, review of CV, many phone discussions,just the usual stuff nothing enlightening to report but I have to put in 50 words, the main point is this is not a good work environment", "Interview Questions": "N/A"}, {"date": "19 Feb 2014", "title": "Will Not Disclose Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at MultiCare Health System (Tacoma, WA) in Jan 2010", "Interview Descriptions": "Applied on-line, plus called the department manager after being referred by a friend to the job.   Interviewed with the department manager, in an informal manner.", "Interview Questions": "There were no unusual questions, just the basics:  Education, experience, skills, etc. "}, {"date": "24 May 2010", "title": "Administration Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MultiCare Health System (Tacoma, WA) in Sept 2009", "Interview Descriptions": "Applied for an opening. Received phone interview.  No follow up call: had to leave a message requesting a feedback on the process for job opening. Received no call back. Instead received an automated email response. Was disappointed with lack of courtesy for an exempt level position. Once determined not a fit,  rejection was a quick door in the face. Unfortunate person was impersonal.", "Interview Questions": "Respond to the kind of methods you have used to do your job (vendor, internal staff) etc."}]]