[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": "N/A", "review_title": "A much needed service and incredible support provided!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Feb 2023", "job_title": "Supervisor in Wilmslow, England", "duration": "N/A", "pros": "The clients you get to work with are incredible, being able to support them in the home, community, educational settings and work placements has such a positive impact on progression and outcomes. Support provided is person centred, giving choice wherever possible and teaching skills to expand liberty. High level of supervision provided to each client. Varied days and activities.", "cons": "Difficulty with client cover if staff are off sick- new system being trialled to overcome this"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "A fake and failing organisation", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Aug 2022", "job_title": "Registered Behavior Technician in Wilmslow, England", "duration": "N/A", "pros": "The clients you get to work with are so amazing.", "cons": "Communication amongst the company is horrendous, the left hand doesn't know what the right is doing. \r\n\r\nThere is massive bias from the directors for certain clients. \r\n\r\nOne thing is said to your face but another is done behind your back, can not trust management to save your life. \r\n\r\nThey absolutely do not support mental health issues. Once again pretend to but will throw it in your face. \r\n\r\n\r\nFlexi work, so you will get paid for your hours salaried but if by the end of the year you've worked under your hours, you are essentially in debt to them. \r\n\r\nThere is no work life balance\r\n\r\nThey know no boundaries, because they will contact you on you day off. When you're on holiday and off sick. \r\n\r\nThey expect you to do things above your pay grade and if you grumble. Well you arent a team player. \r\n\r\nNo real praise of staff for good work. \r\n\r\nThe career progression is fake, they pretend like they're helping you but actually they aren't. \r\n\r\nMost of what is said in your phone call prior to starting with the company you will figure out to be lies."}]]