[[{"date": "15 May 2023", "title": "Communications Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Environmental Defense Fund", "Interview Descriptions": "Went well! Interviewers were amicable and very understanding of my nerves while still being professional and asking good questions and giving me a chance to ask questions of my own", "Interview Questions": "Provided me with an example of a situation and asked me how I'd handle it from a comms perspective"}, {"date": "10 May 2023", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Environmental Defense Fund (Boston, MA)", "Interview Descriptions": "The process was structured and communication was very clear. The HR team managing the process was really helpful and answered all my questions. The questions weren't very hard, but emphasizes heavily on past work.", "Interview Questions": "Typical behavioral questions, as well as questions about interest in environmental advocacy."}, {"date": "23 Apr 2023", "title": "HR Industrial Relations Labor Law & Litigation Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Environmental Defense Fund", "Interview Descriptions": "Great experience it was very insightful and useful in the future and the interviewrs were very welcoming and friendly overall ot was very nice there were 4 rounds in total with assessments interview and written statement", "Interview Questions": "What is your weakness and"}, {"date": "14 Apr 2023", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Environmental Defense Fund (South San Francisco, CA)", "Interview Descriptions": "Typically a 45 minute interview with one or two of the hiring supervisors. The interview starts off with introductions, an explanation of the position and scope of work, and then an opportunity for the candidate to talk about their background and how it connects to the internship. Time for questions at the end. Second interview may be required for follow up questions.", "Interview Questions": "What about your background best aligns with this position? Why are you interested in this position?"}, {"date": "19 Feb 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Environmental Defense Fund", "Interview Descriptions": "There were three rounds, one with a case study. The HR people were very professional and helpful. Of course it took longer than the interviewer promised but that was expected. There was a case study which was interesting and well done.", "Interview Questions": "Why do you want to work at EDF? What is your biggest weakness?"}, {"date": "8 Feb 2023", "title": "Climate Corps Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Environmental Defense Fund", "Interview Descriptions": "Straightforward screening interview (interests, background, skillsets, etc.), followed by a relatively brief review of prepared case study questions provided ahead of time. Follow-up questions related to how to work independently, manage difficult / underresourced projects, and communicate with diverse stakeholders.", "Interview Questions": "Why do you want to work as a fellow? What sustainability experience do you have?"}, {"date": "7 Feb 2023", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Environmental Defense Fund", "Interview Descriptions": "A online interview with potential supervisor. The interview questions were very detailed and asked for your expertise in the area. Also asked alot about relevant experience and what would you do in a scenario kind of questions.", "Interview Questions": "Introduce a project you mentioned in the cover letter."}, {"date": "16 Feb 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Environmental Defense Fund (New York, NY) in Jan 2023", "Interview Descriptions": "The recruiter I worked with was lovely. Very engaging and transparent, highly communicative, and she gave me tips for my interview with the hiring manager. I'd work with her again in a heartbeat. My actual interview experience was much less organized. Two people were supposed to interview me together, and only the hirng manager showed up. 15 minutes into the virtual interview the no-show told the hiring manager she had mixed up the days and couldn't make it. The hiring manager was also getting over a cold and seemed unfocused (totally understandable, but maybe she should have rescheduled). The questions she asked me were vague and had little to do with evaluating my skills or qualifications. I had a hard time answering any questions with the STAR method because the questions were so unfocused. We also didn't talk much about the type of projects that the person in this role would work on, which I thought was odd. She wrote next to nothing down during the entire interview. I'm a reasonably good conversationalist (I have a client-focused background), so I don't think that was the problem here. I got the impression she had something very specific in mind and I wasn't it, despite being completely qualified for the job. Also worth noting: I currently work at a fairly prestigious institution, and wondered if they might have been using me to benchmark salary bands. I sent a thank you through the recruitment team. The recruiter informed me four business days (and one weekend) later that I wouldn't move forward. No word from the hiring manager. FYI this position has been posted since at least November of 2022 - maybe longer. Honestly feel like I dodged a bullet. I never write Glassdoor reviews but this was definitely a waste of my time and I hope to spare others the same. FYI: salary was under 100K for a remote comms manager position expected to regularly work international hours.", "Interview Questions": "Tell me about yourself. What is your experience working with people based in other countries? What did you learn from [a very specific project that you worked on at previous job]? (What she actually asked was more like, \"How was that?\")"}, {"date": "19 May 2023", "title": "Climate Corps Fellow Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Environmental Defense Fund (New York, NY) in Jan 2023", "Interview Descriptions": "There was only one interview. They asked me only behavioural and experience based questions. Interviewer was friendly. They also explained the logistics of the matching round. Overall interview seemed like a formality.", "Interview Questions": "Case Study and previous work exp description"}, {"date": "18 Apr 2023", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund (New York, NY) in Jan 2023", "Interview Descriptions": "HR rep was very friendly and the questions asked were very generic, which is to be expected. But after my first interview there was no further communication, which was very frustrating for me.", "Interview Questions": "Why are you interested in this position?"}], [{"date": "8 May 2023", "title": "Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund (New York, NY) in Jan 2023", "Interview Descriptions": "I was a huge fan of this organization until I went through their grueling interview process. There was a giant lapse in communication and general disorganization throughout the whole process, and it was a LONG process to be strung along for. From application submission to ultimate rejection, it was nearly five months. I was invited to all three interview rounds, and between each round, I thought I was being \"ghosted\" since I would go weeks and even a month without hearing anything about my candidacy. My attempts to reach out were always ignored; I tried to reach out at reasonable intervals, such as once per week or even less frequently so as to not be a pest. When I finally did hear back from someone, there was no acknowledgment of my multiple failed attemps to connect with anyone. I would absolutely not recommend putting yourself through this process, especially if you are in need of a job any sooner than about six months out. The constant state of limbo I found myself in was truly exhausting.", "Interview Questions": "It's been so long since the last round interview, but they asked me about my experience using science to influene policy."}, {"date": "12 Dec 2022", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Environmental Defense Fund", "Interview Descriptions": "It was only one round and very laid back. It was a panel interview with serval other people. I would say it was the best one I ever had so far in my career.", "Interview Questions": "Tell us about yourself and resume."}, {"date": "17 Mar 2023", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Environmental Defense Fund in Dec 2022", "Interview Descriptions": "Applied online and had a zoom interview about 1 month later. Great recruitment team and seem like a great impactful organization. The projects were also really interesting some were remote and others in person", "Interview Questions": "What skills you have and your location preferences"}, {"date": "5 Feb 2023", "title": "Senior Compensation Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Environmental Defense Fund (Topeka, KS) in Dec 2022", "Interview Descriptions": "The first interview was a 45 minute phone screen with a recruiter to walk through my resume and make sure I met the minimum qualifications for the role. There were some technical questions about my experience as a compensation analyst and the work I have done. The second interview was with the hiring manager. The third interview was with a senior manager and senior director The final and forth interview was with the VP of Compensation/Total Rewards. Each interview as a 45-minute video interview.", "Interview Questions": "How would you evaluate a new job if you do not have market data for the role?"}, {"date": "17 Oct 2022", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund", "Interview Descriptions": "Had a phone screening with the HR manager, 1:1 interview with potential supervisor regarding background, and then interview with the team discussing case studies and subject matter expertise. The team provided a list of materials to review, publications from EDF and other organizations, in advance of the team call to discuss specific expertise for the role.", "Interview Questions": "What is your experience with program management? Have you managed RFPs and consultants in previous roles?"}, {"date": "21 Sept 2022", "title": "Donor Engagement and Events Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund", "Interview Descriptions": "HR interview, hiring manager interview, skill assessment, and last round interview \n\nAll the interviewers were nice. However, HR was emailing, calling, and texting to schedule interviews. The first email I got from HR didn’t have time slot to schedule an interview nor contact information to inquire. HR changed/cancelled interview times last minute. I tried to be flexible with their schedule, but they did not notify me about the status of the application after the last round. ", "Interview Questions": "standard interview questions were asked. "}, {"date": "18 Nov 2022", "title": "Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund in Sept 2022", "Interview Descriptions": "Three interviews, pretty standard with a lot of questions in the first interview relating to when I could leave my current job and how soon I would be available to start. HR was very responsive while I was interviewing however after multiple times following-up about the position I never heard from them again. It is at least better to get a rejection than nothing, but I have yet to get any response after over a month since my last interview.", "Interview Questions": "Why are you a good fit? Do you think x problem can be solved?"}, {"date": "18 Aug 2022", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Environmental Defense Fund", "Interview Descriptions": "The entire hiring process took about three months. I applied online (through their website) and one month later I received a call from a very friendly recruiter who scheduled my first 30 min interview. The interview took place one week after that initial communication. I was then invited to an interview with my future managers, this interview was about one hour long.  Then I did a third one hour interview with my future Directors (each of these interviews happened within 1 week on each other).  Throughout this entire process my HR contact was very friendly and communicative and answered any questions I had. We then moved on to references, payment negotiations, and back ground checks.  The process was long but worth it.", "Interview Questions": "Why do you want to work for the EDF?\nWhat are some of your strengths in relation to this role?\nHow do you handle working under pressure? "}, {"date": "25 Oct 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Environmental Defense Fund (Washington, DC) in Aug 2022", "Interview Descriptions": "Streamlined, quick, and accessible. The first interview consisted of an HR intake, followed by a call with the director of the team you'll be working with, and lastly a call with the broader team.", "Interview Questions": "What is your experience with handling large datasets?"}, {"date": "28 Sept 2022", "title": "Senior Operations Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Environmental Defense Fund (New York, NY) in Aug 2022", "Interview Descriptions": "The process was amicable and professional; the job description was clear and objective; the HR team was very thoughtful and the interview panel was very engaged. I really appreciated their transparency and enjoyed the whole process. ", "Interview Questions": "What's your motivation, why EDF?"}], [{"date": "5 Jul 2022", "title": "Communications Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Environmental Defense Fund", "Interview Descriptions": "First round with an HR recruiter, they moved me forward. I interviewed with the position manager and was not selected to continue. I emailed HR to find out if I was moving forward or not over a week after interviewing. Everyone was kind and caring.", "Interview Questions": "What is my experience in coalition work?"}, {"date": "17 Jul 2022", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund (New York, NY) in Jun 2022", "Interview Descriptions": "I only did the first round of the interview. The overall process was efficient and nice even though didn't get into the second round. It was a good experience. I might apply for the organization again in the future.", "Interview Questions": "Why did you leave your old job and want to work with us? "}, {"date": "9 Jun 2023", "title": "Campain Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund in May 2022", "Interview Descriptions": "Interview process was quick and fairly efficient. I had a brief interview with a recruiter, and two panel interviews with different members of the teams that I would be joining.", "Interview Questions": "They were very interested in my previous experience with campaigning, and wanted someone who could somewhat hit the ground running"}, {"date": "23 Aug 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Environmental Defense Fund (Washington, DC) in Apr 2022", "Interview Descriptions": "After submitting the application online I got an email from HR to schedule a phone screening. I didn't make it past the initial screening but at least I was notified as such in an email. The phone interview was straightforward, going through the resume with questions related to activities written on the resume.", "Interview Questions": "Do you have the XXX experience that the position needs? Does the YYY activity on the resume correspond to that? Can you explain more?"}, {"date": "22 Apr 2023", "title": "Climate Corps Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund (Houston, TX) in Apr 2022", "Interview Descriptions": "It was very conversational, the questions were mainly centered on your knowledge of ESG , a case study was given to see how you would address large ESG projects and we were asked to discuss our approach.", "Interview Questions": "How would you plan a project of adopting electric vehicles in a municipality"}, {"date": "3 Feb 2022", "title": "Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Environmental Defense Fund", "Interview Descriptions": "Smooth, engaging, not your regular type, asked about interest, why EDF fellowship, discussions about the case study given, and so on and so forth. I think it was an interesting interview", "Interview Questions": "why did you apply to the fellowship"}, {"date": "6 Mar 2022", "title": "Climate Corps Fellow Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Environmental Defense Fund in Feb 2022", "Interview Descriptions": "The interview was 1 round, they told me that they have to squeeze two interview into 1, and during the interview they told me the week after I can choose 5 organzation, some are easier than other to get in. The interviewer knew so little about the organization is not a good thing. I never quite get the point of the interview becasue after that you basically apply again on their website.", "Interview Questions": "What is your prior experience with renewables."}, {"date": "31 Jan 2022", "title": "Legal Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Environmental Defense Fund", "Interview Descriptions": "Great experience. I had one interview where they asked why I was interested in EDF and more specific questions about my experiences (and how they would aid me in an internship). I also had questions prepared for my interviewer.", "Interview Questions": "Why do you want to intern with EDF?"}, {"date": "9 Dec 2021", "title": "Development Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Environmental Defense Fund in Nov 2021", "Interview Descriptions": "Three rounds of interviews and a written assignment for a position that barely pays minimum wage. After bending over backwards to make the interviews work for their schedules  I was not even given the respect to notify me that they had moved forward with another candidate.", "Interview Questions": "Standard Questions about past experience"}, {"date": "29 Mar 2022", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund in Nov 2021", "Interview Descriptions": "HR did not stick to original scheduled call.  Had to reach out to reschedule. During call it felt like HR was disinterested in conversation.  Followed up after call and there was no response regarding status or a rejection.", "Interview Questions": "walk me through your resume, why do you want to work here "}], [{"date": "28 Dec 2021", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Environmental Defense Fund in Oct 2021", "Interview Descriptions": "The process was clear and well-communicated. Had video interviews with technical staff and the role's manager. Completed a written assignment. Everyone was easy to talk to, the interview felt like a conversation which I appreciated.", "Interview Questions": "What would be the most challenging part of this role for you?"}, {"date": "10 Feb 2022", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund in Oct 2021", "Interview Descriptions": "I spoke with an internal recruiter for a phone screen call and discussed my background and various requirements for the job. It was in depth and professional. I reached out again when a similar position was advertised and the recruiter told me she forwarded the notes from our interview to the new recruiter.", "Interview Questions": "Are you currently waiting to hear back about any other immediate offers?"}, {"date": "11 Dec 2021", "title": "Program Coordinator, Regional Affairs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Environmental Defense Fund (Phoenix, AZ) in Aug 2021", "Interview Descriptions": "Three rounds - first 30 min phone interview with HR employee, next met for 1hr with three employees who would interact with the position and final interview was 1hr with three Southeast State Directors and the Regional Senior Director for the entire Southeast.\n\nHR had to reschedule my first two interviews even after I chose from the times they provided.  I can understand once but twice is indicative of an issue. \n\nI made it to the last round of interviews with three other candidates.  I was told by the Senior Director they would finish interviews up the same week, make a decision, \"run it up the flagpole\", let HR know and HR would inform me about the result.  I never heard from them again.\n\nEvery employee I met with was very nice but it is clear that HR has issues. They are either understaffed or incompetent.  I even followed up a couple of weeks after the final interview with HR and received no reply. It's not difficult to track and notify candidates about the status of a position. \n\nI was extremely disappointed because I believe this organization does great things and was very excited for the opportunity to work with them. If I had been treated respectfully I would consider applying in the future but this process completely changed my opinion.", "Interview Questions": "Every round - why EDF?\nAre you comfortable with data, excel?\nGive an example of how you've \"managed up\"\nHow do you deal with competing priorities?\nMethodology for managing time and tasks. \n"}, {"date": "7 Aug 2021", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Environmental Defense Fund", "Interview Descriptions": "Interview process WAS lengthy but my recuriter was SO helpful and responsive. She made sure I was kept up to date with each step as it came. It was about 3-4 30 minute zoom interviews with various levels of employees. Everyone was so nice and open to discussing the in's and out's of EDF.", "Interview Questions": "How would your friends/family describe you?\r\nWhere do you see yourself in 5 years?\r\nWhy EDF?\r\nTeach me something you're passionate about."}, {"date": "26 May 2022", "title": "Senior Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Environmental Defense Fund in Aug 2021", "Interview Descriptions": "I had an initial interview with HR,  then one with the manager of the position and finally a panel interview with multiple members of the team. Each interview was hosted over video, I'm not sure if it were not COVID times if any would have been in person.", "Interview Questions": "This was a water-focused position, so I was asked about environmental justice, my hands on experience, working with stakeholders, why I am interested in the job, etc."}, {"date": "26 Aug 2021", "title": "Energy Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Environmental Defense Fund (New York, NY) in Aug 2021", "Interview Descriptions": "A video interview was conducted by a very friendly full-time recruiter of the non-profit. I was asked to describe my current job, and how that fit into the work that I was applying for. The interview included standard recruitment questions.", "Interview Questions": "What do you think you would find challenging in this role?"}, {"date": "27 Jul 2021", "title": "Economics and Policy Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund", "Interview Descriptions": "There was a 30-minute phone interview with an HR specialist after submitting the online application.  There were questions about my background as well as a technical question related to sustainability.", "Interview Questions": "-About your background\n-Definitional question about forecasting effects of emissions"}, {"date": "13 Jul 2021", "title": "Legal Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Environmental Defense Fund", "Interview Descriptions": "Two employees interviewed me through Zoom. It was very laid back. They asked questions about experiences on my resume and wanted to get to know me. It didn't feel like an average interview.", "Interview Questions": "Tell me about your study abroad experience."}, {"date": "28 Jun 2021", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Environmental Defense Fund", "Interview Descriptions": "I had three rounds of interviews and a written assessment.\r\n\r\nAfterwards, I didn't hear back from them for several weeks.  When I received another offer, I communicated my deadline for that offer immediatley and asked them to make a decision by then (gave them a full week). They came back to me on the day of the deadline and told me to ask for an extension with the other company. When I asked them how long the extension should be they didn't reply. Two days later they told me they were not offering me the job.\r\n\r\nI am very disappointed in the process because I had to risk my second offer job offer to have a shot at the job.", "Interview Questions": "Questions regarding my skills and experience. "}, {"date": "5 Aug 2021", "title": "Senior Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund in Jul 2021", "Interview Descriptions": "logical and purposeful. Everyone I talked to was incredibly kind and easy to talk to. Made it seems like an awesome place to work. Their questions made sense and the flow of them made it feel more like a conversation.", "Interview Questions": "How do you interpret the role of this position?"}], [{"date": "23 Dec 2021", "title": "Marketing Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Environmental Defense Fund (Washington, DC) in Jul 2021", "Interview Descriptions": "Received an email for a phone screener. Interviewed with the hiring manager. Then interviewed with the hiring manager's supervisor. There were supposed to be 2 more interviews after that! I emailed the HR recruiter to withdraw my candidacy and never got a response. That left a bad taste. The hiring managers were great though. Organizational culture seemed nice.", "Interview Questions": "Almost all questions were behavior based: Tell me about a time when...."}, {"date": "21 May 2021", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund", "Interview Descriptions": "The phone screening followed a pretty standard set of questions. The recruiter was friendly and responded positive throughout the call. I did receive some questions to clarify my experience and timeline of resume after providing my initial walk-through answer", "Interview Questions": "What's your graphic design experience?"}, {"date": "20 May 2021", "title": "Program Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund", "Interview Descriptions": "Four rounds of interview counting the initial phone screen with a recruiter.  Both the recruiter and the hiring manager were very communicative throughout the process which I appreciated. Took about four weeks from the initial conversation to the offer.", "Interview Questions": "Why do you want to work for EDF?"}, {"date": "2 Jun 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Environmental Defense Fund (Deland, FL) in May 2021", "Interview Descriptions": "Filled out a questionnaire and then set up a zoom meeting to discuss summer internship responsibilities. It was around a 15-30 minute interview and then resulted in a week long wait for response.", "Interview Questions": "Experience in activism and environmental knowledge "}, {"date": "26 Jan 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Environmental Defense Fund in May 2021", "Interview Descriptions": "One interview, great questions, were more interesting to helping me than seeing what they could glean from me. \r\n\r\nI cannot remember much else because it was last year and was also partly through my university", "Interview Questions": "Tell  me about yourself- why are you interested in this role?"}, {"date": "13 Apr 2021", "title": "Intern for A Project Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund (New York, NY)", "Interview Descriptions": "First they asked behavioral questions, focusing on what I did in the past. Then asked relatively difficult technical questions. The tech questions really got me. The interviewer was nice, but it was difficult with a phone interview.", "Interview Questions": "What would you do to evaluate the validity of a policy decision"}, {"date": "6 May 2021", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund in Mar 2021", "Interview Descriptions": "My interview with H.R was great & I liked my final interviewer.  Unfortunately, while I liked talking to my interviewers, not hearing back for three weeks and having to email them myself to learn they selected another candidate makes them seem disrespectful overall as an organization", "Interview Questions": "HR: Why do you want to work for EDF \nHR:  Tell me about a time when you used ___ skill "}, {"date": "11 Apr 2022", "title": "Ingénieur D'études Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund in Mar 2021", "Interview Descriptions": "entretien bien passé Rh sympa , des question plus au moins fréquentes , bien préparer votre entretien pour ne pas streser  ,  il y avais 2 personnes un Rh et un ayant le meme poste donc preparer des question technique plus développer", "Interview Questions": "pourquoi avez vous quité votre ancien post"}, {"date": "18 Feb 2021", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Environmental Defense Fund", "Interview Descriptions": "The EDF interview was relatively seamless -- 1 with recruiter, 1 phone with two people and then 1 in person with 2 people and presentation -- the presentation was about 10 min on the topic the role was designed to cover", "Interview Questions": "Mostly behavioral -- some overall industry speculations"}, {"date": "10 Feb 2021", "title": "Climate Corps Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Environmental Defense Fund", "Interview Descriptions": "Pretty standard multi-step interview process. First round involved typical background and experience questions plus a case we were provided in advance to discuss with interviewer. Second round was about career plans post-fellowship and how the position would help with that.", "Interview Questions": "What are your current career goals post-graduate school program"}], [{"date": "10 Mar 2023", "title": "Solicitor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund (London, England) in Feb 2021", "Interview Descriptions": "Nice people, straightforward process. Questions were challenging but not too difficult. Took the time to explain the role to me. They were clear about the process from the outset. Overall a good experience.", "Interview Questions": "Mostly competency based around role skills"}, {"date": "27 Mar 2021", "title": "Oceans Fellow Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Environmental Defense Fund in Feb 2021", "Interview Descriptions": "I had a first round interview with someone that was really nice & I think it went really well (it lasted roughly an hour & was an engaging conversation. The second round was with her and 3 others which I think started off well but got increasingly more difficult", "Interview Questions": "They asked how I would personally solve world hunger and climate change at the same time. They asked me to think about someone in my life that doesn’t believe in climate change & how I would convince them it is real (I don’t know many people who don’t, so this caught me off guard). Multiple questions like this and prying when I guess I didn’t give an answer that was up to their "}, {"date": "14 Jan 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund", "Interview Descriptions": "You apply through the EDF website. If you are offered an interview, someone from EDF will reach out to you to arrange a time. It's a two round interview process. First with direct supervisor and second round interview with the team. It is  a friendly conversation.", "Interview Questions": "Why EDF? What are your weaknesses?"}, {"date": "15 Jul 2022", "title": "Digital Communications Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Environmental Defense Fund in Dec 2020", "Interview Descriptions": "There were three rounds. First a phone screen with HR, then an interview with the hiring manager, and then a final round with the department head and other coworker. They were mostly behavioral questions and then I also had to do a writing assignment.", "Interview Questions": "Tell me about a time where you had a conflict with a co-worker that you had to resolve? "}, {"date": "5 Sept 2020", "title": "Fellowship Role, Economics and Policy Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Environmental Defense Fund", "Interview Descriptions": "Had an interview with director supervisor. Went very well. Then got a second phone call with someone higher up in company. Grilled me more on my economics experience, which was not very extensive.", "Interview Questions": "Tell me how economics and policy are currently interrelated in regards to the environment in the US."}, {"date": "5 Mar 2020", "title": "Translator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Environmental Defense Fund", "Interview Descriptions": "First a phone interview with the hr recruiting specialist, then one week later a Skype interview with the direct supervisor. Then one week later I received the offer. The whole process was friendly", "Interview Questions": "Why are you interested in the position?"}, {"date": "15 Dec 2020", "title": "Summer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Environmental Defense Fund in Mar 2020", "Interview Descriptions": "The process was not stressful at all. There was just one screening interview with someone from the department you are applying for. They go over your resume, your intentions, and your motivation for joining that particular department.", "Interview Questions": "What got you into the field of ________? How would your previous supervisor describe you?"}, {"date": "15 Feb 2020", "title": "Climate Corps Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Environmental Defense Fund", "Interview Descriptions": "After the application screening, EDF will set up a video call with on of their team members. After a 30 min to an hour interview the process is done.", "Interview Questions": "What environment projects have you done in the past? "}, {"date": "3 Feb 2020", "title": "Digital Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Environmental Defense Fund in Jan 2020", "Interview Descriptions": "I've had two very bad experiences interviewing with the EDF, for similar positions, two years apart. This time around, I was told by the recruiter the process would not drag out as it did the first time two years ago, and that I would hear back within a week of the initial phone screen, as they were \"in a rush to hire.\" A month and 4 ignored follow-ups later, I hear that the process was delayed, which is why I was ghosted. In my professional opinion, at least an email response saying \"things have slowed down\" would have been acceptable. But the icing on the cake, was the part where I was told \"hen we were back on track, we moved quite quickly and have offered this position to another candidate, who has accepted.\" \r\nNo explanation as to why I was not contacted to continue the process, but simply forgotten and ignored. Completely unprofessional.", "Interview Questions": "Why do you want to work here"}, {"date": "30 Nov 2020", "title": "Climate Corps Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund (New York, NY) in Jan 2020", "Interview Descriptions": "There were 2 rounds of interviews, including a take home prompt that I had to prepare and bring to the first interview. The prompt was 3 different scenarios that would require sustainability/energy action - you pick one and prepare the answers.", "Interview Questions": "What kind of data would you need to begin the process of electrifying a Parks Dept vehicle fleet?"}], [{"date": "17 Jan 2021", "title": "Institutional Giving Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund in Nov 2019", "Interview Descriptions": "Phone screen, video call, then writing task. HR was extremely friendly and every person I spoke with was professional. The interview process was long however and they were delayed in making a decision so I ultimately had to withdraw myself from candidacy to take another position.", "Interview Questions": "Strengths and weaknesses, past experience "}, {"date": "25 Oct 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Environmental Defense Fund", "Interview Descriptions": "Pretty standard interview, and everyone that I spoke with was incredibly nice. This is an organization looking for the best candidates for the progression of environmental science and policy, so you should apply if your mission seems to fit theirs.", "Interview Questions": "Always specific to the position. "}, {"date": "12 Apr 2021", "title": "GIS Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Environmental Defense Fund (New York, NY) in Aug 2019", "Interview Descriptions": "I submitted an application online and received an email scheduling a first round interview. I had a  first round interview with two individuals in different offices who worked on the same team. My second round interview was with the director of the team and lasted about 1 hour. The third round interview was with who would be the direct line manager. After the third round I had a screen with the HR team and since the team was small, they were reviewing the final 2-3 candidates and gave me an answer in about a week's time. The whole process took about 3-4 weeks.", "Interview Questions": "Tell me about a data task you performed. \r\nWalk me through your resume. \r\nWhy are you interested in working for EDF? "}, {"date": "29 Jun 2019", "title": "Program Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Environmental Defense Fund (New York, NY) in May 2019", "Interview Descriptions": "My interview was scheduled at approximately 11:30am for a day later in the week through an outside recruiter. When I arrived, I was greeted by the assistant of the person I would be interviewing with. She was friendly, but I waited 45 MINUTES for my interviewer to come. I only allocated about an hour that day for the interview and when I tried to say I’d leave if she didn’t show, her assistant asked if I could wait a little longer. Finally, when my interviewer came, we only had about 10-15 minutes and by that time, I was already antsy from waiting for so long. At the end of our interview, she said it didn’t do research on the company, which I did had I been seen on time. And I made it clear right and then I wasn’t interested in working for them. VERY unprofessional for them to make me wait for 45 minutes!", "Interview Questions": "What do you know about this company?"}, {"date": "29 Apr 2019", "title": "Interviewer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Environmental Defense Fund", "Interview Descriptions": "The interview with the recruiter was pretty straightforward. Went over my resume and asked questions about the my prior experience. Explained my interests in the position. Talked about the schedule and timeline", "Interview Questions": "go over your resume"}, {"date": "13 Nov 2019", "title": "Supply Chain Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Environmental Defense Fund (Ithaca, NY) in Mar 2019", "Interview Descriptions": "I had a video interview with three managers with the marketing and communications team within the supply chain team at EDF+biz. They asked me several questions and went very in depth on my past experiences on my resume. They focused on communication skills.", "Interview Questions": "Tell me about this experience on your resume."}, {"date": "26 Sept 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Environmental Defense Fund in Mar 2019", "Interview Descriptions": "I had two phone interviews - one with the recruiter and one with the role's supervisor about two weeks apart. The recruiter's questions were primarily behavioral and the supervisor's questions were to gauge my interest in their various projects.", "Interview Questions": "Do you work better by yourself or in a group?"}, {"date": "26 Feb 2019", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Environmental Defense Fund", "Interview Descriptions": "Two rounds of interviews with different members of the department, around 30 minutes each. First one was more technical while the second one was more about my background and my interest for this position.", "Interview Questions": "Describe what you know about the natural gas sector."}, {"date": "15 Apr 2023", "title": "Graduate Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Environmental Defense Fund (San Francisco, CA) in Feb 2019", "Interview Descriptions": "The process consisted of two on campus interviews and then notification via email - it was set up through my University so it was not necessarily the normal process for EDF", "Interview Questions": "What is an economic environmental challenge that is important to you"}, {"date": "31 Jan 2019", "title": "Climate Corps Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund", "Interview Descriptions": "Straightforward interview, friendly conversation with good coverage of logistics on the process. Mostly behavioral questions with a short case.  The length of the process is the strength and weakness of this program- the matches seem thorough and effective, but the length of the process is substantial and must contribute to some attrition.", "Interview Questions": "What qualifies you for the program"}], [{"date": "2 Feb 2019", "title": "Climate Corp Fellowship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Environmental Defense Fund (New York, NY) in Jan 2019", "Interview Descriptions": "Submit an online application by early December and they will contact you if you were successful to proceed to the next round of interviews (there are two interviews in total). I was given a few cases to choose one from for the first interview, from there you are given guiding questions to prepare for - pretty straightforward. The interviewer ended up asking me a blind question related to the case I picked but it was a very manageable question, they're not trying to catch you off guard. They also asked me about the skills that I demonstrated proficiency in and previous experience. The second interview was more casual and consisted of asking more about placement preferences, interests and career goals.", "Interview Questions": "How would you explain \"sustainable development\" to someone from you Grandparent's generation?"}, {"date": "11 Dec 2018", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 8 weeks. I interviewed at Environmental Defense Fund (New York, NY) in Oct 2018", "Interview Descriptions": "Company cancelled interviews with 45 minutes' notice; demanded interview times within period of 1-2 hours; feedback on interview scheduling got delayed over weeks at a time; multiple re-schedules; when I showed for interview, contact was \"out for the day.\"  I should have known.  If they treat candidates like this, I cannot imagine how they treat employees.", "Interview Questions": "How would you manage a contract with a delivery partner"}, {"date": "28 Dec 2021", "title": "Senior foundations officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund in Jul 2018", "Interview Descriptions": "I was interviewed by the recruiter which went well. I then interviewed with the the hiring manager. I followed up with respectful emails with absolutely no feedback from either person. Then they ghosted me with absolutely no follow up. Not professional in my opinion. I just wanted to hear “no, you weren’t a fit”.", "Interview Questions": "Standard questions about my experience in fundraising/foundation relations and how I thought my experience could help the organization.. We discussed the position and what I could bring to the role. "}, {"date": "27 Jun 2018", "title": "Energy Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Environmental Defense Fund", "Interview Descriptions": "Skype interview with the hiring manager, which lasted approximately 30 minutes. Was fairly laid back and casual, more conversational than anything else. Asked alot of basic behavioral and standard interview questions.", "Interview Questions": "Tell me about your experience with energy"}, {"date": "13 Sept 2018", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Environmental Defense Fund (New York, NY) in Apr 2018", "Interview Descriptions": "Sent in an application online for a summer internship. Had a phone interview with the intern hiring manager. A couple of weeks later had a video-conference interview with the EDF department that I would be working with.", "Interview Questions": "What is an environmental problem that you care about, and how would you explain it to the average person?"}, {"date": "7 Mar 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Environmental Defense Fund (San Francisco, CA) in Feb 2018", "Interview Descriptions": "The 3rd party interviews for EDF. The first interviewer was a senior in the company and was very friendly. The second interviewer was more to the point. However, I think the first one was the important one, and in the second interview, they were evaluating the first phase options.", "Interview Questions": "You are in a meeting with your supervisor, and the audiences are not supporting the options that you and your supervisor presented to them. Your supervisor will put you on the spot and asks you to explain what is the importance of what you do in one minute. What would you tell them?"}, {"date": "9 Feb 2021", "title": "Clean Energy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund in Dec 2017", "Interview Descriptions": "I was contacted by a manager. I set up a time to speak with them on the phone. We spoke on the phone for about 30 minutes. 20 minutes were questions about my background and 10 minutes were for my questions/personality questions.", "Interview Questions": "Why are you interested in this internship? What are your previous experiences with excel? How do you understand the relationship between water-energy-climate?"}, {"date": "15 Jun 2017", "title": "Marketing and Communications Brand Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Environmental Defense Fund", "Interview Descriptions": "I was contacted by an HR representative for a screening. The conversation was very fast. I was given a chance to discuss my background briefly and then I was told some further information about the position. I was never asked questions relevant to why I would be a fit for this position. It was so brief that I assumed it was just a quick formality interview and I would be asked real questions in the next stage with the hiring manager. Later I was sent a very generic email letting me know I had been passed on for the next stage.", "Interview Questions": "N/A"}, {"date": "1 Jul 2017", "title": "Tom Graff Fellowship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund (Washington, DC) in Jun 2017", "Interview Descriptions": "1. Phone interview call (30 min approx.). Screening phase.\r\n2. In person (or online) interview at the office. General conversation about the fellowship.\r\n\r\nThey were really nice. The process took to long though. It could have been faster.", "Interview Questions": "Why are you a good candidate for this position?"}, {"date": "8 Mar 2017", "title": "Climate Corps Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Environmental Defense Fund", "Interview Descriptions": "After the application online, you'll get an information about the interview.\r\nIn this interview, they would ask you if you get a car. And some easy calculations.\r\nWhat's more, the case questions are indispensable.", "Interview Questions": "1. the case questions\r\n2. If you can not meet with your supervisor, what would you do. "}], [{"date": "22 Sept 2017", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Environmental Defense Fund (Washington, DC) in Mar 2017", "Interview Descriptions": "Phone screen via video conference. The interview screen went well as I was able to articulate my skills match well with the job description. However, I wasn't invited to the in-person panel interview. I wasn't given any feedback the interview", "Interview Questions": "N/A"}, {"date": "13 Mar 2017", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund (Virginia Beach, VA) in Mar 2017", "Interview Descriptions": "Interview process takes place around 45 min. The interview comprised 3 parts: case interview, case questions and behavioural questions. The interviewer was nice and friendly. If you passed the first round, there will be 2nd round of interview.", "Interview Questions": "Walk me through your resume"}, {"date": "2 Mar 2017", "title": "Climate Corp Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund in Feb 2017", "Interview Descriptions": "EDF outsourced another firm to conduct the interview due to the large number of applicants every year. Interviewees will be tested on some behavioral and analytical questions and a case study on their first round.", "Interview Questions": "Explain NPV (Net present value)"}, {"date": "6 Feb 2017", "title": "Events and Outreach Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund (New York, NY) in Feb 2017", "Interview Descriptions": "I applied online. It took me about a week to hear back from the office. I want to talk more about the process before the interview, because I never made it to the interview. They asked me to set up a time for an interview. I was going to be out of the country during the time and date that they suggested, so I sincerely asked whether they would be free after I come back. They said yes. \r\n\r\nHowever, I heard back from them on the week of the interview date that they have selected another candidate. It was very disrespectful of them to cancel the interview this late. If they had told me earlier, I could have spent my time differently. They should understand that if their time is important, so is the candidates' time. \r\nIf they felt that they could not wait until I came back from abroad, they could have told me that they can only interview me earlier, or that they cannot interview me because they need to make a decision earlier.", "Interview Questions": "N/A"}, {"date": "27 Apr 2017", "title": "Summer Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Environmental Defense Fund (New York, NY) in Feb 2017", "Interview Descriptions": "I applied for the EDF Fellowship by the early deadline (December 2016) and got an interview call by early January. The process was of 4 steps. The first interview was divided into a case and behavioural questions. The case was sent in a week before to prepare. The second round was more about personal preference for a match and also tested passion for climate change. After that, we had to submit our top 5 host preferences and in the nest step I was matched with my top preference.", "Interview Questions": "You are at a party and someone comes up to you says, you don't believe in climate change right? How would you respond?"}, {"date": "22 Jan 2017", "title": "Climate Corps Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Environmental Defense Fund", "Interview Descriptions": "Two rounds of interviews where first one asked more of behavioral questions and the second one was more in regards to location and industry preference. After the interview process, I was proceeded to select my preferences for companies I wanted to intern for.", "Interview Questions": "Gave case study question and a list of behavioral questions"}, {"date": "15 May 2017", "title": "Climate Corps Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund (Washington, DC) in Jan 2017", "Interview Descriptions": "2 Interviews. The first one with technical questions based on analysis of a case study they sent a week before the interview. The second one with a cultural approach, aimed at analyzing the \"fit\" of candidates.", "Interview Questions": "Calculate energy consumption of a site, and estimate savings from LED retrofits."}, {"date": "1 Aug 2016", "title": "Legal Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Environmental Defense Fund (New York, NY)", "Interview Descriptions": "I met with three of the supervising attorneys and we discussed why I was looking to intern for their company and my legal interests. I don't think they were tough at all but were very friendly and seemed just to get a sense of why I wanted to be there.", "Interview Questions": "Why do you want to intern with EDF?"}, {"date": "26 Dec 2016", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Environmental Defense Fund (New York, NY) in Apr 2016", "Interview Descriptions": "An hour long phone interview with an outside interviewing company. It was a screening call to ask about experience and skills, so they were not able to answer questions about the work environment. The interview was fairly straight forward.", "Interview Questions": "What are you looking for in a work place? "}, {"date": "8 Aug 2016", "title": "Fisheries Policy Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Environmental Defense Fund (San Francisco, CA) in Apr 2016", "Interview Descriptions": "Had a video Skype interview with the hiring manager on the West Coast. The interview was casual and easygoing. He let me tell my story of my previous professional experiences and they asked questions along the way to gauge how applicable those experiences/skillsets are to the job at hand. It was more like we were having a conversation, rather than a formal Q&A interview.", "Interview Questions": "This job requires a lot of independent work that requires a lot of self-motivation. How do you handle that type of work?"}], [{"date": "23 Mar 2019", "title": "Clean Energy Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Environmental Defense Fund (New York, NY) in Apr 2016", "Interview Descriptions": "Had an initial screening phone call to gauge general interest, knowledge, and suitability, was then given times excel exercise to complete - had to be able to use “if” function, then another final phone call with other employees", "Interview Questions": "What is your economic background? "}, {"date": "6 Jun 2016", "title": "Fellow Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Environmental Defense Fund (New York, NY) in Apr 2016", "Interview Descriptions": "Brought in for an interview, then asked to come back in two weeks later to meet with a panel of people. people were friendly and intelligent though it was difficult to express my qualifications effectively because the primary interviewer was unavailable.", "Interview Questions": "Why are you interested in this work?"}, {"date": "23 May 2016", "title": "Water Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Environmental Defense Fund (San Francisco, CA) in Mar 2016", "Interview Descriptions": "Filled out an online application and was contacted about a week later for an initial phone interview to take place within the next few days. The interview was about 30 minutes, 20 of which were spent answering questions, the last 10 were left for me to ask questions about the position/company. I was told I would hear back by the end of the week or the start of the following week. I did not hear anything by the dates specified, so I sent a follow-up email. I still have yet to hear back from the company a month later, but the job posting was removed. Highly unprofessional. Either the position was given to someone else, or they lost funding for the position. Either way they did not have the courtesy of letting me know. I would not be surprised if they lost funding because I had already interviewed for another internship with the company a couple weeks prior, and they told me they lost funding for it.", "Interview Questions": "Walk me through your resume. \r\n\r\nTell me what you know about groundwater.\r\n\r\nWhat were your favorite and least favorite courses and why?\r\n\r\nWhat courses did you take that are relevant to this position?"}, {"date": "10 Mar 2016", "title": "Climate Corps Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Environmental Defense Fund (Los Angeles, CA) in Feb 2016", "Interview Descriptions": "Applied online and stated three referrals (two must be professional). Received invitation request in three weeks. EDF hired an agency to conduct all the recruitment.The agency reached out in another 3 weeks to set up a time to skype interview. The interview included a case discussion. Three cases with questions were sent to me and I had to pick one and prepare for discussion.\r\n\r\nThe first round interview last around 25 minutes. Asked some behavioral questions such as tell me about yourself, why EDF, your experience in financial modeling. Also asked some technical questions such as what is NPV, how many kw is saved with LED light bulb. Then went through the case. Questions in the case were asked.\r\n\r\nAfter I completed the first interview, I immediately received a request for second one. The second interview is mainly about understanding my preference. I was asked about the management style that I feel comfortable working with, what my long term career goal is and what industry I want to work in etc. \r\n\r\nThen they opened the engagement list and asked me to list my 5 top choices. I submitted my choices and they came back and told me that they will move me to the next round of match. \r\n\r\nThe interview process overall is good. The recruiting agency is professional and organized. I was well prepared and did everything right. However the hosting company has the final saying in whether they will take you as their fellow. My background does not really fit the position even though I did a lot of work to educate myself. In that way, I felt that EDF didn't do a good job selling the candidates.", "Interview Questions": "What would you do if your manager does not respond to you?"}, {"date": "12 Mar 2016", "title": "Climate Corps Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Environmental Defense Fund (Denver, CO) in Jan 2016", "Interview Descriptions": "The process took approximately 3 months. Two phone interviews, the first one in early Jan., immediately after the first interview I was informed that I passed to round 2. Second interview was 2 weeks later, this was a more relaxed interview, no quant questions. A couple of hours after my second interview I was informed that I was a finalist and needed to wait until Feb. 12 for all engagements to be released. We had two weeks to choose our 5 preferred engagements. I received a notification that I was placed on Feb. 26th and had until March 11th to accept or decline the offer.", "Interview Questions": "Explain NPV in layman's terms."}, {"date": "29 May 2017", "title": "Climate Corps Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Environmental Defense Fund (Austin, TX) in Dec 2015", "Interview Descriptions": "2 interviews both of them by phone. A cover letter was also required. \r\nThe interview was very friendly. Not difficult at all.  They just want to now your knowledge about project management, financial metrics, and energy/environmental concepts.", "Interview Questions": "Most of them are related to project management and financial valuation"}, {"date": "9 Jul 2015", "title": "Climate Corps Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Environmental Defense Fund", "Interview Descriptions": "Two rounds of Skype interviews. The first one was more focused on my problem solving abilities and the second one more about the program and my expectations. The interviews were pretty informal and the people very nice. I never felt like I was grilled. The interviews were actually performed by an external consulting company.", "Interview Questions": "Simple energy efficiency calculations like X light bulbs of X wattage need to be replaced. How much money will you save assuming they burn X hours"}, {"date": "5 Jun 2015", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Environmental Defense Fund (New York, NY)", "Interview Descriptions": "I was contacted by the HR 2 weeks after I submitted my application. It was a 30 mins phone interview where I was asked regular questions, e.g. why EDF, tell me about your previous experience, where do you see yourself in 5 years...etc. 2 weeks later the 1-2-1 interview was scheduled with the team. Again, mostly behavioral questions. After that I've sent a thank you note to everyone, but never heard back from them. I followed up with the HR a week later and again nothing. Exactly 3 months (!) after the submission of my application I received a note that another candidate was selected for the position. No communication after the second interview was quite frustrating...", "Interview Questions": "What are your strength and weaknesses?"}, {"date": "24 Mar 2016", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Environmental Defense Fund (San Francisco, CA) in Apr 2015", "Interview Descriptions": "after about two weeks, had a skype interview with future supervisors. The internview took about 30 min. All questions are behavioral questions and lots of them are about working habits. The interviewers are really nice.", "Interview Questions": "Do you prefer working alone or in a team? When are you most efficient, in the morning / afternoon / evening?"}, {"date": "28 Apr 2015", "title": "Climate Corps Fellow Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Environmental Defense Fund in Apr 2015", "Interview Descriptions": "I was approached by the EDF recruiters over email and setup a phone interview. They were very nice and the interview was pretty interesting. The recruiter asked behavioral based questions with a mix of questions related to fit and your ability to convey information. After the interview, they asked for three references in order to give you an offer. Also, once you accept an offer, you have a meeting with the client and there is a possibility they pull the offer at that point, if there isn't a fit.", "Interview Questions": "How would you explain NPV or IRR to a ten year old? Explain Climate change to a ten year old. How have you convinced a manager to accept a proposal?"}], [{"date": "23 Oct 2016", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Environmental Defense Fund (Ann Arbor, MI) in Apr 2015", "Interview Descriptions": "I applied online. Only one round phone interview. The questions focus on experiences related to the prospective project. The supervisor is interviewer be herself. Showing your interest and effort is very important. Overall nice experience.", "Interview Questions": "Walk through the resume."}, {"date": "16 Jul 2015", "title": "Climate Corps Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Environmental Defense Fund (Austin, TX) in Apr 2015", "Interview Descriptions": "I applied in January and heard from them in April. They use a consulting firm from California to conduct interviews through Skype. The first interview gauges your knowledge of finance and energy efficiency. They asked me to calculate the financial and energy savings of a particular lighting retrofit. You have to solve the problem right on the spot which is a little nerve-racking, but not too bad. They also ask a few scenario questions about dealing with employees who aren't environmentally focused. If you make it past the first round, there is a second interview a couple of weeks later. This interview is much more casual, and is meant to gauge your particular placement interests. You have to list your top organization and location choices, and explain why you chose them. After that, I heard from them in about two weeks with a placement. You have exactly one week to accept or decline the offer.", "Interview Questions": "Q: How do you explain NPV to a person who doesn&#039;t have a financial background? How do you handle someone who doesn&#039;t believe in global warming?"}, {"date": "21 Jun 2016", "title": "Climate Corps Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Environmental Defense Fund (Dallas, TX) in Apr 2015", "Interview Descriptions": "With the number of applicants to this fellowship program, EDF has outsourced the two Skype interviews to another company. While the interviewers weren't as able to answer specific questions about EDF or Climate Corps, this was still a positive experience. The first interview asks a combination of technical and situational questions (e.g. \"Calculate the ROI on this project....\", or \"Describe a time when you had to work together with people who had very different perspectives\"). \r\nIf asked for a second interview (which usually happens within the same week), this will be more focused on matching your interests and summer logistics (e.g. where in the country you want to work, whether you'll have a car) with an interested company.", "Interview Questions": "How would you respond to someone who believes climate change isn't real?"}, {"date": "12 Jun 2016", "title": "Communications Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Environmental Defense Fund (New London, CT) in Apr 2015", "Interview Descriptions": "I send my cover letter and resume to someone I knew at EDF and they passed it around until someone decided to interview for a potential internship. Originally after the interview that person decided they didn't need an intern, and then after that someone else decided they wanted an intern but didn't interview me. This review is for the original interview I had.", "Interview Questions": "Describe a time where you made a mistake or ran into a problem and how did you solve it?"}, {"date": "26 Feb 2016", "title": "Climate Corps Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Environmental Defense Fund (Boston, MA) in Mar 2015", "Interview Descriptions": "I had two rounds of interviews: the first one with behavioral questions, to test my finance skills and to test my logic skills. The second interview was to assess my interest in the EDF climate corps projects, and my knowledge of the broad field of sustainability.", "Interview Questions": "How would you describe an ideal boss/manager ?"}, {"date": "18 Feb 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Environmental Defense Fund", "Interview Descriptions": "I applied online and heard back after 4+ weeks. I had three interviews, one over skype and two over the phone. The first interview, over skype, was with a direct supervisor, the two subsequent were with people who were progressively higher up in the organization. The interview process took about 2 weeks, but it seemed like it would usually take less time, we just had a lot of scheduling problems.", "Interview Questions": "Walk me through your resume"}, {"date": "24 Aug 2016", "title": "Climate Corps Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Environmental Defense Fund (Santa Barbara, CA) in Feb 2015", "Interview Descriptions": "Two skype interviews both with CEA(california environmental associates). EDF outsources HR to CEA. To be placed with a good host organization, you kinda have to be very aggressive and demanding.", "Interview Questions": "Walk me through your resume in 60 seconds, then tell me what your career aspirations are."}, {"date": "3 Jun 2014", "title": "Research Intern (Summer) Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Environmental Defense Fund", "Interview Descriptions": "Contacted by email after 3-4 weeks of applying. Very courteous employee called for a phone interview. It only lasted 20 minutes. Never made it to the 2nd interview, the position was very competitive.", "Interview Questions": "Why do you want to work for EDF?"}, {"date": "4 Mar 2014", "title": "Climate Corps Fellow Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund", "Interview Descriptions": "Round 1: Skype interview", "Interview Questions": "How would you explain ROI, NPV, & IRR to a facility staff person who has no finance knowledge?"}, {"date": "2 Mar 2014", "title": "Climate Corps Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Environmental Defense Fund (Kingston, NY)", "Interview Descriptions": "Four month process including an initial application, one technical interview, and one \"cultural\" interview. They use another company to conduct all the interview since there are so many applicants. It was very challenging but the interviewer was very nice and made it feel a little more casual. It was done over skype, which can get frustrating if the audio or video is off.", "Interview Questions": "They sent out a graph right before the technical interview and asked to various questions about it, such as, which point on the graph represents a building that needs energy efficiency improvements."}], [{"date": "29 Sept 2014", "title": "Climate Corps Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Environmental Defense Fund (Boston, MA) in Mar 2014", "Interview Descriptions": "EDF CC was a very thorough and detailed process. They source out their climate corps recruiting to an independent firm, who is very versed on the traits EDF is looking for, but can't always answer questions you might have about the experience and company. I believe the firm they use has been working with EDF for a while, so they are familiar with most questions that come up. \r\n\r\nMy first interview was a phone/fit interview. We conducted it over Skype video call so it felt more casual then a phone conversation. We talked about EDF and the interviewer seemed really interested in my fit with the program than with my previous skills and experience in sustainability. I was sent a chart a few days before to review, and only had a couple basic questions. Not a full case interview by any means. It was just to assess my problem solving abilities. I was told to expect a follow up within a week, and I did. It was to schedule my second Skype interview.\r\n\r\nThe second interview was with a more senior recruiter at the recruiting firm who seemed to have worked with EDF for some time. She was extremely nice and positive. I think she had a list of predetermined questions, and they were very situational, what did you do here? How would you deal with difficult stakeholders? Where would you go if you needed help? Afterwards, she said I would hear back by the end of the following week.\r\n\r\nI heard back with an offer a few days later, but it was more informal and gauging my interest as it was at a location I had not specified in my application. They said I could take a few days to think it through and get back to them. I said I would be interested and they sent through a formal offer. I then had a firm deadline of one week to accept or decline, which seemed fast. The whole process took probably a little less than a month.", "Interview Questions": "If your host organization asked you to do something you had no experience in, where would you go for help?"}, {"date": "10 Feb 2014", "title": "Prospect Research Associate Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Environmental Defense Fund (New York, NY)", "Interview Descriptions": "Phone interview, in-person interview, research test, in-person interview with team", "Interview Questions": "N/A"}, {"date": "14 Apr 2015", "title": "Climate Corps Fellow Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Environmental Defense Fund (San Francisco, CA) in Feb 2014", "Interview Descriptions": "There were two interviews. The first one asked about basic skills and background information. It was about 40 mins. The second one asked about preferences for matching with companies, i.e. geographic location, industries, etc. This one was about 10 minutes.", "Interview Questions": "can you explain rate of return to a 10 year old? How you convince a climate skeptics to believe climate change"}, {"date": "11 Jan 2014", "title": "Climate Corps Fellow Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Environmental Defense Fund", "Interview Descriptions": "Initial Skype interview with questions about financial analysis skills and knowledge of environmental practices.", "Interview Questions": "How would you describe sustainability to a five year old?"}, {"date": "13 Jan 2014", "title": "Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Environmental Defense Fund (San Francisco, CA)", "Interview Descriptions": "One phone call and three in-person interviews.", "Interview Questions": "N/A"}, {"date": "18 Feb 2014", "title": "Prospect Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Environmental Defense Fund (New York, NY) in Dec 2013", "Interview Descriptions": "The process was an interview with the head of the team, a take-home test (they gave me a name to research), a brief phone call with an HR person and a final meeting with the team members.\r\n\r\nI had a very interesting experience interviewing with the EDF. The head of the team is an impressive, personable, straightforward lady. She talks a lot, but she does ask pointed questions and listens carefully when you answer.", "Interview Questions": "There were no difficult questions. I had a strange experience in the final stage of the process, when I met the team members. They appeared to lack interviewing skills and were so informal that I thought they were unprofessional. One of them would frequently interrupt the interview to talk to the other, turn the fan on and off and attend to other distractions. I felt that I was barely given an opportunity to respond to a question fully."}, {"date": "13 Nov 2013", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Environmental Defense Fund", "Interview Descriptions": "Easygoing and polite. Good to have a broad knowledge of topics.", "Interview Questions": "How fast can you calculate the threshold and baseline?"}, {"date": "22 Sept 2013", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Environmental Defense Fund", "Interview Descriptions": "Three interviews, including a writing test.", "Interview Questions": "How do you deal with having too much work to accomplish? "}, {"date": "10 Apr 2013", "title": "Climate Corps Fellow Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 5 months. I interviewed at Environmental Defense Fund", "Interview Descriptions": "I went through three different interviews. The first two were a great experience. However the on boarding/interview meeting with the placement was messy and unclear.  I was also CC'd on an email that was discussion between EDF and my placement in whether or not they would accept me. It felt a bit unprofessional.", "Interview Questions": "I was not expecting to interpret an energy usage report."}, {"date": "28 Jan 2014", "title": "Climate Corps Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Environmental Defense Fund in Mar 2013", "Interview Descriptions": "Two skype interviews. The first was more of a traditional interview that focused on previous work experience, classwork, understanding of finance, climate change and energy efficiency. The second focused more on cultural fit and placement preferences.", "Interview Questions": "There were a few analytical questions that took you through your problem solving process, for example \"How would you estimate the number of CFLs used in Boston?\""}], [{"date": "4 Jul 2013", "title": "Communication Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Environmental Defense Fund (New York, NY) in Mar 2013", "Interview Descriptions": "Heard back about a month after applying for a half hour HR phone interview. That was followed two weeks later by an in-office one with the two hiring managers. The NY manager seemed more focused on personalities meshing and friendlier than the DC manager whom I video-conference with. The two interviews were done separately and had vastly different tones.", "Interview Questions": "Was basically asked for a specific marketing plan for their program without prior information on what their current plans entail."}, {"date": "13 Jan 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Environmental Defense Fund (Boston, MA) in Feb 2013", "Interview Descriptions": "I had one interview at my school and then one follow up interview via skype.", "Interview Questions": "What do you bring to the table"}, {"date": "25 Feb 2013", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Environmental Defense Fund in Jan 2013", "Interview Descriptions": "Initial communication through an email from HR to schedule an interview with a HR representative. HR interview, lasted about 30 minutes. Then an interview with the direct supervisor (hiring manager), then their supervisor, then their supervisor, each lasting about 30 - 45 minutes and lots of the same general questions. Then had several shorter, less formal (more conversational) interviews with other program members, lasting only about 20 minutes. All interviews were in-person or video conferencing but from the local EDF office.", "Interview Questions": "Lots of situational questions, questions that begin with \"tell me about a time when...\" and \"given this situation how would you handle it?\"  Most unexpected question was that in my second to last interview I was asked what I did not like about the interview process, interviewers and the program I was applying for."}, {"date": "11 Oct 2012", "title": "Sustainability Specialist Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Environmental Defense Fund (Houston, TX)", "Interview Descriptions": "I submitted my application online, and to my surprise I found that EDF was one of the few companies that actually paid attention to online submissions. After maybe 2 weeks I received an invitation for an interview which was scheduled for the following week.\r\nThe interview was over phone, and she started by asking how I knew about EDF, that was followed by the usual questions about strengths, goal etc.", "Interview Questions": "All questions were easy/regular HR questions."}, {"date": "1 Apr 2013", "title": "Climate Corps Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Environmental Defense Fund in Mar 2012", "Interview Descriptions": "The first step is to get through the official application on the website where they asked questions about what you would do on your first day, how do you work in XYZ situation, and general info about yourself. The next step, if you make it, is a Skype interview with an EDF project manager. The interview lasted about an hour. They contacted me soon afterward to inform me that I would get a second Skype interview. Said it would be more of a personality fit interview to help place you with a company/location. 2nd interview was typical behavioral based questions and where or what company you want to work with and why. Finally, after the interview, you work with the recruiter to nail down a company or location.", "Interview Questions": "In 3 sentences, explain to me the science behind climate change as if I were a smart 12-year-old."}, {"date": "30 Oct 2011", "title": "CCPS Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Environmental Defense Fund in Apr 2011", "Interview Descriptions": "We had a phone interview on mostly behavioural questions. They said they were going to get back to me 4 day after the interview and they didn't until the following week after I called them to follow up.", "Interview Questions": "What do you know about sustainability?"}, {"date": "17 Oct 2011", "title": "Regional Ambassador Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Environmental Defense Fund (Washington, DC) in Jan 2011", "Interview Descriptions": "Someone from the office called me and asked a few questions about my experience.", "Interview Questions": "Describe your previous Experience"}, {"date": "6 Jun 2010", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Environmental Defense Fund in Jun 2008", "Interview Descriptions": "Applied online. Followed up with phone calls.  Received offer about a week after the interview.  I was asked a lot of questions regarding my views on the environment and my experiences directly related to to the job requirements.  I was interviewed by a panel of four people.  It was a fair interview process.", "Interview Questions": "what are some of the most dangerous impacts of climate change in your view?"}]]