[[{"date": "20 Sept 2022", "title": "Information Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Metropolitan Community College (New York, NY)", "Interview Descriptions": "I was contacted fairly quickly via email and scheduled within the same week for an interview.  Was not told that it'd be a group interview but was asked various questions, mostly on how how I keep myself organized. This was for a job classified as an IT job. I was told I'd be contacted within a week. It has now been a month and a half since the interview and two follow up emails later and not even an automated message turning me down. Very unprofessional.", "Interview Questions": "How do you make a peanut butter and Jelly sandwich? (seriously asked)"}, {"date": "8 Jul 2019", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Metropolitan Community College", "Interview Descriptions": "All of Metro's interviews are with a 4-5 person committee, there is always someone there from HR or Equality and  Inclusion office.  They take turns asking you questions and describing scenarios to you that you have to answer.  Some positions also ask you to have a presentation ready.  Each person has Matrix to which they grade your interview.", "Interview Questions": "Name a time in your professional career that you had a conflict with someone and how did you resolve it"}, {"date": "10 Dec 2015", "title": "Administrative Assistant/Receptionist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Metropolitan Community College (Papillion, NE) in Nov 2015", "Interview Descriptions": "It was an casual interview, we talked about the company, the job expectations, answer some questions from a list of \"questions\" on customer service and how to deal with the incoming traffic in the office.", "Interview Questions": "How do I handle constantly interruptions on a daily basis?\r\nTo talk about my own very life experiences in the past, and what I currently do.\r\nAsked about working in office teams and how to deal with many differently personalities."}, {"date": "27 May 2016", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Metropolitan Community College (Omaha, NE) in Aug 2015", "Interview Descriptions": "I interviewed with two full-time faculty members. I taught a sample 10-minute lesson, then I was asked a series of questions about my education and experience. The interview was very positive and took no more than an hour. I heard back from the administration within an hour after the interview.", "Interview Questions": "How do you keep up-to-date with the latest teaching strategies in your content area?\r\nIn what ways do you incorporate technology in your classes?\r\nWhat is your attendance policy like?"}, {"date": "28 Dec 2017", "title": "Enrollment Services Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Metropolitan Community College (Omaha, NE) in May 2015", "Interview Descriptions": "I was asked a series of questions and had to answer them in the most genuine manner, I was asked for my availability and I layed it on the table and management worked around my school schedule with me.", "Interview Questions": "Explain a situation where you faced difficulties with your previous job and how you handled it."}, {"date": "18 Jun 2015", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Metropolitan Community College (Omaha, NE) in Jul 2014", "Interview Descriptions": "interviewed with instructors, advisory board, Dean and HR people. I  taught a subject for 10 minutes. I was given the subject to teach 5 days in advance to prepare. All equipment was provided that twas in the classrooms. the interview was somewhat intimidating simply b because I had no idea 9 people would be there.  It went very u icky and it was  very friendly atmosphere", "Interview Questions": "student conduct"}, {"date": "19 Apr 2014", "title": "Admissions Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Metropolitan Community College (Omaha, NE)", "Interview Descriptions": "Their interview process was very intense but everyone was warm and kind.", "Interview Questions": "I didn't expect a group interview. They asked me to choose something in the room and how I would sell it."}, {"date": "4 Dec 2017", "title": "IT Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Metropolitan Community College (Omaha, NE) in Nov 2013", "Interview Descriptions": "I applied at school and I was directed to take an assessment and a class online.  A few days later I was called in for an in person interview.", "Interview Questions": "What do you like about programming"}, {"date": "13 Jul 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Metropolitan Community College (Elkhorn, NE) in Aug 2013", "Interview Descriptions": "Came in, sat down, went over my experience and past curriculum. I had a pretty good relationship with the head of the department going in so it was mainly a formality followed by more formalities, background checks, etc.", "Interview Questions": "What range of classes did I feel comfortable teaching."}, {"date": "6 Aug 2014", "title": "College Retention Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Metropolitan Community College (Kansas City, MO) in Jul 2013", "Interview Descriptions": "Set interview over phone. Had to prepare a presentation about MCC, benefits of community college, and an on-campus recruiting event. Very little detail to what they wanted in the presentation. Arrived and interviewed in front of a panel of 5 people. They went around the table asking questions, mostly 'what experience do you have in these situations.' Finished with presenting my presentation.", "Interview Questions": "The presentation they required for the interview."}], [{"date": "5 Jul 2012", "title": "Testing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Metropolitan Community College (Omaha, NE) in Mar 2012", "Interview Descriptions": "The application, interview, and hiring process took forever.  I applied in February, had a phone interview in March, had a panel interview 3 weeks later, and then a month later in April they finally called me to officially offer me the position.  It took the hiring manager 2 weeks longer than she said to make me the offer, after she made me aware that they were interested in hiring me.", "Interview Questions": "N/A"}, {"date": "30 Apr 2012", "title": "Transition Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Metropolitan Community College (Omaha, NE) in Apr 2011", "Interview Descriptions": "typical", "Interview Questions": "What would you  bring to the table?"}, {"date": "29 Apr 2012", "title": "Staff Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Metropolitan Community College (Omaha, NE) in Sept 2010", "Interview Descriptions": "Was relatively painless--standard interview questions (give examples of working in teams; what do you feel is your biggest weakness, etc).  Because it's a government job it takes a long time to go from application submission to getting a call for an interview (I had actually forgotten I applied by the time they called) and several weeks after the interview to get the offer and start.  Decent place to work, laid back.", "Interview Questions": "\"What would you say is your biggest weakness?\""}]]