[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "1", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Jan 2022", "job_title": "Graduate Student in Guangzhou, Guangdong", "duration": "N/A", "pros": "Had a wonderful experience during my graduate program", "cons": "No cons, I am fully satisfied with the environment and faculties."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Rutgers University Newark at Northeast Normal University", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Mar 2018", "job_title": "Professor in Changchun, Jilin", "duration": "N/A", "pros": "-No office hours\r\n-Low stress if you keep your head down\r\n-No micromanagement \r\n-Good salary for Chinese University, even those in large cities seem unable to compete with the benefits and salary here", "cons": "-For people who actually try to improve the program itself, it can be very stressful and difficult working with management to make basic changes\r\n-Being a partner school, with issues between the 2, professors are stuck in the middle, making our jobs 2x harder\r\n-If a colleague has to take extended leave, others are expected to carry the workload for an indefinite period of time, without salary increase or even knowledge of the field (\"the you're American, you can teach English\" approach)\r\n-Rutgers seems unhappy with the current state of the program, and there's been speculation about the cancellation of the program, this has been openly discussed at meeting so I suppose that's appreciated. But it makes me worried long term"}], [], [], []]