[[{"date": "18 Jan 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northern Westchester Hospital", "Interview Descriptions": "Was contacted by nurse recruiter via phone call and answered a few questions over the phone. Was called back a few days later for formal in person interview with floor manager", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "21 Sept 2021", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northern Westchester Hospital (Mount Kisco, NY) in Aug 2021", "Interview Descriptions": "Didn't much of an opportunity to ask questions as manager took it upon herself to describe every detail.  A candidate was chosen before interview was held.   This was discouraging as I felt participating in the interview was pointless.", "Interview Questions": "They asked about strengths and weaknesses."}, {"date": "30 Oct 2020", "title": "Concierge Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northern Westchester Hospital", "Interview Descriptions": "Easy straight forward. Everyone was friendly  I met with 3 different professional , the interview environment was calm. Great experience. They asked a few questions like why should we choose you? What makes you stand out? What can you bring to the table?", "Interview Questions": "Why should we choose you ?"}, {"date": "26 Jan 2016", "title": "RN New Grad Program Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Northern Westchester Hospital", "Interview Descriptions": "The Human Resources rep took me to her office and we talked for 20 minutes. She was really nice and talked a lot about the job and if it appealed to me", "Interview Questions": "Asked questions like why nursing, why our hospital"}, {"date": "20 Jan 2016", "title": "Laboratory Assistant-Microbiology Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Northern Westchester Hospital (Mount Kisco, NY) in Dec 2015", "Interview Descriptions": "Arrived 10 minutes early for my interview, was told to sit and wait for the interviewer who was approximately 20 minutes late. She explained the philosophy of the hospital and we had a casual conversation regarding how I feel about their philosophy etc. Because she worked in human resources, she did not ask me any questions regarding my actual laboratory experience, just feeling out how I would fit into the hospital's overall experience, I guess. I was then introduced to the laboratory manager who asked me one or two questions and then introduced me to the laboratory supervisor, who seemed eager for me to work in their lab, however, I was not given an offer. I feel as though they place too much power in hiring in human resources, despite the fact they are not who you will be working for, nor do they understand how to evaluate someone's laboratory experience.", "Interview Questions": "Does this philosophy seem like something that would interest you?"}, {"date": "27 Feb 2018", "title": "Mental Health Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Northern Westchester Hospital (New York, NY) in Feb 2015", "Interview Descriptions": "i was called in for an interview and was scheduled to meet with the talent acquisition specialist. this part of the interview was approx 1 hour long. afterwards, i met with the manager of the unit i was applying for.", "Interview Questions": "explain a situation in which you were able to deescalate a crisis situation "}, {"date": "9 Jan 2014", "title": "RN Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Northern Westchester Hospital", "Interview Descriptions": "Interview with HR and unit manager, Math test had to pass with at least 85%", "Interview Questions": "There wasn't one"}, {"date": "16 Feb 2017", "title": "Ultrasound Technologist Supervisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Northern Westchester Hospital (Mount Kisco, NY) in May 2013", "Interview Descriptions": "I got hired because I was nice but more for my appearance. The Director had already decided he was hiring me by the time we walked from waiting room to his office, which he locked during the interview. I had nice legs.", "Interview Questions": "Where do yo see your self in five years."}, {"date": "10 Oct 2017", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Northern Westchester Hospital (Mount Kisco, NY) in Jan 2013", "Interview Descriptions": "easy but long interview, one interview with hr one with floor manager, Entire process took a long time though it took about a month before I was actually hired. Took a blood test and drug test, and orientation was on days 9am to 5pm for the first two weeks in a classroom (boring) to learn about the hospital and basic skills on how to greet and say hello to people.", "Interview Questions": "why do you want to work at a hospital"}, {"date": "4 Aug 2011", "title": "Psychiatric Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northern Westchester Hospital (Mount Kisco, NY) in Aug 2011", "Interview Descriptions": "The first portion of the interview appointment entailed completion of background check paperwork and a 15 minute meeting with an HR representative. The HR rep asked basic questions related to my work experience and discussed information about benefits and salary. The HR rep was very pleasant, professional, and gave a positive first impression of the hospital staff and culture. After the meeting with HR, I was ushered to a waiting room near the unit. I waited almost 2 hours for the second portion of my interview to start, which was scheduled with the respective unit's nurse manager. The HR rep kept stopping by to check on me, offered me water,  and appeared sincerely apologetic about the substantial delay in the interview process. The nurse manager breezed by me in the wait area several times, told me she was running late with \"meetings\", and could be periodically overheard chatting with staff in the neighboring offices. When the nurse manager finally graced me with her presence, she complained about being \"too busy with meetings all day.\" She appeared unprepared for the interview. The only question she asked was, \"Tell me about you.\" She detailed the job description. Then she took me on a leisurely tour of the unit, showing me every room, closet, patient bathroom, etc, and introduced me to various staff. This tour was the bulk of our meeting. Then she tried to introduce me to the unit's medical director, who was on the phone. She made me wait for an additional 15 minutes in her office until the medical director ended her call. While I waited in the nurse manager's office,  she answered emails and retrieved phone messages.", "Interview Questions": "N/A"}]]