[[{"date": "15 Mar 2023", "title": "Clinical Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hospital Sisters Health System", "Interview Descriptions": "Interview process is a normal process. Multiple steps. Speak to multiple people. I had three interviews total. The first with HR. The second with the direct manager. The third with their manager.", "Interview Questions": "Tell me a bit about youreself"}, {"date": "4 Aug 2022", "title": "Patient Access Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hospital Sisters Health System (Green Bay, WI) in Jul 2022", "Interview Descriptions": "Had phone interview that asked the standard questions. After phone interview I was forwarded to particpate in a virtual interview with current manager and director. Discussed the position and expectations and my background.", "Interview Questions": "Are you okay with commuting to multiple locations? "}, {"date": "24 Mar 2022", "title": "Credentialing Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Hospital Sisters Health System (O Fallon, IL) in Feb 2022", "Interview Descriptions": "Recruiter was late calling for interview, when I reached out to her, she said her system was down and she needed to reschedule. The actual interview was average, just lack of communication about needing to reschedule.", "Interview Questions": "If I were to ask your current employer, what would they say are  your biggest strengths and weaknesses?"}, {"date": "6 Sept 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Hospital Sisters Health System", "Interview Descriptions": "Very quick interview process. Probably too quick. They are pretty desperate for employees and will hire anyone remotely qualified. The interview is more of a formality and less of an actual interview to see if you’ll be a positively contributing member of the team.", "Interview Questions": "Which one of our hospital ideals do you think is most important?"}, {"date": "25 Jun 2021", "title": "RN Pediatrics Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hospital Sisters Health System", "Interview Descriptions": "I was at St. Vincent Children's in Green Bay, WI. The nurse manager was friendly and gave me a tour of the ER and Children's ER. Then we went to a conference room and she asked me typical interview questions. Finally, she gave me a tour of the Children's Hospital and introduced me to some family members and staff. Overall a good interview. I would ask for a job shadow in the future.", "Interview Questions": "How have I dealt with change?"}, {"date": "10 Apr 2021", "title": "Student Nurse Extern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hospital Sisters Health System", "Interview Descriptions": "Very pleasant phone interview consisting of about 5 or so questions. I appreciated that it seemed more relaxed rather than formal. After the phone interview I was pushed on to the face-to-face, which hasn't been completed yet.", "Interview Questions": "HSHS is a faith based organization with 4 core tenets, which one stands out to you and why? \nWhy do you want to work for us? \nWhere are you currently attending school and when do you graduate? "}, {"date": "22 Jan 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hospital Sisters Health System", "Interview Descriptions": "Pleasent quick and responsive they called me the next day. The interviewer was very nice and conversational. There were two interviews each with different people. One was with the lead of the team I would be on.", "Interview Questions": "Where do you see yourself in five years and some gereal personality questions."}, {"date": "22 Jan 2021", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hospital Sisters Health System", "Interview Descriptions": "first telephone interview, then in person interview and asked 10 to 15 questions.  cultural interview was the last one. overall the interview process was normal. had good experience working with the team.", "Interview Questions": "what is your salary expectations?\n"}, {"date": "4 Dec 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hospital Sisters Health System", "Interview Descriptions": "Smooth, Phone interview first followed by a in person panel interview.  Overall The managers made me feel very comfortable.  They seemed genuine about getting to know me", "Interview Questions": "Tell me about  a time you worked within a difficult team, how did you handle it?"}, {"date": "5 Sept 2020", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Hospital Sisters Health System in Sept 2020", "Interview Descriptions": "Initial interview was on the phone, the second interview was on video call. Was a decent process. Can’t do the video on a chrome book, had to do it on my phone. It was maybe 20-25 minute call. Not too bad.", "Interview Questions": "Name a time you had a difficult patient and how you handled it."}], [{"date": "21 Jul 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Hospital Sisters Health System in May 2020", "Interview Descriptions": "I worked with an excellent talent recruiter that connected me with a St. Elizabeth’s Hospital.  The interview process was straight forward with several department managers present.  The interviewer was amazing in facilitating the interview with all departments present and proving concise and clear interview questions.", "Interview Questions": "Tell me about a time when you went above and beyond for a patient?"}, {"date": "4 Nov 2019", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Hospital Sisters Health System", "Interview Descriptions": "Applied online through their website and was contacted (by phone) by a recruiter for a phone interview. Phone interviewer asked questions regarding my work experience. They also went over the benefits offered and asked about my salary wishes. They gave me a range of salaries based on some averages at the hospital and set up a time for an in person interview. The in person interview took place in the Radiology dept. There were two interviewers, I was given time to ask questions about the job and shift.", "Interview Questions": "Tell me about a time you went above and beyond for a patient."}, {"date": "5 May 2021", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hospital Sisters Health System in Nov 2019", "Interview Descriptions": "Interview was very laid back with the hiring manager and director. Discussed previous work history, how it relates to current job, etc. No deep behavioral questions. \n\nFrom application to recruiter reaching out was about 1 month, then about 1 week after to receive offer.", "Interview Questions": "Name a time when you were overwhelmed with work. What did you do and how did you handle it?"}, {"date": "7 Jul 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Hospital Sisters Health System (Springfield, IL) in Aug 2019", "Interview Descriptions": "It was pretty straight forward. I was interviewed with nurse manager  and one of the HR. It was a 30 minute interview and I got an offer after 3 days.", "Interview Questions": "Describe yourself and your past experiences."}, {"date": "4 Jun 2019", "title": "Emergency Department Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hospital Sisters Health System", "Interview Descriptions": "Just beginning the process with this company at the Springfield, Il location.  Both of the people that I spoke with were very conversational and professional.  The interim manager that I spoke with was knowledgeable and positive about her experience within the dept and the company.  It was informative and encouraging to hear someone speak so positively about their job without sounding like a robot or that they really had to SELL the position.", "Interview Questions": "Tell me a bit about yourself..."}, {"date": "24 Jul 2019", "title": "Certfied Nursing Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Hospital Sisters Health System (Springfield, IL) in Jun 2019", "Interview Descriptions": "After I had initially applied for the CVICU, it took 2 weeks for anyone to get back to me. I had a phone interview shortly after the Hiring Recruiter got back to me.  A few days later I had a in-person interview.  Some more days went by and I got a phone call following up on the position and they didn't hire me because I didn't have enough experience in a hospital. So, the HR directed me to the Med floor to have an interview there. I went to the interview and the manager on that floor told me there wasn't any day shift positions open and that they only had night shift. I get another phone call about another 2 weeks later following up but I declined because the pay wasn't what I wanted and the drive to and from (45 min. drive from where I live) wasn't worth it.", "Interview Questions": "What is one of your biggest weaknesses?"}, {"date": "27 Oct 2018", "title": "Client Service Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Hospital Sisters Health System (De Pere, WI) in Sept 2018", "Interview Descriptions": "The interview process was very laid back. They made It really easy to open up to them and tell them what my goals are and why I want the job.", "Interview Questions": "They asked me about past jobs and how they helped me end up applying for this position. "}, {"date": "15 Nov 2018", "title": "Quality Assurance Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hospital Sisters Health System (Springfield, IL) in Sept 2018", "Interview Descriptions": "It was a rushed interview, probably due to the large pool of applicants that they are notorious for dealing with. Yet they failed to communicate or provide updates, even within the Taleo status.", "Interview Questions": "How would you set the parameters in SAP?"}, {"date": "29 Aug 2018", "title": "Hospice RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hospital Sisters Health System (Belleville, IL)", "Interview Descriptions": "Group Interview with Supervisor and administrator and one staff member.  They appeared to be looking for my motive for applying for the job.  The group seemed to be measuring my personality more than my clinical skills.  They did not provide a great deal of information of what my actual work tasks would be on the job.", "Interview Questions": "Explain why you think you can work independently and be happy with this job?"}, {"date": "19 Sept 2018", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Hospital Sisters Health System (Springfield, IL) in Jun 2018", "Interview Descriptions": "First with HR and then to unit manager. They each do separate interviews with similar questions.  HR representative will usually meet interviewee in main lobby and then walk them up to the specific unit they are interviewing for. The nurse manager then does their portion of they interview and gives a run down of the unit and its expectations.", "Interview Questions": "I was asked what one of my weaknesses was. "}], [{"date": "14 Feb 2018", "title": "Nurse Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hospital Sisters Health System", "Interview Descriptions": "It was a hairly easy interview process. Started with a phone interview, then a hiring event where you were interviewed in person, then they called you a few weeks later to let you know whether you got the job or not.", "Interview Questions": "Why do you want to work for us?"}, {"date": "9 Nov 2019", "title": "Medical Records Clerk Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hospital Sisters Health System (Green Bay, WI) in Jan 2018", "Interview Descriptions": "Time consuming. Uncomfortable. Unprofessional. I was interviewed in a messy room with stacks of banker's boxes. My interviewers did not appear to have much experience. They were stuffy and unprepared.", "Interview Questions": "During the \"culture interview,\" I was asked \"Describe a good day and a bad day.\""}, {"date": "19 Nov 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hospital Sisters Health System", "Interview Descriptions": "Overall, great experience. Nurse managers were friendly, very informative and informational. Christina in Human Resources and Recruiting was absolutely amazing! Gave great information prior to interviewing, as well as after job offers were made.", "Interview Questions": "What was the most stressful day that you've experienced at work?"}, {"date": "12 Jun 2018", "title": "Patient Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Hospital Sisters Health System (Chatham, IL) in Jun 2017", "Interview Descriptions": "After submitting an online application I was called for an interview. During the interview the practice manager asked me questions about my work history and my schooling. This job is mainly customer service so they are looking for people who have great customer service skills.", "Interview Questions": "How do you handle patient privacy?"}, {"date": "3 Apr 2019", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hospital Sisters Health System (Eau Claire, WI) in Jan 2017", "Interview Descriptions": "Application, then had to get 3 references, then the interview which went great. Just had to interview with one person which was the supervisor of the floor that I got hired onto. The interview in person took about 30-45 minute. I got a call for the interview about a week and a half after I had applied online. After the interview I had a job offer about a week later.", "Interview Questions": "When is a time that you had a conflict with someone at work, and how did you resolve it?"}, {"date": "18 Sept 2016", "title": "Outreach Representative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Hospital Sisters Health System (Chicago, IL)", "Interview Descriptions": "One on one after submitting application.  Interviewed with a consultant and then met with the CEO.  I was already an employee of this company in another department so they were aware of my drive/work ethic.  It also helped that I was an active member of the community and had held leadership roles in several civic organizations.", "Interview Questions": "How do you read listen to the voice of the customer?"}, {"date": "7 Oct 2016", "title": "Informaticist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hospital Sisters Health System (Springfield, IL) in Sept 2016", "Interview Descriptions": "All of my interviewers made me feel as if they were very interested in me as a person and not just as someone to fill a need for the facility.  Everyone was incredibly friendly and made the interview process flow much more smoothly than I was anticipating. I immediately felt right at home with my interviewers and was able to comfortably speak with them as colleagues rather than strangers.", "Interview Questions": "How you handle dealing with a client/customer that is unhappy with how a current process works."}, {"date": "18 Jan 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hospital Sisters Health System (Sheboygan, WI) in Jan 2016", "Interview Descriptions": "Very professional and intense. Discussed experience and background information.  Discussed the importance of flexibility and believing in core values  discussed values and the impact on how personal values affect growth and motivation to be an effective leader.", "Interview Questions": "Why would you be a good fit for this position "}], [{"date": "11 May 2017", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hospital Sisters Health System (Oconto Falls, WI) in Jan 2016", "Interview Descriptions": "This was a 2 step interview process.  The first step was with an HR Representative and second step with Nursing Manager.  We went over my resume and past CNA experiences and what my future goals were.", "Interview Questions": "Tell me about a time you went over and beyond with your customer service."}, {"date": "16 Jan 2017", "title": "Lab Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Hospital Sisters Health System (Eau Claire, WI) in Nov 2015", "Interview Descriptions": "Long process with multiple layers. It takes a long time to actually start officially once an offer is made. Other than that the salary range offered was fair. I appreciated the opportunity to showcase my experience.", "Interview Questions": "How do you see yourself in our mission based hospital"}, {"date": "23 Sept 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hospital Sisters Health System", "Interview Descriptions": "Most are behavioral based questions which can be difficult to answer for new grad RN's with no healthcare experience. You meet with the director or a supervisor of the unit to do your interview. They hire many new grad RN's, so don't be afraid to apply if your just passed boards.", "Interview Questions": "We expect people to say that they went into nursing because they enjoy caring for others. Other than caring for others, tell us why you chose nursing as a career."}, {"date": "21 Jul 2015", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hospital Sisters Health System", "Interview Descriptions": "Easy, had online assessment, then phone interview, then in person interview. The whole thing was very easy and stress free. They did a good job of making you feel welcome.", "Interview Questions": "very basic, not hard at all"}, {"date": "30 May 2017", "title": "ER Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Hospital Sisters Health System (Springfield, IL) in May 2015", "Interview Descriptions": "A meeting with HR, a meeting with the manager- most of the interview was directed by a scripted list of questions. Not very personal.  A tour of the facility.  A very brief meeting with the CEO.", "Interview Questions": "Name a time you made a mistake"}, {"date": "29 Dec 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hospital Sisters Health System (Green Bay, WI) in Apr 2015", "Interview Descriptions": "Brought into office where id work and got asked a few questions. Was less than an hour. Was not shown the facility. It didn't feel like they took the time to look at my application at all. I was interviewed by two people who were managers. When I got the job i wasn't sure which position I had received as we had talked about two in the interview.", "Interview Questions": "To be completely honest I don't remember much. I got asked where I thought I would be in 5 years. My familiarity with the company. What I was looking for in the internship.The pay I wanted. Where I would live if I got the position. They then showed me what i would be doing and if i was inerested"}, {"date": "14 Mar 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hospital Sisters Health System (Decatur, IL) in Jul 2014", "Interview Descriptions": "Interviewed with Ceo, DON, and Department manager. Felt very relaxed and easy to converse with everyone. Actually was the last interview of the day and spent over an hour talking about our family life and where we were born. Also talked about previous employer and reason for leaving. Did not feel judged at all, very comfortable.", "Interview Questions": "What did I expect from them as an employer."}], [{"date": "19 Oct 2015", "title": "Housekeeping Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Hospital Sisters Health System (Decatur, IL) in Aug 2013", "Interview Descriptions": "The interview process was long and boring.  They ask you the same questions.  What can you bring to the job?, why do you want to work for our company?, Where do you see yourself in 5 years?", "Interview Questions": "What can I bring to St. Mary's?"}, {"date": "28 Nov 2015", "title": "Student Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Hospital Sisters Health System (Springfield, IL) in Apr 2011", "Interview Descriptions": "I submitted my application through the HR website from an associated college program.  Then, I received a call to schedule a telephone Pre-Interview with a recruiter.  This was followed by an in-person interview with HR and then a fairly casual interview with the Program Director for the student nurse internship.", "Interview Questions": "Behavioral interviewing techniques along with technical knowledge and school accomplishments questions."}, {"date": "4 Oct 2015", "title": "IT Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Hospital Sisters Health System (Springfield, IL) in Jan 2011", "Interview Descriptions": "They afforded the interview to me but the decision was made before the process really began. I believe the interviewers did not make the decision but they were told how to decide from the President and the interviews were just formality.", "Interview Questions": "What is your management style?"}, {"date": "2 Jan 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Hospital Sisters Health System (Springfield, IL) in Dec 2010", "Interview Descriptions": "Quick callback with formal interview", "Interview Questions": "Tell me a time when your opinion did not match your senior management?"}, {"date": "7 Sept 2012", "title": "Pharmacist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hospital Sisters Health System (Springfield, IL) in Jan 2008", "Interview Descriptions": "I applied online and then several days later I was contacted by a recruiter. After the recruiter contacted me we set up a phone screening and then I came in for an in person interview. The process was fairly seamless and the recruiters were very welcoming. Overall very good experience.", "Interview Questions": "Tell me about your work history "}]]