[[{"date": "31 Jul 2019", "title": "Nutritionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HealthEast", "Interview Descriptions": "the hiring and interview process overall was very easy and as long as you show interest and eagerness to learn, you should be fine. Most often than not, they tend to prefer someone who works well with others.", "Interview Questions": "What would you do in stressful situations?"}, {"date": "7 Mar 2019", "title": "Switchboard Operator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HealthEast", "Interview Descriptions": "HR sent an email to confirm a 15-30 minute phone screen. I sent an email back confirming times that would work for a phone screen as well as my salary requirements. Because I have my B.A. and almost my Masters degree the 15.50-16.50 that HR replied back in an email with determined that we need not schedule the phone interview.", "Interview Questions": "N/A"}, {"date": "2 Jan 2019", "title": "Patient Flow Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at HealthEast (Saint Paul, MN)", "Interview Descriptions": "I was interviewed by the director of a broader department and the manager of my specific department. They asked my about my future goals, education, and even family. I was given a tour of the secured office area on the day of my interview.", "Interview Questions": "What are my goals for the future"}, {"date": "22 Jun 2018", "title": "Scribe Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at HealthEast", "Interview Descriptions": "It was quick and painless. I was interviewed by the lead scribe and the managing RN. I did have to do a typing test, where I had to remember everything important about a doctor's visit. It was relatively simple and went well.", "Interview Questions": "What experience do you have?"}, {"date": "2 Mar 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HealthEast (Woodbury, MN) in Feb 2018", "Interview Descriptions": "Best interview I’ve ever had! Super relaxed, wasn’t stressful. I applied online, scheduled a phone interview about a week later then scheduled an in person interview the following week. Very quick process.", "Interview Questions": "Tell me about a time when you gave the best patient care?"}, {"date": "31 Jan 2018", "title": "Ra Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at HealthEast (Minneapolis, MN) in Jan 2018", "Interview Descriptions": "Applied online and a few days later I received an email with a phone interview scheduled for the next day. I was told they will make a final decision by the end of the week. I received an email a few days after with a schedule face to face interview with the unit manager.", "Interview Questions": "Why did you decide to apply to Healtheast? "}, {"date": "1 Nov 2017", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at HealthEast (Maplewood, MN) in Oct 2017", "Interview Descriptions": "Applied online, received an email from a recruiter a few days later asking to set up a phone interview. Proceeded to the phone interview where the job description was described more in detail, as well as salary expectations, your work history, and some standard behavioral questions. Got moved on to schedule an in person interview a few days later. Arrived 5 mins early, waited about 5-10 mins after scheduled time to be interviewed before I got called back. The interviewers were nice, however the clinic manager seemed a bit new to the process. There was a new interview question sheet she wasn't too fond of so she skipped some questions, mainly just behavioral again. More opened ended questions from another nurse who joined and the manager, followed by if I had any questions. Overall an interesting in person interview, very hard to tell about how it went due to the clinic managers attitude the whole time. She said I should hear something by the end of the week.\r\n\r\nUpdate- I got a call back from the original recruiter the next day with a job offer. Went over onboarding details and scheduled a date to get a physical as well as orientation.", "Interview Questions": "How do you handle stress?"}, {"date": "18 Sept 2017", "title": "Credentialing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HealthEast (Saint Paul, MN)", "Interview Descriptions": "Had email interview and phone interview with a recruiter. Then had an in person interview with HR Director, Credentialing department manager and supervisor. Received a call the following week regard an offer.", "Interview Questions": "Describe your current role and how that role with your experience relates to this position."}, {"date": "10 May 2017", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HealthEast", "Interview Descriptions": "Interview depends on job you applied for usually for minimal clinic positions it consist of the manager only, if you are applying to a corporate or leadership role expect to have 5-6 individuals. Sometimes they bring in unnecessary individuals for the interview that has nothing to do with your role. it doesn't makes sense. but it is usually pretty standard.", "Interview Questions": "How well do you work under pressure?"}, {"date": "22 Apr 2017", "title": "Insurance Denials Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HealthEast (Saint Paul, MN) in Mar 2017", "Interview Descriptions": "Application,  email interview, phone interview, face to face interview with 2 members of management. Interview was nerve wracking as I had absolutely no experience they wanted and made sure I knew it, but I had something they didn't ICD-10-CM and CPT schooling that she said was the only reason why I was getting an interview.", "Interview Questions": "What would keep you in my department VS leaving to a different department. "}], [{"date": "25 Apr 2017", "title": "Insurance Follow Up Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HealthEast (Saint Paul, MN) in Mar 2017", "Interview Descriptions": "Went in scared and unsure what to expect. Was told I did not have the requirements that they were looking for in the perfect candidate, but I was also told I had something that she didn't have that was wanted.", "Interview Questions": "Why should I hire you and how will I know you wont leave my department to go to the next that closer fits your schooling background?"}, {"date": "5 Jan 2017", "title": "Surgical Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at HealthEast (Maplewood, MN) in Dec 2016", "Interview Descriptions": "Very formal and traditional, 3 members of management sat in an office for the interview. Basic questions pertaining to hospital care and your background. Got a tour of the wing after interview.", "Interview Questions": "What was one accomplishment you would say you are proud of?"}, {"date": "2 Oct 2016", "title": "Organizational Development Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HealthEast (Maplewood, MN)", "Interview Descriptions": "Very in-depth online application. Unfortunately, I never heard back regarding my submission. I would encourage HealthEast to reevaluate their communication practices with applicants. The candidate experience starts the moment someone clicks the submit button. It's important to make every applicant feel valued throughout the their experience with your company.", "Interview Questions": "N/A"}, {"date": "29 Sept 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at HealthEast (Saint Paul, MN)", "Interview Descriptions": "The interview was friendly and informal.  I felt at ease and comfortable with the director of the unit for which I was applying. The interview is always stressful, but the people at Healtheast made the whole process very relaxed.", "Interview Questions": "If I was easily stressed.  How do I handle stress?"}, {"date": "22 Sept 2016", "title": "Housekeeping Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at HealthEast (Saint Paul, MN) in Nov 2015", "Interview Descriptions": "I was prepared for all the questions she asked me because she created a worry free environment by us having a one on one interview. It was fairly simple in my opinion . She assured me that I had plenty of time to answer each question , which made it easier to respond to them.", "Interview Questions": "Why do you want this position ? "}, {"date": "3 Jun 2017", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at HealthEast (Saint Paul, MN) in Oct 2015", "Interview Descriptions": "They will contact you if you apply and have some experience in security or a degree. You get two interviews. Basic interview questions. You get interview by two people; a lead and a supervisor.", "Interview Questions": "Why do you want to work for HealthEast? Where do you see yourself in 5 years?"}, {"date": "24 Jul 2015", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at HealthEast (Minneapolis, MN) in Apr 2015", "Interview Descriptions": "Met owners on two separate occasions.  Each spoke about the company history, current structure, services provided.  Also talked about the consulting industry in general and how it differs from permanent work.  Interview questions were in regards to interest in moving to consulting position, previous experiences and industries.  Spoke about the types of desired consulting engagements and how that fits into current services and clients.", "Interview Questions": "What type of work are you interested in performing?"}, {"date": "16 Sept 2017", "title": "Nutrition Services Aide Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HealthEast (Saint Paul, MN) in Mar 2015", "Interview Descriptions": "First, you are interviewed by direct supervisor. Then contacted later by HR if chosen for an interview. After you are given a job offer and you accept it, they schedule your new hire orientation. You start by shadowing the employees in the first few shifts then you continue on your own after learning the job tasks.", "Interview Questions": "The interviewer is looking for organized and on time employees."}, {"date": "25 Jan 2015", "title": "Clerk Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HealthEast", "Interview Descriptions": "Relies on references and uses that information for on online company ratings using company the systems intranet services. This information will most likely be used as a marketing tool for promoting\r\nHealthEast Cares System in Minnesota.", "Interview Questions": "Why are you appyling here?"}, {"date": "2 Mar 2016", "title": "Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HealthEast in Jan 2015", "Interview Descriptions": "IT engineer, went well no deep questions. Was interviewd by 4 people but they were all great. Didnt ask much questions, just to the point on how you do your particular task and what can you implement.", "Interview Questions": "How do you handle pressure"}], [{"date": "30 Aug 2017", "title": "Paramedic Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at HealthEast (Saint Paul, MN) in Sept 2014", "Interview Descriptions": "Brief ALS scenario questions. Mostly about previous EMS experience. There is no physical skill testing or lift test to determine ability to perform the job. I would encourage this company to include these in future hirings to limit future injuries ot inability to perform their job requirement.", "Interview Questions": "Name a time you had to deal with a difficult coworker"}, {"date": "17 Mar 2017", "title": "CMA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at HealthEast (Saint Paul, MN) in Aug 2014", "Interview Descriptions": "Meet with clinic manager and then a tour of the clinic and meeting the rest of the medical assistants, providers, and administration staff. Provided medical assistant certification, and BLS certification, and demonstrated my lab skills including drawing minimum of 10 people in order to get \"signed off\" as Healtheast approved as someone who could potentially float there if needed.", "Interview Questions": "What was the best part of the position applying for"}, {"date": "22 Sept 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at HealthEast (Saint Paul, MN) in Aug 2014", "Interview Descriptions": "One-on-one interview with management in a conference room with a large table. She asked all the questions. She was very polite and professional. It took under an hour. I got a call back several days later.", "Interview Questions": "Why do you think you will make a good hospice nurse?"}, {"date": "15 Dec 2017", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at HealthEast (Saint Paul, MN) in Apr 2013", "Interview Descriptions": "Total joke manager was unprofessional!\r\nbuilding smelled bad like moldy basement.\r\nThought I seen a mouse or Rat run under a closed door? It was kinda scary also the restroom I used smelled like urine and was out of toilet paper not good!", "Interview Questions": "Tell me about yourself?"}, {"date": "5 Oct 2015", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HealthEast in Aug 2012", "Interview Descriptions": "had to go in 3 times for interview met with a ton of people who asked the same questions pretty much. the staff was super nice in the interview, however i feel that has changed now with new managers. they seem to hire anyone and everyone", "Interview Questions": "what good things have you heard about healtheast"}]]