[[{"date": "5 Jul 2023", "title": "Grounds Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Charlotte (Charlotte, NC)", "Interview Descriptions": "Kind of a formal interview with 3 supervisors. There was a quiz for landscaping knowledge and equipment maintenance knowledge. Not bad interview, lots of general questions nothing to overthink or worry too much about getting ‘right’.", "Interview Questions": "What is an example of a time you have faced adversity at work and how did you deal with it?"}, {"date": "9 May 2023", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Charlotte", "Interview Descriptions": "Asked about who you are as a person. Qualities. If you’re ok with doing XYZ. They asked about your interests and hobbies. They talk about your resume and cover letter.", "Interview Questions": "What made you want to apply?"}, {"date": "28 Mar 2023", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at UNC Charlotte (Charlotte, NC) in Jan 2023", "Interview Descriptions": "I got the job straight away. They had asked if I had prior work experience with the school. I did have experience. The interview was forward and with the athletic department.", "Interview Questions": "Do you have any prior work experience with the school."}, {"date": "16 Mar 2023", "title": "Business Services Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at UNC Charlotte in Nov 2022", "Interview Descriptions": "I had 4 panel interviews. And an interview with the hiring manager. The question set was the same each round so I was practiced by the end of the day.", "Interview Questions": "What was something I learned at my last job"}, {"date": "22 Sept 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNC Charlotte", "Interview Descriptions": "Multiple interview process that consists of doing an over the phone interview and later an in person or Zoom interview with multiple staff members. After both interviews there is an assessment asked to complete before coming to a final decision. ", "Interview Questions": "Name a time you encountered a difficult situation at your place of work "}, {"date": "22 Dec 2022", "title": "Student Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at UNC Charlotte (Charlotte, NC) in Aug 2022", "Interview Descriptions": "It was a phone call interview. It lasted around 16-17 minutes. The interviewer asked a bit of insightful questions to get a better understanding of my future plans to test whether I would leave this job immediately if I got a better offer.", "Interview Questions": "Why are you interested in this job and what are your plans in the next few years or after graduating?"}, {"date": "23 May 2022", "title": "Learning And Development Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at UNC Charlotte", "Interview Descriptions": "First interview was 45 minutes over the phone. Asked a series of HR developed questions. Second interview was 2.5 hours in person. Long process, lack of transparency in the desired qualities of the positions and could not pin point the scope of responsibility for the position.", "Interview Questions": "If a piece of equipment was not working on your office and you had tried all you could to fix it to not avail. Describe the steps you would take to get it fixed."}, {"date": "24 Jun 2022", "title": "Assistant Professor Clinical Faculty Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at UNC Charlotte (Charlotte, NC) in Feb 2022", "Interview Descriptions": "Full day of interviews including teaching demo and meetings with faculty and administrators. Opportunities to ask questions and discuss work environment. Advice given on relocating to the area. Priorities at this institution include disability rights and early childhood special education.", "Interview Questions": "In what ways can you support diversity among staff and students?"}, {"date": "3 Jan 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Charlotte", "Interview Descriptions": "Simple and easy interview process. I wasn’t asked difficult questions and I was able to get the on campus job I applied for with no problem even while still being a senior student.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "9 Dec 2021", "title": "Floor Sales Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNC Charlotte", "Interview Descriptions": "The general manager was late to start and led me to a crowded mall cafe instead off an office area or making the interview be of the store. After having a smooth interview and told I was hired in the spot , I received on boarding information and completed it it . I waited about a week and heard nothing from the store or any of the store managers. I called the store 3 times a week for 3 weeks and finally got the general manager I interviewed with to approve my start date. Extremely unprofessional but being though I was in need of employment at the time I proceeded to work there and received lots of mistreatment in shift management and unprofessional from all leadership staff.", "Interview Questions": "What exeperiencr do you have in retail?"}], [{"date": "10 May 2023", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at UNC Charlotte (Charlotte, NC) in Dec 2021", "Interview Descriptions": "It was detailed and informative for the interview process. I learned a lot during the process and good questions were asked. The process was online and they give you prompts and you have to answer them under a time limit.", "Interview Questions": "When was a time you faced conflict?"}, {"date": "27 Jun 2022", "title": "Peer Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at UNC Charlotte (Charlotte, NC) in Nov 2021", "Interview Descriptions": "It was extremely smooth and helpful, the professors in charge did a great job at putting me at ease however the questions were extremely cliche and their expectations were high for a low paying job.", "Interview Questions": "How did you display leadership in a difficult situation. "}, {"date": "24 Aug 2021", "title": "Technology Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Charlotte", "Interview Descriptions": "Boilerplate questions read from a book. Asked to describe a situation in the past. \"How would you handle this particular situation?\" They don't have much flexibility in what they can ask.", "Interview Questions": "Tell me about a time you dealt with an angry customer. "}, {"date": "8 Jun 2021", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Charlotte", "Interview Descriptions": "Usually, an 8 questionnaire is point-based.  You will have two people conducting the first interview for about 30 minutes. Then you will switch to a new set of two people with different questions.", "Interview Questions": "Tell me about a time when you had to take the leadership role."}, {"date": "13 Jul 2021", "title": "Business Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNC Charlotte (Charlotte, NC) in Jun 2021", "Interview Descriptions": "Initial phone interview 30 minutes with numerous questions by several committee members; second Zoom interview one week later with several UNCC employees from 12:15 p.m. until 4:30 p.m. with little breaks between Zoom meetings. Expected presentation of data provided three days in advance of Zoom meeting. The meeting coordinator controls the presentation with no option for modification or updates.", "Interview Questions": "What is your management style?"}, {"date": "9 Jun 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at UNC Charlotte (Charlotte, NC) in Apr 2021", "Interview Descriptions": "The process consisted of two interviews. This took about a week. After that, it was very smooth setting everything up and getting aquatinted with the lab space and and co-research assistants.", "Interview Questions": "Describe the process of making composites."}, {"date": "23 Sept 2020", "title": "Technology Support Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNC Charlotte (Charlotte, NC) in Aug 2020", "Interview Descriptions": "I applied for the position 07/25/2020. \r\n\r\nThree weeks later I was invited to a virtual Webex interview with two managers within the department. The interview lasted about 45 minutes and both managers made me feel welcomed and relaxed. The interview was a 50/50 split of both customer service and technical questions\r\n\r\nTwo days later I was contacted to setup a phone interview with the director of the department I would be working under. This interview lasted around 15 minutes and he explained the responsibilities of the role and went on to ask me a few technical questions.\r\n\r\nOne week later I was asked to submit three references including a prior supervisor. All were contacted. A couple weeks later I submitted a criminal background check. After the background check came back I was made an offer and given a start date for the end of September.  Overall, it was a lengthy process that was probably made a lot longer by Covid-19 (two month long hiring process). However, everyone I interacted with during the hiring process was professional and courteous.", "Interview Questions": "Describe how you would troubleshoot a network printer that isn't working."}, {"date": "6 Aug 2020", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Charlotte (Charlotte, NC) in Jul 2020", "Interview Descriptions": "I applied for the position on Sunday July 5, 2020. I was contacted via email by the Director with an invitation to to interview  in the First Round panel and asked to choose out of six one hour time frames. \nI was contacted via email with a one hour block of time. The interview was completed virtually and included the Director and 5-6 staff members who each asked a series of questions.\nI was contacted via email the next week informing me I was invited for the 2nd Round. The second round was held virtually on Friday and included a 15 minute intro and overview with the Director and then a one on one with one of the other departments Academic Advisors which lasted 30-45 minutes. Next I met with the same panel from from the previous Friday. The interview concluded with a 10-15 minute chat with the Director. \nI was told I would meet with the Assistant Dean of Academic Affairs on the following Monday.\nI met with the Dean virtually on Monday August 3, 2020 from 10-10:30am. This round consisted of information regarding the department and questions concerning the reason I wanted to join the team.\nI was told I would hear back in 1-2 weeks with a yes or no if I was selected for the position.", "Interview Questions": "What attracted you to the role?\n\nInitiatives brought to current or previous role?\n "}, {"date": "8 Feb 2022", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Charlotte in Apr 2020", "Interview Descriptions": "I got a great idea of the study areas and protocols in the laboratory I would be working in.  I was also able to see the laboratory and meet current graduate students.", "Interview Questions": "Did the goals of the laboratory align with my scientific interests?"}, {"date": "9 Mar 2023", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Charlotte in Mar 2020", "Interview Descriptions": "Questions on program fit and also interest. It was chilled with the professor mainly discussing why I want to work on the project. It was an overall great interview experience.", "Interview Questions": "Why do you want to work on the project?"}], [{"date": "26 Feb 2020", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNC Charlotte", "Interview Descriptions": "All behavioral questions. First a phone screen with the hiring manager, then in person with the team I would be working with the most in my role.  Asked about my past experiences from my resume, asked what I knew about the students at UNCC, and why I wanted the role.", "Interview Questions": "Why do you want this job?"}, {"date": "25 Feb 2020", "title": "Visiting Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at UNC Charlotte", "Interview Descriptions": "Phone interview  with panel of faculty that asked questions on the phone. No Skype which I appreciated. They asked typical questions and even forwarded me the questions before the interview which was really considerate and anxiety relieving.", "Interview Questions": "Describe a past teaching challenge"}, {"date": "27 Jan 2020", "title": "Psychologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Charlotte", "Interview Descriptions": "The advertisement was accurate and complete. The process for the interview, transportation, and the meetings were clear. The expectations for the interview day and preparation was also clear and detailed. The staff were prepared and courteous.", "Interview Questions": "Why are you interested in this position?"}, {"date": "28 Jun 2023", "title": "Teacher Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at UNC Charlotte (Charlotte, NC) in Jan 2020", "Interview Descriptions": "It depends on your professor for the most part but most likely you will only have to answer a few behavioral questions about having to work on campus and being able to conduct labs with students and grade their assignements.", "Interview Questions": "Q: Are you comfortable conducting labs in front of a big group? Q: Can you explain programming concepts to students clearly?"}, {"date": "6 Jul 2023", "title": "Adjunct Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Charlotte (Charlotte, NC) in Jan 2020", "Interview Descriptions": "A few questions were asked and they were not that difficult. The interviewer was interested in hearing about my prior employment experiences and teaching. Pedagogy was important and valued. I was told the department was collaborative and supportive.", "Interview Questions": "What is your favorite teaching strategy?"}, {"date": "25 Jan 2020", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at UNC Charlotte (Charlotte, NC) in Dec 2019", "Interview Descriptions": "There were two interviews. One Preliminary that was taken by professor and other was taken by UNC Charlotte Officials. The second interview was an assessment of my teaching skills. It was asked to develop your own course and how do you explain it to students. And why this topic was your choice than other topics.", "Interview Questions": "Design your own course module and explain it? "}, {"date": "1 Jul 2019", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Charlotte", "Interview Descriptions": "Quick and easy. \r\nKind of last minute for me. \r\nOne day laboratory interview and tour with lab member and research faculty. \r\nAlso gave an hour seminar talk with informal question session.", "Interview Questions": "Where do I see myself in the future?"}, {"date": "17 Jun 2019", "title": "Recycling Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at UNC Charlotte in May 2019", "Interview Descriptions": "I applied online, I received a callback around 3 weeks later. First, was a phone screening and then a phone interview with a panel. The interview questions were standard for a supervisor position. They were hiring internally, but are required to interview external candidates.", "Interview Questions": "How have you dealt with conflict in the past?"}, {"date": "23 Apr 2020", "title": "IT Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at UNC Charlotte (Charlotte, NC) in May 2019", "Interview Descriptions": "I applied online and was emailed to schedule an in person interview. The people interviewing me were relaxed and asked a few questions to get to know my skills and personality.", "Interview Questions": "Do you have experience with customer service? "}, {"date": "12 Mar 2019", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UNC Charlotte", "Interview Descriptions": "A casual and laid back experience. An one on one interview with professor in their office. They explained the position and the expectations. They asked about my experience and fit.", "Interview Questions": "Tell me about yourself"}], [{"date": "10 Sept 2019", "title": "University Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UNC Charlotte in Feb 2019", "Interview Descriptions": "Initial contact by e-mail.  Required to submit work samples in powerpoint, excel and word.  In person interview at the office.  Background check and reference check.  Offer.", "Interview Questions": "Describe your ideal boss."}, {"date": "21 Feb 2022", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Charlotte in Feb 2019", "Interview Descriptions": "Overall very good. The faculty in the department were kind and answered all of my questions. They were supportive and followed up with me regarding how I was doing throughout the entire multi-day interview, which I appreciated.", "Interview Questions": "What is your teaching philosophy"}, {"date": "8 Mar 2021", "title": "Associate Director Student Union Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Charlotte (Charlotte, NC) in Jan 2019", "Interview Descriptions": "Online application, received initial call to chat. Followed up by another call then scheduled a group interview call. Telling about myself, a couple of standard questions then a roundtable of questions from various employees from the Univ.", "Interview Questions": "Describe a challenging situation and how you resolved"}, {"date": "3 Jul 2019", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at UNC Charlotte in Jan 2019", "Interview Descriptions": "It was easy. They just looked at my resume and asked couple of questions related to my resume and asked weather I will be available during the start of semester.", "Interview Questions": "Tell about yourself"}, {"date": "19 Feb 2019", "title": "GTA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at UNC Charlotte in Jan 2019", "Interview Descriptions": "1) Discuss with the professor about your Interest\r\n2) Send the Resume\r\n3) Professor will review the resume and offer accordingly\r\n4) Attend the I-9 session\r\n5) Get the Employment Letter from ISSO\r\n1) Discuss with the professor about your Interest\r\n2) Send the Resume\r\n3) Professor will review the resume and offer accordingly\r\n4) Attend the I-9 session\r\n5) Get the Employment Letter from ISSO", "Interview Questions": "Related to the course which you want to TA for"}, {"date": "4 Dec 2018", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Charlotte", "Interview Descriptions": "It was a nice process that consisted of a couple of interviews. The people were nice and made you feel at ease when answering. You have 30 minutes for each of your interviews which is plenty of time. Be sure to ask questions at the end.", "Interview Questions": "How would your role around campus allow you to excel in the RA position?"}, {"date": "11 Aug 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at UNC Charlotte (Landis, NC)", "Interview Descriptions": "Very long interview process. Two phone interviews and then an in person. The in-person interview was panel style with the entire department. A lot of questions, about 25. Everyone wrote down the answers given. My best advice would be to practice thoroughly for this interview. I was told I would hear something either way by the end of the we", "Interview Questions": "Tell us about a time you made a mistake at work and how you handled it."}, {"date": "13 Jul 2018", "title": "Student Services Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNC Charlotte (Charlotte, NC) in Jul 2018", "Interview Descriptions": "I applied online via company website on Monday June 11, 2018.  I was emailed by the Director of Graduate Admissions on Thursday July 12, 2018 on my availability for a phone interview. After agreeing on a time I was called on Friday afternoon July 13, 2018.  \r\nThe phone interview lasted approximately 30 minutes. At the end I was asked what day the following week  I was available to come to campus for a face to face interview.", "Interview Questions": "What does Data Integrity mean to you?"}, {"date": "30 May 2018", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at UNC Charlotte", "Interview Descriptions": "Asked many questions, really focused on resume experience, not technical or confusing. Professors vary so I wouldn't go by just one example. Timing was about 30 minutes long and it was over.", "Interview Questions": "Tell me about yourself"}, {"date": "14 Oct 2022", "title": "Technology Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNC Charlotte (Charlotte, NC) in Mar 2018", "Interview Descriptions": "Initial 15 minute conversation with hiring manager going over what can be offered and a description of the workplace. Later a phone/Zoom interview for about 1 hour as an initial screening. Later followed by half day in person interview which included a work sample.", "Interview Questions": "List your strengths and weaknesses. Tell me about a time you needed to meat a deadline. Describe how you would explain something complicated to someone who is learning."}], [{"date": "12 Jun 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNC Charlotte (Charlotte, NC) in Dec 2017", "Interview Descriptions": "Phone interview first, call you back for in-person interview. Panel interview with the people you had the phone interview. Questions were pretty much the same. 2 panel interviews-4-5people in each about 45 minutes long.", "Interview Questions": "Tell us why you are interested in this position. "}, {"date": "28 Jan 2020", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNC Charlotte in Nov 2017", "Interview Descriptions": "phone interview and a in person half day interview multiple people. Long and drawn out process. There is a specific process to be followed so it is never quick .", "Interview Questions": "Experience and how I handled difficult situations"}, {"date": "26 May 2017", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at UNC Charlotte", "Interview Descriptions": "Interview is basically from the resume and behavioral. Through resume, they assess our technical skills. i) Tell me about yourself ii) What are the technologies you have worked?\r\n Through behavioral, they assess our attitude.", "Interview Questions": "Tell me about yourself ?"}, {"date": "19 May 2017", "title": "Technology Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Charlotte", "Interview Descriptions": "It was a 2-parter, first with department admins+the chair+technology support (to make sure I knew my stuff for the role), second with the supervisor (to make sure I would be competent).", "Interview Questions": "Are you familiar with imaging workstations?"}, {"date": "6 Jun 2017", "title": "Senior Buyer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Charlotte (Charlotte, NC) in Apr 2017", "Interview Descriptions": "Very informal, only had one interview. Called me back within a week to notify me I was selected for the job. Very professional and cordial. Asked a lot of questions about my experience in the work area but in a relaxed manner.", "Interview Questions": "How much procurement experience I have working with construction and facilities management."}, {"date": "25 May 2017", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Charlotte (Charlotte, NC) in Mar 2017", "Interview Descriptions": "Typical academic process: email to set up phone interview. Told they would email to follow up after all phone interviews. Never heard from them again.  I emailed chair to ask about status but still have had no reply. Website says job is filled.", "Interview Questions": "A ton of diversity questions "}, {"date": "25 Jan 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at UNC Charlotte (Charlotte, NC) in Jan 2017", "Interview Descriptions": "First, I email my professor regarding the job availability.  I got an reply regarding an personal interview. After the personal, I got an offer letter form the professor. In some days, he explained me about the work and handed me the data.", "Interview Questions": "Tell me about your past experience?"}, {"date": "24 May 2017", "title": "Scorekeeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at UNC Charlotte (Charlotte, NC) in Jan 2017", "Interview Descriptions": "There was not an actual interview. Easy process. Program director sent an email out to all students informing about the job opportunity. Had to attend an information session to be considered. At the information session you were given a quiz related to the sport, had to get a certain amount correct to be further considered. Then, if chosen, you had to go to a training session in order to get the job.", "Interview Questions": "How many players play on each basketball team?"}, {"date": "19 Oct 2016", "title": "Campus Police Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at UNC Charlotte (Charlotte, NC)", "Interview Descriptions": "Application, then a one-on-one interview, then a night time ride along, then an F8 interview with the recruiter, then a personality test at a doctors office, then the oral board interview with about 8-10 people. The questions were not very difficult and it seemed like half of the people were in a good mood and half of them looked like they were miserable being there.", "Interview Questions": "Difference between probable cause and reasonable suspicion."}, {"date": "30 Aug 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at UNC Charlotte (Charlotte, NC)", "Interview Descriptions": "The evaluation based on your resume and previous performance in the courses. It is imperative to attain good grades and also have suitable resume according to the role that you are applying for in order to be considered for the position. It is also important to be up to date with the latest technologies that you are interested in , as that is exactly what they are looking for in your application.", "Interview Questions": "What is your experience and skill sets in this respective field?"}], [{"date": "20 Jan 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at UNC Charlotte (Charlotte, NC) in Aug 2016", "Interview Descriptions": "I have mailed my resume to the professor and then the professor called me for personal interview and then he interviewed me to see weather i am a perfect fit for the role and then selected me.", "Interview Questions": "how do you think you are eligible for this position?"}, {"date": "13 Nov 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNC Charlotte (Charlotte, NC) in Jun 2016", "Interview Descriptions": "Reached out to Professor through email. Then Professor reviewed my Resume and Cover Letter and requested an in-person interview. I went in with my transcripts and Resume as requested. Once professor has finished interviewing all the applicants he offered the position based on the right fit of his needs.", "Interview Questions": "What are the supervised learning techniques you are good with? what all deep learning techniques you used so far? Details about these techniques"}, {"date": "11 May 2016", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNC Charlotte", "Interview Descriptions": "The interview was a 3 part all day interview, the last interview was a presentation/ panel interview with 8 staff and faculty. They want to see how prepared you are, how you will fit into the office culture, and what your knowledge is of the departments purpose.Some questions were trick questions.", "Interview Questions": "Questions were behavioral based. One question was describe a difficult situation that you encountered at work and how did you handle it."}, {"date": "20 Feb 2020", "title": "Technology Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UNC Charlotte (Charlotte, NC) in May 2016", "Interview Descriptions": "Applied online and received a responds a couple weeks after the posting was closed. Interviews were schedule and held in my supervisor's office. Discussed key points from the resume, work experience, and academia.", "Interview Questions": "How would you troubleshoot a Windows workstation?"}, {"date": "24 May 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at UNC Charlotte (Charlotte, NC) in Apr 2016", "Interview Descriptions": "Went in person to speak with the office manager, where I had to speak about different things concerning my background and experience.  she also had a set of questions she asked as well about how I work with others and various work scenarios. The Executive Director which I would be working under was out of the office, so I had to return the following week to meet with him and the Office Manger again so that he could get a good feel for me as well. Both were very funny, pleasant, and polite.", "Interview Questions": "Q: How well do you handle stress?"}, {"date": "3 Apr 2017", "title": "Public Safety Dispatcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at UNC Charlotte (Charlotte, NC) in Apr 2016", "Interview Descriptions": "The hiring process can take up to 3 months depending needs and speediness of the HR & State. Once HR make a decisions on applications based information only then the application will go to area inwhich you applied. If you're selected you will receive and call for an interview. If you make it pass the interview process; your background (nationally) will be checked; If you're considered to be hired you will get a either a call, email or a letter of a conditional salary offer.", "Interview Questions": "Several question depending of your experience "}, {"date": "15 Feb 2017", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 4 days. I interviewed at UNC Charlotte (Charlotte, NC) in Mar 2016", "Interview Descriptions": "3 rounds of interview\r\nFirst was a Phone interview by recruiter\r\nSecond was Hiring Manager (1:1)\r\nLast was Panel interview for almost 1 hr\r\nAfter a wait of 3 days, I received job confirmation in e-mail\r\nI have carefully evaluated the offer and accepted it!", "Interview Questions": "How do I differentiate myself from the crowd. No generic answers were entertained"}, {"date": "20 Feb 2020", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UNC Charlotte in Feb 2016", "Interview Descriptions": "Quick, and low-key with Department head.  Met for less than an hour. Asked me a few questions and gave me tour of the building and the space. Walked me through expectations and job requirements and duties as well as responsibilities.", "Interview Questions": "I cannot remember, but they were not very hard at all. "}, {"date": "15 Nov 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at UNC Charlotte (Charlotte, NC) in Jan 2016", "Interview Descriptions": "They dont have an interview process. They select based upon your GPA and whether you studied the subject under the professor you are applying for. \r\nThey look at the number of marks and Grade you received under that professor for that subject. \r\nYou have to apply personally to the professor through email rather than through the application the college sends everyone.", "Interview Questions": "Do you accept the job responsibilities of responding to students immediately?"}, {"date": "22 Feb 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UNC Charlotte (Charlotte, NC) in Dec 2015", "Interview Descriptions": "I was called about a month after I applied. My position was for a temporary spot. I had an interview with the Office Director and the Office Manager whose position I was filling for. The both asked me a series of questions. The explained the job duties.", "Interview Questions": "Name your best quality?"}], [{"date": "26 Oct 2015", "title": "Lab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at UNC Charlotte (Charlotte, NC)", "Interview Descriptions": "Wasn't much of an interview. Hired based on recommendation, I had a friend that worked prior to me that recommended me based on my skills and ability to complete the tasks.", "Interview Questions": "Asked if I could handle the software needed"}, {"date": "7 Oct 2016", "title": "AV Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNC Charlotte (Charlotte, NC) in Oct 2015", "Interview Descriptions": "First I applied then i had go through interview that was conducted on the site. It was for about 30 mins where they asked several questions related to cultural and academic background an then they said result will be declared after sometime.", "Interview Questions": "How will you deal with (they gave a scenario) this kind of situation?"}, {"date": "28 Mar 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at UNC Charlotte (Charlotte, NC) in Mar 2015", "Interview Descriptions": "The interview was about 3 hours, but it was not intimidating. The interviewers were extremely nice and the environment was warm. Also, they allowed me to take a break in-between the three hour process.", "Interview Questions": "Describe a time you implemented something, from beginning to finish. "}, {"date": "29 Jan 2015", "title": "PHP Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at UNC Charlotte", "Interview Descriptions": "I was contacted by a consultancy firm for the position at UNCC. I had 2 rounds of phone interview and the entire process took about 3 weeks +. I got the job offer and than they had to run a background check and that took almost a week or so. In my 2 rounds of interview, one of them was with a group of team members that I had to work with if they offered the job.", "Interview Questions": "Didn't find any question that difficult and it was a long time ago."}, {"date": "23 Jan 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Charlotte (Charlotte, NC)", "Interview Descriptions": "based on gpa and performance. ask questions on the courses you take . Also be prepared on basic C and matlab related stuff. Based on projects done during course work .", "Interview Questions": "no difficult questions as such"}, {"date": "8 Jul 2015", "title": "Visual Design Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNC Charlotte in Jan 2015", "Interview Descriptions": "There was a interview with two people and they let me know within a couple days. That interviews at lease 4 other people and decided to offer me a whole new position, based on my experience and portfolio.", "Interview Questions": "What did you not like about your pass job?"}, {"date": "1 Sept 2017", "title": "Student Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Charlotte (Charlotte, NC) in Jan 2015", "Interview Descriptions": "Received email inviting me to a group interview. There were approximately 30 people at the interview, and questions were discussed in small groups with the interviewer watching and listening. At the end, everyone had to fill out an interview question form with 5 job related questions.", "Interview Questions": "How would you describe your communication skills?"}, {"date": "27 Oct 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at UNC Charlotte (Charlotte, NC) in Dec 2014", "Interview Descriptions": "we were asked to deign a game in 3 days. The game would take more time than the given time period. I guess we were tested for our stress levels and we could manage to handle if the tasks is too big to complete. so at the end i could do 95% of it , the game was not complete, but i completed 95% of it. Many others completed close to 80-90 % . So i was selected for the job.", "Interview Questions": "what languages are good with ?"}, {"date": "16 Nov 2014", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Charlotte", "Interview Descriptions": "The interview was via Skype.  People were very nice, respectful, and interested to hear more about my background.  We had a short phone interview before they selected Skype candidates.  The Skype interview lasted an hour.", "Interview Questions": "They asked how I might deal with a certain client issue and how I might supervise someone working with that client issue. "}, {"date": "22 Sept 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at UNC Charlotte (Kannapolis, NC) in Nov 2014", "Interview Descriptions": "Interview process was very simple. They specifically want somebody who have basic understanding of java programming language, and that is what they'll ask in interview. They gave me two simple java programs to make, which I made without much struggle.", "Interview Questions": "How comfortable I am with various build tools?"}], [{"date": "9 Jul 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at UNC Charlotte (Charlotte, NC) in May 2014", "Interview Descriptions": "normal interview, nothing new, asked about prior experienced as asked about future plans for graduate schooling. nice people nice staff, friendly atmosphere, great department was in University college working with first year students which was what my dissertation was on. I was able to use the students for my research study. It was fun and the students were inspiring.", "Interview Questions": "Tell me about your experience"}, {"date": "13 Apr 2017", "title": "Student Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNC Charlotte (Charlotte, NC) in May 2014", "Interview Descriptions": "The interview process consisted of a group interview during which we sat around a long table and went in a circle answering various questions. The call center manager conducted the interview, and there was another individual attending, and adding input here and there.", "Interview Questions": "Tell me about a time when you experienced good customer service."}, {"date": "29 Jun 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Charlotte (Charlotte, NC) in Dec 2013", "Interview Descriptions": "During the interview, they tell you about the job and responsibilities. Then they ask you a few questions about your educational background and past work experience. After the interview, they give you a tour of the office.", "Interview Questions": "Tell me more about your major."}, {"date": "23 Aug 2015", "title": "Marketing Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at UNC Charlotte (Charlotte, NC) in Aug 2013", "Interview Descriptions": "Applied for the job by submitting a cover letter, resume, and writing samples. Later had a phone interview, where I was asked to also make editing corrections to a news release, and also write a news release in a timely manner. Once I was offered the position, I went in with potential supervisor to fully go over expectations and to make sure we were both on the same page.", "Interview Questions": "Why do you want this job?"}, {"date": "7 Jul 2013", "title": "Marketing and Communication Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UNC Charlotte (Charlotte, NC)", "Interview Descriptions": "Basic STAR questions", "Interview Questions": "Why do you want to work here"}, {"date": "3 Apr 2014", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Charlotte (Charlotte, NC) in Jul 2013", "Interview Descriptions": "email", "Interview Questions": "some major questions like statistical and regression questions/"}, {"date": "9 Jun 2014", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at UNC Charlotte (Charlotte, NC) in Jun 2013", "Interview Descriptions": "They look for your GPA in the previous semester and qualify you based on your experience and the courses you have taken. The interview was easy and was a cake walk.", "Interview Questions": "N/A"}, {"date": "28 Aug 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at UNC Charlotte (Charlotte, NC) in Jun 2013", "Interview Descriptions": "There wasn't much of an interview. In all three positions I held with UNCC, the professors were familiar with me and my work. So I gave informal presentations that displayed what I wanted to accomplish and how it worked. I knew them so there was no need for scheduling and applying. I just asked.", "Interview Questions": "They wanted a demonstration of my research work."}, {"date": "3 Jan 2014", "title": "Student Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at UNC Charlotte in May 2013", "Interview Descriptions": "The interview was me meeting with my boss and submitting samples of my work and a link to my website.", "Interview Questions": "There was not any really difficult questions it was all very personable."}, {"date": "21 Mar 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at UNC Charlotte", "Interview Descriptions": "It was a phone interview with details related to my bachelors degree and work experience.", "Interview Questions": "You should have basic knowledge in your field."}], [{"date": "4 Jun 2014", "title": "Statistics Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at UNC Charlotte (Charlotte, NC) in Mar 2013", "Interview Descriptions": "Nothing unusual. They asked you to 'teach' a class in front of a committee and then they gave suggestions.They may also asked you basic statistics questions and some behavior questions, just relax.", "Interview Questions": "NO, just general questions"}, {"date": "12 Nov 2015", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UNC Charlotte (Charlotte, NC) in Dec 2012", "Interview Descriptions": "Interviewed simultaneously by multiple supervisors in a conference room, Situation Action Result oriented questions, Informal Conversation, Discussed hobbies, Was given an opportunity to ask questions, Supervisors wanted to know what my plans were for the future and seemed genuinely interested in getting to know me, Discussed existing team dynamic and how I would fit in", "Interview Questions": "How would you resolve a meeting schedule conflict?"}, {"date": "22 Apr 2013", "title": "Risk Analyst Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at UNC Charlotte in Sept 2012", "Interview Descriptions": "Referred, then interview by a panel ( Assoc. Vice Chancellor RMSS, Director of RM&I, Risk Management Analyst)", "Interview Questions": "What do you plan on getting from your time here? (AVC RMSS)"}, {"date": "18 Jan 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at UNC Charlotte (Charlotte, NC) in Aug 2012", "Interview Descriptions": "I scheduled an appointment with the professor I am interested to work with on the posted project. I arrive 5min earlier and waited outside his office. The talking is quite relaxed. We first discussed some personal and department issues. Then we went directly to my motivation for the project. After that I explained my strength and fit. It was a nice conversation with easy-going atomosphere.", "Interview Questions": "What's your background? What attracted you in the project? and What's your plan to solve the problems?"}, {"date": "8 Apr 2014", "title": "Math Instrcutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at UNC Charlotte (Charlotte, NC) in Aug 2012", "Interview Descriptions": "basic math and statistics question; previous teaching experience, following your resume; have a lecture as a real class.", "Interview Questions": "no, pretty normal"}, {"date": "19 Jan 2013", "title": "Print Lab Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at UNC Charlotte (Charlotte, NC) in May 2012", "Interview Descriptions": "Interview and single day of training with a resume", "Interview Questions": "N/A"}, {"date": "17 Oct 2013", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNC Charlotte (Charlotte, NC) in May 2012", "Interview Descriptions": "1.  Online application and cover letter.  Application includes brief essay question\r\n2.  Phone interview.  They ask: Why this job? What do you think your primary duties will be?  What experiences do you have that make you qualified? Why UNC Charlotte? What experiences are you looking to get out of this job?  \r\n3.  In-person interview.  Be prepared for about four hours of interviews.  I had a 1:1 interview for about 50 minutes, immediately followed by an interview 3:1 for another hour.  I got a short break and then the process repeated, this time a 3:1 and then another 1:1 each for 45 min to an hour.", "Interview Questions": "Tell me about a time at work when there was an urgent or emergency situation.  How did you handle it, and do you think you could have handled it better?  How does this apply to the position for which you are currently being considered?"}, {"date": "9 Jul 2015", "title": "Systems Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNC Charlotte (Charlotte, NC) in Apr 2012", "Interview Descriptions": "The process was pretty straight forward. It started with a tour of the facilities and an overview of the expectations. I then went through a series of interviews with the technical staff, the faculty and finally upper management. The process took quite a long time. After working there for quite a while I have learned that the HR process includes a lot of red tape so the process can take weeks to months to work through.", "Interview Questions": "How do you deal with conflicting priorities with individuals that wait until the last minute and need your assistance?"}, {"date": "17 Sept 2015", "title": "Network Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UNC Charlotte (Charlotte, NC) in Feb 2012", "Interview Descriptions": "Telephone interview first, then had a one on one interview in person with the hiring Director.  After that I had a group interview with the team in person the same day.  My total interview time in person was 2-3 hours total.", "Interview Questions": "What is your proudest achievement?"}, {"date": "5 Jun 2015", "title": "Laboratory Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at UNC Charlotte (Charlotte, NC) in Aug 2011", "Interview Descriptions": "Met with several people including prospective suboridnates. Questions were all over the map but tended toward the technical side as the committees were made up of technical people. Several times I met with large committees of 10 or more people. Questions were fired from any direction on any subject.", "Interview Questions": "Do you understand computing languages"}], [{"date": "30 Nov 2012", "title": "Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at UNC Charlotte (Charlotte, NC) in Mar 2011", "Interview Descriptions": "basic web technology questions", "Interview Questions": "nothing was difficult"}]]