[[{"date": "8 Jun 2023", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at Phoenix Children's (Phoenix, AZ)", "Interview Descriptions": "I came to a job fair and met with the hiring manager for physical therapy. They spent a thorough amount of time reviewing my professional experience and asked detailed questions regarding ways that I have handled criticism and conflict. Offer pending and unknown at this time.", "Interview Questions": "Tell me a story about a time that you received criticism and how you responded to it."}, {"date": "7 Jun 2023", "title": "Emergency Department Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Phoenix Children's", "Interview Descriptions": "The postion was posted on Indeed. PCH offered a self scheduling interview experience. The interview began with HR and if you met the requirments, you were transferred to the hiring manager for the interview.", "Interview Questions": "1. Tell us about yourself 2. What does your day look like in the ER 3. Have you ever had a conflict with a co-worker"}, {"date": "18 May 2023", "title": "CDM Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Phoenix Children's (Phoenix, AZ)", "Interview Descriptions": "There was an initial screening with an internal recruiter to go over the basic job requirements, followed by an in-depth discussion with the department leader. The scheduling was very accommodating.", "Interview Questions": "Why are you leaving your current role?"}, {"date": "2 May 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Phoenix Children's (Phoenix, AZ)", "Interview Descriptions": "It was difficult to get an interview, had to know someone to get in the door. The interview questions themselves were average. We had the interview in the lobby which was strange.", "Interview Questions": "Tell me about a time you had to respond to an emergency."}, {"date": "1 May 2023", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Phoenix Children's (Phoenix, AZ)", "Interview Descriptions": "The interview was over zoom, was very personable, got plenty of information on orientation process and what day-to-day would look like along with how the unit is set up and how the nurses there work together", "Interview Questions": "Do you have any experience in a NICU in the past, whether it was work or personal experience"}, {"date": "4 Nov 2022", "title": "New Grad RN Position Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Phoenix Children's (Phoenix, AZ) in Nov 2022", "Interview Descriptions": "The recruiter interviewed me for 25mins. She asked me about my previous experience that was related to work or clinical locations. I did not get the job offer, but it was a great interview with her.", "Interview Questions": "Why do you want to work for Phoenix Children's Hospital?"}, {"date": "15 Oct 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Phoenix Children's", "Interview Descriptions": "Very friendly and informative. I was provided answers to all of my questions and transparency about the job. It was a very laid back meeting and I felt valued for my prior experience.", "Interview Questions": "Tell me about yourself and your prior work experience."}, {"date": "2 Aug 2022", "title": "Senior Revenue Cycle Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in Jun 2022", "Interview Descriptions": "The interview process was very easy, it took about 40 minutes. They were very friendly and interview questions were based around the core values of the company. The interview was done through Zoom. The position was originally for a remote position.", "Interview Questions": "Why would you like to work for Phoenix Children’s hospital?"}], [{"date": "10 Apr 2023", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Phoenix Children's (Phoenix, AZ) in Apr 2022", "Interview Descriptions": "Incredible interview process. Easy to schedule (available management) and formal questions were well considered and clearly asked. The first interview was over Zoom, and then I was flown on-site for the second interview. Incredibly friendly staff, accommodating recruiting team; great flight and hotel accommodations. Well organized itinerary, and I felt very welcomed when on-site.", "Interview Questions": "Describe a time you made a mistake and what did you do to remedy the situation."}, {"date": "11 Mar 2022", "title": "Patient Care Technician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Phoenix Children's", "Interview Descriptions": "Only needed positions for patient sitter and the made the interview be about working in the floor but in the end you would get hired to be a sitter. Pay was offered very low.", "Interview Questions": "What do you see yourself in five years?"}, {"date": "31 Aug 2021", "title": "Emergency Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Phoenix Children's", "Interview Descriptions": "The interview went really well. met with the hiring manager and team lead. They were very nice and the flow of the interview went really well.they asked me several questions and provided very good information and details regarding the position.", "Interview Questions": "If given a project that is due by the end if the today's shift, whatvwoukd you do to handle the project and also meet your daily tasks and duties?"}, {"date": "7 Jul 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in Jun 2021", "Interview Descriptions": "Initially a phone interview with HR that went over basic information. What they are looking for in an applicant, what kind of unit it is, the patient demographic etc. Also talked about benefits, but not pay. Second interview was with the nurse manager and educator. Went more into detail about the unit, types of patients you will encounter, discussed what orientation would look like,  educational opportunities, and what they expectation from you. Both the nurse manager & educator were very professional, polite and informative.", "Interview Questions": "Why would you like to work for Phoenix Children’s hospital?"}, {"date": "17 May 2021", "title": "Marketing Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Phoenix Children's", "Interview Descriptions": "The first interview is over the phone. The interviewer shared minimal details about the role, which isn’t ideal for someone trying to determine if they’re a good fit. Routine questions, not too difficult.", "Interview Questions": "Can you tell me about yourself?"}, {"date": "12 May 2021", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Phoenix Children's", "Interview Descriptions": "Simple, video interview conducted due to coronavirus. Asked about teamwork; problem solving, and how you get along with coworkers. Pay is not very good. Expect to sit with psychiatric patients for 13 h shifts most of the time during the pandemic instead of being on the floor.", "Interview Questions": "How do you get along with coworkers, how do you solve problems with coworkers, do you have prior experience"}, {"date": "16 Dec 2020", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Phoenix Children's", "Interview Descriptions": "The interview process was easy and it took about 30-40 min.  They were very friendly and interview questions were based around the core values of the company.  The interview was online due to the pandemic so it was very laid back.", "Interview Questions": "They asked what I would do in a situation where I had a conflict with a co-worker."}], [{"date": "11 Dec 2020", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Phoenix Children's", "Interview Descriptions": "Fast process. Job approval through email communication.  Very friendly. Zoom interview. The interview took less than 20 minutes and asked about yourself, why do you want to work with children, and details about job description.", "Interview Questions": "What do you see yourself in 3 years?"}, {"date": "17 Dec 2020", "title": "PCT/CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Phoenix Children's in Dec 2020", "Interview Descriptions": "I filled out an online application and did a phone interview about a week after. It was about 40 minutes long with situational-based questions. Other than that it was straight-forward.", "Interview Questions": "One question they asked for example was how would I fix a mistake that I made in regard to patient care."}, {"date": "5 Nov 2020", "title": "Scribe Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Phoenix Children's", "Interview Descriptions": "I was brought in. We spoke about present and long term goals. Many within the role are students going into other careers within healthcare. Asked to describe ideal length of employment.", "Interview Questions": "What is your expected length of employment?"}, {"date": "3 Sept 2020", "title": "Emergency Department Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in Aug 2020", "Interview Descriptions": "Because of Covid my interview was a zoom meeting with the overall supervisor and my direct supervisor. It was a very relaxed vibe and they were very upfront on what to expect as far as work environment to compensation.", "Interview Questions": "Explain a time you were in an emergency and how did you handle it? "}, {"date": "6 Dec 2019", "title": "Financial Clearance Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Phoenix Children's (West Covina, CA) in Dec 2019", "Interview Descriptions": "I applied online and was called within 2 days for an interview. They were kind enough to let me do it via video the next day. The interview was with two managers who made the experience very comfortable.", "Interview Questions": "The main questions were about my experience and a few about “what is a deductible?” What is a co-insurance"}, {"date": "24 Sept 2019", "title": "Medical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Phoenix Children's (Phoenix, AZ) in Sept 2019", "Interview Descriptions": "I attended the PCH Job fair  and met with a friendly recruiter. She made me feel comfortable  and all of my questions were answered. I handed her my resume for her review. The interviewing well.", "Interview Questions": "Why do I want to work at PCH?"}, {"date": "26 Jul 2019", "title": "Brand Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Phoenix Children's", "Interview Descriptions": "Very well structured interview. I met the whole team and gained a lot of insight into the company culture. There weren't any surprises and the whole thing felt natural and good.", "Interview Questions": "What three words would you use to describe yourself?"}, {"date": "18 Jan 2021", "title": "Admin Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Phoenix Children's (Phoenix, AZ) in May 2019", "Interview Descriptions": "3 interviews, everyone is really nice interviewed with 3 different people and they were all very nice and welcoming. It all starts with an email and then they call you and then you go in.", "Interview Questions": "Questions about yourself and about your skills, regular interview questions"}, {"date": "28 Mar 2019", "title": "Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Phoenix Children's in Mar 2019", "Interview Descriptions": "Called on a Thursday, interveiwed Friday. Very smooth and strait fowerd.  I was sent an employee benefits package to review before the interview. I was asked a series of job appropriate questions. Was given a brief description of the job.", "Interview Questions": "How did you handle conflict in the work place? "}, {"date": "24 Mar 2019", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Phoenix Children's (Phoenix, AZ) in Feb 2019", "Interview Descriptions": "I had a phone interview within about a week of applying and a couple weeks after received a email notification for all day in-person interview.   I took a day off work from my current job in order to interview, as again it was a process that lasted all day.  After the interview ended, I was given no feedback about the next steps in the process.  I immediately sent an email to the recruiter asking for details, and did not receive a response.  A  couple of weeks later, I sent another email, asking the status, and also asking that I be told if I was not being considered, and if they had moved on in the process.  It's been a month, and I have never received a response.  At this point, I am no longer interested.", "Interview Questions": "Tell me about a time you were faced with a challenge at work?"}], [{"date": "16 Apr 2019", "title": "ED Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in Feb 2019", "Interview Descriptions": "Nice people ,  easy interview.  Took 3 weeks to call for an in person interview.  Got the call 30 minutes later with job offer.    The questions were behavior based.  She gave me a walk through and met everyone.  Was a good proccess.  The director seemed very helpful and concise on what she wanted.", "Interview Questions": "What's your worst quailty"}, {"date": "19 Mar 2019", "title": "Pre Access Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Phoenix Children's (Phoenix, AZ) in Jan 2019", "Interview Descriptions": "It was simple, met with 2 of the 3 supervisors who were so genuine and real. they took the time to get to know what I had to offer the team. they laid out the expectations and there were really no surprises.", "Interview Questions": "what did I have to offer the team"}, {"date": "11 Jan 2023", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Phoenix Children's (Phoenix, AZ) in Jan 2019", "Interview Descriptions": "After you apply for a position, if you are selected they will call you to set up an initial interview if that interview goes well you’ll be contacted soon after maybe a day or so later to let you know that they would like a second interview with you with some of their other managers once that happens if everything goes well with that interview you’ll be contacted by HR to let you know that you’ve been selected for the position, that can happen sometimes later on that same day or at least within 2 days.", "Interview Questions": "Why do you feel you’re a good candidate for this position? What do you know about this position? Why do you want to work for this company?"}, {"date": "16 Jan 2019", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in Nov 2018", "Interview Descriptions": "The interview was with my manager and it was a very comfortable conversation discussing myself and included a more in depth description of the job. The questions asked were very relatable to the position making sure I was able to have appropriate responses in certain situations.", "Interview Questions": "Situations relatable to the position we’re presented to me and I was asked how I would act in that situation. "}, {"date": "25 Oct 2018", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Phoenix Children's", "Interview Descriptions": "The interview was personal and in the lobby area. Everyone was friendly and the questions were behavioral based. Offered the job within half a day. The hiring process was easy and helpful. felt welcomed the whole time.", "Interview Questions": "How did you respond when a situation didn't go as planned"}, {"date": "4 Jan 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in Oct 2018", "Interview Descriptions": "I had 2 interviews. One was with my current manager and the second interview was with another administrative assistant. Then there was follow ups to advise that I was being offered that position. They then asvised that they would be calling me back to offer me a compensation based on my resume and job experience, to see if I would accept.", "Interview Questions": "What is my experience with this type of position and what job am i currently doing that would help me best fit into this position. "}, {"date": "5 Nov 2018", "title": "Patient Sitter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in Oct 2018", "Interview Descriptions": "- I applied online\r\n- Received a call from the recruiter and she went over the job.\r\n- Scheduled a interview with the staff HR manager\r\n- Received an offer through email a little over a week later.", "Interview Questions": "Please, tell me about yourself and work history?\r\n\r\nWhy do you want to work a PCH?\r\n\r\nShe asked scenario questions, what if?\r\n\r\n"}, {"date": "16 Oct 2018", "title": "Behavioral Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in Oct 2018", "Interview Descriptions": "Applied online and took sometime for someone to call me back. Had a phone screening and was told to wait till my Arizona Fingerprint card was processed. Once I had the card I sent it in to HR and they set me up with a face to face interview. I waited in the main lobby for about 10 minutes after my arrival. Met with the Manager of the Bio-Behavioral Unit for the interview, we sat in the lobby. Interview lasted about 45 minutes, then I asked some questions totaling an hour for the interview. It was difficult and very detail oriented.", "Interview Questions": "What kind of learner are you?"}, {"date": "10 Sept 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Phoenix Children's", "Interview Descriptions": "2 weeks of interviews not too difficult. Silly incomplete questions but not too challenging for a nurse. Just smile and tell your future manage that you are happy to be yelled at by upset parents and continue to do your job with no help from support staff or supervisor", "Interview Questions": "Normal. What should you do?"}, {"date": "21 Jul 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Phoenix Children's", "Interview Descriptions": "Went by very quickly and efficiently. I put in an application and was called for an interview the next day.  Had a phone screening and met with two managers. Great company to work for.", "Interview Questions": "What was a situation in which you had to bend the rules for a patient?\r\n"}], [{"date": "27 Aug 2018", "title": "Scheduler Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in Jul 2018", "Interview Descriptions": "It was a basic three-person interview.  \r\nVery easy and laid back.\r\n\r\nApplied online.  \r\nThree weeks later, recruiter called to schedule interview. \r\n\r\nNot very impressed.\r\nHave not heard back one way or the other.  I even emailed the recruiter just to inquire if the position had been filled but it's been crickets.  Honestly, it's scheduling not direct patient care but the respect should still be the same.  Sadly, my opinion of the hospital is not as positive as it once was.  They have some pretty bad staff there (not nursing or doctors or other direct patient care), but the scheduling staff but ah, such is life", "Interview Questions": "How do you handle office politics?"}, {"date": "18 Oct 2018", "title": "Certified Medical Coder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Phoenix Children's (Phoenix, AZ) in Jul 2018", "Interview Descriptions": "I had a phone screening/pre interview, followed by a in person interview at PCH a few days later.  I received an email confirming the interview and gave me directions to the hospital.  It was a panel interview, that after a few questions it seemed more like a friendly getting to know you conversation with coworkers.  Later that day I was asked to do a skill test.  A few days later HR called me with  job offer.  I started about 3 weeks later( all new hires have to start on a Monday and have a benefits class).", "Interview Questions": "I was asked scenario based questions and to expand upon some areas of my resume.   "}, {"date": "19 Jul 2018", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Phoenix Children's (Phoenix, AZ) in Jun 2018", "Interview Descriptions": "It was easy, and enjoyable. Everyone was quick in responding to my emails and more. The process to less time than I expected. At the interview everyone was friendly.", "Interview Questions": "Tell me a little about yourself in regards to your experience for the position.  "}, {"date": "16 Jun 2018", "title": "IT Systems Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Phoenix Children's (New York, NY) in May 2018", "Interview Descriptions": "Received phone call 3 weeks after initial online application. Returned call next morning, then again 2 days later. No follow-up to voicemail. After 10 days, received notice that the position was filled.", "Interview Questions": "N/A"}, {"date": "5 Aug 2018", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in May 2018", "Interview Descriptions": "The interview was one on one. I interviewed with the person who is now my manager. The questions I asked were open ended and allowed me to share what my experiences are/how I handle specific situations.", "Interview Questions": "Describe a time that you worked as a patient's advocate."}, {"date": "18 Jul 2018", "title": "School Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in May 2018", "Interview Descriptions": "I interviewed with a panel of 6 people which included people in the same position as I was applying for, as well as the manager. The interview consisted of the manager giving an overall synopsis of the position, then the team asked a series of questions. Lastly, I was asked if I had any questions.", "Interview Questions": "They had a series of scenario based questions. "}, {"date": "18 Jul 2018", "title": "Transplant Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in Apr 2018", "Interview Descriptions": "The interview process was professional, first interaction was over the phone with team, then 1:1 with manager and lastly in person all day hospital interviews. Met multiple members of the Team, shadowed in meetings and felt very welcomed. Was offered a position within a good timeframe of applying.", "Interview Questions": "What are my strengths?  Why I would fit well in such a position?"}, {"date": "18 Jul 2018", "title": "Injury Preventon Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in Apr 2018", "Interview Descriptions": "filled out the online application, with in a week was invited for the interview with the Director and manager.  then a week later I was interviewed by the \"team\".  It went very well!", "Interview Questions": "They wanted to know about a time I used multiple organizations for an event."}, {"date": "5 Feb 2019", "title": "Major Gifts Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in Apr 2018", "Interview Descriptions": "I had a phone interview and then came in for a hospital tour and in person interviews. The in person interview was broken up into 2 one-on-one meetings and one group interview. The only thing I thought that was strange is that I did not speak to anyone in HR or hiring until a job offer was made (not even for my initial phone screening).", "Interview Questions": "They wanted to make sure I was comfortable with the fast paced environment and flexible as things change regularly and a good candidate needs to be able to adapt."}, {"date": "18 Jul 2018", "title": "Major Gifts Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in Mar 2018", "Interview Descriptions": "I received an email from an Executive Search firm, set up a phone call with the initial recruiter who vetted whether or not I was a desirable candidate. She set me up on a Skype/FaceTime call with the hiring recruiter. From there I had an in person interview with the position's supervisor and the Foundation's Chief Development Officer. From there I received an offer.", "Interview Questions": "Why do you want to work for Phoenix Children's Hospital [Foundation]?"}], [{"date": "14 Feb 2018", "title": "Web Content Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Phoenix Children's (Phoenix, AZ)", "Interview Descriptions": "There was a standard phone screening by HR, an initial interview by the immediate supervisor followed by a full day of interviews with various stakeholders from middle management down to peers and then a final interview with HR. The entire process took 4.5 months, which is unusually long but not by much.", "Interview Questions": "Why do you want to work at Phoenix Children's?"}, {"date": "16 Jan 2018", "title": "Behavior Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Phoenix Children's (Phoenix, AZ)", "Interview Descriptions": "I applied online using the career search engine on their website. I received a call about a week later to discuss opportunities within the behavioral health field. I missed the call, and called back, but it took another week for them to get back to me. When I finally got the call back I was scheduled for an interview. The interview was fairly laid back and was held in the front lobby in comfortable chairs. I was interviewed by the clinical manager, and she explained to me in detail the position and what it entails and then proceeded to ask about my past experiences. Most of the interview questions were situation based, i.e. \"tell me about a time you dealt with a customer/client who was unhappy.\"", "Interview Questions": "Tell me about a time you dealt with a customer/client who was unhappy"}, {"date": "11 Feb 2018", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in Jan 2018", "Interview Descriptions": "i applied for numerous floors as a PCT, didn't get a call for any of them. I later got a call from HR saying if I would like to apply for other floors I said yes and they got me an interview. Interview lasted about 30 min and I got a call with the final answer from HR about a week later", "Interview Questions": "Have you ever broken a rule?"}, {"date": "9 Feb 2021", "title": "Interpreter/Translator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Phoenix Children's (Phoenix, AZ) in Dec 2017", "Interview Descriptions": "Its was a very casual interview, I even felt a little overdressed. It seemed more about making sure I could fit within their work culture. They seem open to give you opportunity despite not having extensive experience.", "Interview Questions": "Mainly How would I respond in certain scenarios after given the examples."}, {"date": "17 Oct 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Phoenix Children's", "Interview Descriptions": "Interview was a one-on-one in the lobby of the hospital. Made you feel very comfortable. They are looking at your non-verbal ques and asked many behavioral questions to see if you are truly what they are looking for.", "Interview Questions": "weakness and strengths and how do you overcome your weakness?"}, {"date": "8 Oct 2017", "title": "Clinical Research Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Phoenix Children's", "Interview Descriptions": "Applied online and received a phone call for an interview about a month later.  The interview was with the manager of the department and was very informal and relaxed.  She really just wanted to get to know who I was and how I interact and If I would fit in with her team.  She informed me they have other candidates to see and I would hear from her in a few weeks.  I followed up with a thank you email the next day and I received a call from HR 2 days after the interview with an offer.", "Interview Questions": "What 3 words would a co-worker say that describes your work ethic.   "}, {"date": "13 Dec 2017", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Phoenix Children's (Phoenix, AZ) in Oct 2017", "Interview Descriptions": "I received a call to schedule an interview and it was scheduled about a week later. Then I received a map of where my interview will be held and where I would be able to park along with the Supervisor information that was going to be interviewing me.", "Interview Questions": "Why I would be a good fit for the position."}, {"date": "16 Nov 2017", "title": "Marketing And Communications Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in Sept 2017", "Interview Descriptions": "Very thorough, very proactive on their part. They communicated with me every step of the way. very positive experience! My HR contact called me along every step.  He knew me and acted as my representative within the organization getting questions answered to my satisfaction.", "Interview Questions": "We have this situation coming up. If it landed on your plate on day 1 what would you do?"}, {"date": "4 Apr 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in Mar 2017", "Interview Descriptions": "Contacted by Talent Aquisition and resume/qualifications were reviewed over the phone.  Informed someone would be in touch for f/u tonschedule interview.  Received call from dept to schedule interview the next day and interview was scheduled with Director of dept and current employee in the position.  The top 2 candidates would be referred to hiring manager for 2nd interview; scheduled within 1 week.", "Interview Questions": "What are two weaknesses you would like to improve or work on?\r\n"}, {"date": "3 Feb 2017", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Phoenix Children's (Phoenix, AZ)", "Interview Descriptions": "Things moved very quickly in the beginning of the process.  Within a week of applying for the position, I was contacted by HR and had a brief telephone interview with them.  This was followed by a telephone interview with the hiring manager and then FTF interviews with the hiring manager and dept director and then a panel interview with the other PMs.  And then, I waited... and waited... for 2 months before I was told that I wasn't selected for the position.  I don't expect an offer for every position I interview for, but common business courtesy would call for informing me that I didn't make the cut within a week or so after the last interview, not 2 months.  Very disappointed in the lack of communication and follow up from the HR representative, he ignored multiple messages from me asking for a status.", "Interview Questions": "All of the typical behavioral questions.  \"Tell me about a time when you..... and how did you respond?\" "}], [{"date": "22 May 2017", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Phoenix Children's (Phoenix, AZ) in Feb 2017", "Interview Descriptions": "Overall interviewed with multiple people during 2 site visits with a total of > 25 people. found very few people actually asked questions related to my ability to do the job or behavioral based questions. One day interviews started at 7 am and ended at 6 pm - very grueling.", "Interview Questions": "about dealing with difficult people and conflict management"}, {"date": "19 Jan 2017", "title": "Behavioral Health Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Phoenix Children's (Phoenix, AZ)", "Interview Descriptions": "Asked to come in for a face to face interview with BHT manager. Then she discussed my past experience working with children and if I had any experience working with children that require special attention or with intellectual disabilities.", "Interview Questions": "What kind of distraction technique have I used in the past when working with a child that starts to become upset? "}, {"date": "17 Jan 2017", "title": "Human Resources Business Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Phoenix Children's (Phoenix, AZ) in Dec 2016", "Interview Descriptions": "Horrible process! It's unfortunate that recruiters have such power when good qualified individuals are applying. Horrible in communication from the recruiter The only reason I received a call back was because I reached out to the VP of HR to voice my frustration, only to be told via phone they are moving forward with other candidates. Could have saved the call and just sent an email!", "Interview Questions": "No questions made, recruiter had me go over my background in chronological order"}, {"date": "15 Dec 2016", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in Nov 2016", "Interview Descriptions": "It was a quick process the interview and not even a week later I received a call back and had an offer for the position. The company is willing to work with you schedule and I find that management are willing to listen.", "Interview Questions": "How would you handle a nervous child or a child that is very upset and crying."}, {"date": "30 Dec 2016", "title": "Cash Applications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Phoenix Children's (Phoenix, AZ) in Sept 2016", "Interview Descriptions": "I was incredibly nervous, and it got even worse when I realized it was a four person panel interview. Though, once the interview started, everything went really well. I was offered the position a week later, though it took almost a month before I actually started", "Interview Questions": "How do you work with others? Do you like to participate in office functions? "}, {"date": "2 Feb 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in Aug 2016", "Interview Descriptions": "I applied online to several positions.  Received a call for one position in particular, but when I spoke with recruiter, they ask me questions and ended up referring me to interview with a totally different department (one I preferred anyway).  I had a phone interview/screening, then an in person interview with the hiring manager.", "Interview Questions": "Why PCH?"}, {"date": "2 Jun 2016", "title": "Physician - Pediatric Hematology/Oncology Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Phoenix Children's (Phoenix, AZ)", "Interview Descriptions": "Met by one supervisor, scheduled to meet other specialty director, spoke for 30 minutes, loosely offered job - many years ago.  Now, promises have been broken, even contract violations by the organization have occurred, but Phoenix is a very political market and once one powerful physician 'blackballs\" you, staying in the vicinity is near impossible.", "Interview Questions": "Potential for growth into partial supervisory roles as I aged - was given thumbs up.  Since then [ thumbs down."}, {"date": "19 Oct 2016", "title": "Network Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in Jun 2016", "Interview Descriptions": "normal interview process, I applied online through website, I got called within couple of days where I did an interview on the phone, then I did another 1:1 interview with the manager then got to see the team and talk with them, after that within 2 weeks I got an offer.", "Interview Questions": "Networking questions\r\nwireless\r\nrouting/switching"}, {"date": "5 Jul 2016", "title": "Foundation Communications Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Phoenix Children's (Phoenix, AZ) in May 2016", "Interview Descriptions": "Two interviews included in the process. First was a phone interview with the recruiter/HR person and the second was a one on one with the communications director. She asked a lot of situational and behavioral questions to see if you could handle the stress of the job and if you had all the qualification for PR, design and social media. Most PR people do not have experience in all three, because they are all different jobs. It's recommended to highlight any experience you have working across departments to create a whole package for a company.", "Interview Questions": "Describe a situation where you worked well with a team"}, {"date": "12 Sept 2016", "title": "Medical Lab Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in May 2016", "Interview Descriptions": "Very regimented, interviewer stick to script, and skipped questions to make it shorter I guess she in rush to go on bereavement leave. Very nice, included a tour of the hospital laboratory.", "Interview Questions": "roudementary questions about how to handle difficult situations?"}], [{"date": "25 Mar 2016", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Phoenix Children's (Phoenix, AZ)", "Interview Descriptions": "Phone call to schedule the interview, fill out forms, interview with manager of the unit, call with job offer a few days later. During interview received tour of hospital and introductions to some staff members.  Everyone was very friendly.  Interview lasted approximately one hour.", "Interview Questions": "How would I handle a specific situation with a patient / family?  Give example."}, {"date": "10 Jun 2016", "title": "HRBP Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in Mar 2016", "Interview Descriptions": "This was a great interviewing experience. Every single person I met with was professional, passionate about the business and very eager to really get to know me as a person. It was refreshing to have that many people so engaged during the process. From the scheduling to the efficiency of the interviews, I would recommend PCH to anyone in a heartbeat!", "Interview Questions": "Can you tell me about a time where you had to make an executive decision on the fly, how did you come to that decision and what decision did you make?"}, {"date": "23 Sept 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in Feb 2016", "Interview Descriptions": "The interview was casual and felt like a conversation rather than 20 questions. That being said, the questions that were asked I felt were specific to the job I was going into rather than a panel of generic interview questions. It gave me a sense of the job I was applying for and knew without a doubt that it was the job I wanted. It was very comfortable with the hiring manager and I felt good leaving the interview.", "Interview Questions": "Is there ever a time that breaking the rules or going against policy is ok?"}, {"date": "23 Jan 2020", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Phoenix Children's (Phoenix, AZ) in Jan 2016", "Interview Descriptions": "The process was quick and easy with the HR team. I was asked about my HR skills and ability to onboard and interview. I was also asked if I’d be willing to float to areas in outpatient requiring additional help and process development.", "Interview Questions": "Background, education, and potential for growth "}, {"date": "21 Oct 2019", "title": "Executive Chef Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "The process took 4 days. I interviewed at Phoenix Children's in Oct 2015", "Interview Descriptions": "Interview was done by outside vendor. There was a panel interview and a cooking interview. It took at least 6 weeks to be on boarded. Drug screening, back ground check and TB test included.", "Interview Questions": "How well I interact with the public."}, {"date": "29 Aug 2015", "title": "Healthcare Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Phoenix Children's", "Interview Descriptions": "Went great. Had a couple of phone interviews before in person interview. After speaking with the manager, a team interview was conducted before an offer was extended. The questions asked related to my experience and areas of expertise I would like to grow in.", "Interview Questions": "What areas would you like to expand your knowledge in?"}, {"date": "19 Aug 2015", "title": "BHT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Phoenix Children's", "Interview Descriptions": "HR called me and asked me a few questions like \"Why PCH?\" before setting up the in-person interview. Thorough interview. Lots of questions that involved the STAR method. The hiring manager seems to care explaining what the role and PCH had to offer. The interview went pretty long. Almost an hour.", "Interview Questions": "Questions using the STAR method"}, {"date": "22 Aug 2015", "title": "Provider Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Phoenix Children's (Phoenix, AZ)", "Interview Descriptions": "Skype screening followed by in person for a day. Out to dinner with leadership of the department. Follow up was quick after interview. It was relaxed in person with no \"got you\" type questions. I also toured the facility.", "Interview Questions": "Primarily behavioral"}, {"date": "14 Aug 2015", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Phoenix Children's in Jul 2015", "Interview Descriptions": "Interviewed with supervisor at the location at which position was open. Interview was July 1st, however, since their training/orientation starts every other Monday, I wasn't able to start until July 27th. I was offered the position right away. I interviewed at 8am and I received the job offer by 4pm.", "Interview Questions": "How would you deal with the following situation: Your coworker isn't doing much and you feel that you're doing most of the work."}, {"date": "25 Oct 2015", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in Aug 2015", "Interview Descriptions": "Very intensive interview process, including a personality test. About seven one-on-one interviews, which was beneficial as the team dynamics and culture were easily observed.  Communication from the recruiter was consistent and positive throughout the entire process. I was heartbroken when I did not receive an offer, however, I was not left guessing and received a nice phone call to communicate their decision.", "Interview Questions": "Some behavioral questions but mostly conversational/informational."}], [{"date": "3 May 2016", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Phoenix Children's (Phoenix, AZ) in Apr 2015", "Interview Descriptions": "I waited in the lobby for about 20 minutes for the interviewer to show up. It was very casual. We sat in the chairs for about a half an hour. I received a call the next day offering me the job. It was a bit frustrating because the front desk attendants don't have many options to call or find out where you're supposed to be. You just have to wait for the right person to show up.", "Interview Questions": "Describe an experience where you handled a customer complaint?\r\nGive me an overview of your work history and education?"}, {"date": "20 Apr 2016", "title": "Pediatric Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Phoenix Children's in Feb 2015", "Interview Descriptions": "The interview process was very straight forward. The manager on CA 6 was extremely nice and inquired not only about my want for the position, but about my personal life as well.", "Interview Questions": "Tell me about a time you were placed in a difficult situation? How did you overcome it?"}, {"date": "13 May 2014", "title": "Patient Care Tech Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Phoenix Children's", "Interview Descriptions": "Hard to get an intervie but easy proccess once you get one. The oreder in how things went is listed below.\r\nCall to set up an interview\r\nInterview with clincal manager\r\nCall from HR got the  job\r\nSubmit Paper Work proof of qualifications like Certifications\r\nHR Meet and greet plus drug test and background consent\r\nTraining class for 4 days\r\nShadow (precepting)\r\nSitter traininf class\r\nCPI\r\nOn your own", "Interview Questions": "Nothing out of the ordinary."}, {"date": "2 Sept 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Phoenix Children's in May 2014", "Interview Descriptions": "In depth 3 hour interview resulted in a job offer within 2 weeks.  Met with a panel then a manager, then 2 directors.  After a group decision was made for selection, an offer was made.", "Interview Questions": "What is your greatest weakness and what is your plan to change it?"}, {"date": "8 Nov 2013", "title": "Major Gifts Officer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Phoenix Children's", "Interview Descriptions": "Applied from their website, HR called and scheduled a phone interview - asked detailed questions about my background, work history.  Called in for an interview at the Foundation, met with two staff members and asked detailed questions. Senior Hiring Manager then met with me separately and asked questions", "Interview Questions": "Very detailed and technical questions about hospital fundraising and the medical field."}, {"date": "25 Jul 2016", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Phoenix Children's (Phoenix, AZ) in Apr 2013", "Interview Descriptions": "Relatively brief as this was an internal job posting within my own department.  I interviewed with my immediate boss and then the VP of Human Resources.   I felt confident after this interview as it offered me the opportunity to discuss my Management skills", "Interview Questions": "If I felt that I had the tools to do my job and would feel comfortable managing my co-workers"}, {"date": "8 Oct 2016", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Phoenix Children's (Phoenix, AZ) in Jan 2013", "Interview Descriptions": "Human Resources then supervisor/manager then Human Resources again \r\nQuestions and drug tests that include prescription alcohol and tobacco usage. Come hydrated if taking test they will need a sample and a pain to wait if you done need to go. Training isn't much but tedious basics need to be taught not process because that changes for each department or speciality. If hired be prepared to be overworked.", "Interview Questions": "What is your Weakness and strengths? When was last time you went above and beyond job duties? Why should we hire you?"}, {"date": "24 May 2015", "title": "Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Phoenix Children's (Phoenix, AZ) in Jan 2012", "Interview Descriptions": "Online --> Phone call --> In person; I interviewed with the manager of the floor that I was hired on. She was very nice & asked me basic questions. Then she gave me a tour of the floor & had someone show me around the hospital. Everyone was very kind & made me feel very welcome right away.", "Interview Questions": "N/A"}, {"date": "12 Feb 2013", "title": "Pediatric Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Phoenix Children's (Phoenix, AZ) in Mar 2009", "Interview Descriptions": "Short interview, few questions, hired on the spot", "Interview Questions": "My interview consisted of a tour "}]]