[[{"date": "17 Feb 2021", "title": "Resident Physician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Ochsner LSU Health Shreveport", "Interview Descriptions": "Friendly, strong faculty, lots of in house fellowships, have several young hospitalist faculty, did not have good escort back to exit/entrance at end of interview, left applicants lost to wander back themselves", "Interview Questions": "Future Career goals after residency"}, {"date": "29 Mar 2021", "title": "Project Manager Medicine/Feist-Weiller Cancer Center Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ochsner LSU Health Shreveport (Shreveport, LA) in Jan 2021", "Interview Descriptions": "Submission of online resume along with 3 letters of recommendation through State jobs website. Received a call to schedule an in-person interview. An in-person interview was conducted at the location with two managing directors.", "Interview Questions": "How did I gain my grant writing experience?"}, {"date": "19 Feb 2019", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ochsner LSU Health Shreveport", "Interview Descriptions": "It was an in-person interview where they showed me around the lab and asked about my experience with the different laboratory techniques and instruments. They asked me to handle a rat as this would be a part of my job once I was hired. Overall it was a good, friendly experience.", "Interview Questions": "What experience do you have performing surgeries on small rodents?"}, {"date": "16 Aug 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ochsner LSU Health Shreveport (Shreveport, LA) in Feb 2017", "Interview Descriptions": "Interview was professional but laid back. A fairly normal nursing interview. They are severely short staffed and looking for bodies. I interviewed with the unit supervisor, floor manager, and one of the critical care physicians. One of the charge nurses also popped in and asked a handful of questions", "Interview Questions": "What are your goals, where do you see yourself in 5 years, do you have any nursing certifications, why/why not"}, {"date": "25 Nov 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ochsner LSU Health Shreveport (Shreveport, LA)", "Interview Descriptions": "We reviewed my resume from top to bottom. Closely looked over previous jobs and references. We talked about previous work experiences and how they would prepare me for the job I was interviewing. We discussed  start dates. We discussed orientation schedule related to a possible start date. Did not have a pay scale formulated because they use a formula in HR.", "Interview Questions": "How would your previous work experiences prepare you for this position."}, {"date": "3 Dec 2017", "title": "Housekeeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Ochsner LSU Health Shreveport (Shreveport, LA) in Apr 2016", "Interview Descriptions": "You just had to show up, fill out the paper work, and watch the videos.   Once you finished the videos you had to answer a few questions about what you saw and how well you understood the video.", "Interview Questions": "Why would you like to work here?"}, {"date": "22 Jul 2019", "title": "Pharmacy Technician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Ochsner LSU Health Shreveport in Mar 2015", "Interview Descriptions": "was nice durning the interview but wolf in sheeps clothing beware. they were standard pharmacy questions anyone should be able to answer.  Be ready to answer math calculations questions on computer", "Interview Questions": "do you know calculations give a test "}, {"date": "16 Dec 2015", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Ochsner LSU Health Shreveport (Shreveport, LA) in Mar 2014", "Interview Descriptions": "Very casual. Talked to the PI for a while of what the lab studies and which assays are done. Was then introduced to members of the lab and was able to ask them questions", "Interview Questions": "Asked what my GPA in undergrad was. How long I will be there."}, {"date": "16 Feb 2016", "title": "Human Resource Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ochsner LSU Health Shreveport (Shreveport, LA) in Sept 2012", "Interview Descriptions": "I had three interviews, all with a group panel or at least two people involved.  Everyone was very nice and made me feel comfortable, but asked several questions. The first interview was a panel of approximately ten people which asked probably twenty questions.  The second interview was consisted of  maybe five to seven individuals and maybe ten questions.  The final interview was only two people, the direct supervisor of the position being filled as well as that person's supervisor.  There were only a few questions on this interview, just to get a personal feel to see if I would \"fit in\" with the current employees.  I was shown around the department and introduced to some of the employees and left with a very good feeling that I had gained approval from those making the final decision.  Two weeks later I received an offer letter and was asked to come in and finalize all of the hiring paperwork to begin my new job.  I will say although it was a long process, it was enjoyable.", "Interview Questions": "How I would handle certain public relations issues.  They presented me with different scenarios and I was to give them an idea of how I would respond.  Also, was asked about my skill level and what I thought about myself and why I should be chosen over other applicants."}, {"date": "20 Jun 2015", "title": "RN Clinical Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Ochsner LSU Health Shreveport (Shreveport, LA) in Jun 2011", "Interview Descriptions": "Initial phone call, Face to face with physician, review of CV, outgoing RN coordinator, also met with department head and was given tour of clinic and offices.  Also was given a description of job functions, salary proposal, was allowed to negotiate salary up some.", "Interview Questions": "Basically reviewed my experience, education, and qualifications"}]]