[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great place.", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Apr 2021", "job_title": "Administration in Worthing, West Sussex, South East England, England", "duration": "N/A", "pros": "Excellent colleagues. Lots of opportunities. Working hours. Great perks. Close to Brighton station.", "cons": "Absolutely nothing comes to mind!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Could be so much better", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "8 Feb 2021", "job_title": "Anonymous Employee in Brighton, England", "duration": "N/A", "pros": "If the idea of the membership was executed well - it would be amazing. Given the horrendous situation, the past year has massively impacted healthcare workers more than most, Boundless had the opportunity to really step up and stand for something - even with younger NHS employees. Some people across the business really are passionate about this and want nothing more than to be proud of where they work.", "cons": "The company is its own worse enemy. There are people employed way above their level of competence across almost every business area - and worse, there are actively detrimental members of staff who don't want to help the business succeed, let alone know how. Due to the culture of the company, these individuals are not dealt with and so competent, passionate people give up and become unmotivated or leave.\r\nFor some reason, Boundless struggles with the balance of making sure they have enough new members flowing into the portfolio in order to provide revenue to spend on member benefits. Boundless is not well known at all, even amongst the target demographic, and they don't seem to know what to do to make the business model actually work."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Toxic environment filled with ego and lack of accountability", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "17 Dec 2021", "job_title": "Marketing Executive in Brighton, England", "duration": "N/A", "pros": "Decent work/life balance\n\nNon-management colleagues are truly lovely people \n\nClose to the train station\n\nFree lunch once a month", "cons": "The leadership team allow bullying, discrimination, and harassment to occur completely unchecked. Staff feel that they cannot raise issues with HR due to personal relationships between members of the leadership team and fear of retribution from perpetrators. \n\nThere is one member of staff in particular who’s behaviour has been a contributing factor to several long-standing members of staff leaving. This person regularly bullies, belittles, and humiliates people, when this has been brought to the attention of HR or leadership, no action has been taken. In another department, there are two men who treat women in a very misogynistic way. Complaints have been made about both; no action has been taken. HR take the position that if the victim does not lodge a formal grievance, they will take no action. This is unacceptable. \n\nBoundless state that they are a not-for-profit mutual, Boundless itself is run as a private limited company, which employs all head office staff. There is a separate board for the club, CSMA, which is not for profit. One of the core values of the club is 'Member First', sadly, this is rarely the case. Many projects that are in the members' interest are shut down due to internal politics. \n\nDiversity and inclusion is a problem at Boundless. There majority of employees are white, and the environment (colleagues and customers) is often hostile for black & ethnic minority colleagues. Most of the senior leadership team are white men over the age of 40, however, there has recently been a woman appointed as CFO and one woman in a ‘head of’ role. The leadership team were encouraged to self-nominate someone to champion diversity & inclusion at Boundless, nobody came forward. \n\nBoundless offer below market rate salaries, they benchmark their roles based on public sector salaries, although they are not a public sector or charitable organisation. There is no pay band structure. The gender pay gap is significant, this was attributed to women being more likely to apply for admin and hospitality roles - it would be prudent to question why that is. What are Boundless doing to make higher paying roles accessible to marginalised people, particularly those with intersecting identities?"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good company", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "25 Dec 2021", "job_title": "Anonymous Employee in Brighton, England", "duration": "N/A", "pros": "Good people, lots of focus on improving the club benefits and they care about the people who work there.", "cons": "No real downsides but should continue to focus on things that members will benefit from"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "A toxic work environment", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Jun 2021", "job_title": "Marketing Executive in Brighton, England", "duration": "N/A", "pros": "Work colleagues who are below management level are great, but you can see their spirit die as each day passes.\r\n\r\nGood location, so you can go for a much-needed drink after dealing with the lies and woeful mismanagement of the place.\r\n\r\nThe sheer relief when you get another job, knowing you'll never have to return there ever again.", "cons": "Boundless claim to exist for the betterment of their members, but this is so far from the truth it's laughable. It's run by clueless sociopaths whose only interest is to bleed as much money from the organisation as they can before it finally dies off. The only way to progress in this organisation is to be a man (preferably white) and to have no reservations in stabbing co-workers in the back.\r\n\r\nA truly awful and corrupt place."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Good people broken by abysmal Marketing managers brought in after an ill-advised restructure.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "2 Nov 2020", "job_title": "Marketing Executive in Brighton, England", "duration": "N/A", "pros": "Central location and nice building.", "cons": "Directors and senior management use the memberships money like their own piggy bank."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Excellent Employer", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "31 Jul 2019", "job_title": "Event Manager in Brighton, England", "duration": "N/A", "pros": "I have worked at Boundless now for over ten years and whilst there have been challenges along the way (which company doesn’t have those) I have also found them to be receptive to new ideas and strategies and willing to go that bit further to put our members at the core of our activity. \r\n\r\nStaff incentives are excellent and we are looked after really well, staff lunches, end of month socials, training and out of office networking sessions. I have met some wonderful, talented people here along the years.", "cons": "Like any modern membership company Boundless faces challenges in terms of how to engage new members in a practical manner that really benefits the customer."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Good employer who cares about their people", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "6 Sept 2019", "job_title": "Brighton HQ Team in Brighton, England", "duration": "N/A", "pros": "- new management that truly cares about the Members\r\n- changing culture, now more open and transparent\r\n- great perks and benefits, free lunch, drinks on Friday, home tech and bike schemes, beach cleans, yoga, and much more\r\n- investing in creating an environment that encourages learning and personal and professional growth\r\n- great focus on mental health awareness and support available to those who need it\r\n- training opportunities", "cons": "- there have been some significant structural changes at Boundless this year, which resulted in people feeling unsetteld"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "31 Jul 2019", "job_title": "Head of Member Communities in Brighton, England", "duration": "N/A", "pros": "I'm lucky that I'm surrounded by a hard working, enthusiastic and committed team, who work wonders with our fantastic volunteer members and events.  \nWe benefit from comfortable offices, convenient to the station, and with some nice perks many businesses wouldn't offer.  The support from our Executive Team and the Board is great, they share the right ethos and vision of the Association, putting members at our core.", "cons": "As with all businesses we have weaknesses/issues, some of which could potentially be addressed whilst others are inherent with the nature of our business."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "A good place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Oct 2019", "job_title": "Marketing in Brighton, England", "duration": "N/A", "pros": "The business has been through considerable change during the last twelve months which has resulted in a progressive, focused and positive place to work. It is a workplace that invests in the people who work there and encourages new ideas and innovation.", "cons": "Due to the recent changes in the senior executive team, there has been a period of instability, but things are starting to settle down now."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A great company to work for!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "31 Jul 2019", "job_title": "Member Communities Administrator in Brighton, England", "duration": "N/A", "pros": "Wonderful people to work with, especially member communities team, flexi hours ( depending on your role ) self improvement opportunities with, mindfull workshops, language lessons , discount for gym and more. Free lunch once a month , lots happening to improve our enviroment. A happy environment overall .", "cons": "We could do more fire walks !"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Unbelievably corrupt organisation and terrible employers", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "2 Jul 2019", "job_title": "Call Center Representative in Brighton, England", "duration": "N/A", "pros": "Central Brighton location. Close to many other employers!", "cons": "Those in power are bleeding the company dry and are only in it for themselves. Loads of people mysteriously go missing (including the CEO) - never to return. All very dodgy. They pretend that there's an amazing work culture, but it's truly awful and loads of people are absolutely miserable. I left as soon as I could. I can't believe companies like this still exist."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Demotivating place to work", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "22 Aug 2019", "job_title": "Manager in Brighton, England", "duration": "N/A", "pros": "City Centre location, some great people", "cons": "Pay is shocking and throughout my time there I received no support when looking to progress or when there were any struggles.  No perks - no health/dental insurance, terrible pension, minimum holiday allowance.   Membership numbers going down year on year despite what members are told.\nDefinitely a company to steer clear of."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Toxic blame culture", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "17 Sept 2019", "job_title": "Customer Service Representative in Brighton, England", "duration": "N/A", "pros": "Some nice people...but not many.", "cons": "Unpleasant and unsupportive - no career progression. Prefer to get rid of people and senior management like to blame others for their misgivings. Organisational structure is like working in the 1950s!!"}]]