[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Good place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "8 Dec 2021", "job_title": "Music Teacher in Shenzhen, Guangdong", "duration": "N/A", "pros": "Well-organized management and excellent environment.", "cons": "School lunch is too expensive."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Will break your spirit.", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "12 Nov 2022", "job_title": "Teacher in Shenzhen, Guangdong", "duration": "N/A", "pros": "They always pay on time.", "cons": "Had 30 lessons a week and duty every day, while some teachers had no duty and less than 15 lessons a week. \r\n\r\nNot allowed to discipline, the students will taunt you to get a reaction. \r\n\r\nDI gives useless advice and doesn't help. Had useless meetings on Wednesdays. \r\n\r\nAlmost all teachers give the students passing grades even though there is no actual teaching or learning going on. \r\n\r\nIt's all about making money, if the students complain about you they will get rid of you. Some students have been there for over 5 years and still can't even speak basic low level English. \r\n\r\nFake and toxic environment to work.\r\n\r\nDo not go there if you are young and excited about teaching. Old and lazy people will make you want to never teach again."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Good benefits", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Mar 2023", "job_title": "Teacher, Elementary School in Shenzhen, Guangdong", "duration": "N/A", "pros": "Free housing Free healthcare Free yearly flights", "cons": "Directors, lack of diversity, poor professional development"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Meh", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Feb 2023", "job_title": "Teacher in Shenzhen, Guangdong", "duration": "N/A", "pros": "It pays well enough for what it is", "cons": "Leadership, philosophy, standards, structure, etc."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Enjoyed it -Mostly", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Aug 2022", "job_title": "ELL Teacher in Shenzhen, Guangdong", "duration": "N/A", "pros": "Travel \nConsistent company culture \nColleagues", "cons": "Overly accommodating to retain clients"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "All that glitters is not gold.", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Nov 2021", "job_title": "Teacher in Shenzhen, Guangdong", "duration": "N/A", "pros": "Extremely technically competent management. \r\n\r\nStaff are all good to excellent at their jobs, though some were kind of checked out sometimes.\r\n\r\nVery easy students to deal with. Few who don't try.\r\n\r\n\"Mastery Learning\" means anyone who tries can pass. Everyone gets as many tries as they like to get it. You don't miss your chance and then fail. This does mean adjusting your teaching style a bit, and your assessment style a lot, however. \r\n\r\nBooze at company events if you consider that a pro *\r\n\r\nLots of Professional Development opportunities.\r\n\r\nExcellent standards in place; ones which act as guidelines and not shackles. The QSI curriculum system really is good. If you aren't already at the top of your field, you will definitely improve as a teacher here.\r\n\r\nComprehensible and useful Moodle setup. The back end for grades was a little kludgy and occasionally unreliable, but otherwise, their IT setup was pretty good.", "cons": "Low-key anti-mask attitudes abounded. People were really comfortable to admit how much they resented anti-COVID measures. Wistfully reminiscing about partying in HK.\r\n\r\n* Re: booze. A lot of teachers seemed really enthusiastic about their drinking. Like, I know teachers drink. But I've never known teachers to have an \"aw yeah time to get my drink on\" attitude. It wasn't universal there, but there were a few where I was like \"hmmm...\" These were the functional drunks. These were the ones who kept it together.\r\n\r\nYou see, there had, I was told by someone who was quitting in disgust, been a bunch of them who hadn't kept it together. During the start of COVID quarantine in march 2020, classes were online. A bunch of teachers decided they'd go out drinking instead of teaching their online classes. Not go out drinking and teach hung over; drink instead of teaching. This included the principal, which is why they had a new principal when I was there. Combine this with the fact that they didn't lower tuition during this period, meaning parents were already annoyed, and you had parents who were flaming pissed. And that's why the school was down 1/3 of its students (they recovered, I estimate, about 1/4 of what they lost in new students). It's also why they were facing down 100 separate lawsuits. So yeah, the school was having money troubles. \r\n\r\nAnd they'd hired a bunch of new teachers to replace the teachers they'd fired, and the ones who had fled China during COVID. (Yeah, that didn't turn out to be the good idea they had thought it was.) Way too many teachers. All of my classes were below capacity.\r\n\r\nSo they let a bunch of teachers go. One guy, they told him they weren't renewing his contract, then at the last minute they offered him a contract. He signed it, the principal countersigned it, and then later said \"hey, could I get that back, I need to put the company stamp on it.\" He then ripped up the contract. Dude didn't have a copy of it, didn't have any other proof. \r\n\r\nThis is the single most disgusting act I've ever heard of from any employer I've ever worked for, and I've had a few real winners in the past. This definitely beats out the lies that man personally told me (about salary; nothing not in writing is promised! And at QSI even then it may not be!) \r\n\r\nThey had to close a campus, too. The cover story was that their landlord wasn't going to let them keep using the site; but uh, yeah, that's probably because you're not able to keep paying them. \r\n\r\nMy boss may have lied to me at least once. Her boss definitely lied to me at least once. \r\n\r\nOh, as you might imagine, budgets were nearly non-existent. I don't imagine that's a perennial thing at a school like QSI, but there ya go.\r\n\r\nI should also point out that there were two classes of teacher. The ones hired overseas via the international school job fair system were mostly paid roughly the same, but with better benefits and job security. The local hires in China were treated as disposable. This makes a little sense to me, in that the overseas hires were shuffled around the QSI network, and many of the local hires wouldn't be willing. But it's still kinda awful. Now there's a third class of teacher. The ones hired to replace the ones they let go. They're hiring inexperienced teachers (not necessarily a bad thing, but yeah) for lower pay. One of the new hires replaced at least two, possibly three of us. \r\n\r\nHaving dependent children who need schooling there clearly also puts a target on one's back. The cost of that slot isn't the full retail value of it, but obviously a teacher with no kids is cheaper for them. \r\n\r\nBasically, don't go there expecting job security any time soon. They let their insane management dig a hole for them they'll be digging themselves out of for years. (To their credit those cretins were fired.) On the plus side, Shenzhen is full of schools if QSI dumps you. \r\n\r\nAnother thing which I consider a con, but you may not: nearly all of the Anglophones in the staff were firmly and completely lodged in the Foreigner Bubble. I've lived in several countries, and I've always tried to live as close to how locals live as I can given my circumstances. These people do not. If you're looking for that Expat Package life, I guess you can have it here if you don't want to save any money. But living life as a tourist isn't for me.\r\n\r\nOh yeah, and Shenzhen kind of sucks. I don't miss it."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Chance to live in many countries", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "2 Feb 2022", "job_title": "Teacher in Shenzhen, Guangdong", "duration": "N/A", "pros": "Many countries to choose from. Free housing and medical", "cons": "Directors can be challenging and difficult to work for"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Mostly Good", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Oct 2020", "job_title": "IE Teacher in Shenzhen, Guangdong", "duration": "N/A", "pros": "Overall a good company who thinks of the people, not just the business of being a private school.", "cons": "High-transfer rates due to teachers traveling to more cities in the QSI system mean there are often new people learning new roles. Each year feels like a mad house for 3 weeks, with most new teachers left to figure all the systems out on their own. Administrators can have a very difficult time communicating with staff during challenging times, such as pandemics."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great international school option", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "17 Jul 2020", "job_title": "Teacher in Shenzhen, Guangdong", "duration": "N/A", "pros": "Great environment, small class sizes, caring faculty, free tuition for kids, well organized, ability to transfer to various locations", "cons": "Implementing mastery learning in high school can present challenges"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "teacher", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "16 Sept 2019", "job_title": "Anonymous Employee in Shenzhen, Guangdong", "duration": "N/A", "pros": "Mastery learning with success for all students.", "cons": "Could use more locations throughout the world."}], []]