[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Making an important contribution to youth mental health", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Jun 2023", "job_title": "N|A in Toronto, ON", "duration": "N/A", "pros": "Love how Jack.org works alongside youth. Great board oversight.", "cons": "None that are significant at all."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Incredibly disappointed by new executive leadership", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Jul 2023", "job_title": "Lead in Toronto, ON", "duration": "N/A", "pros": "Coworkers who care a great deal.", "cons": "Interesting to see all the reviews that have been reported/taken down here once executive leadership was made aware of them. Things feel toxic and an end doesn't seem to be in sight. The culture at Jack.org currently feels like the worst it has ever been with awful morale and zero trust in leadership or HR. This can easily be construed as disgruntled, entitled staff causing a fuss because of change - but from conversations with many folks below the VP and CEO level, this sentiment is approaching unanimous among a staff of 80+. This is following sincere optimism around changes to strategy and leadership. The reason staff feel angry enough to say something is that they care so much and continue to feel disrespected, discounted, and devalued. The lack of accountability around deadlines, frameworks, justification is frustrating to see. It feels like an uphill battle to get any transparency around fallout from recent layoffs. Most people are seeking new work as it isn't worth the struggle to stay. There are good intentions around EDI (see Rowena Pinto's responses to the posts here) - but ask anyone how this looks in practice and it is terrible/more harm than good. Do not want to be aligned with this org anymore simply due to the new executive leadership."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Toxic Executive Leadership", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Jul 2023", "job_title": "Team Lead in Toronto, ON", "duration": "N/A", "pros": "There are many young, talented and passionate workers in the team.", "cons": "Toxic and stressful culture coming down from top leadership, especially when the new CEO, Rowena Pinto, arrived. Employees in all levels feel the drastic change of the work culture in a negative way. We used to work hard but happily together. Now hidden agenda exist in all areas of the organization, causing colleagues to distrust each other and step on each other for job survival. Hiring practice is problematic. While the CEO seemingly upholds EDI ideology at town hall meetings, she turns around hiring her hand-picked favourite people without a transparent and equitable process. She belittles her staff. In 1:1 meetings, she loses her posture easily and sometimes emotionally mistreats staff. Many people are under immense mental distress (ironically this is a mental health charity). This CEO often blames poor performance on the prior executive leader. Finger pointing culture here is worrisome. We are sad to see how a positive and vibrant workforce turned downward so drastically since the arrival of the current CEO."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Terrible HR practices & leadership", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Jul 2023", "job_title": "Manager in Toronto, ON", "duration": "N/A", "pros": "Colleagues are great to work with.", "cons": "Every single task or project or initiative that lives with HR gets completely fumbled. There is little to no equity in hiring practices. The CEO hides behind the rest of the leadership team to make terrible decisions and then blames the previous Executive Director for everything. The job of a CEO is to motivate and support your team, but most of us have never met someone who is less of a people person and more disrespectful. If you question why a decision is made it is often answered ‘this is how things are done’ which is understandably frustrating to staff who have valid concerns. Even staff who were promoters and culture builders until a few months ago are either quitting or immensely frustrated/trying to leave. It’s hard to see a future for Jack.org with this lack of HR oversight/strategy/skill and extremely poor leadership."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Mentally Stressful Work Environment - mental health is a joke here", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 Jul 2023", "job_title": "Manager in Toronto, ON", "duration": "N/A", "pros": "The office is situated in a beautiful building with Meta Canada as our neighbour. The work computers for all employees are the expensive MacBook Pro - latest version (less than 2 years old). We have a trendy Teabot for unlimited high-end tea. We used to have beer and wine in the kitchen to Friday hangout (but now discontinued). We give out good quality and high-end swags such as sweat shirts, rain coats, cotton t-shirts, hats, scarves, baby onesies, etc, and employees get to keep some, too.", "cons": "In the past, I used to distrust the reviews on Glassdoor in general because I thought these were ill-intentioned posts by disgruntled employees against their employers. However, as I came across the reviews posted by my current and former colleagues at Jack.org, I couldn't agree with more. I truly believe the truth of these reviews as I can testify to them based on my own work experience here. I truly believe these are comments made from the bottom of their hearts. The reviews are posted because we care. The truth has to come out because we are sad to see how a promising charity go down to be a demoralizing, oppressing, inequitable organization struggling more for its own survival (to pay for the CEO and the VPs' salaries) than for its missions - the mental health of young people. Since about 10 months ago, my mental health has started to deteriorate due to the toxic morale prevalent among the executive leadership first and later among my peers in all departments. In my own interactions with the CEO, Rowena Pinto (the company profile on Glass needs to be updated - NOT Eric Windeler anymore), I feel demoralized and psychologically unsafe. Her tone in those private conversations are not professional and could be emotionally intimidating (which I agree with a post below that mentioned about being mistreated). In our discussions, my disagreement on some issues was often taken as \"emotionally not happy about her\", so I just stopped disagreeing by shouting down my voice. During our annual budget proposals, the CEO ordered lunches, drinks and desserts for herself and the VPs on the donor's money, while we presenters had to stand there presenting during our lunch hours without food and watching them eat. I used to be loyal donor and fundraiser to Jack.org, the moment I saw them using our donors' money in this way, I turned around withdrawing my monthly commitment. Most employees are underpaid based on our workload and level of engagement (with lots of overtime unpaid), while the CEO and VPs are earning mid-$200K to high-$100K (data published on CRA's charity financial disclosure). I am appalled. I don't want to donate to this charity anymore."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "New executive leadership is horrible; run far and fast", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Jul 2023", "job_title": "Anonymous Employee in Toronto, ON", "duration": "N/A", "pros": "Before new executive leadership came on (VPs and President-CEO -- this profile needs to be updated), I overall loved working here. Lots of silly decisions made by upper management and past executive leadership, as in any workplace, but felt like usually we were treated as people first, not just employees. Felt like we could ask questions and provide critical feedback on decisions made by management. Best part of this workplace has always been peers/coworkers: honestly some of the best people I've ever worked with. Real sense of belonging, folks actually caring about how you're doing, and genuine friendships built. The benefits (mental health coverage and unlimited sick days) are also pretty great.", "cons": "Anything good about the organization is long gone with new executive leadership. Staff are leaving the org in droves and for good reason. Would not recommend anyone work here or partner with this organization. Run far and fast. New executive leadership style is honestly disgusting. Decisions made behind closed doors. No transparency. Actively gaslighting staff. Avoiding answering questions or lying if they do answer questions. Treating staff as if we are disposable and interchangeable. Changing job titles and job descriptions without even speaking to managers. Saying we're not expected to do more with less, when they've just fired many staff without cause, which is very much impacting workload and literally makes us have to do more work with fewer people. Saying we're co-creating our programs with youth when we're not and often end up exploiting and burning out the youth advocates we work with. Saying we're working with 'priority populations' and equity deserving groups when EDI within the org is a joke and they don't make decisions or alter programming to actually bring about equity or justice. So disappointed to see our org become like this. Real heart breaking."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Awful", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Jun 2023", "job_title": "Manager in Toronto, ON", "duration": "N/A", "pros": "Great mission Great colleagues Wfh", "cons": "Executive team Lack of transparency Horrible new ceo"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Employer", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Mar 2023", "job_title": "Human Resources in Toronto, ON", "duration": "N/A", "pros": "Great organization, friendly work environment, flexible, hybrid work", "cons": "My experience was very good, Management is great."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Nov 2021", "job_title": "Program Coordinator in Toronto, ON", "duration": "N/A", "pros": "Doing good work - kind people", "cons": "Non-profit with a corporate environment"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "An Amazing Organization to Grow With", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Feb 2021", "job_title": "Program Lead in Toronto, ON", "duration": "N/A", "pros": "- Amazing people, across the entire organization!\r\n- Management that takes the time to listen and act on feedback\r\n- Lots of opportunity for promotion and professional development", "cons": "Nothing that comes to mind! We do have the odd growing pain as we expand the organization, but I trust our leadership to point us in the right direction."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Highly talented, under-appreciated staff with negative workplace culture and poor leadership", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Sept 2020", "job_title": "Coordinator in Toronto, ON", "duration": "N/A", "pros": "- There are many great staff members who bring tons of experience and expertise in all things related to youth work, coaching, and mental health; \r\n- There are lots of opportunities to learn, do research, and create content;", "cons": "- There is a lack of feedback culture and constructive criticism is not taken well; \r\n- There is a lack of expertise in mental health in senior management and no process to review content for accuracy; \r\n- There are major equity gaps in hiring, promotion, and workplace culture;"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Inclusive, growing, well-resourced but nimble not-for-profit", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Jul 2019", "job_title": "Program Manager in Toronto, ON", "duration": "N/A", "pros": "Management is really genuine and responsive to staff needs (e.g. improvements to benefit plan, implementing flex hours, encouraging work-from-home arrangements).\r\n\r\nGrowth, strong leadership, and big organizational dreams mean there's lots of opportunity for professional development and advancement.\r\n\r\nYouth engagement is core the Jack.org's values and operation and that attitude applies to office life as well.  Questions (and suggestions!) are welcome and everyone's opinion matters.", "cons": "While Jack.org values diversity and recognizes the importance of diversity in a strong team, racial and gender diversity are still lacking. It's a work in progress to build a more diverse team and Board and we have a lot to learn to challenge false binaries and disrupt entrenched norms of oppressive systems.\r\n\r\nWe're growing so fast that the office can be hectic / crowded at times."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "The best work culture I've experienced", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Aug 2019", "job_title": "Community Giving Manager in Toronto, ON", "duration": "N/A", "pros": "It sounds cliché, but the people are what really makes this organization amazing. The hiring process is great and there is a real focus on culture fit - which I think is rare. Every employee is wonderful, intelligent, kind and talented. There is a ton of collaboration between teams, which is crucial as we work toward our common goals. The office dogs are also fantastic coworkers. :)", "cons": "As we're growing rapidly, it can be hard to find a quiet space or private space to take a phone call. Open concept offices and hot-desking might not be for everyone."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Tremendously Difficult Place to Work", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Oct 2020", "job_title": "Anonymous in Toronto, ON", "duration": "N/A", "pros": "-\tMany staff members are highly experienced and bring a depth of knowledge to their roles.\r\n-\tThe mission of the organization in elevating young people’s voices in mental health is very important, though in my view, the organization is not delivering on its mission.", "cons": "-\tVery few staff, if any, have formal mental health training (i.e. beyond Mental Health First Aid) but are creating and disseminating youth mental health materials.\r\n-\tYouth voices are sometimes used to guide programs; however, youth do not lead the organizational mission and mandate.\r\n-\tThe work culture at Jack.org was oppressive and harmful to my own mental health.\r\n-\tDecision making was held solely by the Senior Management Team, who do not reflect the communities Jack.org serves. \r\n-\tHiring and internal promotion practices were not transparent with no policies available for staff. Nepotism (i.e. senior management hiring direct family members) and favouritism was demonstrated in recent hires and promotions.\r\n-\tResources for marketing and communications are disproportionate to resources for the work with young people. BIPOC youth and staff are tokenized within marketing and communications materials.\r\n-\tSenior management relied on a high turnover of entry-level positions to maintain the status quo and hiring new professionals as they are deemed more ‘gullible’ (i.e. they will buy-in to the organizational culture and accept lower wages for the privilege to work with a mission-driven organization). I would not recommend working for Jack.org, especially in any entry-level positions."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Energy of a startup, standards of a Fortune 500", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "11 Jul 2019", "job_title": "Content and Communications Manager in Toronto, ON", "duration": "N/A", "pros": "An incredible place for growth. High-octane but wonderfully supportive. People are (correctly) seen as the #1 resource and the leadership invests in them. Has the youthful energy of a startup but the high standards of a durable, successful business. Have had some of my best growth years here.", "cons": "It's a fast-paced and wildly ambitious organization. To me, this is what makes it so great. But it might not be the right fit for everyone."}]]