[[{"date": "23 Mar 2023", "title": "Senior Programs Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at IntraHealth International", "Interview Descriptions": "The recruiter was 15 minutes late and didn't bother to email, then when they came on the phone they started to talk to someone else while I was in the middle of speaking, clearly not listening and then not apologizing for the interruption, asking me 3 questions with barely any interaction, and then never spoke to me again. It was a consultant, so it was clear they were not engaged in the work and did not care about the interview at all.", "Interview Questions": "Tell me about your experience"}, {"date": "20 Nov 2018", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at IntraHealth International (Nairobi)", "Interview Descriptions": "A panel of 3; 2 technical staff and 1 HR. Unfortunately, the interview lead kept cutting me off when I was speaking, and she seemed distracted, even getting on her phone and ignoring me altogether at some point. The other 2 members of the panel seemed embarrassed about their colleague and seemed to overcompensate with unnaturally bright smiles, cheer and encouragement (to me), but it looked like the lead interviewer - who was that department's director - was the end-all, so we were now all just going through the motions.", "Interview Questions": "Tell us the structure of the Ministry of Health."}, {"date": "21 Jan 2021", "title": "Senior Data Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at IntraHealth International (Nairobi) in Nov 2017", "Interview Descriptions": "Formal, in person led by the technical lead and HR and the questions were structured using a questionnaire, which was scored at the end of the interview. The questions were relatively standard to the position", "Interview Questions": "Understanding of how government systems in health work"}, {"date": "23 Jan 2016", "title": "Senior Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at IntraHealth International (Chapel Hill, NC)", "Interview Descriptions": "I initially had a phone interview with HR.  Subsequently, I had in-person interviews in the Chapel Hill office.  In-person included meeting with several higher --level individuals as well as one panel made up of junior and mid-level staff.", "Interview Questions": "Describe a challenge you had in your previous job and how you handled it."}, {"date": "3 Mar 2015", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at IntraHealth International", "Interview Descriptions": "I had a phone interview first with HR and it was a pretty basic interview. I had to answer general questions about my work experience and knowledge of IntraHealth. The in-person interview lasted much longer and I was asked in-depth questions about my work experience, working style, in addition to some behavioral questions.  At the end I completed a budgeting and writing exercise.", "Interview Questions": "What is your working style?\r\n"}, {"date": "11 May 2016", "title": "Monitoring and Evaluation Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at IntraHealth International (Nairobi) in Jun 2014", "Interview Descriptions": "The process combined a written and oral interview both conducted by very friendly and experienced panel. This was done at a multilevel where first there was a written interview that tested the competency and the oral interview after a week, followed by negotiations. This culminated into their upgrading my applied position from an officer position to a manager position based on experience and salary scale", "Interview Questions": "Questions bordered on education, experience, leadership, accountability, partnerships and career history"}, {"date": "12 Oct 2016", "title": "Software Development Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at IntraHealth International (Nairobi) in May 2014", "Interview Descriptions": "All questions asked related to the job applied for. The panel composed of persons with diverse backgrounds. They were thorough in the questions and focus on the skills and experience garnered over the years. In short, it was a nice experience.", "Interview Questions": "Where do you see yourself in the next five years"}, {"date": "21 Jul 2015", "title": "Fellow Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at IntraHealth International (Chapel Hill, NC) in Mar 2014", "Interview Descriptions": "I went through an hour long interview with 5 employees. It was fairly casual and conversational. I felt at ease, and the participants included personal touches, talking about travel experiences, etc.", "Interview Questions": "They asked about my interest in the company and how I found out about it. They also asked me about my communications skills, strengths and weaknesses, and specific aspirations and goals for the fellowship."}, {"date": "11 Mar 2018", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at IntraHealth International (Washington, DC) in Mar 2014", "Interview Descriptions": "Questions were based from job description and previous experience. They asked questions about your knowledge of Sub-Saharan African. Also they asked about interest in the company and where do you see yourself in the next five years", "Interview Questions": "Why do you want to work for AfriMind"}, {"date": "22 Apr 2013", "title": "Monitoring and Evaluation Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IntraHealth International (Nairobi) in Mar 2013", "Interview Descriptions": "I did an online application for this position....one month later i received an e-mail being invited for the interview.", "Interview Questions": "how best do you handle pressure? and a situation is given"}], [{"date": "30 Jan 2013", "title": "Program Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IntraHealth International (Chapel Hill, NC) in Jul 2012", "Interview Descriptions": "It was an entry level position and I was interviewed by 4 people in one day.  The first two people were the hiring managers, and the second set of people were employees that previously held the position.  They had a hard time deciding between a few candidates and I did not receive a response from the hiring managers/HR for about 3 weeks.", "Interview Questions": "The only question they asked me that I was not prepared for was \"How do you deal with conflict in the office?\"  "}, {"date": "6 Jun 2010", "title": "Summer Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at IntraHealth International in Feb 2010", "Interview Descriptions": "The interview took place in a hot seat fashion with about seven people (including one HR representative) sitting semi circle around me, with me sitting in the hot seat, front and center.  I was expected to prepare a five minute presentation on who I was, why I was interested in International Development and experience I had to offer.  Then began the Q&A session, behavioral interview.", "Interview Questions": "Describe your ideal summer internship experience."}]]