[[{"date": "1 Dec 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Delta College", "Interview Descriptions": "The interview is #1 phone interview with group. #2 their supervisor. #3 another panel. Interviews are conducted virtually. Plan on 45 minutes in each. Human Resources is great to work with.", "Interview Questions": "Where do you see yourself in 5-8 years?"}, {"date": "3 Aug 2022", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Delta College", "Interview Descriptions": "Easy process, friendly interviewer and questions appropriate to determining expertise of the subject matter and teaching ability. Basic review of expectations, salary, benefits, etc.  Offered tour of campus and general chit-chat.", "Interview Questions": "Questions such as my educational background, why I was interested in position, etc. "}, {"date": "6 Dec 2021", "title": "Student Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Delta College", "Interview Descriptions": "Thank interview process was handled with relationship driven questions, thoughtfulness and clarity in answers. It was a wonderful job for me when I was a student. My work schedule was flexible around my school schedule.", "Interview Questions": "N/A I do not recall. "}, {"date": "15 Oct 2018", "title": "Adjunct Faculty Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 days. I interviewed at Delta College (Saginaw, MI) in Aug 2018", "Interview Descriptions": "The job interview was reasonable. The most important portion of the interview was your presentation, other questions were simple and familiar. The time required for the interview was around 30 minutes", "Interview Questions": "introduce yourself"}, {"date": "18 Oct 2016", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Delta College (University Center, MI) in May 2016", "Interview Descriptions": "I applied online through Indeed by submitting a cover letter and resume. I received a call from the HR department to set up an initial interview. I met with the department head and their boss in a room for the interview in which they asked me approximately 15 questions. They were respectful and kind  and I felt little stress during the interview process. After the interview took place, I took a tour with the department head of the facility and had a brief overview of what my job would entail.", "Interview Questions": "What was the most difficult challenge you have overcome?"}, {"date": "30 Jun 2015", "title": "Clinical Nurse Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Delta College (Slidell, LA) in Mar 2014", "Interview Descriptions": "Resume/ interview with HR and the Supervisor. I was introduced to staff and welcomed. I received a tour of the facility and three days later was asked to join the staff.", "Interview Questions": "Why did I apply for this job"}, {"date": "17 Dec 2016", "title": "Secret Shopper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Delta College (University Center, MI) in Sept 2013", "Interview Descriptions": "During my interview she looked at my resume. I was then asked if I had ever done a job like this before, and what my availability was. She explained more of what the job entailed and told me how much it was paid.", "Interview Questions": "Have I ever been a mystery shopper before?"}, {"date": "26 Feb 2014", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Delta College in Aug 2012", "Interview Descriptions": "Submission of resume and references via College site did not yield any response. However, when I approached the Division Chair directly, I was able to set up a time to interview immediately for an open position. The interview was very informal.", "Interview Questions": "How would you describe your teaching methodology?"}, {"date": "18 Jan 2012", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Delta College (University Center, MI) in Sept 2011", "Interview Descriptions": "I found the job listing on indeed and was directed to the schools website. Overall the online application process was a little confusing and long but I have had much worse experiences.  I got called a few days after applying. The interview was setup a week later.  It was only a 15-30 minute interview on campus.  The group was a search committee.  Basic questions were asked, pretty much a standard interview. Everything was very positive and the people in the offices were very nice.", "Interview Questions": "The hard questions were just about situations I would be put in and how I would respond."}, {"date": "30 Jun 2015", "title": "Full-Time Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Delta College (University Center, MI) in Jan 2011", "Interview Descriptions": "The interview process was conducted in multiple stages, beginning with a phone interview conducted by a hiring committee panel. This part of the interview was the most challenging for me as phone interviews are not my strong suit to begin with and this was the first time I had ever been asked to participate in a panel interview that was not face-to-face. Once I passed this first phase I then met with a representative from the department, then the process was concluded with the final candidates conducting a classroom demonstration. The interview process was rather lengthy but very thorough and fair.", "Interview Questions": "What are some classroom techniques you have implemented in the past to engage students who seem to be having difficulty grasping the subject matter?"}]]