[[{"date": "21 May 2023", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Helen Keller International", "Interview Descriptions": "Firstly, there is a written test. After the written test, the company will arrange an interview, they will contact you via phone. Make sure you pick up the call. Then go to the interview.", "Interview Questions": "any experience related to the work."}, {"date": "2 Aug 2022", "title": "Regional Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Helen Keller International", "Interview Descriptions": "It started with an HR interview. Then there was an interview with the hiring manager.  There would have been a final interview with the head of the organization for the selected candidate to confirm organizational fit.", "Interview Questions": "What interests you about the position?"}, {"date": "22 Apr 2022", "title": "Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Helen Keller International in Jan 2022", "Interview Descriptions": "Applied online, was promptly scheduled for HR interview, then with hiring manager within a period of about 2 weeks.  About a month later the hiring manager emailed to request that I complete an assignment over the weekend.  I spent several hours of my personal time critiquing a marketing piece that had already been used.  About 3 weeks later, an HR rep contacted me to let me know they were still interviewing but would be in touch shortly to provide an update.  About 2 weeks later, I noticed the position was again promoted online. I asked the HR rep for feedback regarding my candidacy status, after a few days I was informed they had decided to not move me forward in the process. I was not expecting such a mismanaged, inefficient process from an international nonprofit organization.", "Interview Questions": "Basic historical experience with communications and working with vendors and managing contracts.  "}, {"date": "9 Jun 2021", "title": "Customer Service Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Helen Keller International (Whitby, ON) in Jun 2021", "Interview Descriptions": "very friendly people and ask common question the meeting was through zoom and they would tell you what time the met was. understand what customer needs and want is very important", "Interview Questions": "what is ur greatest strenght"}, {"date": "28 Jun 2021", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Helen Keller International in Apr 2021", "Interview Descriptions": "The interview process was very easy. The job description was forward and direct with responsibilities and expectations. The Interview was completed over zoom during COVID and the staff was very professional. They made me feel extremely comfortable and I was not nervous at all.", "Interview Questions": "What were my expectations for this position"}, {"date": "21 Jan 2021", "title": "Nutrition Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Helen Keller International", "Interview Descriptions": "I was recruited by HKI for a position. They first did an informational interview and were a joy to talk to and work with. The technical interview went well, questions were more focused on processes rather than technical knowledge.", "Interview Questions": "Can you talk about a time you adapted a global tool to a country-specific program?"}, {"date": "26 Jan 2021", "title": "Help Desk Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Helen Keller International (Toronto, ON) in Jan 2021", "Interview Descriptions": "it was nice and smooth but it was at the same time kind of complex too but i needed time to ingest the content before anything else if you know what i mean", "Interview Questions": "hey man how are you tonight"}, {"date": "13 Dec 2020", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Helen Keller International", "Interview Descriptions": "This was a pre-pandemic interview process: consisted of a total of 5 separate phone / in-person interviews, each between 30 minutes - one hour long. The hiring manager was clearly unsure of what they were looking for.", "Interview Questions": "This position might change slightly as time goes on, are you comfortable with that?"}, {"date": "2 Mar 2018", "title": "External Relations Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Helen Keller International (New York, NY)", "Interview Descriptions": "Nearly two months after applying I was contacted. There were a few phone screenings and then in person interviews with individuals and panels and a test. Then they called references.", "Interview Questions": "What frustrates you? What are your strengths? Tell us about a time you disagreed with a boss. Tell us about a time you failed and what you learned."}, {"date": "14 Nov 2017", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Helen Keller International (New Haven, CT)", "Interview Descriptions": "Total of three interviews. One was face to face and the other two on the phone. Process was formal and relaxing at the same time. They look for you type of personality to fit in the organization plus your skills and tittle. They are very honest during the entire process.", "Interview Questions": " \r\nHow would you make this program more sustainable? "}], [{"date": "4 Sept 2017", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Helen Keller International", "Interview Descriptions": "It was a quick and easy interview. It was slightly informal and everything was wrapped up within a week altogether. The process was super smooth. They offered a short-term contract initially.", "Interview Questions": "Generic behavioral questions"}, {"date": "2 Jun 2017", "title": "Grants and Contracts Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Helen Keller International (New York, NY) in Apr 2017", "Interview Descriptions": "In office interview, followed by a skype call with the Washington DC office, followed by a third in office interview\r\n\r\nThe interviews themselves took place over a week and a half in order to get to the final group, but it took them an entire month and a half to tell me that I didn't get the job. I emailed them roughly every week and a half for an update and was repeatedly told to wait. In the meantime, I missed out on an opportunity at a start-up because HKI kept promising an answer and finally the start-up cancelled their offer after waiting for 3 weeks.", "Interview Questions": "The third interview involved possible workplace scenarios regarding the database system they use, but without experience using their system its difficult to say the answers they want."}, {"date": "3 Mar 2017", "title": "Finance Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Helen Keller International (New York, NY)", "Interview Descriptions": "First I met with the HR director and person who I would be reporting to.  Then, I was called in for a second interview with some in G&C and the Controller.  Then a few weeks passed and I was called with an offer.", "Interview Questions": "there weren't any difficult questions."}, {"date": "4 Sept 2020", "title": "Finance Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Helen Keller International (Nairobi) in Jan 2016", "Interview Descriptions": "Very well organised,  impressive panel,  interesting conversations that made the process quite comfortable,  the panel was warm and welcoming,  quite engaging and the questions were well thought through, organised complex but well outlined", "Interview Questions": "Complex organised engaging and we'll presented "}, {"date": "1 Dec 2014", "title": "Accounting Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Helen Keller International", "Interview Descriptions": "The interview was very pleasant. There were three interviewers from financial department and HR department. All of them were very nice and easy-going. Generally, the process was very detailed about my experience about education( Since I was a student) and past work experiences, you know, work experience is the one of the most important leverage in job hunting. So, being familiar with your resume is the last thing you want to left.", "Interview Questions": "N/A"}, {"date": "5 Nov 2014", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Helen Keller International (Nairobi)", "Interview Descriptions": "I send my resume and cover letter and was later called for an interview.I met the interviewer who was very straight to the point. The interview went on very well. After a few weeks i got an acceptance  letter and after I confirmed I started the job the next week.", "Interview Questions": "Describe how your skills and experiences fit into this job"}, {"date": "19 Jan 2017", "title": "Deputy Country Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Helen Keller International (Washington, DC) in Jan 2014", "Interview Descriptions": "The hiring process was long and long people who interviewed me. The phone screen was about my suitibility for the post. The in-person and Skype interview were technical and question about program management.", "Interview Questions": "Knowledge on nutrition, management"}]]