[[{"date": "23 Mar 2023", "title": "Resident Case Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Downtown Women's Center", "Interview Descriptions": "It was a bit intimidating at first because it was a panel interview but everyone was very personable and by the end, it felt more like a conversation than an interview.", "Interview Questions": "\"Give an example of a situation in which you had to set firm boundaries with someone.\""}, {"date": "3 Sept 2022", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Downtown Women's Center", "Interview Descriptions": "The interview process was quick and engaging. I did not have to go through multiple tiers of interviews like with most jobs. It was a phone interview and an on site interview with staff pertinent to the job I was interviewing for. The employees were friendly, professional and welcoming. The team followed up right away.", "Interview Questions": "How I handled a difficult circumstance with a co-worker."}, {"date": "5 May 2022", "title": "Case Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Downtown Women's Center (Los Angeles, CA) in Apr 2022", "Interview Descriptions": "I attended a Job fair that was posted on indeed. They had serval tables set up for different positions that were currently hiring. At each table the had the job description with the qualifications as well if you felt like that was a position you wanted to apply for the offered onsite interviews.", "Interview Questions": "What do you do for self care?"}, {"date": "9 Nov 2021", "title": "Domestic Violence Rapid Rehousing Case Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Downtown Women's Center (Los Angeles, CA) in Mar 2021", "Interview Descriptions": "The interview was very easy. it was on zoom. They emphasized to be organized and acted as if their department was perfect. They understand how to drop keywords and miss lead staff into believing they’re working in a safe environment. When in fact you’re excepting an offer that could put your own life at risk.", "Interview Questions": "Give us tools and ideas for how you organize"}, {"date": "25 Oct 2013", "title": "Program Services Residence Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Downtown Women's Center", "Interview Descriptions": "Phone interview went well with the hiring supervisor. They were thorough and helpful. The in-person interview was not intimidating either as the questions fit the specific job. It was clear that they were looking for someone who cared for the community and was not afraid to work with the population that struggled with mental illness, physical disabilities, and chronic homelessness.", "Interview Questions": "I can't remember a difficult or unexpected question."}], []]