[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Nov 2022", "job_title": "Admissions Associate in Manchester, England", "duration": "N/A", "pros": "Great culture and important mission", "cons": "Not many - maybe a feeling of slight understaffing currently"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Purpose driven charity with a corporate feel", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Dec 2022", "job_title": "Senior Associate in London, England", "duration": "N/A", "pros": "Purpose, progression opportunities, working at the leading edge of education in UK, people", "cons": "Corporate, aligned with Conservative education ideology"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Delivery Partner Lead role", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Oct 2022", "job_title": "Delivery Partner in Birmingham, England", "duration": "N/A", "pros": "work life balance is good", "cons": "lack of internal processes and scaled up too fast"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Limited opportunities and undervalued", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Apr 2021", "job_title": "Programmer Associate in Manchester, England", "duration": "N/A", "pros": "All colleagues are very nice, helpful and friendly. \r\nEquality, diversion and inclusion heavily promoted through groups whether actively taking part or an ally.\r\nGood work life balance and flexibility e.g flexible work hours and working from home (when in office).\r\n\r\nInitially, I was able to learn some new skills which I grasped very quickly.", "cons": "Lack of opportunities for progression/promotion. Limited opportunities to branch out and work within other teams to understand wider organisation. \r\nVery little/no discussion around goals and objectives. \r\nPayment level unfair for huge amount of work. Work often assigned last minute and completion expected immediately. \r\nUnderstaffed due to cuts/restructuring, as such workload was often too heavy for 1 person to manage but still expected even after raising this as an ongoing concern. \r\nWork often very monotonous and menial, very limited opportunities to up skill. \r\nHierarchy structure means management etc. are delegating tasks but not getting actively involved and sharing workload when at full capacity. \r\n\r\nOverall, I felt stuck in the same position for the duration of my employment. My development, goals and objectives were not addressed and I completed the same tasks day in day out. \r\n\r\nI tried multiple times to progress but was unable to do so. As such I made the decision to seek new employment and move on."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Flexible & appreciative", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Jul 2022", "job_title": "Data Analyst in Manchester, England", "duration": "N/A", "pros": "Flexible working\r\nVaried work\r\nGreat professional development opportunities & training", "cons": "Lower pay\r\nTakes a long time to make change happen"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Pleasant Culture and Atmosphere", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Aug 2022", "job_title": "Associate in Birmingham, England", "duration": "N/A", "pros": "Friendly and Supportive management from start to finish", "cons": "Hugh turnover\r\nSignificant period of disruption"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Do not work here!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "9 Feb 2022", "job_title": "Manager in London, England", "duration": "N/A", "pros": "- The people are the best thing about it, but in truth most of the amazing people have all left as they realise how terrible A.I is. \r\n-The ability to work from home and not be forced into the office during covid was also a plus.", "cons": "- The Salary - the salary by rung is completely ridiculous, with the difference between roles and salary jumping drastically at director level and above. There is no pay for the guaranteed overtime that each staff member has to do, the pay disparities by race and gender are a huge problem with people secretly getting a pay rises to even out the data before it is released to the public. No clear pathway for pay rises with favourites being given pay rises and other extremely hard-working staff who go above and beyond being turned down due to budget. \r\n\r\n-Progression – there is what appears to be a linear line from entering as an associate, progressing to senior associate, to then manager and then getting to director level. Things are not what they seem, with promotions internally being based of who you know and if your line manager puts in a good word for you, without these things’ promotions are extremely hard to get. \r\n\r\n- Training - there are no streamlined training support given to new starters on how to use the systems and what is expected or for new line managers who can have teams of 7+ with no line management experience, it really is sink or swim. \r\n\r\n-\tDiversity and inclusion – there are several network groups for protected characteristics, for example LGBTQ, BAME, Women’s. Yet these are run by lower staff for no extra pay, recognition, possible promotion or support. Plus, there is no training to be a network lead unless forcibly begging for it. Hilary the CEO attends monthly meetings with all networks leads however no real actions for change that are suggested by the leads is ever taken into account, instead the new culture director steals these ideas and passes them off as her own. (You know who you are!)\r\nThere are several other internal and external groups that are lead by directors, staff get great updates on the discussions that have taken place, yet no tangible action for improvement is ever made. This is probably because the D&I team are made up of white middle class employees who don’t think that tangible change is needed. \r\n\r\n-\tReviews – these Glassdoor reviews have been a huge contention for internal staff, with old employees asked to write positive reviews of Ambition to offset all the negative, so be careful what positive reviews you trust about Ambition. The main reason for this was that funders were worried about the severe level of negative reviews, however the negative reviews reflect the real internal workings. \r\n\r\n-\tDirector level and above – as noted directors often steal work and take credit, speak horrendously about other staff members and expect everyone to often work 10+ hour days. However, they themselves are subject to pressure from above and are often online at 10pm onwards just trying to keep a float.\r\n\r\n-\tHR – the ever criticised HR Team, do try their best, however with the level of staff turn over in that department it is hard to keep up, as well as the resistance from the CEO to actually make any improvements to the company. \r\n\r\nIn conclusion, I am thrilled to say I no longer work here, it was great to start with but then when the illusion fell it was clear that this is a company that has no clear direction, changes focus and strategy every year (future teachers, middle leadership programme, Apprentices , NPQS, ECT…the list could go on). As well as changing names and branding each year (Future Teachers, Ambition School Leadership, Ambition Institute). \r\nIf you want to work in the Education and charity section, look elsewhere, if you are a young 20 something and just want a job to get you by then this is the place as there is no long term reward or support to stay long term. \r\nBe warned though that you may have to work ridiculous hours, your ideas probably will be stolen and passed off as someone else's, you may have complaints filled against you just for giving ideas that are then stolen by others and you will probably be spoken down to and at some point made cry at the complete mess that is Ambition Institute….hopefully this review helps internal and potential employers to look else where."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great company to work for but poor career progression", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Jan 2022", "job_title": "Tutor in London, England", "duration": "N/A", "pros": "Excellent culture of teamwork and support. Great programmes and organisational mission. Excellent training resources. Very flexible ways of working.", "cons": "Salary the lower end of competitive. Low tolerance for human error. Career progression support is non existent."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "3 years of chaos and getting worse", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "13 Dec 2020", "job_title": "Manager in London, England", "duration": "N/A", "pros": "Flexible work hours and good pension.\nLots of great people at manager and associate levels", "cons": "The majority of people in senior management  have no idea how to manage people or processes. There is a staggering arrogance that their way is right, with a complete lack of empathy or openness to feedback. \n\nIt’s ironic that a charity who provides leadership training to schools is somehow unable to apply the same training internally.  Hierarchy is key, and it seems getting yourself a director position means you can behave in an appalling way, leading and managing through fear and bullying tactics.  I know one director who has made several employees cry,  use intimidation tactics to get results yet is universally praised by the exec team. \n\nThe HR in the organisation is laughably awful! One month, despite not working in HR, I was sent the payroll for the whole organisation to sign off, nothing was raised about my complaint. I was also sent notes for the outcome of a disciplinary procedure for an employee who was not in my team.  No HR director has lasted more than 3 months, so it continues to get worse.\n\nDespite great lip service to diversity and inclusivity about 6 months after starting I discovered another male manager who started at the same time was paid £3000 more than me."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great first job!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Sept 2021", "job_title": "Senior Associate in London, England", "duration": "N/A", "pros": "Amazing team, everyones there to help you carry out daily tasks. Have been super adaptable through remote working.", "cons": "Hard to progress up through the organisation as it's a pyramid structure. With remote working, it seems to be hard to control how much work people are actually doing from home."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "atmosphere did not match my personality", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 Dec 2021", "job_title": "People Associate in Birmingham, England", "duration": "N/A", "pros": "some lovely people\nfriday night quiz night / free fruits- really nice perk of the job", "cons": "The atmosphere was very strange and it didnt always feel friendly, i just didnt fit in!!!!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Learn a lot and make a meaningful impact on education in England", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Jul 2021", "job_title": "Director in London, England", "duration": "N/A", "pros": "Mission-driven employees; strong position in the market which provides opportunities for staff to drive large-scale, national impact; strong efforts in EDI; tons of sector-leading expertise across the senior leadership team; intelligent, ambitious, and caring executive team which one can learn a lot from", "cons": "Some lingering post-merger kinks still being ironed out, e.g. in internal communication and collaboration structures. Good news is that these improvements are a clear organisational focus, work is already underway, and staff mission orientation and culture is strong enough to drive the necessary changes in the coming months."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Avoid at all costs", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "8 Oct 2021", "job_title": "Director in London, England", "duration": "N/A", "pros": "There are none, I guess the people are nice and all driven towards a common goal. This is not the place to achieve that.", "cons": "The leadership is WOEFUL. Melanie Renowden is a prime example of all things a leader shouldn't do. Extremely two-faced and encouraged a toxic culture. Thank goodness she didn't get kept on as CEO."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Really impressed by the new strategy", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Jan 2021", "job_title": "Associate Director in Manchester, England", "duration": "N/A", "pros": "Mission - an organisation that truly cares about tackling educational disadvantage\r\nQuality - what we deliver is impressive and makes a difference\r\nPeople - dedicated people who are intelligent, committed and friendly", "cons": "The leadership changes of the past two years have led to some chopping and changing of initiatives. That has sometimes been frustrating, particularly when you put effort into something that is eventually defunct. However, I've just come back from maternity leave to a more focused organisation - the new strategy is clear, focused and deliverable and it makes me excited to come to work every day. \r\n\r\nI really feel that, with this renewed energy and focus, we are making a real difference"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Good place to work previously but not anymore", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Sept 2021", "job_title": "Administrative in London, England", "duration": "N/A", "pros": "Great initiative, great mission, great first steps into the working world.", "cons": "I guess bad SLT and organisational priorities."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Supportive work environment, lots of change", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Jan 2021", "job_title": "Senior Associate in London, England", "duration": "N/A", "pros": "Great benefits and opportunities to be involved in organisational direction and strategy. Workload/ capacity really varies depending on the team. New CEO brings positive changes. There is a strong culture of support for staff and very flexible working options.", "cons": "Pace of change is quite constant which can be tiring. Lots of information flow from executive to wider staff but less clear channels of communication upward."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Worked with some lovely people but lower level staff not valued", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Jan 2021", "job_title": "Programmer Associate in Manchester, England", "duration": "N/A", "pros": "Great community of people that want to make a difference. Connection to the mission (depending on the team you work in).", "cons": "Lack of clarity for career progression. Poor salary at the lower levels leading to extremely high turn over and loss of staff assets and erosion of positive culture."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Incompetent and immoral organisation & leadership", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "6 Jan 2021", "job_title": "Associate Director in London, England", "duration": "N/A", "pros": "There are no pros to working at Ambition", "cons": "I worked at Ambition, and its legacy organisations for over 7 years. In my final 2 years, they treated me dreadfully, and I can’t recommend enough that you do everything you can to avoid working there. There are several issues I want to draw attention too, many of which have been touched upon by other posters: \r\n\r\n1.\tToxic culture since the merger \r\nSince the merger of Ambition School Leadership and Institute of Teaching, there has been a dreadful culture. Of course, it is hard to unite opposing ideologies (even intentionally!), but instead, IfT began by being oppositional to Ambition School Leadership. In particular, IfT staff were encouraged to view Ambition School Leadership staff critically, which planted seeds amongst the IfT staff not to trust Ambition staff, and to view their work as sub-par. When I have worked with individuals in many instances, I built good relationships. However, the bad culture still exists between these teams- namely: the current design team and the programmes that fall under the 'teaching' programmes umbrella vs all other teams within the organisation. These teams work with the rest of the organisation in a conflictual manner, either micromanaging work, advising on areas outside of their expertise, or trying to take on responsibilities that doesn't sit within their functions. \r\n\r\n2.\tNo viable operating model, or organisational strategy \r\nThe organisation has been running into a deficit each year (which you can see publically on companies house). In spite of this, there has been no clear strategy to address this. These issues lead to continual organisational restructures (3 in the last 2 years), where senior staff are protected and junior staff let go, in spite of where there is evidence to the contrary about who does the work. E.g. the School Partnerships team removed all junior-level postings this year, with no evidence on why this was a better model. \r\n\r\n3.\tIncompetent CEO \r\nHilary has shown absolutely no organisational leadership since joining the organisation and is clearly out of her depth. For a while, it was hoped that she was holding her cards to her chest while finding her feet, but unfortunately, she has not made decisive action on any area and continued to oversee an organisation with no model, and a terrible culture. Only with new leadership can Ambition improve. \r\n\r\n4.\tUnethical & incompetent HR \r\nThis year my job was coming to an end, as it was a maternity cover contract. The organisation decided to place me in a redeployment pool, which means any suitable role that came up, I would be considered first as a candidate. When a new hire was announced one day, I asked HR why I hadn’t been able to apply for the role, they told me the internal intranet post, was the first they had heard of the vacancy, and said it was ‘out of their hands’. I was then called by an exec director who explained it was just a ‘3 month’ posting, which is why it didn’t go through due process. This was in direct contradiction to the postholder, who said in a call with me that she was expected to be here until December (9 months at the time- going well beyond my contract end date). This postholder is still employed. \r\n\r\nWhen I complained formally about this, I was lied to repeatedly by HR and leadership. The complaint put me out of favor of the organisation, and when suitable posts did come up, the process was predetermined so that I was unsuccessful. When I emailed Hilary to discuss these issues she ignored me on several occasions. \r\n\r\nWhilst there is one particular good HR employee (Janine) and perhaps others in HR are trying to influence the organisation to do better, the fact that the organisational leadership is not listening to the advice of HR (or the law), nor providing enough resource for it (for instance they have not backfilled the role of HR director) shows how little they respect HR. \r\n\r\nNow when you read this, you may just think I am a ‘disgruntled’ employee, but it is not just me that feels this way. The results of the staff survey that came out this year compared us with other charities. Across most metrics we were in the bottom quartile, yet Ambition took no action to respond to the feedback."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Great people, clueless leadership", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Apr 2021", "job_title": "Human Resources Advisor in Manchester, England", "duration": "N/A", "pros": "Colleagues and flexibility of work", "cons": "Leadership who do not listen"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Very nice people and organisation", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Jan 2021", "job_title": "Junior Project Manager in London, England", "duration": "N/A", "pros": "Good work life balance, very helpful people, 11% pension contribution from employer", "cons": "Depending on the position salaries can be quite low, but it is a charity after all."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Fantastic people and training opportunities", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Jun 2018", "job_title": "Anonymous Employee in Manchester, England", "duration": "N/A", "pros": "In the short time I have worked here I have had multiple training opportunities as well as the chance to stretch and develop my skills with great support from my line manager. There are also lots of internal secondment opportunities and working groups to get involved with. \r\n\r\nThe people are a pleasure to work with - as a relatively young organisation in terms of the age of staff, most people are brimming with ideas and enthusiasm which makes it a really nice place to come to work. \r\n\r\nThe organisation is really making an effort to listen to staff and improve on some of the growing pains highlighted in former reviews - for example, the HR team now regularly visit other offices outside of the London HQ. \r\n\r\nThe flexible working policy works really well on my team - you are trusted to use your own autonomy to work from wherever is needed and you are not micro-managed on this at all. \r\n\r\nPeople genuinely care about the mission of ending educational disadvantage.", "cons": "As a small-ish organisation Ambition can be very fast-paced and staff are at risk of burning out if they do not have adequate support from their line manager to take advantage of the flexible working/TOIL policies. \r\n\r\nThere appears to be some discrepancy between the Delivery Associate role description and what the actual job entails. We have a lot of very talented graduates in these roles and understandably they can find the role limiting/frustrating."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great for progression", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Mar 2021", "job_title": "Senior Associate in Birmingham, England", "duration": "N/A", "pros": "Great culture and great people", "cons": "Lots of change, can be stressful"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Great mission", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Feb 2021", "job_title": "Manager in London, England", "duration": "N/A", "pros": "You know you're making a difference", "cons": "People culture was not the best"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great org", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Jan 2021", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Great Staff, young people, members and partners,", "cons": "Challenging financial times for the sector"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Mixed feelings", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Jul 2020", "job_title": "Associate in Manchester, England", "duration": "N/A", "pros": "The majority of staff at the organisation are lovely people and the office culture is generally positive. I made some great friends here and never dreaded going into the office.", "cons": "Over the last two years the organisation has felt more and more like business and less and less like a charity. The senior leadership team largely seem out of touch with the concerns of the rest of the organisation. There are also limited opportunities for development, particularly at the associate and senior associate level, which leads to quite a high turnover, particularly in certain teams that struggle to hold onto some employees who become bored/frustrated in their roles and look elsewhere. Some teams/staff members are massively overworked whilst others are underutilised."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Working at Ambition", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Jun 2018", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "It's a lively place to work with a great sense of mission and strategy. For me there was a real sense of empowerment with all opinions listened to and it's a place where anyone can get involved in helping achieve the organisation goals.", "cons": "The constant challenge to achieve the best and associated review of activity can seem slightly chaotic at times and a bit wearing - personally I'd rather see changes challenged and if necessary dropped rather than stagger on zombie like as I've seen at other organisations.\r\nMoney - as a non-profit/charity it will never be a top payer. It tries to make up for this through flexible working which is good but perhaps could be further improved.\r\nCareer building is discussed but being a small/medium organisation this can be a challenge."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Ironic 'charity' promoting the primacy of leadership externally while having a  black hole void of it internally", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Aug 2017", "job_title": "Associate in London, England", "duration": "N/A", "pros": "Smart, talented and very amicable staff\r\nSmartly straddles taking in lucrative government contracts with development of  independently funded and ran corporate programmes £££\r\nLong-term organisational capacity deficits create opportunities to take additional 'development opportunities' outside of your contract and often in your spare time, whether you chose to take these or they are thrust upon you under the guise of 'organisational need'. If you do not have a life outside of work or looking to give one up, Ambition School Leadership may just be for you.", "cons": "Appalling HR- I mean,  truly appalling.  \r\nWage depression\r\nWork-life balance\r\nPalpable low morale\r\n\r\nWhat can I say? If you value  even a degree of balance in your life do not work for Ambition School Leadership.  Prior to the merger I was on the Future Leaders side where there was a worrying culture of overworking but with an appreciation to dedicated staff. Since the merger, the workload has again increased substantially and the obsession with performance management targets is truly suffocating and counterproductive.  \r\n\r\nIt is also worth noting that the pay of roles advertised is substantially lower than when I started at the end of 2015, whereas expectations and the workload has increased.  Internal promotion opportunities have also dried up considerably. A classic case of layers of management who have done enough boot-licking up to middle and senior management only to subsequently knock the ladder down behind them and having no shame in throwing those below them under the bus.\r\n\r\nMorale across the organisation is palpably low. The internal propaganda machine which  shovels disingenuous talk of 'values', 'mission' and 'moral purpose' down our throats has worn thin, especially as since the merger it is painstakingly and cringeworthilly conceited and inauthentic.  Comparison with North Korea or the Soviet Union always comes to mind, however outrageously hyperbolic, but this is a five year plan that needs abolishing.\r\n\r\nThe HR department are grossly incompetent to the point of countless breaches of employment law, Careless confidentiality breaches of sensitive employer information littered on it's shared drive and around the office printer.\r\n\r\nI do believe, especially on the Future Leaders side there used to be heart to what we were trying to achieve. It's probably no coincidence that problems have been mounting as the focus has shifted relentlessly to chasing money.\r\n\r\nI hope these are teething problems with establishing a new organisation but to ambitious, morally-driven graduates and those early on in their career, I'd advise staying well away if you can help it, for now at least. With hindsight I would never have worked here, let alone on currently advertised salaries. You can do better."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Proud to work here", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "26 Feb 2018", "job_title": "Anonymous Employee in Manchester, England", "duration": "N/A", "pros": "Culture: I truly believe we have an outstanding culture here; I can’t tell you how empowering it is to walk into work knowing that your opinions, thoughts and ideas will not only be heard but taken into account. It doesn’t feel hierarchical and there isn’t a culture of fear; in my opinion people are encouraged to be themselves. This wasn’t the case in my previous job where I would often feel patronised and belittled by senior colleagues. I love working for Ambition for a bunch of reasons but it’s the people that give me the most pride; to work amongst so many kind, supportive and talented individuals who go out of their way to support you is invaluable.\r\n\r\nLearning and Development: When I joined our predecessor organisation (Teaching Leaders) as a Delivery Associate, I got stuck in and learnt all about our programmes, matrix working and how to interview and assess candidates, which I really enjoyed. When we became Ambition, I saw a role in the Marketing and Comms team that really excited me. Even though I had no direct experience, my now manager gave me the opportunity to grow into the role through multiple learning and development opportunities. I’m learning technical skills that I never thought would be in my reach and feel much more confident in facilitation and building professional relationships. That being said, learning opportunities haven’t been handed to me on a plate. The opportunities are there, but you need to be proactive and go for it. \r\n\r\nAgile working: I love the fact we have agile working here as it really suits my working style. I used to hate feeling like my days were confined to the same four walls.  The opportunity to work agilely gives me me the autonomy to set up a working week that works for me. It also makes me feel like the organisation trusts me; something that I hadn’t experienced in other work situations.", "cons": "Reactive : As we’re a new organisation, sometimes it feels like we are quite fast paced. I know this is normal after a merger but it can be frustrating at times, especially when we could have done something more impactful. \r\n\r\nTake time to reflect: Sometimes as an organisation we forget to pause and reflect on what we’ve achieved or what we could have done better etc. I think we miss a trick sometimes as we are charging ahead without looking around us. That’s when mistakes can happen."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "My experience was great", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "10 Dec 2018", "job_title": "Associate Director in Manchester, England", "duration": "N/A", "pros": "Wonderful people\nGreat mission\nSome really good benefits and pay\nAn environment that encourages personal reflection, development and growth (self-led)", "cons": "Some of the support systems and process need to be ironed out to ensure that colleagues can work effectively, without frustration \nLots of change over the last few years, but nothing that is out of the ordinary for a charity of this size\nTransparency and autonomy are not consistent enough across all teams/functions, creating inequality in roles"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "The most amazing people serving a great mission", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "19 Mar 2018", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Great people who put in a lot of effort to get things right and to help forward the mission and vision. \r\n\r\nConstantly wanting to get things right, engage and review. \r\nBrilliant set of people with ideas and knowledge", "cons": "Haven’t quite got the hang of decision making and everyone wants to input, which can make things at times laborious.\r\nNot respecting or knowing how to incorporate those who have expertise."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "A boring mess.  Work here if you want to spend half your day emailing people about dry sandwiches.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "7 Aug 2017", "job_title": " in London, England", "duration": "N/A", "pros": "-Agile Working\r\n-Smart and fun coworkers\r\n- Based in central London", "cons": "- Hierarchical, there is barely any decision making power for managers and associates. Any little change has to go through to directors- LEARN TO LET GO POWER. This totally dis-empowers teams. \r\n\r\n-  Salaries are crazy low for London.  Associate level is paid 20K which has been the same for the last 5 years and doesn't take into consideration inflation.  London weighing is a mere 2K per year which is completely outrageous- that barely covers transport! \r\n\r\n- Blame culture is heavy as is passive aggressive attitude from directors. \r\n\r\n- It's all about who you know in the organisation. If you are based in the North office  you are bound to be promoted, like a little clique. So obvious and everyone knows it but them apparently.  People with 1 year experience have been promoted to manager without the slightest ability to train and develop people and the organisation offers no help for this.\r\n\r\n- Development and training is consistently promised but it's all a lie.  Don't buy into that farce if you are interviewing there. \r\n\r\n-Recognition and praise is nonexistent and one constantly feels disheartened. \r\n\r\n- The charity's impact in terms of mission and goals is completely dubious and cannot be substantiated with any reliable data or thorough qualitative studies. This is an urgent task  for external researchers or  investigators particularly as the government funds the programme!!\r\n\r\n- There was no HR department for 2 whole years.\r\n\r\n- Directed and led by staff that couldn't cut it in the private banking sector but don't actually care about systemic change or inequality.\r\n\r\n-Undervalue associate staff constantly.\r\n\r\n-HAS A HUGE DIVERSITY ISSUE!!! Mostly middle class white people working here."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Lamentable organisation masquerading as a charity", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "9 Aug 2017", "job_title": "Associate in London, England", "duration": "N/A", "pros": "Associate level staff, who as a rule, are more than the organisation deserve in terms of skills, experience and general empathy.", "cons": "Everything. Another reviewer has raised the point about the irony of an organisation which promotes the benefits of excellent leadership externally and then pursues the exact opposite approach internally. It's as though discovering the President of the Galileo society, is, infact, a flat earth theorist.\r\n\r\nI cannot underemphasise how awful an organisation this is to work for. I've witnessed employment law flagrantly broken, staff with mental health concerns sneered at, confidential information about employees leaked and employees being coerced into working appalling hours in the interests of 'organisational need'. \r\n\r\nThis organisation requires root and branch reform. Every member of Exco appears, either through accident or design, unwilling or incapable of dealing with the inconvenient business of actually running a functional organisation. There are a subsequent layer of Associate Directors, who essentially deal with the tasks that Exco feel are beneath them, which would be fine other than the fact these people owe their careers to the patronage they have enjoyed (to wit - who these individuals have been prepared to schmooze for a promotion). Then, below this, you have a cadre of managers, of varying abilities, who recognising the organisation's deference to power will willingly throw their team under a bus in order to climb one step further on the management rung. \r\nThese are broad generalisations but generally they ring true of an organisation that would rather 'appear' to be doing a great job than it would, actually do a great job. \r\nFurthermore, the entire structure is run and organised on the basis of a now fundamentally discredited 'performance management' model of operating. Performance targets rule the roost. The problem, of course, is that human experience, particularly that within education is not simply a set of one's and Zeros. As Robert McNamara proved, if you can't win a war on performance targets you certainly can't counter educational disadvantage that way either."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Avoid like the plague", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Oct 2019", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "There are none! Nice people, that is about it", "cons": "So many egos. Exec team is ran with ego and power in mind. The organisation genuinely thinks it makes a difference to the sector, but it has very little impact stats\r\n\r\nReading through the comments, I agree with them all. Too many directors, the culture of my way or the high way, 'other ways' of thinking are not encouraged although they claim that they are.  The finances are a mess. Department for education need to stop funding the salaries of egotistical, white exec team and give to schools."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Disorganized, Hierarchical, Exploitative, Hierarchical, Bureaucratic", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Mar 2018", "job_title": "Associate in London, England", "duration": "N/A", "pros": "-Several nice employees from Associate to CEO level \r\n-Agile working: Generally you can work from home 1 day/week (more if you're an associate director or higher)\r\n-Central Location (Holborn)\r\n-Free fruit provided in the mornings", "cons": "-Many employees are overworked and put in extra hours (of course without extra pay) e.g. skip lunch break and stay longer to get workload done. No work life balance\r\n\r\n-Many systems and processes are disorganized and it is often unclear where responsibilities lie \r\n\r\n-The company is very hierarchical: Associate directors and upwards (Directors, Executive Directors, CEO) are clearly treated favourably and 'sucked up to' while employees at associate level and the like are treated VERY differently\r\n\r\n-Line managers can do as they wish with their subordinates and aren't kept in check. Some line managers will unscrupulously take on more and more work for their (already overworked) team to make themselves look good to senior management and climb up the promotional ladder. \r\n\r\n-Very bureaucratic company. I'd even say pretentious as a lot of it is just show but disorganisation and confusion 'hides' behind the facade.\r\n\r\n-Unfortunately, some employees are quite work shy and inept at doing their job but great 'talkers' and brown nosers so everything is 'hush hush' and swept under the carpet which causes other employees who are not big 'talkers' but conscientious workers having to pick up their slack.\r\n\r\n-Unless you work in Finance, HR or the IT department, you'll probably have to travel a lot due to offices in Manchester, Birmingham, Newcastle and more (This can be a pro or a con, depending on your position on travel)\r\n\r\n-Little to no training provided to new starters and throughout employment \r\n\r\n-Budget consciousness with some things but lavish spending with others e.g. travel\r\n\r\n-No diversity in senior management staff e.g. Not one black senior manager (in 2017)"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Hypocrisy thy name is Ambition School Leadership", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Jun 2018", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "It’s located in Central London. The park in Lincoln’s Inn Fields is quite pleasant I suppose. The Associate Level staff, are as a rule, an incredibly affable and dedicated group of individuals.", "cons": "Everything else. Having worked there for an extended period of time it’s difficult to escape the impression that the entire edifice has been constructed to massage the egos of some Oxbridge types short of a job. Unfortunately, this lip service to a poorly defined charitable ‘mission’ has resulted in a group of mediocrities in the mid-tier of the organisation cleaving to a facsimile of ‘success’ in the hope that they too will inducted into the rarified air of power and infuence. Unlikely. The entire organisation’s existence is yet another testament to Oxbridge’s monopolistic stranglehold on the rhythms of British society at large.\r\nAs a result a cadre of talented, hard-working and intelligent staff at lower levels of the organisation are treated abysmally by a group of people who couldn’t manage the proverbial in a brewery. Internal promotion is run along feudal lines where career advancement seems largely determined  by the favour of powerful benefactor. It’s clear that the self-aggrandising ‘mission’ about equal opportunity and meritocracy hasn’t percolated down to the organisation’s policy on salary for Associate level staff, where the contempt in which you are regarded is routinely revealed on the 25th of every month when wage slips arrive.  No quality evidence or research at all that the perpetual motion machine that is Ambition School Leadership delivers anything of meaning or value in the education sector except to act as an extremely effective sluice of public money into the hands of monstrously overpaid and dubiously qualified external education ‘consultants.’ They do let you wear your own jeans on a Friday though. So there is that."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Just a vehicle for networked egos", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Jun 2019", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Intentions are good but endless mergers, rapid succession of changes at the top, restructures and too much attention on the shiny stuff instead of fixing the basics.", "cons": "There’s an in-crowd at the top like no other organisation I’ve worked in.  Poor performers get moved around while some great performers are sidelined by a clique."}]]