[[{"date": "1 May 2023", "title": "Personal Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at March of Dimes Canada (Toronto, ON)", "Interview Descriptions": "Straight Forward - virtual interview found out in 1 week that I got the job Was with a panel of 2 hiring managers who were very kind and made the interview feel relaxed", "Interview Questions": "Tell me what you know about March of Dimes Tell me about your previous experience"}, {"date": "9 Jan 2023", "title": "VRS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at March of Dimes Canada", "Interview Descriptions": "Questions are very straight forward and based around how your experience can be applied to the role. Make sure you understand the job you are applying to and have specific examples to provide. Be personable/ friendly, and you will be fine!", "Interview Questions": "What related experience do you have? Why do you want to work here?"}, {"date": "26 Nov 2022", "title": "Psychometrist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at March of Dimes Canada", "Interview Descriptions": "Telephone call for screening which was followed by a virtual interview with the program manager and psychologist. Each were about 30 to 45 minutes long. Mainly discussing experience and skills.", "Interview Questions": "What assessments do you have experience with administering?"}, {"date": "1 May 2022", "title": "Administration Officer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at March of Dimes Canada", "Interview Descriptions": "It was 2 phone calls and 1 In person interview \r\n1st call was HR , second call was who I was reporting to and the phone call was with both", "Interview Questions": "They ask about what past experience would be beneficial for this role etc "}, {"date": "16 Jun 2021", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at March of Dimes Canada", "Interview Descriptions": "Found job through Indeed. Had a quick, friendly phone call with HR about setting up the interview date and screening questions. I then had the interview with HR within the week.", "Interview Questions": "What kind of a team do you like working in? "}, {"date": "18 Jan 2019", "title": "Employer Client Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at March of Dimes Canada", "Interview Descriptions": "Relaxed interview, multiple behavioural type questions.  One stage of interview was required in person.  Called with an offer about 1 week later.  Overall it was an average experience", "Interview Questions": "Why are you a fit for this position?"}, {"date": "31 Jan 2019", "title": "Support Service Attendant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at March of Dimes Canada in Nov 2017", "Interview Descriptions": "Read your contract before you sign. They like to sneak things in that you dont know about and they sure wont tell you.  Again, run run run. The only benefit was the training that I received.", "Interview Questions": "N/A"}, {"date": "23 May 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at March of Dimes Canada (Toronto, ON) in Jan 2017", "Interview Descriptions": "Easy, basic questions on how the company is, if I know them, what experience I have, what I would like to learn; If you do get hired as a student, you will be given the jobs they don't want to do, which is normal I guess.", "Interview Questions": "If I can keep things confidential"}, {"date": "18 Aug 2016", "title": "Service Delivery Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at March of Dimes Canada (Chatham, ON)", "Interview Descriptions": "Was a typical interview. 2 persons alternating questions. Gave feedback, answered my questions, let me share a family person tie to the organization in another province for fundraising and share pictures. Friendly. At the end advised I was the candidate in front of the pack, they had 3 more interviews to go and I would be contacted before the end of the week.", "Interview Questions": "Name a conflict situation you experienced, in a former position, with a coworker. Describe you handled the situation and how the situation was ultimately resolved if it was resolved."}, {"date": "2 Dec 2019", "title": "Vocational Rehabilitation Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at March of Dimes Canada in Jul 2016", "Interview Descriptions": "They begin with a phone screening and ask if you have or can acquire the CVRP designation. The next step is participating in a phone interview with 2 individuals (hiring Managers). They will also do a reliability check.", "Interview Questions": "Asked about education, work experience and how that can be best applied to vocational rehabilitation services. "}], [{"date": "17 Jun 2016", "title": "ABI Rehabilitation Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at March of Dimes Canada (Toronto, ON)", "Interview Descriptions": "I was interviewed on the phone by Kieron Rowe. The interview lasted only about 15 minutes, and I found it very typical and basic. There weren't any questions that I was unprepared for. Following our conversation, he told me he was interested in doing a face to face interview in Toronto later that week. I decided against going to the interview, as I knew I would not be taking the job anyway (for the reason of commuting costs from my home to Toronto). Mr. Rowe was very friendly and easygoing, and he was understanding when I declined the offer of a second interview, saying he appreciated my honesty and consideration.", "Interview Questions": "What is your understanding of an ABI Rehabilitation worker / what do you think the role entails?\r\nWhat do you know about March of Dimes?\r\nWhy do you want this position?\r\nWhat makes you the right candidate / what are your related srengths?"}, {"date": "10 May 2016", "title": "Payroll Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at March of Dimes Canada (North York, ON) in Apr 2016", "Interview Descriptions": "I the interview with the HR Director and it was positive, touch on all experience, qualification, transfer skills, strengths and weakness, all were answered. She had positive feedback and wanted me to meet the CFO just for meet and greet, she already stated I am the strong candidate and was going to make me an offer. I met with the CFO and he feels I am overall a good candidate, however the few topic he ask about was answered base on my experience and my pass processes along with legislation laws, he then felt I did not explained the topic strong enough, because of the pay equity question, he feels pay equity is base on gender (male and female) I advice no, it is equal pay and must be base on performance, job satisfaction, qualification, experience and so forth, he still insist it is gender. I try to stray the topic by stating my  previous experience and how I have done, also said every company have a different enternal process and I quickly adp to changes. base on the reason he did not offer me the job, I find it discripnation on his part to want to base it those term there is laws against that, and when I explained it he feel otherwise", "Interview Questions": "Compensation Analysis, Pay Equity, CRM, Unionize, Excel, full cycle payroll with year end and audits, US and CDN Payroll,"}, {"date": "27 Feb 2016", "title": "PSw Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at March of Dimes Canada", "Interview Descriptions": "I was hired quickly interviewed on the phone then brought in for an interview the following day,  I was hired within 24 hours of my interview and out working less than a week from the day I applied. The interview was relaxed and casual, overall a very positive experience", "Interview Questions": "How would you handle a difficult client who was asking you to do something you were not authorized to do?"}, {"date": "25 Aug 2015", "title": "Junior .NET/SharePoint Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at March of Dimes Canada (Toronto, ON) in Aug 2015", "Interview Descriptions": "I applied through recruiting agency and they schedule my interview within 24 hours. I was interviewed by IT Manger. He was really good person we talk about Microsoft web technologies, SharePoint, HTML5/CSS3, Google API's, responsive design and Agile methodology. \r\n\r\nI recommend all the applicants should research about the company, manager and most important thing he/she should be familiar with Web Content Accessibility Guidelines (WCAG) (EXPERIENCE PEOPLE PREFERRED)\r\n\r\nP.S: best of luck to all future applicants :)", "Interview Questions": "Have you work with SharePoint / responsive design / google api's before and what do you know about Web Content Accessibility Guidelines (WCAG)?"}, {"date": "30 May 2015", "title": "Residentrial Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 5 days. I interviewed at March of Dimes Canada (Toronto, ON) in Apr 2015", "Interview Descriptions": "Friendly, through and honest. It was an informational interview to gather knowledge about the agency. The current demand did not favor employment at this time. Was given other agency in line with my previous background and experience", "Interview Questions": "Why should we hire you?"}, {"date": "2 Dec 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at March of Dimes Canada (Toronto, ON) in Jun 2014", "Interview Descriptions": "Received a call from HR that asked basic questions to assess fit;  went in for an in person job interview with two people - one from the dept and another from HR; the interview went well and I received a call from HR within a couple of days from the interview to offer the position.  I studied a lot for the interview - the department, the history of the company, and came prepared with questions to ask at the end of the interview, which is why I felt it was easy.", "Interview Questions": "Why do you want to work here; question about a bad customer service experience and how you turned it around; question about how skills and education prepare you for the role; questions about weakness and how you address it; what are you strong points"}, {"date": "3 Apr 2016", "title": "Employer &Amp; Client Coordinator (Ontario) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at March of Dimes Canada (Toronto, ON) in Apr 2012", "Interview Descriptions": "I was greeted very warmly and was interviewed by two staff members. It was unclear who they were at the time but it ended up being the team lead and a staff member for the office. The other staff members made it very comfortable to sit and wait for my interview to begin. The interview was conducted in a board room, and was very comfortable. I felt at ease when entering the interview room and therefore the experience was one that I left feeling good about.", "Interview Questions": "Tell me about yourself?"}, {"date": "7 Oct 2009", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at March of Dimes Canada in Aug 2008", "Interview Descriptions": "The interview consisted of a 2:1 panel.  The questions varied form knowledge about the WSIB process to soft skills such as communication. Focus was placed on ability to work in a stressfull and fast pace enviornment as well as working with difficult clients helping them clarify their occupational goals.  Following the 30 minute discussion there was a personality test and also a need to answer 3 questions.", "Interview Questions": "Case Study:\r\nYou learn that your client did not complete the college application process by the specified date and would not be able to attend college as per the LMR plan.  The adjudicator yells at you for not enusring that the client completed all the application requirements.  What do you do?"}]]