[[{"date": "22 Apr 2023", "title": "Youth Development Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Prince's Trust (Glasgow, Scotland) in Apr 2023", "Interview Descriptions": "The interview was an assessment centre style day, with introductions first of all, an interactive activity in the first half of the day and a team building style exercise in the second. Included in the competency based panel interview at the end of the day was a 5 minute presentation task delivered to the interview panel.", "Interview Questions": "1. Why did you apply and how do your skills and experiences fit this role? 2. Name a time when you led a project that you were proud of, and what were your contributions. 3. Name a time when you championed for equality, diversity and inclusivity?"}, {"date": "26 May 2023", "title": "Fundraiser Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Prince's Trust (London, England) in Apr 2023", "Interview Descriptions": "1 competency based interview and follow up with a task around the job role. Second interview was on site with a chance to see the offices and meet different people.", "Interview Questions": "Look at our current giving data - what do you notice and what would you do to change the outcomes?"}, {"date": "16 Feb 2023", "title": "Youth Development Lead Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prince's Trust (Burnley, England)", "Interview Descriptions": "Teams interview - 45 mins with the Service Delivery Managers. They asked 6 questions - pretty standard questions on communication and relationships with stakeholders and also got one on risk assessments (Have I ever carried one out)", "Interview Questions": "Describe a time you carried out a risk assessment?"}, {"date": "31 Jan 2023", "title": "Youth Development Lead Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prince's Trust (Birmingham, England) in Jan 2023", "Interview Descriptions": "Sent an application off with your CV and a cover letter which was made online. I was then asked for a phone call and then an offer to interview in person.", "Interview Questions": "Name a time when you helped a young person and succeeded... Name a time when you worked as part of a team that was successful and what was your role within the team? Name a time when you have worked well under pressure and how did you cope with the pressure? Name a time you worked within a team, what went well, what were the challenges and what was your role within the team? Name a time when you championed for diversity & inclusivity? Name a time when you had to change your communication style. Name a time when you worked well under pressure."}, {"date": "15 Dec 2022", "title": "Youth Development Lead Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Prince's Trust", "Interview Descriptions": "Good - friendly interviewers , made me feel comfortable but very professional. Asked 7 questions and also left time for me to ask questions at the end. Heard back within a few days.", "Interview Questions": "What do you think are the most important problems facing young people?"}, {"date": "4 Nov 2022", "title": "Participant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prince's Trust", "Interview Descriptions": "A casual conversational interview to ensure requirements are met and general interest in programme. Tour of centre and discussion about expectations etc. Very lovely chat altogether. Definitely recommend anyone looking to take part in a course here. I’m trying to access something on glass door so need to write a review of someone so here we go.", "Interview Questions": "About my date availability, interest in the programme."}, {"date": "6 Oct 2022", "title": "Corporate Partnerships Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Prince's Trust (London, England) in Sept 2022", "Interview Descriptions": "There were 2 rounds of interviews which I was expecting. It was clear during the second that their was affinity bias, and clear that the interviewer was looking for someone with similar experiences to the team with a similar career background. I was told the team hadn’t changed in 4 years so they didn’t want to ‘rock the boat’ by hiring someone with a different background.", "Interview Questions": "In the second interview, Tell me about yourself, and a bit of a deep dive on my background. "}, {"date": "16 Nov 2022", "title": "Business Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Prince's Trust (Birmingham, England) in Sept 2022", "Interview Descriptions": "It was in 3 stages. The first was a phone call, the second was a video call with 2 members of the team. The last was a presentation with 3 members of the team. The last stage was a 10min presentation on a challenging project I had done, followed by some questions,", "Interview Questions": "Q1: Tell me about yourself Q2: How to handle difficult stakeholders Q3: Greatest achievements"}, {"date": "22 Sept 2022", "title": "Youth Development Lead Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Prince's Trust (Leeds, England) in Aug 2022", "Interview Descriptions": "Applied online on the website and got a first stage interview offer 1 week later. The interview has multiple stages which is set at different dates. The interview took place via Microsoft Teams with two members of staff (Operations Manager and Service Delivery Manager). \r\n\r\nThe interview consisted of 6 questions, both members of staff were very warm, positive and welcoming. The interview lasted for 30 minutes. After this, an explanation was given about the role, what it would require and I was given the opportunity to ask any extra questions at the end. In total, the interview lasted 45 minutes.\r\n\r\nThe second stage interview would have consisted of travelling to a youth centre or school in order to see how one would interact with the youth and if you have any further questions.\r\n\r\nThroughout the interview, as well as sharing your own experiences from your voluntary work or your previous jobs, you do constantly have to refer back to the Prince's Trust job specification and discuss how you demonstrate these otherwise you will not progress. You must fully research everything about the company (e.g. values, EDI strategy, agencies, job specification list).", "Interview Questions": "What steps do you have to take to complete a risk assessment?"}, {"date": "6 Oct 2022", "title": "Youth Development Lead Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Prince's Trust (London, England) in Aug 2022", "Interview Descriptions": "There were 6 questions which is standard for any junior role at PT, including YDL, usually including a question about EDI and the other questions were based off of points in the job description. Some questions asked for examples, however some didn’t, yet it was clear in the feedback that this is when I lost points. I do think that this should be looked at as people with certain learning needs need explicit questions. You could also set interviewees up to do better by sending them the questions ahead of time, rather than expecting them to ask for them and answer quite lengthy questions on the spot. It was also clear that the interviewers were not well trained when doing the interviews, as sometimes it was very clear that the interviewer or hiring manager had already made their decision and prejudgement. In 3 roles I applied for, it was clear someone had already been lined up for the role and if this is the case, please don’t ask other people to waste their time and resources applying.", "Interview Questions": "Why have you applied for this role and how does it fit with your skills and experience?"}], [{"date": "1 Jul 2022", "title": "Youth Development Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Prince's Trust (Leicester, England) in Jun 2022", "Interview Descriptions": "Online teams interview with two interviewer for first stage, informal interview with personal questions to get to know better such as tell me about yourself and how did you develop professionally", "Interview Questions": "How have you developed professionally?"}, {"date": "19 May 2022", "title": "Youth Development Lead Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Prince's Trust", "Interview Descriptions": "Typical 1 round 1:1 interview, or it could be conducted informally through a Get Hired Event which is similar but more accessible. Submit CV and Cover Letter.\r\n\r\nTypical 1 round 1:1 interview, or it could be conducted informally through a Get Hired Event which is similar but more accessible. Submit CV and Cover Letter.", "Interview Questions": "What are the pressures on young people?"}, {"date": "20 Apr 2022", "title": "Communications Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prince's Trust", "Interview Descriptions": "The Interviewer was horrid, she was laughing the whole way through the interview. Considering she is from a BAME background that was really shocking. Appalling behaviour, and quite frankly disgusting. \r\n\r\nThe company does not believe in helping disadvantaged people, if you do not employ them. They hardly employ black people and I can only assume there is some sort of disdain there. I think if you as a charity are positioning yourself as a brand to help disadvantaged children, you kind of need people from disadvantage backgrounds. \r\n\r\nIt’s a disgrace. Not the most professional interview at all. Also feedback was just excuses.", "Interview Questions": "Asking about my prior experience."}, {"date": "16 Mar 2022", "title": "Youth Development Lead Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Prince's Trust", "Interview Descriptions": "There were 2 steps: first, icebreaking with young people(2 to 4) and second, formal interviews with 3 people. They asked me 9 questions in formal interview.\r\nI was comfortable to answer.", "Interview Questions": "what is your motivation to apply for this postion?"}, {"date": "12 Jan 2023", "title": "Youth Development Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Prince's Trust (London, England) in Mar 2022", "Interview Descriptions": "Interview process was smooth and very professional, with a panel of 3 interviewers. I've managed to secure a job after successfully completing this interview and vetting checks. All the process including HR communications was done in a good time manner.", "Interview Questions": "They asked me about who I am and my aspirations in life."}, {"date": "10 Sept 2021", "title": "Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Prince's Trust", "Interview Descriptions": "I was asked to put together a ten minute presentation for the interview about the challenges young people currently face when trying to enter employment, after this I was asked a series of interview questions.", "Interview Questions": "After the presentation they asked strength based interview questions."}, {"date": "18 Aug 2021", "title": "Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Prince's Trust (Manchester, England) in Aug 2021", "Interview Descriptions": "Competency questions about diversity, teamwork, organizational skills, and customer service. There were two interviewers and took turns in asking questions. They were friendly and introduced themselves before diving in with the questions", "Interview Questions": "1- tell me about a time you changed someone’s opinion or decision \r\n2- what does diversity mean to you?\r\n3- what tools do you use to organise your work?"}, {"date": "24 Oct 2021", "title": "Youth Development Leader Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Prince's Trust in Jul 2021", "Interview Descriptions": "Interviewed via Teams, with two people on the panel. Relaxed and friendly approach.\nAsked 6 questions; make sure you are familiar with the Trusts 5 values.\nPlenty of opportunity to ask questions.", "Interview Questions": "What does diversity and inclusion mean to you"}, {"date": "15 Jul 2023", "title": "Service Delivery Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prince's Trust (Manchester, England) in Jul 2021", "Interview Descriptions": "Competency based questions that require you to give lots of examples. Suggest using the STAR method. Included questions about Safeguarding and Equality, Diversity and Inclusion. Panel of 3 members in person. Friendly staff.", "Interview Questions": "Why is EDI important to you?"}], [{"date": "15 Jun 2021", "title": "Partnerships Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Prince's Trust", "Interview Descriptions": "Was sent a presentation question to work on and present in the interview about how I would keep partner companies engaged. Staff friendly. Didn’t get back to me for a while.", "Interview Questions": "What’s your favourite partnership between a company and a charity."}, {"date": "15 Jun 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prince's Trust", "Interview Descriptions": "It was a fairly easy process, the interview was quite relaxed and the questions were competency based. There was a test that followed after the interview. The process was fairly easy.", "Interview Questions": "Competency based questions"}, {"date": "15 Jun 2021", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prince's Trust", "Interview Descriptions": "Prepare a 5 minute interview and then had to answer about 8 interview questions. The interviewers were both really friend and smiley which made me feel much more at ease!", "Interview Questions": "What 3 words would your friends use to describe you?"}, {"date": "11 Dec 2020", "title": "Operations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Prince's Trust", "Interview Descriptions": "Uploaded cv, then did a 500-word personal statement to go alongside it before accepted for   the interview, then had competency based questions in the interview. Looking at where you had helped young people. Although interview was somewhat hard because you had to pick pinpointed scenarios it is somewhat easy if you reslly want the job", "Interview Questions": "Why do you want to work for princes trust"}, {"date": "14 Dec 2020", "title": "Princes Trust Executive Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prince's Trust (Manchester, England) in Dec 2020", "Interview Descriptions": "virtual interview- 2 people on the panel- they were very welcoming and friendly. They would sometimes positively comment on an answer you had given. There were 7 Questions- make sure you give a lot of details.", "Interview Questions": "Why do you want to work for the trust. what skills and qualifications do you have?"}, {"date": "8 Jan 2022", "title": "Operations Executive/Youth Development Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Prince's Trust (Birmingham, England) in Dec 2020", "Interview Descriptions": "In the invitation to interview I was asked to prepare a five minute presentation analysing the opportunities and challenges young people face when starting a business. \r\n\r\nI was interviewed by a panel of four (two managers, one executive and a young ambassador). I was firstly asked to deliver my short presentation and then each of the panel members took it in turns to ask situational and competency-based questions. I followed the STAR technique and that seemed to work really well. \r\n\r\nAll the panel members were welcoming and friendly, which put me at ease.", "Interview Questions": "Tell me about a time when you had to have a difficult conversation with a colleague  "}, {"date": "9 Apr 2021", "title": "Head of Partnerships (South) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Prince's Trust (London, England) in Oct 2020", "Interview Descriptions": "The interview process took about a month but during that time I was kept informed about progress and next steps.\r\n\r\nFor the final interview I had to submit a written task and then prepare and deliver a presentation. It was then 6 selection board questions. \r\n\r\nI felt I was able to demonstrate why I would be the best candidate for the role in that the questions were relevant for the role and gave me the opportunity to talk to my skills and experience.", "Interview Questions": "Why do you think you are the best person for the role "}, {"date": "30 Nov 2020", "title": "Director of Individual Supporters Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 9 months. I interviewed at Prince's Trust in Mar 2020", "Interview Descriptions": "Phone interview with the deputy CEO to discuss general aspirations/company culture, then a zoom meeting with deputy CEO and Head of fundraising. Questions were very odd, incredibly specific. Neither seemed to know why they were interviewing. Was told i would hear in a week.\r\n\r\nTWO MONTHS LATER Hr sends me an email to say hold tight and they are sorry  about the delay (blamed COVID) and that i would hear about new plans in 4 weeks. That was 5 months ago. I chased up the HR business partner and received no reply. It says a lot about a company when they cant even tell you you dont have the job out of courtesy. Im shocked for such a high level position that this is acceptable behaviour.\r\n\r\nA lucky escape i think.", "Interview Questions": "What do you know about the Princes Trust"}, {"date": "27 Jan 2020", "title": "Operations Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Prince's Trust (London, England) in Jan 2020", "Interview Descriptions": "Straight forward and fairly quick process. I had to submit an online application which included an uploaded copy of my CV and a cover letter addressing the person specification provided. I first got a rejection email a few days later. Then a couple days after that I got an email saying this was an accident and they invited me to interview. The job turned out to be for a specific programme which wasn't mentioned in the job advert, and I had to prepare a 5 minute presentation based on strategies for that particular programme.", "Interview Questions": "Describe a time when you had to have a difficult conversation with a colleague or an external stakeholder.\r\nDescribe a time when you helped a young person to a positive outcome.\r\nDescribe a time when you completed a project or a piece of work.\r\nFollow up questions and questions based on the presentation.\r\n"}, {"date": "25 Nov 2019", "title": "Corporate Partnerships Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prince's Trust (London, England) in Nov 2019", "Interview Descriptions": "I was asked to give a presentation at the interview however, the set question was grammatically incorrect and poorly worded. I felt that the interview went ok. However, I never heard back despite being told that I would and was given a deadline for when they would contact me. I am pleased that I was not offered the job as I wouldn’t want to work for an organisation that ignores applicants who had worked hard to prepare for the interview process and who had bothered to waste their time and money.", "Interview Questions": "General interview questions. "}], [{"date": "19 Jan 2021", "title": "Supporter Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Prince's Trust in Nov 2019", "Interview Descriptions": "20 Minute task of writing a 'Thank You' email and then spotting mistakes between 2 excel sheets printed on paper\r\nFollowed by a 30-45 minute interview discussing previous related jobs and skills, and general conversations to assess if I would be a good fit for the team", "Interview Questions": "How do you relate to the young people?"}, {"date": "12 Jan 2021", "title": "Business Development Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Prince's Trust (Birmingham, England) in Oct 2019", "Interview Descriptions": "Tour of office space, introduction to key staff and overview of the organisation. Detailed history and opportunity to ask questions. Good and professional outlook. Good exposure to the organisation and people within it.", "Interview Questions": "What are your ambitions for next 5 years"}, {"date": "1 Sept 2020", "title": "Executive Team Leader Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Prince's Trust (Bristol, England) in Mar 2019", "Interview Descriptions": "Applied via website contacted for interview via email about 1 week after closing date. I was given a 2 questions to present back to panel at interview stage I had one week to prepare.", "Interview Questions": "Why do you want to work for PT"}, {"date": "16 Mar 2019", "title": "Digital Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Prince's Trust (London, England) in Feb 2019", "Interview Descriptions": "30 min marketing plan activity and 45 min interview.\r\n\r\nTask was relatively straight forward.  Very relaxed and lovely panel of two. Called to let me know the result and gave me some feed back on the interview.", "Interview Questions": "Tell us about a campaign you were involved in?"}, {"date": "3 Jan 2020", "title": "Assistant Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Prince's Trust (Omagh, Northern Ireland) in Jan 2019", "Interview Descriptions": "It was an intense interview headed by South West Collage. The questions were in front of me to review before the start of the interview and involved problem solving solutions and my experience with working with young people.", "Interview Questions": "I was asked why I wanted to do this kind of role given the challenges attached."}, {"date": "4 May 2019", "title": "Events Executive Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Prince's Trust (London, England) in Jan 2019", "Interview Descriptions": "I applied online, completing a long application form.\r\n\r\nThe interview process followed a very traditional format of answering pre-determined questions to a panel of two staff members. It was very clear that I was one in a long line of candidates being interviewed one after the other. I was taken into a room and offered water. There were several empty cups on the table from previous interviews, indicating that at least 5 people had been seen before me. There was a feeling of rushed urgency to the interview meaning that it was over within 30 minutes. I felt like I answered the questions to the best of my ability but the format of the interview process didn't allow me to express as much of my personality; a more casual approach, incorporating the format of questions would have permitted a more detailed look into each candidate's nature.\r\n\r\nI was offered a second interview which followed exactly the same format, except with a change in the panel and the questions. I was also asked to prepare a short presentation on the benefits of commercialising a previously free event offered by The Trust.\r\n\r\nFollowing this, I was offered the position.", "Interview Questions": "What would you do with your first 100 days at the company?"}, {"date": "7 Oct 2019", "title": "Operations Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prince's Trust (Belfast, Northern Ireland) in Dec 2018", "Interview Descriptions": "After the initial online application which is pretty standard the interview was very friendly and they were very fair. I have also been on a panel and objectivity and honesty are very important in the decision. It can take a while to hear to back though.", "Interview Questions": "Describe a time when you have had to help someone at work. What did you do and what impact did it have? "}, {"date": "1 Nov 2018", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Prince's Trust", "Interview Descriptions": "The Online application process is really quite outdated. At interview you need to provide examples of when you have demonstrated values and behaviours and there are a lot of competency based questions. Interviewers make a lot of notes", "Interview Questions": "Tell me about a time when you had to have a difficult conversation with a colleague"}, {"date": "10 Aug 2018", "title": "Deputy Leader - Team Programmer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Prince's Trust (Worthing, West Sussex, South East England, England) in Aug 2018", "Interview Descriptions": "Online application form followed by email notification of interview time & date.\r\n\r\nPanel interview with two staff members, one a Leader and the other the programme co-ordinator.\r\n\r\nInterview notification detailed that the duration would be 45 mins but the panel raced through questions, completing the interview in 20 mins. There appeared to be further interview assessment materials laid out on the table but they were not used. I glanced at them at the end of my interview and they both tensed up so I speculate they intended to cut my interview short for a reason unknown to me.", "Interview Questions": "What experience can you bring to the role (or words to that effect)?"}, {"date": "23 Aug 2018", "title": "Communications Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Prince's Trust (London, England) in Aug 2018", "Interview Descriptions": "Very easy, great communication with hiring manager. The interview itself was fantastic experience, and although i neer recieved a job offer, I was provided with invaluable feedback that will help my career progression", "Interview Questions": "Why do you want to work here?"}], [{"date": "1 Aug 2018", "title": "Digital Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Prince's Trust (London, England) in Jul 2018", "Interview Descriptions": "Relaxed and professional.  I had to do a task for 30 minutes at the start which was based on creating a digital strategy. I was then interviewed by two senior staff members. I heard back later that day with a job offer which I accepted.", "Interview Questions": "Competency-based questions"}, {"date": "5 Aug 2019", "title": "Marketing Apprentice Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Prince's Trust (London, England) in Jun 2018", "Interview Descriptions": "I was more showcasing my personality and who i was as a person. It felt more like a conversation rather then an interview as i was meeting a group off people that wanted me to succeed.", "Interview Questions": "Favorite Movie that i watched recently"}, {"date": "20 Jan 2018", "title": "Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prince's Trust", "Interview Descriptions": "Most of the application and interview process was straightforward enough. The online application system is a tad dated and clunky, but I sent off my application without a hitch and was pleased to be invited in for an interview soon afterwards. \r\n\r\nThe interview itself went smoothly and seemed well organised. I completed a written exercise and then spent 45 minutes or so answering a series of questions put to me by the interview panel. Everything went fine: they were friendly, the questions were reasonable, and I thought my performance was OK. \r\n\r\nHowever, my experience then turned very negative. I was told they'd inform me of the outcome as soon as possible, but after two weeks I still hadn't heard anything back from them. No phone call, no email, no update on the online system. Nothing. \r\n\r\nI sent polite messages to the head of the department I was applying to and to the HR team, saying I assumed I hadn't got the job but could they please confirm this and offer some feedback. After all, I was busy applying to lots of other vacancies elsewhere, so it would be useful to be certain about what had happened to my application to The Prince's Trust and to receive feedback that could help me in future interviews.  \r\n\r\nInitially there was no response. Then, almost a month after the interview, I got an email confirming that my application was unsuccessful. I was told some feedback would be sent my way soon. However, it has still not appeared. \r\n\r\nI understand The Prince's Trust staff are stretched and busy and that contacting unsuccessful job applicants isn't going to be their number one priority, but I still think this is a pretty shoddy way to treat people that undermines The Prince's Trust's reputation. I put in a huge amount of time and effort reading up on the organisation, working on my application and preparing for the interview. It's not unreasonable to expect confirmation of whether I'd got the job or not within a two week timeframe...or at least an update on when I could expect to hear from them. I came to GlassDoor and saw reviews suggesting previous applicants had the same sort of experience. \r\n\r\nIt's certainly affected my opinion of The Prince's Trust as a charity: if they're disorganised in this way, what other parts of the organisation aren't providing a good service? And if I had got the job, would it actually have been a supportive place to work? I've since secured a job elsewhere and can't help but think it's maybe for the best I didn't end up at The Prince's Trust.", "Interview Questions": "Give an example of planning a project"}, {"date": "7 Dec 2017", "title": "Head of Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Prince's Trust (London, England)", "Interview Descriptions": "Actual interview was okay. However, the process both before and after the interview was chaotic, with the hiring manager emailing me about the interview and asking if time/date was okay and then going on leave until the date she had proposed for my actual interview. I did in the end make it to the interview and about two weeks after requested feedback, even just being told I hadn't got the role would have been enough but despite numerous follow up efforts I received no reply. I feel it says a lot about a manager/organisation if they cannot respect how much effort it takes to prepare for an interview and at least let candidates know whether or not they have been successful.", "Interview Questions": "Competency based questions"}, {"date": "8 Mar 2019", "title": "Programmer Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Prince's Trust (Nottingham, England) in Sept 2017", "Interview Descriptions": "10 minute presentation then 3 Panel interview .  Applied for the job  online. Was asked to prepare a 10 minute presentation about how you would introduce people to Enterprise Programme.  Then there was a 45 minute interview with a panel of three. I thought this was a bit much for the money they were offering.", "Interview Questions": "How would you empower young people"}, {"date": "13 Jul 2017", "title": "Outreach Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Prince's Trust", "Interview Descriptions": "Had to fill out a detailed application form about the Princes Trust values including a personal statement. Then was invited to a 3 panel interview where they asked two questions each. Very little about past experience and more centred on scenario questions i.e. 'how would you' questions about specific Outreach programmes and recruitment. The panel were extremely polite and put at ease, and they also were very forthcoming with very detailed feedback after the interview was complete.", "Interview Questions": "What do you think the top priorities of an Outreach Executive is? "}, {"date": "1 Jul 2017", "title": "Programmer Executive Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Prince's Trust (Leicester, England) in May 2017", "Interview Descriptions": "a panel of 3 people. Current programme exec, Manager and a member from the outreach team. 12 or so questions along with presenting how i would plan and organise my first four weeks as programme exec for the Get into programme.", "Interview Questions": "Why do you want to work for prince's trust?\r\nWhat prince's trust value do you most associate with?\r\n"}, {"date": "28 Mar 2017", "title": "PA Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prince's Trust", "Interview Descriptions": "Simple enough interview. Just a few competency questions. Interviewers were nice, a panel of 2, it lasted about 30 minutes. Was told I'd hear within 2 days (Friday), wasn't actually informed until the Tuesday. That was extremely disorganised of them, there was no email explaining there was a delay in the decision.", "Interview Questions": "Why do you want to work for the princes trust."}, {"date": "23 Feb 2017", "title": "PR Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prince's Trust (London, England) in Feb 2017", "Interview Descriptions": "Job was advertised on national newspaper. I applied through PT website with CV and cover letter. Less than a week later I was emailed to say I was called for interview 4 days later.", "Interview Questions": "Example for resolving conflict.\r\nExperience with social media and suggested campaigns.\r\nWhich journalists / publications / shows would be good fit for a feature."}, {"date": "21 Jul 2016", "title": "Programmer Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Prince's Trust", "Interview Descriptions": "Internal application: lengthy application. Includes values which the trust hope their staff will embody. Quick shortlisting process followed by email inviting me to interview with all the relevant info needed.\n\nInterview itself was good! I really enjoyed it, questions were all situational, \"tell me when you worked across functional boundaries\" etc. \n\nInduction process very clear and included when candidates could expect to hear back.", "Interview Questions": "All situational."}], [{"date": "25 May 2016", "title": "Finance Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Prince's Trust (Birmingham, England) in May 2016", "Interview Descriptions": "Applied via recruitment agency who were very helpful! Got an interview the next week. Interview was divided into two parts -  Excel test and the official interview.  Excel test was 15 minutes. Interviewers were lovely! Made me feel very welcome and comfortable!", "Interview Questions": "Asked many questions - mostly the ones where you have to give examples from your past (how would you deal in this sort of situation, etc.) "}, {"date": "18 Sept 2019", "title": "Outreach Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Prince's Trust (Birmingham, England) in Nov 2015", "Interview Descriptions": "They took a few weeks to respond to my application, but then the process was quick and smooth. Prepared a presentation and answered questions as expected for an outreach role.", "Interview Questions": "Tell us about a time you had to manage multiple projects at any one time."}, {"date": "15 Dec 2016", "title": "Programmer Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Prince's Trust (Leeds, England) in Jul 2015", "Interview Descriptions": "Lengthy online application, then interview with panel of 2 people. I had to prepare a presentation on what I think the first 6 months of my role would be and challenges I would face and how to overcome them. No questions after presentation then straight to a set of questions interviewers had written down.", "Interview Questions": "Why the Prince's Trust? \r\nWhat's your experience of working with young people \r\nExample of when given construction feedback \r\nQuestions around boundaries and safeguarding \r\nHow do I show their values? (Approachable, Inspiring, Empowering, Passionate, Non-Judgmental). How do I handle conflicting priorities?"}, {"date": "29 May 2015", "title": "Verkaufsleiter Nord / Großkundenmanager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Prince's Trust", "Interview Descriptions": "The interview process involves first a unseen presentation which you get 15 minutes to prepare. \r\nYou then give the presentation to the panel of interviewers using flip chart paper which you have prepared in the 15 minutes.\r\nFollowed by panel interview in my case was 3 people with competency and experience questions.", "Interview Questions": "Presentation:\r\n- Best Volunteer Practice\r\n- Corporate Volunteer Advantages"}, {"date": "30 May 2016", "title": "Outreach Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Prince's Trust (London, England) in Jan 2015", "Interview Descriptions": "I applied online then got an email asking for me to come in for one in-person interview; it was a pretty simple process. I had the department director and direct manager in my interview. Not too much was asked in-depth about the competencies for the role.", "Interview Questions": "How would you reach out to and engage disadvantaged young people?"}, {"date": "20 Sept 2014", "title": "Programmer Manager Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Prince's Trust", "Interview Descriptions": "This was an internal vacancy, but the application system was exactly the same as external. It's a lengthy online application form. The most difficult section is \"living the values' where you need to give examples of how you meet the organisation's values in your everyday life.\r\n\r\nAfter being shortlisted I was invited to the interview. I was interviewed by 2 members of staff - the immediate line manager for the post and the senior head of programmes. It was a competency-based interview and the interviewers did not seek clarification if they wanted more information. The questions themselves were not tricky but the interviews had a very specific idea of what they were looking for.\r\n\r\nI heard the next working day that I had been unsuccessful, and in fact that they had not appointed anyone and were opening up to external candidates.", "Interview Questions": "This post will require you to manage large budgets. Give me an example of a time when you have managed significant budgets."}, {"date": "14 Jun 2014", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Prince's Trust (London, England)", "Interview Descriptions": "I applied using their online portal - very lengthy application - and it was over 2 months before I heard back from them. Initial meeting for coffee and then an interview with a 3 person panel for which I had to prepare a short presentation about the challenges I would face in my first three months. It was about a week before I heard back as to whether I'd got the job or not.", "Interview Questions": "On the application they ask you to go in to detail how you live their values, which feels a bit contrived."}, {"date": "20 Jun 2016", "title": "Volunteer C-ordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Prince's Trust (Belfast, Northern Ireland) in Jan 2013", "Interview Descriptions": "I knew I would have an unseen presentation to prepare.  Was given 20 minutes, flip chart paper and marker pens to prepare five minute presentation on recruiting volunteers, retaining them and encouraging them.  Panel interview after with three staff.", "Interview Questions": "How have you managed volunteers before? How do you plan to meet the values of the Prince's Trust in your job role?"}, {"date": "12 May 2013", "title": "Training Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Prince's Trust (Chingford, England) in Oct 2012", "Interview Descriptions": "Internal progression nonexistant, job required applying as if external. Scheduling process slow and difficult. Despite exceeding job specification requirements, and with support of referees vouching for sufficient experience, they went for external candidate with more experience, thus proving internal career opportunities nonexistant because there's always someone out there with just a little more experience.", "Interview Questions": "Questions revolved around 1 programme, as if preoccupation by interviewers; which made the job description misleading because that  wasn't noted the role description. "}]]