[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A rewarding job at an institution with a great legacy", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "5 Jun 2023", "job_title": "Senior Lecturer in Guildford, England", "duration": "N/A", "pros": "incredible colleagues - you will not find better Brilliant students Excellent career development oppurtunities and generally higher pay than other similar institutions. Flexibility", "cons": "Fast paced work environment not for everyone"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Just be aware", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Jun 2023", "job_title": "Senior Manager in Guildford, England", "duration": "N/A", "pros": "Learning experience, fast pace, opportunity to do new things", "cons": "Oppressive working environment. Fear. Anxiety. Accountability but little autonomy."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Paid to lie to new students", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Nov 2022", "job_title": "Student Ambassador in London, England", "duration": "N/A", "pros": "Campus/teaching staff are really nice and want to help students", "cons": "Student ambassadors are paid to tell lies to potential new students and their families. We are told to tell them that ACM has industry standard equipment and world leading facilities but the truth is the equipment is constantly breaking or out of action and the facilities are falling apart, damp or older than the students. We are told to tell students how great student life is but honestly the staff and students are miserable and wish they'd gone to another university."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "I do not recommend to ACM to anyone - not even my enemy", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Jan 2023", "job_title": "Bookkeeper in Guildford, England", "duration": "N/A", "pros": "Work is plenty for someone who is a self starter, a keen learner, has thick skin and is WHITE.", "cons": "My time at ACM was the lowest point in my life. I was picked on by my line manger who absolutely hated me for reason other than my work. I was on constant fear as it was guaranteed that I would be damned if I did and damned if I didnt. The team I worked with all turned blind eyes to what I was experiencing - not one of them had a decency to atleast ask if I was ok. The only one who reached out was a lady (ex employee) who had seen me being spoken to in a manner that was not acceptable. Her advise to me was ACM was a lost cause and not worth my mental health and bullying that I was suffering. I regret not taking her advise sooner but I had my reason (obviously that being acm my only source of income). I approached HR and requested external counsellor who I could speak to about my experience and get unbiased advice. I was given no support but instead referred to in-house counsellor. I was in desperation so I contacted the in-house counsellor only to be told her service is limited to students only. I dont hold anything against the in-house counsellor but shouldnt HR know better? What was required of me to be taken seriously? I have always been a diligent worker with good work ethics. And what I experienced at ACM wasnt my normal. I have always been well respected personnel of companies i had worked for so it was important for me to get a clarification on why I was being made to feel the way I did ... the person I was picked on by said it wasn't my work that she had issue with. Which basically means she hated me for me being me. My ethnicity perhaps? For these reasons, I would not recommend ACM to young professionals from different ethnicity who hasn't yet build a tough skin. Also to the lady I met on the supermarket - No it wasn't the work at ACM that I found overwhelming, I reached a decision to leave because your chummy did not treat me well. I guess they will go with whatever suits their narrative but they know the truth and I know the truth and thats all matters. To those if you are suffering, leaving is really the best thing I did for myself and my mental health."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Many good people let down by one awful Chairman", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "5 Jul 2022", "job_title": "Education Professional in Guildford, England", "duration": "N/A", "pros": "1. I have been able to work alongside some wonderful people and have met some very talented students too.\r\n2. The part of the company I work in means I don’t have to work directly with the Chairman and sit in his meetings where he just talks at people every day about how they must try to get more students in to classrooms.", "cons": "1. Having to watch on when good colleagues are treated badly by the same person until they leave or are broken down and submit to him.\r\n2. It often feels like Staff wellbeing comes last here. Air con that doesn’t work. Holes in walls. Offices like building sites.\r\n3. High turnover of staff because of all of the above. The amount of money I spend on leaving gifts is becoming a joke these days."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "No Care for Staff or Students", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Apr 2022", "job_title": "Anonymous Employee in Guildford, England", "duration": "N/A", "pros": "Some good colleagues, if you know who to trust\r\nThere are some good facilities, which are managed and maintained poorly", "cons": "The CEO makes an effort to belittle and bully everyone he can\r\nThe exec team are terrified that the CEO will work out they have no idea what they are doing and so blame everyone else for their constant mistakes. \r\nThere is no trust to the staff to make their own decisions\r\nThe high level of micro managing makes it impossible to do your job\r\nThe expectations of your job change all of the time, and you're expected to know what they are without being given any warning.\r\nThe turnover of staff makes it impossible to get any work done to any high quality\r\nThere is no sense of job security, \"Fire Fridays\" were a common thing\r\nThey used the pandemic as an opportunity not to pay staff, and made no effort to look after them"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "People don't believe me when I attempt to explain this place", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Jul 2022", "job_title": "Anonymous Employee in Guildford, England", "duration": "N/A", "pros": "There are some fantastic people here. The technical staff will go above and beyond to help. Some tutors are super knowledgeable. Very lovely receptionists. Some fantastic students, who unfortunately don't deserve the lack of care they receive.", "cons": "It's ironic that the chairman wants to run a creative establishment but is only capable of destroying. Literally everything he touches turns to ruin. He is incapable of finishing anything. From door frames to strategies. This man is only able to lie, cheat and make money. Which is much easier than actually caring about people. \r\n\r\nThe culture at this place is in its nature setting you up to fail. It's all fault blaming, finger pointing and people working for their own agenda. \r\n\r\nIf the managers ever give you an inch and show they like you, it's just a matter of time. You'll make a \"mistake\" and they will hold you personally accountable for it. And my god, you will know they no longer like you. The ad hominem attacks, the ignoring, the extra workload. Literally, anything to make you quit. It is the most ridiculous place I've ever worked. ANYONE who has ever been the chairmans favourite, has been fired right after as he is incapable of maintaining any form of human relationship. He is like the kid in school who no one wants to play football with....But he owns the ball so you have to."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Please take these reviews seriously and protect your own wellbeing.", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 Jul 2022", "job_title": "Lecturer in Guildford, England", "duration": "N/A", "pros": "Only one - the non-executive staff are very skilled, knowledgeable, and kind.", "cons": "- Company-wide culture of fear and anxiety. No one feels safe in their job and if you spend at least 5 minutes talking to any member of staff, they will tell you their own horror stories, and some of them are truly shocking. \r\n- Pay is inconsistent and you will spend the days before payday trying to figure out if you have enough money for the month despite working hard and long hours. \r\n- HR department seems to be non-existent, but if they do exist, they are not there to support employees. Feels like the chairman is standing behind them in any meeting or discussion. \r\n- The chairman is very disappointing and runs the place like he's never met another human being before. The place is run like a business rather than educational institute, however the chairman seems to have no idea how to run a business. \r\n- People seem to fall uphill here all the time - people walk into high paying roles with no experience in the role, and this impacts everyone negatively as no one at the executive level seems to know what they are doing. \r\n- No communication at all between managers and their staff, huge changes happen seemingly on a whim and no one knows until the last minute.\r\n- God forbid you cross the chairman and his ego - if he feels you have stepped out of line, your professional life will be made hell until you leave. Tutors don't get fired, but they will be pushed to the ends of their limits until they lose spirit and leave of their own accord.\r\n- Turnover of staff is astounding, at least 10 people have left within the past 1 month period alone. \r\n- Big promises are made to students and staff and they are not delivered, I feel dreadful for the students who are promised the world during open days, but as soon as they agree to come to study here, they become a bag of money to rinse as much as possible. \r\n- Staff regularly made to do work outside of their role and contract (if they have one) which they are not trained for, and if they get anything wrong here they will be belittled and bullied. \r\n- Higher Education benchmarks and REF don't seem to be very important or focused on, in my experience I haven't had more than one conversation with a fellow employee about these topics. There is no appreciation for excellence in teaching, the best teachers and tutors leave as they are not empowered at all in their skills. \r\n- Zero-hour contracts are not only commonplace, but seem to be the majority. This may seem better than nothing if you are desperate for a job, but these hours can be stripped from you at an instance if you rub anyone up the wrong way. Don't walk, run from these kinds of contracts. \r\nOverall the place is run like a pyramid scheme, and if you care about students and teaching, this place will ruin that care and passion. The chairman is quite frankly unhinged and incapable of running such a large scale operation. It is a shame that he feels the need to be so unkind and lacks basic empathy, and I hope one day he will reflect on why he is this way for his own sake. \r\nI personally thought all these reviews were over-dramatic when I joined, but I was proved wrong within months. It is truly a miracle to me that this place is still running, there are a great deal of unethical practises and the culture is thick with anxiety amongst all staff. \r\nLastly, if you are still not sure if you should take these reviews seriously - there are a number of positive ones, but look closely at the dates of them. All the clusters of positive reviews here have been done on the same day, and this is likely not a coincidence - if I were the chairman I too would worry about the low scores and perhaps 'encourage' staff to post glowing reviews, regardless of the lies within them."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Jun 2022", "job_title": "Mentor in London, England", "duration": "N/A", "pros": "I have been with ACM for 3 years now. I only intended to stay for 1. Seeing the growth and transformation in the students has been very satisfying for me. Not only that but the growth in the company. ACM prides itself in putting together a whole network to support its students. I'm happy to be a part of that. Really making a change and positive impact on young people's lives is how we better our future.", "cons": "i can't think of any"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "DO NOT WORK HERE!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "13 Jul 2022", "job_title": "Academic Tutor in Clapham, London, England", "duration": "N/A", "pros": "Those doing the actual teaching and support staff are passionate and care about their work, and are some of the nicest people you will meet.", "cons": "DO NOT WORK HERE\r\nIf you value your own self respect, if you value education, if you value healthy work environments, you should avoid ACM and run for the hills. \r\n\r\nACM is a money generator for the chairman masquerading as a University. Very similar to a pyramid scheme. \r\nMany members of staff are current or Ex-Students and are used as cheap labour.\r\nStudents are viewed as money bags rather than actual human beings.\r\n\r\nChairman attempts to micromanage every element every element of the University and does not trust his staff to get on with their jobs. \r\n\r\nIn the last year alone: \r\n\r\nThe chairman has demanded lengthy documents, including proposals for ideas to support his vision, and then never read them\r\n\r\nPromised full time contracts to members of staff working full time hours, however struggling unpaid through holiday periods. Where there's a lot of prep work and additional work to do.\r\n\r\nTurned teaching members of staff into essentially a call centre, spamming prospective students with phone calls, text messages and marketing messages. \r\n\r\nAs part of seeking to get a full time contract, a target of a number of prospective students was set to get them to accept their UCAS offers. This target was then changed and increased after the target was hit. \r\n\r\nThe future of my job as an educator was determined by my ability to do marketing NOT my ability for excellent teaching and learning.\r\nNever once was education or good teaching practises brought up, and it is clear that education is NOT valued at ACM.\r\n\r\nPlease pay attention to the negative reviews on here. I didn’t when I joined, I thought people were just bitter after leaving and said to myself “How bad can it really be?” \r\nIn truth, Everything you read here on the negative reviews is 100% true. You may be desperate for a job like I was when I joined, please hold out longer for a job and a workplace who will value you for your skills.\r\n\r\nPlease note that many positive reviews on here read as marketing spiel.\r\nThe chairman is “dynamic and charismatic” that is how he has managed to pull the wool over so many prospective students and parents eyes during open days etc."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Great tutors", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "17 Jul 2022", "job_title": "Tutor in Guildford, England", "duration": "N/A", "pros": "A Great team of teachers", "cons": "The Pay is too low and no pay through holidays"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Save your mental health; run, don't walk from this place.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "21 Mar 2021", "job_title": "Team Leader in Guildford, England", "duration": "N/A", "pros": "Creative envionment, some great staff members", "cons": "Toxic work culture, some back-stabbing staff members, CEO get a kick out of setting people up to fail. Culture of blame, total lack of accountabiluty at the top - it's *always* someone else's fault and god help you if the CEO decides it's yours.\r\n\r\nRampant dishonesty and manipulation of image - for example; the three postive / neutral reviews on here dated 21st May 2019? Left by staff after management deposited a box of doughnuts in the main office and told staff they could have them if they left positive feedback on here.\r\n\r\nCEO seems to think that a staff turnover of over 100% in the last 2 years is an indicator of good management and happily boasts about firing people, which is an almighty red flag.\r\n\r\nThere is constant change, it's never allowed to bed in before Executive decide to throw it all up in the air again. Ignore whatever they say , it's not stopped changing since the CEO took over 5, 6 years ago and *it will never stop changing* -unless the CEO changes.\r\n\r\nCEO loves to demand complex, lengthy reports from people that he never reads...\r\n\r\nWhen staff get other job offers, executive frequently lure them to stay on with all sorts of promises that they invariably renege on once the threat of the other job offer has passed.\r\n\r\nNeither staff nor students are valued; the only care the executive has is for money.\r\n\r\nI have seen confident, positive happy people reduced to tears and verging on mental breakdowns working here. As one colleague put it '6 months to crush a soul'. Don't do it.\r\n\r\nThe review dated 26th January says it best."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "It’s a place to work, I guess.", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "25 Dec 2021", "job_title": "Lecturer in London, England", "duration": "N/A", "pros": "Other tutors and staff work incredibly hard.", "cons": "Very long working hours, that exceed contracted time."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Bad working environment", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 May 2021", "job_title": "Marketing in Guildford, England", "duration": "N/A", "pros": "Lovely lecturers and receptionists/front of house staff", "cons": "Really bad management, blaming culture, high turnover, ego-centric CEO who bullies staff and fires them whenever he feels like it. His directors just say “yes” and nod to keep their big jobs. Blaming others is a norm at ACM and making people feel so low. Bad HR department. Not a professional organisation. They use sticky tape to cover the big cracks."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Two-tier company with a sociopathic and unhinged chairman - avoid!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "23 Apr 2021", "job_title": "Anonymous in Guildford, England", "duration": "N/A", "pros": "Remote working is a plus + the people I worked with were lovely.", "cons": "A horrendous two-tier business with exec staff and no middle management.\r\n\r\nNo performance reviews or probation reviews during my time.\r\n\r\nChairman is impossible to work with - sociopathic, reactive, unhinged, impulsive, and regularly fires people at will. Staff turnover is shocking.\r\n\r\nConstant construction work going on throughout my whole time at ACM within the building. No care for health and safety with doorways blocked, and constant drilling sounds."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Do not work here", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Mar 2021", "job_title": "Anonymous Employee in Guildford, England", "duration": "N/A", "pros": "Not many I can recall.", "cons": "The upper managers and some office staff are bullies, they promise you things to keep you quiet. I experienced bullying throughout my whole time there with no support or help. When I disclosed suicidal ideation to my bosses they didn't put in any crisis plans or support plans for me. This company also fabricated reasons to dismiss me because I would speak out and question their decisions when exploiting students. I am so relieved that I do not work there anymore. Do not work here."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Great colleagues", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "13 Jun 2021", "job_title": "Lecturer in Guildford, England", "duration": "N/A", "pros": "The staff are great and professional", "cons": "The directorate are motivated by profit"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Applicant advisor", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Apr 2021", "job_title": "Anonymous Employee in Guildford, England", "duration": "N/A", "pros": "Lovely creative people trying their best.", "cons": "Management a complete shambles trying to please an ego maniac owner."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Exciting time to join", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 May 2019", "job_title": "Executive Projects Officer in Guildford, England", "duration": "N/A", "pros": "ACM offers a unique working environment in terms of the challenges it presents and the opportunities therein. A structured and accountable education enterprise within the creative sector gives the best & worst of both worlds, but ACM seem to have mastered it with their medium/long term plans.\r\nAs an employee you are encouraged to think outside the box and challenge things, get involved in different areas of the business and get stuck in to passion projects.\r\nThey are unapologetic in that the student comes first, and refreshingly open and honest about the challenges they face as an organisation and the movement within the industry (both education and creative!). It's very much a time of change for the sector and the company on the back of astronomical growth since its foundation, and I'd highly recommend working here.", "cons": "Parking isn't fantastic but that's more of a Guildford thing. Public transport links are fantastic locally. Office refurbishment is underway but will be great when it's done!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Lecturer", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Jun 2018", "job_title": "Lecturer in Guildford, England", "duration": "N/A", "pros": "the tutors and other staff such as student services, SPOs, facilities and reception are talented, supportive and great to work with.", "cons": "The management and particularly senior management can apply bullying tactics if they start feeling like you are complaining about issues. There is no autonomy which is destructive for a creative industries college. They do not value their workers and are mainly focused on quantity of students rather then quality of education. There is a lot of potential however the style of management is driven by convergent thinking and factory style focus of skills. When I started, I was in love with the energy and possibility of realising ideas. After a year, it became apparent that the potential could never be realised as the style of management is in constant crisis mode and the knock effect of this ripples through every element of the business, ultimately unfair to the students as well as the staff and the overall wellbeing of all."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Getting Better", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 May 2019", "job_title": "Anonymous in Guildford, England", "duration": "N/A", "pros": "I have worked at ACM for more than 3 years now and have met some amazing co workers during my time here. There is a great energy here and a lot of talented people. I have seen loads of improvement in the years I have been here and I believe there is more to come.\r\n\r\nI have found opportunity to grow within the company and have been shown the support to do so from management and I believe that there is a great potential for the company going forward. It seems that more recently there are efforts being made to better communicate between departments and start the company working as a whole instead of siloed teams.", "cons": "Lack of communication in the past has led to some resentment building among some employees and confusion of how to execute tasks and projects. It is sometimes unclear who is leading on a project and thing can devolve into chaos if communication between departments isn't clear. That being said, I do think there are motions being taken to improve this for the future.\r\n\r\nI think the curriculum could be improved vastly. There does not seem to be a cohesive learning plan for the courses that tutors, both sessional and full-time, can work to. \r\n\r\nThere is also a huge divide between teams and leadership without management in the middle to oversee project execution. This has resulted in projects taking longer than usual and further confusion as to who is leading it and what everybody's role is."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Fast Moving and Rewarding", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "21 May 2019", "job_title": "Anonymous Employee in Guildford, England", "duration": "N/A", "pros": "Working here is fun if you love what you do and love variety in your day.  ACM moves at a million miles an hour and its product is top notch.  It is kept fresh by constant innovation and there is a strong culture of change, here.", "cons": "The pace of work isn't for everybody, and if you don't like change, this isn't the place for you either."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great people and great atmosphere", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 May 2019", "job_title": "Applicant Advisor in Guildford, England", "duration": "N/A", "pros": "Great place to work, amazing people and great atmosphere. I've been here just over a month and I've settled in great. The people are so lovely, the training is fantastic and I'm enjoying everyday.", "cons": "Storage facilities are too small for the amount of event gear we hold so makes finding stuff a bit of a pain."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "it's neutral", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Apr 2018", "job_title": "Lecturer in Guildford, England", "duration": "N/A", "pros": "Tutors are very talented and supportive and great to work with", "cons": "Too much change makes a de-stablising place to work"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Review", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 Sept 2018", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Some very talented musicians.   Guildford is a nice place to work.", "cons": "No leadership.  Poor communication.  Run by people with no substantial  knowledge of education.  Too many cooks."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Challenging", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "10 Jun 2019", "job_title": "Principal in Guildford, England", "duration": "N/A", "pros": "Wonderful environment, terrific students and an excellent team of tutors", "cons": "Very badly organised, no devolution of decision making, limited strategy and poor people management at the highest level. Good staff tend to leave, weaker staff tend to stay."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Awful", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "17 Jun 2019", "job_title": "Anonymous Employee in Guildford, England", "duration": "N/A", "pros": "There are no pros in this company", "cons": "It’s completely  unprofessional and run by people that don’t value music or education."}]]