[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Team work and emplyee welfare was key", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 May 2020", "job_title": "Accountant in Tamale", "duration": "N/A", "pros": "Timely reporting culture and best goal delivery", "cons": "projects were short in nature"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Dire Company. Don't listen to the marketing it's a sham of a company.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Feb 2023", "job_title": "Manager in Woe", "duration": "N/A", "pros": "Some great people. Flexible (but only when it suits them)", "cons": "Toxic Clueless Senior leadership team. Senior Managers from retail and energy backgrounds without a clue when it comes to maintenance and property repairs. They have no grip on reality. Too many' Yes' men at the top who are all afraid to challenge each other. Poor HR allowing Nepotism to thrive. Jobs for their mates. Remove cars from middle management as they didn't want them to be a status symbol yet Senior leaders all driving round in Teslas. Hypocrits. No respect of middle management. Steer clear of this company for your own mental wellbeing. They only look after the engineers and that's because they struggle to employ them. Great places to work...talk about a joke.They hound everyone to fill it in until they get their results. A sham and a scam of a company. Company has got too big and doesn't have the infrastructure to support it. They give jobs to their favourites without advertising when it suits them. Then others have to jump through hoops to get a role. No consistency and HR know about it. Shocking. I could go on and on."}]]