[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Excellent company, caring employers, with a  fabulous workforce and wonderful services", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "26 Jul 2018", "job_title": "Manager in Peterborough, England", "duration": "N/A", "pros": "Fabulous employees, everyone so welcoming and approachable from top down. The Charity has great vision and really knows how to support one another and members. \r\nWould highly recommend for those that want to make a real difference in society, doesn't matter which area you work everyone's values and beliefs are the same - to Help!! Love working here!!", "cons": "Don't think I've found any so far!!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Meaningful and rewarding", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Jun 2017", "job_title": "Senior Community Engagement Officer in London, England", "duration": "N/A", "pros": "I do not see it as a job I see it as an opportunity to help people and make a difference to other people's lives. The organisation really support their team and everyone is important regardless of position. We have opportunities to better ourselves and rewards such as perkbox we also have the option and support to opt in the savings fund and for childcare vouchers", "cons": "The only down side is our positions are projects so we are only employed on a short term contract which can be worrying and may put people off applying but on a better note it keeps us working hard and wanting to reach above our targets so that we are team players and all working towards the same goal"}]]