[[{"date": "17 Aug 2022", "title": "Registered Nurse Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Confluence Health (Wenatchee, WA) in Aug 2022", "Interview Descriptions": "very efficient, behavioral based questions that I found to be fair and pertain to the role you are applying for.  approximately took 45 minutes total. panel style interview. they include employees in the panel interview that are currently in the role or who you will be closing working with.", "Interview Questions": "tell use about a time where you didn't have to tools to complete a task and how did you overcome that challenge? \n"}, {"date": "6 Oct 2021", "title": "Covid Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Confluence Health", "Interview Descriptions": "Asked about my experience with health care and If I'm willing to be vaccinated. The process was easy and quick. Asked if I was willing to be on my feet for an extended period of time.", "Interview Questions": "Asked me questions regarding contact with covid patients and confidentiality. "}, {"date": "16 Jan 2021", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Confluence Health", "Interview Descriptions": "Two person interview, very formal. Asked questions back and forth over a interview guide. Simple questions about work history, skills and how you handle situations. They also have a recruiter who sets everything up for you.", "Interview Questions": "What is your experience with jobs like this? "}, {"date": "27 Oct 2020", "title": "Housekeeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Confluence Health", "Interview Descriptions": "Behavioral based question, come prepared write down examples, very easy and straight forward. They are very nice and understanding. Got the job the following week. Enjoy working at confluence health", "Interview Questions": "A mistake you learned from"}, {"date": "22 Oct 2020", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Confluence Health", "Interview Descriptions": "I applied online and received a call for in person interview a week later. Went to into was asked a series of questions then was asked if I had any questions.", "Interview Questions": "What does good attendance look like to you?"}, {"date": "10 Oct 2020", "title": "IT Solutions Tech I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Confluence Health (Wenatchee, WA)", "Interview Descriptions": "- Phone call with HR Representative covering experience and availability. \r\n\r\n- Phone call with hiring manager covering experience and details of position. \r\n\r\n- On-site interview with panel consisting of several behavioral and hypothetical questions.", "Interview Questions": "Tell us about a time when you had to make a quick decision and gather a lot of information in a small amount of time. "}, {"date": "5 Feb 2021", "title": "Food Service Worker III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Confluence Health in Sept 2020", "Interview Descriptions": "I waited in the cafeteria. The interviewer came in and took me to a conference room where the interview was held. It was professional, quick, and efficient. The questions were well organized. Mostly behavior based questions.", "Interview Questions": "One question: Tell me about yourself "}, {"date": "9 Aug 2021", "title": "Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Confluence Health (Wenatchee, WA) in Aug 2020", "Interview Descriptions": "It was a panel interview with a lot of behavioral and experience-based questions. After that they showed the facility to meet the staff and the area. All in all a pleasant experience.", "Interview Questions": "Q. Describe a stressful moment for you in your last job?\nQ. Why Confluence and why this job?"}, {"date": "21 Aug 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Confluence Health in Jan 2019", "Interview Descriptions": "About an hour long. Had a great time. Easiest interview I’ve ever had. Got along well with hiring manager. Made things very comfortable for me. Allowed me to come back to questions that I stumbled on.", "Interview Questions": "Tell me a time when you were wrong about something and had to make it right. "}, {"date": "12 Feb 2017", "title": "Graphic Designer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Confluence Health", "Interview Descriptions": "I applied online and it took over 5 months to hear back which seemed strange since the position was being actively advertised when I originally applied. I then went through two rounds of interviews. The first was with a general HR person and the second was immediately after that with the Marketing Director. I didn't go in expecting the second interview and felt unprepared as a result. I received an impersonal response via email a few days later. I was really very interested in a career with Confluence and would have greatly appreciated the opportunity to ask how I could have been a stronger candidate. I know people who work at the hospital, but didn't use that network. I think that would have been helpful in this circumstance.", "Interview Questions": "Describe your creative process."}], [{"date": "8 Sept 2016", "title": "Senior IT Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Confluence Health (Wenatchee, WA) in Aug 2016", "Interview Descriptions": "Progressive, with initial screening interview and second phone interview with Department leadership team. Third level was onsite, where process broke down. Significant travel required to meet teams onsite. Incorrect logistics with lodging, interview locations and pre-paid expenses. Hiring director was on vacation during site visit and outgoing manager was allowed to lead the process. Because of this dynamic, behavior in her interviews was unprofessional. There were obvious issues with the outgoing manager and her teams.", "Interview Questions": "What are 5 adjectives that describe you?"}, {"date": "21 Jan 2017", "title": "Organizational Development Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Confluence Health (Wenatchee, WA) in Jun 2016", "Interview Descriptions": "Contacted out of the blue for a telephone interview, waited a month to schedule a in-person interview which did not happen even though it was implied. Sent in a completed application after the interview for compliance. The recruiter was nice even though they hired an internal candidate.", "Interview Questions": "What are your strengths? Does this salary meet your needs? "}]]