[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Giving the beautiful gift of sight.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Dec 2018", "job_title": "Creative Specialist in New York, NY", "duration": "N/A", "pros": "I have worked in advertising my entire professional career at some of the biggest agencies in country. I have only worked here for a year now, but I have never been so proud to be affiliated with any company that I have created advertising for as I am for the Eye-Bank. Eye, organ and tissue donation is the one of the most selfless acts that a human being can bestow upon another person on this planet. I am so proud to work here. It is a very tightly run ship with a great mix of young and older people. We take what we do here very seriously, we are a not-for-profit, so we have a responsibility to spend donations very wisely. I am not a manager, just happy to be helping people that are blind see again by getting the word out about cornea donation. Many people have worked here for a very, very long time. That should tell you everything you need to know. I love telling people what we do here. Better than hawking Coke or Pepsi like I used to do.", "cons": "The only con for me is that I live way out in Suffolk county. So getting into the city is a bit of a schlep... other than that, I am very pleased."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Most terrible place I've ever worked", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "11 Feb 2022", "job_title": "Technician in New York, NY", "duration": "N/A", "pros": "There's a differential for working evenings and overnights.", "cons": "This place is absolutely awful! I even think one star is generous! On-calls are mandatory and management will assign them when they are short staffed and write you up if you don't take it and show up. My manager would also call me out of my lunch to go on donors and tell me that I had to clock back in and go, absolutely disrespectful! I worked 20+ hour shifts without a break because they would give me 12 hr shifts on days that I was already working 8 hours and they would schedule them in a way that they were back to back so that I worked 20 hours non-stop. I even lost 25 pounds while doing this job because I couldn't even take breaks to eat. I complained to HR about all of this and they didn't even acknowledge my email. Interactions with upper management are passive aggressive and they lack communication skills. They are always short staffed because they can never fill all positions because the techs keep leaving and they expect the staff that stays behind to fulfill every case that comes in.\r\n\r\nThe turnover is quite high and management refuses to change their company culture."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "AVOID", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 May 2022", "job_title": "Laboratory Technician in New York, NY", "duration": "N/A", "pros": "Their benefits are pretty ok.", "cons": "AVOID THIS PLACE. This place was by far the most toxic, gross, and disorganised workplace I have ever worked in. Management and HR in this job do not appreciate employees. They only complain and reprimand them, while sometimes even docking pay or holidays. You will be FORCED to work on-call shifts on weekends (day or night) and you will be FORCED to stay at work beyond your agreed schedule. \r\n\r\nThe role involves cutting eyes out of dead people. Sometimes after you drive 2 hours to recover eyes, you are told that they are not suitable and cannot be used. The cars used after cutting dead people's eyes are never cleaned and smell awful. Their systems are out of date and inefficient. All they do is pick up on your mistakes and they never reward dedication to the job. Like I said, AVOID at all costs."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Great practice but needs work", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "6 Aug 2021", "job_title": "Human Resources Manager in New York, NY", "duration": "N/A", "pros": "The overall practice as a non-profit was great to work towards", "cons": "Management could have been better dealing with overall culture and employee relations."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "-", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Apr 2021", "job_title": "Lab Technician in New York, NY", "duration": "N/A", "pros": "Good mission statement and unique field", "cons": "——- ——- ——- ——- ——— ———"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Emotional and unstable leadership", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "7 Mar 2017", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "location in city, benefit cafeteria plan", "cons": "Bigotry and cultural insensitivity; Narcissistic and emotionally unstable leadership; sub-par and intimidating management style awarded by executive leadership; Low compensation; lack of recognition and acknowledgement; nepotism; unequal hiring and promotion culture; Secretive, backstabbing and non-social office culture; poor board involvement; poor board review of organization, leadership and staff; Instead of investigation, the board turns heads; crossed and broke various employee rights; right-wing opinionated office culture; female leadership that awards males; leadership encourages office debacle and turning staff against one another"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Heed these Glassdoor warnings", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Jun 2017", "job_title": "Laboratory Technician in New York, NY", "duration": "N/A", "pros": "Not many. The location is close to many major transit lines. The benefits are good for those who are actually able to stay at the company for a while.", "cons": "Let me start by stating that whomever is reading this right now should heed these Glassdoor reviews. I ignored them thinking that it was just disgruntled employees who had personal issues with management. Upon working there for about 3 days, I realized that everything that I had read was true.\r\n\r\nManagement staff is extremely egotistical. They frequently go off the deep end when their egos are challenged and publicly and/or privately shame the employees who challenge them. They have yelled and cussed at employees. They’ve made rude and insensitive comments about people’s weight, lunch choices, clothing, etc. And the HR department may as well not exist. There is an incredibly high turnover rate, especially for laboratory staff. There is constant criticism about the management’s conduct and yet, they refuse to believe that any issues are in response to their actions. They have even tried to blame a laboratory employee for spreading “discontent” and implied that he was culpable for the high turnover rate.\r\n\r\nThere is an incredible lack of transparency. Many decisions or changes are made without any regard to the wellbeing of the employees and are thrust on the staff in the most inconvenient and inappropriate ways.\r\n\r\nThe position is stressful in itself, but paired with all of the extra hours demanded and the fact that management is ALWAYS insinuating that the staff is indolent or lazy makes this position unbearable to anyone with self-respect. Upward mobility is almost nonexistent. Compensation is extremely inconsistent and based on favoritism and other cultural biases. They hire people who don’t know any better and low-ball them in their offers. \r\n\r\nThere is a cultural insensitivity that permeates the office and intimidation is the only “motivating” tool of management staff. Reporting to HR is like speaking to a wall. The board of directors is only responsive when there are issues with the amount of money the Eye Bank brings in. Any other situation and you’re on your own."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Surprised by other reviews", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "27 Jun 2017", "job_title": "Director of Development in New York, NY", "duration": "N/A", "pros": "I worked in a senior position for over five years and enjoyed the collaborative leadership style.  There was no micro management and my supervisor (ED) welcomed my opinion and feedback. I had excellent working relationships with my peers and it was a positive work experience.", "cons": "There were no major cons for me."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Recent College Graduates Beware", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Dec 2019", "job_title": "Laboratory Technician III in New York, NY", "duration": "N/A", "pros": "The only pros of the eye bank are the fellow Lab Technicians. As a community, they make sure to look out for and support each other when having to deal with the abusive management. The technicians consists of a group of very wholesome and friendly individuals who I was lucky enough to consider as friends.\r\n\r\nTo be fair, I definitely gained a good deal of technical experience at EBSR, however this is not a place anyone should remain an employee.", "cons": "This job consists of cutting eyeballs out of dead people. The fact that the management at EBSR is worse than having to manhandle a smelly corpse in a dark, drippy morgue is so sad its laughable.\r\n\r\nThe managers at EBSR are in a perpetual, petty spat against each other, with each department pitting their employees against the other's. When the managers are not attempting to use their employees as pawns in the company politics of a tiny, disorganized non-profit, they are using their own department's employees as scapegoats for their own mistakes.\r\n\r\nWhile there are a myriad of anecdotes I could tell you to give you a clear insight to this company, only one needs to be shared. This is what made me quit the Eye-Bank for Sight Restoration:\r\n\r\nOne night, during my lunch break, my manager calls me to let me know she needed me to recover a pair of corneas from a hospital in Westchester, NY. This particular night was that of a blizzard. The mayor of NYC had declared a state of emergency, advising people to stay off the roads at all costs. Looking at the FDR drive from the EBSR office windows, I could see cars with their hazard lights on, struggling as they slipped and slid across the highway.\r\n\r\nSimply put, I did not feel safe being on the road, even with the option of a car service to drive me and pick me up. When I expressed this concern for my own safety to my manager, she angrily expressed that she was the judge of my safety, not myself. I refused to go recover the corneas, which I was right to do. \r\n\r\nThe technician that went in my place took over 3 hours to make the normally 1 hour drive. This is due to the fact that he had to drive uphill through icy side roads, as the the highways were being shut down. Not only did he have to deal with these horrid conditions, but he was driving over ACTIVE POWER LINES. He expressed this to my manager, who told him she was glad I did not go, as I was still a novice driver. To top it all off, the pair of corneas my coworker risked his life to get were improperly screened by the EBSR, as they turned out to be septic and un-useable.\r\n\r\nDue to the fact that my manager had screamingly threatened me with a firing, in the middle of my lunch break nonetheless, I took the issue to HR.\r\n\r\nHR took some notes on what happened and told me he would follow up. Two days later I am pulled into a meeting with HR and two of my managers. They wanted me to sign an admission of insubordination which would make me lose 2 of my hard-earned vacation days. They claimed this was due to a refusal to work overtime, completely ignoring the physical risk they put their own employees through. \r\n\r\nThis was ridiculous cover-up, as I was consistently racking up overtime hours every week, which many times you have to fight payroll to get paid in full. After contesting their claims and refusing to sign the document, the HR representative began yelling at me at the top of his lungs. I quit on the spot.\r\n\r\nEBSR has a very nasty habit of hiring recent college grads and trying to convince them that their abusive, unprofessional, and disorganized ways of running the company are normal in the \"real world\". The amount of times I have been discriminated against as \"young and naive\" are too many to count.\r\n\r\nQuitting this place was the best thing I ever did for myself. Don't make the same mistake that I did. I was better off unemployed. Thankfully, the day after I quit I got an offer for my current job, with a fantastic manager, and higher pay."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Rewarding work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Oct 2017", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "It's rewarding to be part of an organization that has been dedicated to restoring sight since it's inception in 1944.  I find a deep commitment to this core mission among staff, starting at the top with our CEO.  My experiences to date have been positive and it's gratifying to do work that makes a difference.", "cons": "There are no major cons to share."}], []][[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Giving the beautiful gift of sight.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Dec 2018", "job_title": "Creative Specialist in New York, NY", "duration": "N/A", "pros": "I have worked in advertising my entire professional career at some of the biggest agencies in country. I have only worked here for a year now, but I have never been so proud to be affiliated with any company that I have created advertising for as I am for the Eye-Bank. Eye, organ and tissue donation is the one of the most selfless acts that a human being can bestow upon another person on this planet. I am so proud to work here. It is a very tightly run ship with a great mix of young and older people. We take what we do here very seriously, we are a not-for-profit, so we have a responsibility to spend donations very wisely. I am not a manager, just happy to be helping people that are blind see again by getting the word out about cornea donation. Many people have worked here for a very, very long time. That should tell you everything you need to know. I love telling people what we do here. Better than hawking Coke or Pepsi like I used to do.", "cons": "The only con for me is that I live way out in Suffolk county. So getting into the city is a bit of a schlep... other than that, I am very pleased."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Most terrible place I've ever worked", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "11 Feb 2022", "job_title": "Technician in New York, NY", "duration": "N/A", "pros": "There's a differential for working evenings and overnights.", "cons": "This place is absolutely awful! I even think one star is generous! On-calls are mandatory and management will assign them when they are short staffed and write you up if you don't take it and show up. My manager would also call me out of my lunch to go on donors and tell me that I had to clock back in and go, absolutely disrespectful! I worked 20+ hour shifts without a break because they would give me 12 hr shifts on days that I was already working 8 hours and they would schedule them in a way that they were back to back so that I worked 20 hours non-stop. I even lost 25 pounds while doing this job because I couldn't even take breaks to eat. I complained to HR about all of this and they didn't even acknowledge my email. Interactions with upper management are passive aggressive and they lack communication skills. They are always short staffed because they can never fill all positions because the techs keep leaving and they expect the staff that stays behind to fulfill every case that comes in.\r\n\r\nThe turnover is quite high and management refuses to change their company culture."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "AVOID", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 May 2022", "job_title": "Laboratory Technician in New York, NY", "duration": "N/A", "pros": "Their benefits are pretty ok.", "cons": "AVOID THIS PLACE. This place was by far the most toxic, gross, and disorganised workplace I have ever worked in. Management and HR in this job do not appreciate employees. They only complain and reprimand them, while sometimes even docking pay or holidays. You will be FORCED to work on-call shifts on weekends (day or night) and you will be FORCED to stay at work beyond your agreed schedule. \r\n\r\nThe role involves cutting eyes out of dead people. Sometimes after you drive 2 hours to recover eyes, you are told that they are not suitable and cannot be used. The cars used after cutting dead people's eyes are never cleaned and smell awful. Their systems are out of date and inefficient. All they do is pick up on your mistakes and they never reward dedication to the job. Like I said, AVOID at all costs."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Great practice but needs work", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "6 Aug 2021", "job_title": "Human Resources Manager in New York, NY", "duration": "N/A", "pros": "The overall practice as a non-profit was great to work towards", "cons": "Management could have been better dealing with overall culture and employee relations."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "-", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Apr 2021", "job_title": "Lab Technician in New York, NY", "duration": "N/A", "pros": "Good mission statement and unique field", "cons": "——- ——- ——- ——- ——— ———"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Emotional and unstable leadership", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "7 Mar 2017", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "location in city, benefit cafeteria plan", "cons": "Bigotry and cultural insensitivity; Narcissistic and emotionally unstable leadership; sub-par and intimidating management style awarded by executive leadership; Low compensation; lack of recognition and acknowledgement; nepotism; unequal hiring and promotion culture; Secretive, backstabbing and non-social office culture; poor board involvement; poor board review of organization, leadership and staff; Instead of investigation, the board turns heads; crossed and broke various employee rights; right-wing opinionated office culture; female leadership that awards males; leadership encourages office debacle and turning staff against one another"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Heed these Glassdoor warnings", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Jun 2017", "job_title": "Laboratory Technician in Indianapolis, IN", "duration": "N/A", "pros": "Not many. The location is close to many major transit lines. The benefits are good for those who are actually able to stay at the company for a while.", "cons": "Let me start by stating that whomever is reading this right now should heed these Glassdoor reviews. I ignored them thinking that it was just disgruntled employees who had personal issues with management. Upon working there for about 3 days, I realized that everything that I had read was true.\r\n\r\nManagement staff is extremely egotistical. They frequently go off the deep end when their egos are challenged and publicly and/or privately shame the employees who challenge them. They have yelled and cussed at employees. They’ve made rude and insensitive comments about people’s weight, lunch choices, clothing, etc. And the HR department may as well not exist. There is an incredibly high turnover rate, especially for laboratory staff. There is constant criticism about the management’s conduct and yet, they refuse to believe that any issues are in response to their actions. They have even tried to blame a laboratory employee for spreading “discontent” and implied that he was culpable for the high turnover rate.\r\n\r\nThere is an incredible lack of transparency. Many decisions or changes are made without any regard to the wellbeing of the employees and are thrust on the staff in the most inconvenient and inappropriate ways.\r\n\r\nThe position is stressful in itself, but paired with all of the extra hours demanded and the fact that management is ALWAYS insinuating that the staff is indolent or lazy makes this position unbearable to anyone with self-respect. Upward mobility is almost nonexistent. Compensation is extremely inconsistent and based on favoritism and other cultural biases. They hire people who don’t know any better and low-ball them in their offers. \r\n\r\nThere is a cultural insensitivity that permeates the office and intimidation is the only “motivating” tool of management staff. Reporting to HR is like speaking to a wall. The board of directors is only responsive when there are issues with the amount of money the Eye Bank brings in. Any other situation and you’re on your own."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Surprised by other reviews", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "27 Jun 2017", "job_title": "Director of Development in New York, NY", "duration": "N/A", "pros": "I worked in a senior position for over five years and enjoyed the collaborative leadership style.  There was no micro management and my supervisor (ED) welcomed my opinion and feedback. I had excellent working relationships with my peers and it was a positive work experience.", "cons": "There were no major cons for me."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Recent College Graduates Beware", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Dec 2019", "job_title": "Laboratory Technician III in Greenville, SC", "duration": "N/A", "pros": "The only pros of the eye bank are the fellow Lab Technicians. As a community, they make sure to look out for and support each other when having to deal with the abusive management. The technicians consists of a group of very wholesome and friendly individuals who I was lucky enough to consider as friends.\r\n\r\nTo be fair, I definitely gained a good deal of technical experience at EBSR, however this is not a place anyone should remain an employee.", "cons": "This job consists of cutting eyeballs out of dead people. The fact that the management at EBSR is worse than having to manhandle a smelly corpse in a dark, drippy morgue is so sad its laughable.\r\n\r\nThe managers at EBSR are in a perpetual, petty spat against each other, with each department pitting their employees against the other's. When the managers are not attempting to use their employees as pawns in the company politics of a tiny, disorganized non-profit, they are using their own department's employees as scapegoats for their own mistakes.\r\n\r\nWhile there are a myriad of anecdotes I could tell you to give you a clear insight to this company, only one needs to be shared. This is what made me quit the Eye-Bank for Sight Restoration:\r\n\r\nOne night, during my lunch break, my manager calls me to let me know she needed me to recover a pair of corneas from a hospital in Westchester, NY. This particular night was that of a blizzard. The mayor of NYC had declared a state of emergency, advising people to stay off the roads at all costs. Looking at the FDR drive from the EBSR office windows, I could see cars with their hazard lights on, struggling as they slipped and slid across the highway.\r\n\r\nSimply put, I did not feel safe being on the road, even with the option of a car service to drive me and pick me up. When I expressed this concern for my own safety to my manager, she angrily expressed that she was the judge of my safety, not myself. I refused to go recover the corneas, which I was right to do. \r\n\r\nThe technician that went in my place took over 3 hours to make the normally 1 hour drive. This is due to the fact that he had to drive uphill through icy side roads, as the the highways were being shut down. Not only did he have to deal with these horrid conditions, but he was driving over ACTIVE POWER LINES. He expressed this to my manager, who told him she was glad I did not go, as I was still a novice driver. To top it all off, the pair of corneas my coworker risked his life to get were improperly screened by the EBSR, as they turned out to be septic and un-useable.\r\n\r\nDue to the fact that my manager had screamingly threatened me with a firing, in the middle of my lunch break nonetheless, I took the issue to HR.\r\n\r\nHR took some notes on what happened and told me he would follow up. Two days later I am pulled into a meeting with HR and two of my managers. They wanted me to sign an admission of insubordination which would make me lose 2 of my hard-earned vacation days. They claimed this was due to a refusal to work overtime, completely ignoring the physical risk they put their own employees through. \r\n\r\nThis was ridiculous cover-up, as I was consistently racking up overtime hours every week, which many times you have to fight payroll to get paid in full. After contesting their claims and refusing to sign the document, the HR representative began yelling at me at the top of his lungs. I quit on the spot.\r\n\r\nEBSR has a very nasty habit of hiring recent college grads and trying to convince them that their abusive, unprofessional, and disorganized ways of running the company are normal in the \"real world\". The amount of times I have been discriminated against as \"young and naive\" are too many to count.\r\n\r\nQuitting this place was the best thing I ever did for myself. Don't make the same mistake that I did. I was better off unemployed. Thankfully, the day after I quit I got an offer for my current job, with a fantastic manager, and higher pay."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Rewarding work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Oct 2017", "job_title": "Anonymous Employee in Charlotte, NC", "duration": "N/A", "pros": "It's rewarding to be part of an organization that has been dedicated to restoring sight since it's inception in 1944.  I find a deep commitment to this core mission among staff, starting at the top with our CEO.  My experiences to date have been positive and it's gratifying to do work that makes a difference.", "cons": "There are no major cons to share."}], []]