[[{"date": "19 Jun 2023", "title": "Psychology Adjunct Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at National University", "Interview Descriptions": "I received an email to set up a ZOOM interview with two professors. On the day of the interview the Zoom link didn't work (seemed it was canceled without me being told) (30 mins before hand)I reached out via email and phone to let them know. No reply and no follow-up afterwards.", "Interview Questions": "N/A"}, {"date": "4 Jun 2023", "title": "LXD Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National University", "Interview Descriptions": "There was a phone interview with the recruiter then within two weeks I had a Zoom interview with the management. Shortly after, I recieved a phone call about the job.", "Interview Questions": "They asked me about past experience and job details."}, {"date": "20 May 2023", "title": "Enrollment Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University", "Interview Descriptions": "Lots of behavioral questions that included questions about your experience doing work in past jobs like how you got along with others for example. They asked like 8 questions. It was pretty straightforward.", "Interview Questions": "Describe a time when you had a conflict with a Coworker? How did you resolve it?"}, {"date": "27 Feb 2023", "title": "Academic and Finance Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University", "Interview Descriptions": "Interview was solid. Lots of situational questions, like \"Tell me about a time when...\" Overall, the interview was not too hard, as long as you prepare all of your answers. They will be able to tell if you are not prepared.", "Interview Questions": "Tell me about a time when....?"}, {"date": "30 Mar 2023", "title": "Enrollment Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University (Boston, MA) in Feb 2023", "Interview Descriptions": "The interview started well. It was a panel interview, the two hiring managers keep going back and forth on \"building rapport\", one agreed I got it and the other flat out said no.", "Interview Questions": "Imagine a student reaching out to you, call them back and build \"rapport\", while get them to enroll"}, {"date": "17 Jan 2023", "title": "Librarian Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University", "Interview Descriptions": "Overall there are 3 interviews, that culminate in a final panel interview where you present a short project. Interview process was smooth, but HR never told me I didn't get the job. After after time in 3 interviews and creating a project, I would think they could email a standard rejection letter. I had to email them twice just to confirm I didn't get it. Finally, almost a month later, I got a vague response about the position being closed. Maybe that's a standard HR practice but it was disappointing.", "Interview Questions": "Three adjectives to describe yourself."}, {"date": "11 Jan 2023", "title": "Center Support Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University", "Interview Descriptions": "Basic situational and Behavorial questions, interviewers were nice and welcoming. It was a web video type of interview not in person. There were maybe five to seven questions total and the opportunity to ask any questions at the end of the interview.", "Interview Questions": "How I dealt with a difficult customer"}, {"date": "26 Jan 2023", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at National University (San Diego, CA) in Jan 2023", "Interview Descriptions": "A recruiter contacted me after seeing my application. We set up a phone call. He explained to me a bit about the University, possible pay, work schedule, etc. He then set up a Zoom interview that would take place a couple days later. I interviewed with two individuals both members of the Enrollment Advising team. They were super friendly and made me feel very comfortable. The interview took about 30 minutes.", "Interview Questions": "1. Tell us something about yourself that is not on your resume. 2. Why do you want to work as Enrollment Advisor/what do you know about the position. 3. Tell us about a time where you had a difficulty at your job and how you overcame it. 4. What would you do if you were failing to meet quotas for the month? 5. What motivates you in your choice of employment? 6. Tell us about your work day 7. Role play where I as an interviewer played an Enrollment Advisor talking to one of them as a student."}, {"date": "26 Dec 2022", "title": "Nursing Interview Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University", "Interview Descriptions": "15 minute, two people interview over zoom. Questions based on nursing roles, diversity, work history and different scenarios you may see. Know the difference between diversity and inclusion and what qualities are important to have to be a good nurse, and why do you want to be a nurse", "Interview Questions": "N/A"}, {"date": "21 Dec 2022", "title": "Careers Adviser Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University", "Interview Descriptions": "Short and sweet. HR was prompt and the zoom interview went well. It seemed like a good team to work with. I did not get an offer, but would apply again.", "Interview Questions": "How did you hear about national university?"}], [{"date": "3 Oct 2022", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at National University (Charlotte, NC) in Oct 2022", "Interview Descriptions": "Recruited called me and told me more about the job. He told me the salary, then asked if I wished to proceed with an interview. He also explained how the interview was going to go. ", "Interview Questions": "Tell us something that we can't see on your resume."}, {"date": "31 Aug 2022", "title": "Enrollment Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University", "Interview Descriptions": "This was my first negative experience interviewing with a company.  I worked with a recruiter and was given an interview immediately. This part was fine. However, during the interview, I was asked to do a roleplaying scenario. The recruiter did not prepare me for this, and the people interviewing me did not give me a script or time to prepare. (They said there was no expectation that I had to know all their programs, but it felt like a necessary component to doing the roleplay.) When they gave me their feedback, their responses seemed condescending as if I were a child and not a professional in my field. It was disrespectful.", "Interview Questions": "Someone is interested in applying. Call them to find out more information."}, {"date": "21 Aug 2022", "title": "Student Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University", "Interview Descriptions": "They had me interview with an internal candidate. It was so bizarre and off putting.  I had to listen to them talk about people they both knew.  Meanwhile, I have a great number of years in higher education that they weren’t very interested in.  Honestly, I’m not sure the favored candidate could have felt good about the experience either.  Is the idea that you are supposed to compete with your colleagues?", "Interview Questions": "What is good customer service"}, {"date": "3 Dec 2022", "title": "Career Advisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University in Aug 2022", "Interview Descriptions": "Absolutely awful interview. The manager was going to be new to the role and literally knew NOTHING about Career Services or it's important in student development. She was very arrogant and would NOT be a good manager in my opinion. The other individuals im the interview were very kind however but seemed newer to the university. I had 8+ years of Higher Education Career Services experience and was offered the role as THIRD SHIFT with a VERY low salary offer... it was a slap in the face and clear that this was not the place for me.", "Interview Questions": "Tell us about yourself Why are you interested in this role? Where do you see yourself in 5 years?"}, {"date": "2 Aug 2022", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National University", "Interview Descriptions": "Simple interview with basic questions. I recommend having back ground in customer service for this position.  Overall easy interview. Do some research on the college as well and you will be fine", "Interview Questions": "Tell me about yourself please"}, {"date": "20 Jul 2022", "title": "Writing Tutor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National University (Scottsdale, AZ) in Jun 2022", "Interview Descriptions": "It was an hour long interview on Zoom with 2 people. There was a pre-interview reviewing assignment and an on the spot reviewing exercise during the interview which was rushed. The interviews asked multiple part questions but moved on to other questions without allowing their questions to be addressed.", "Interview Questions": "Describe how you will help students complete their dissertations?"}, {"date": "31 Oct 2022", "title": "Training Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at National University in Jun 2022", "Interview Descriptions": "Phone screen Individual interview Group interview presentation Individual interview The people were nice, but the process was a mess. They disqualified me for asking for more then their limit. Then changed their minds. Then told me sorry for making it a messy process. Then literally never reach out again, not even a form email. After 4 interviews. Total waste of my time, and theirs. Disappointing, I thought they were a good community org.", "Interview Questions": "Prepared and shared a 30-minute presentation."}, {"date": "4 May 2022", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University", "Interview Descriptions": "Very pleasant and easy once scheduled on the phone. Much more discussion than probing question / answer. More an opportunity to share about me and learn about the interviewer. Don't sweat it, just be you and you will do fine.", "Interview Questions": "Asked about subject matter and teaching experience."}, {"date": "30 May 2022", "title": "Student Finance Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "The process took 1+ week. I interviewed at National University (New York, NY) in May 2022", "Interview Descriptions": "Started with a short phone call from a Talent Specialist. Ended up scheduling a Zoom meeting later that week. The call consisted with some of the same questions from the phone call plus some more in-depth questions.", "Interview Questions": "How well  do you handle change?"}, {"date": "10 Mar 2023", "title": "LMS Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at National University in May 2022", "Interview Descriptions": "First was a phone interview with recruiter, then a panel zoom interview. Some of the interview questions were extremely difficult multi-step behavioral questions that seemed more appropriate for a director or Sr. role, not entry level.", "Interview Questions": "Tell me about a time when you had to persuade management"}], [{"date": "27 Apr 2022", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at National University (San Diego, CA) in Apr 2022", "Interview Descriptions": "3 staff panel, asking questions and role play at the end on how you'd handle a phone call. First interview questions were with advisors and last with a supervisor so she could get a feel for what I could bring to the company.", "Interview Questions": "Don't recall all questions but about why you want to work in customer service, experience with meeting sale numbers, learning a new task."}, {"date": "1 Mar 2022", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at National University", "Interview Descriptions": "Seemed to be more intense than it needed to be. Made me feel like my role would have more worth in the company than it actually did. Also, no one else was dressed up for the interview.", "Interview Questions": "Tell me about yourself.\r\nTell me a time you worked with a difficult colleague/boss. "}, {"date": "8 Dec 2022", "title": "Enrollment Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University in Mar 2022", "Interview Descriptions": "First point of contact is the recruiter, next virtual interview with enrollment lead and director. Keep in mind this is a group interview setting, which might/might not be issue for some people. Overall the interview experience was a positive one. Heavy emphasis on customer service/call center skills, they say having a passion for Higher Education is important, but honestly, anyone in Higher Education might be disappointed if you accept this role. There's a required script to follow for all calls, and 2 hour \"talk time\" requirement. This position would be best suitable for those who come from a call center/customer service background.", "Interview Questions": "When have you had to learn something new and how long did it take you to learn that new process?"}, {"date": "23 Mar 2022", "title": "Upper Management Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at National University (Los Angeles, CA) in Feb 2022", "Interview Descriptions": "Had a phone screening interview first and it was followed by an interview with the hiring supervisor.  The supervisor liked me and said the next steps were meeting the team and then meeting with her supervisor (I believe the CMO).  \n\nDuring my group interview, I felt like some of the team members was asking questions that did not pertain to the role or was just trying to trip me.  Also, I offered my thoughts on diversity and it wasn't well received.  They took it as a threat.  I'm a person of color interviewing with a group of white people.  \n\nI never got to meet the CMO.", "Interview Questions": "How would you onboard a new team member?"}, {"date": "6 Apr 2022", "title": "Financial Aid Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University in Feb 2022", "Interview Descriptions": "One screening call and one panel video interview. Mostly knowledge based questions. Both were easy interviews, however, panel seemed somewhat disengaged very difficult to tell how one would fit in on the team.", "Interview Questions": "How do you manage stress at work?"}, {"date": "15 Jun 2023", "title": "Assistant Director of Admissions Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National University (San Diego, CA) in Feb 2022", "Interview Descriptions": "Three rounds, fairly basic questions for intro leadership. Focus on your leadership and analytical skills. Do not be afraid to share opportunities to learn as this will help you. Also, be direct and give examples of how you can coach and show support for your teams. Also consider, how you handle difficult people.", "Interview Questions": "Tell me about a time when you lost a team member."}, {"date": "21 Jan 2022", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at National University in Jan 2022", "Interview Descriptions": "Super quick and thorough interview process.  They have a great system and are efficient with your time. Quick call with a talent person, interview with a few enrollment managers, and then the director comes in to offer you the role if it all goes well.", "Interview Questions": "How do you keep your self from getting distracted while working from home?"}, {"date": "26 Feb 2022", "title": "Library Specialist II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University in Jan 2022", "Interview Descriptions": "Very bad communication with candidates.   I had 1 phone screen and 2 zoom interviews.  After the 1st zoom interview there was a LONG wait before the 2nd zoom interview.  After the last interview, I sent a follow-up email to the hiring manager and recruiter to inquiry about the status of the position; specifically regarding the time frame of when they would be making a decision...... never heard back.  This is not considerate and in my opinion, poor practice.  The only way I found out that I was not selected for the position was logging onto my application and seeing the term \"closed.\"   NCU - you can't even send an email or make a phone call to let your candidates know?", "Interview Questions": "Why are you interested in this job?"}, {"date": "26 Feb 2022", "title": "Library Specialist II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University in Jan 2022", "Interview Descriptions": "Very bad communication with candidates.   I had 1 phone screen and 2 zoom interviews.  After the 1st zoom interview there was a LONG wait before the 2nd zoom interview.  After the last interview, I sent a follow-up email to the hiring manager and recruiter to inquiry about the status of the position; specifically regarding the time frame of when they would be making a decision...... never heard back.  This is not considerate and in my opinion, poor practice.  The only way I found out that I was not selected for the position was logging onto my application and seeing the term \"closed.\"   NCU - you can't even send an email or make a phone call to let your candidates know?    This is not an institution I would want to work for.", "Interview Questions": "What type of library software have you used?"}, {"date": "28 Jun 2021", "title": "Student Business Services Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National University", "Interview Descriptions": "Fairly easy interview process, quick turnaround/response time. Friendly interviewing team/hiring managers. Questions were mostly related to my history and experience from a situational standpoint and how I would handle students moving forward.", "Interview Questions": "Describe a time you had to give bad news to a student and how you approached the student?"}], [{"date": "8 Jun 2021", "title": "Nursing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at National University (San Diego, CA) in Jun 2021", "Interview Descriptions": "The interview only consisted of 4 questions. It was a one-on-one interview through zoom and only lasted bout 10 minutes. Other interviewees were put on hold in the zoom waiting room, and I believe we were taken in numerical order.", "Interview Questions": "What is the difference between diversity and inclusion?"}, {"date": "17 Jun 2021", "title": "Enrollment Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at National University (San Diego, CA) in Jun 2021", "Interview Descriptions": "The interview was very friendly and positive, I didn't feel pressured or stressed. They asked me a few standard interview questions and the  did a role play enrollment phone call. They answered all my questions and gave me some great feedback.", "Interview Questions": "Why should we hire you?"}, {"date": "2 Mar 2021", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University", "Interview Descriptions": "After completing a sample grading and a complete review of curriculum vitae, transcripts, and other samples, there is a  standard interview with questions about background, expertise, teaching philosophy, and so on. There was only one interview and the interviewer was kind and gracious.", "Interview Questions": "Tell us about how you overcome obstacles in the workplace."}, {"date": "9 Feb 2021", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University", "Interview Descriptions": "Excellent and straightforward. Set up through Human Resources and went through several rounds of interviews. They were kind and thorough and professional and asked relevant questions. They were prompt in getting back to me and setting up each round of interviews.", "Interview Questions": "Fit for position and related skills "}, {"date": "4 Oct 2020", "title": "Talent Acquisition Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at National University in Aug 2020", "Interview Descriptions": "The most unorganized experience interviewing with a company I have ever had. I applied to this company in July 2020 and went through two panel interviews over the course of 3 weeks. I was then contacted again to schedule a 3rd interview the next week because they \"forgot\" to ask me some questions ( a few questions were actually repetitive from the two interviews before). The interviewers seemed to have no idea what was going on on....discussing with each other who was asking what questions on the Zoom call. At the end of the interview I asked when they would be making a decision and was told in the next week or two. I have not received any feedback at all, I left the Recruiter 3 voicemails over the course of two weeks,  before I got an email response asking my availability that day to call to give me an update on the position. I responded with my availability and never heard from him. I am going to assume I did not get the job as it is now October 2020 and my last interview was nearly a month ago.\n\nI also feel that they did not ask me any questions pertaining to the actual job or got to know my personality whatsoever. This was not a conversational interview. Their questions were all situational and focused on a diverse workforce.", "Interview Questions": "Describe a time that you had to work on a diverse team, while also working autonomously, when you had a deadline to meet.\n\nDescribe a time you had a conflict in a diverse work environment and how was it resolved"}, {"date": "20 Jun 2020", "title": "Professor, Business Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at National University (New York, NY)", "Interview Descriptions": "I applied for the Business Professor position. I was contacted by a recruiter asking if I would be interested in adjunct positions. I accepted. An interview was scheduled, but cancelled on the day of due to a scheduling conflict and asked if I would be able to interview at a later date. The second interview was two later via Zoom. The interview lasted 8 minutes.  The Associate Dean was congenital, but did not seem as focused as she may have been. She asked a few questions then asked if I had any questions. I asked procedural and platform information.", "Interview Questions": "How do you feel is the best manner to chair a dissertation committee?"}, {"date": "3 Aug 2020", "title": "Associate Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University in Jun 2020", "Interview Descriptions": "Had a first-round interview that went well. HR person said she was impressed with my background and would forward my resume to the manager.\n\nNever heard back from them. I emailed the HR person twice and even contacted her on LinkedIn, but still never got a response. It has been about a month without any response. I do not care if I am rejected, I just need to be told I am not getting an offer without being ghosted. They have a terrible hiring system.", "Interview Questions": "Basic questions about previous experience"}, {"date": "7 Mar 2020", "title": "Federal Work Study Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University", "Interview Descriptions": "I did not have an interview. The position was offered on spot through a phone call and then followed with an email afterwards. They asked if I was still interested in the position and to fill out and accept the offer online, through email.", "Interview Questions": "N/A"}, {"date": "5 Mar 2020", "title": "Records Evalutor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at National University (San Diego, CA) in Mar 2020", "Interview Descriptions": "Initial phone interview for screening by a recruiter. Offered an in person interview the next day. This consisted of three interviewers taking turns asking a series of about 10-12 questions.", "Interview Questions": "Recall a conflict you had with a coworker and what you did to resolve it and continue working with them."}, {"date": "31 Aug 2020", "title": "Enrollment Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University in Jan 2020", "Interview Descriptions": "Contacted by the recruiter for a Phone Screen; Asked about employment history; one week later, contacted by hiring manager  for a 30 minute interview; then reached out by recruiter for a Panel Interview;", "Interview Questions": "Standard Questions relevant to the job"}], [{"date": "31 Jan 2020", "title": "Financial Aid Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National University (Fresno, CA) in Dec 2019", "Interview Descriptions": "I applied through Glassdoor and went to the university careers page and completed all the steps to apply. I received a email requesting a phone interview through their 3rd party HR support. The phone interview went well and they moved me forward to the onsite campus director over the fa dept. It took a week but I did get a call back for a inperson interview with the employee hiring board of 4 to 5 people.  Which was another week away. That interview seemed to go well until the very end when at the last moment the director asked if I had worked for non profit college before, which I havent and that is one reason why I had applied for growth  and personal learning. After 15 years in the Educational Student Financial field working my way up to a campus fa director I was pretty confident I could catch on to non profit versus for profit colleges. Well  answered the question and I never heard back not even to say no thank you. I did notice that after he asked me that question that everyone seemed to roll their eyes at him.  I feel like given the chance i could have been a real asset for the university but guess its just not in the cards", "Interview Questions": "How do you handle a difficult student. "}, {"date": "30 Sept 2019", "title": "Academic Advisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at National University in Sept 2019", "Interview Descriptions": "I am writing this as a warning to potential interviewees. Northcentral uses a scheduling software  to set-up interviews with potential candidates. The software itself is fine as it sends multiple reminders for you not forget and to check the information you provided so that you are sure they have the correct number to reach you. So, I checked multiple times to make sure my cell phone was correct. When it came time for the interview, I received no call. I waited over ten minutes and decided to write the HR Representative to see if there was an issue. She wrote back stating that she had attempted to reach me and that it went straight to voice message. She then proceeded to provide a number that was not mine. I think proper protocol would have been for the representative to attempt to email me instead of making me wait during a work day. \r\n\r\nI have to say, coupled with the Glassdoor reviews about the company's HR team here, I am reluctant to believe the representative. I am open to being corrected, but company HR teams need to be a little more respectful to potential candidates. This is a sure fire way to see if a company is a good fit for you. Remember, you're also interviewing them. \r\n\r\nBest of luck!", "Interview Questions": "No questions were asked. "}, {"date": "11 Jul 2019", "title": "Content Expert Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at National University (San Diego, CA) in Jul 2019", "Interview Descriptions": "Flawless. It was scheduled quickly, began on time, and I understood \"next step\" and time frames. It was structured more as a conversation about the program's vision and my background.", "Interview Questions": "What criteria would you use to develop these course for this program."}, {"date": "3 Jul 2019", "title": "Human Resources Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University (Scottsdale, AZ) in Jun 2019", "Interview Descriptions": "I had a 30 minute phone screen with the recruiter. About half way through, the recruiter asked an inappropriate follow-up question about a former employer, pressing for detailed information regarding a legal matter. When I opted not to share confidential info about an employer, the recruiter became very cold towards me. Instead of being transparent that she wasn't interested in pursuing me further as a job candidate, she set a time expectation for following up, then ghosted me. I'm thankful I dodged a bullet here.", "Interview Questions": "What are your salary expectations?"}, {"date": "28 Mar 2020", "title": "Academic and Financial Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University (Scottsdale, AZ) in Mar 2019", "Interview Descriptions": "The process started out relatively normal. Had a phone interview and then was brought in for a panel interview. It was a really weird experience. The lights were off and the only light source was a window. They asked what I would do if I had coworkers who started playing catch. They definitely came across as \"we're so hip and cool and fun\". They were trying so hard to appeal to millennials but tbh I would rather be traveling than playing catch with my coworkers in the office. Then they asked why manholes are round and I gave them the right answer and they were disappointed (?) then said something along the lines of people are putting our interview questions on the internet. No, people just aren't stupid. It's neither a clever nor original question but for some reason they thought it was. They gave off some really weird and bad vibes.", "Interview Questions": "what would you do if your coworkers started playing catch during work?"}, {"date": "10 Apr 2019", "title": "Human Resources Business Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National University (San Diego, CA) in Feb 2019", "Interview Descriptions": "Three phones screens and before a face-to-face interview had my references checked. Then a 4 hour in-person interviews. No offer for water or coffee or bathroom break. Interviewers asked questions that made no sense nor did they attempt to try to “sell” NU. Very disappointing and an attitude of “prove yourself” instead of what can you offer. They seemed more interested in discovering negative issues they could uncover - a sad mindset. Poorly orchestrated process yet they are desperate.", "Interview Questions": "Tell us about a strategic partnership have you created?"}, {"date": "23 Aug 2020", "title": "Student Services Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at National University (San Diego, CA) in Feb 2019", "Interview Descriptions": "A great interview process that had me relaxed and not sweating bullets.  A calm and engaging interview from start to finish. Both of the members that were interviewing me were calm and delightful.", "Interview Questions": "Tell me about yourself\r\nBackground \r\nExperience prior\r\nEducational goals\r\nWhen can you start"}, {"date": "25 Feb 2022", "title": "Student Counsellor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University (Scottsdale, AZ) in Jan 2019", "Interview Descriptions": "Interviewer was late. Tone felt rushed and that they weren’t really interested in me, just interviewing because they had to. It felt like they were going through the motions, not actually taking the time to ask me how I can contribute.", "Interview Questions": "N/A"}, {"date": "16 Oct 2018", "title": "Center Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National University in Sept 2018", "Interview Descriptions": "First was a phone interview with the recruiter. If you're choosen to go on you will then meet in person. In my case I met with the director of the campus and the assistant director of the campus.", "Interview Questions": "Why did you choose to apply for this position?"}], [{"date": "29 Jul 2019", "title": "Software Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at National University (Scottsdale, AZ) in May 2018", "Interview Descriptions": "First interview: Phone interview, asked esoteric questions about C# and general software development questions.\r\n\r\nSecond interview: Two interviewers sat on the opposite end of a table in a conference room and rapidly fired off questions awaiting a quick answer. Asked basic/general software development questions. Asked  more esoteric questions about each different full-stack software development tier (Javascript, C#, SQL).\r\n\r\nThird Interview: Interview with manager, talk about expectations and experience. Provide a 2 minute \"pitch\" as to why we should hire you. More relaxed.", "Interview Questions": "What is IEnumerable in C#?\r\nWhat is the difference between static and const keywords in C#?\r\nWhat s the difference between const and readonly keywords in C#?\r\nWhat is a delegate in C#?\r\nWhat is the \"this\" keyword in JavaScript?\r\nWhat does \"truncate\" do in SQL Server?\r\nWhat's the difference between an inner join and a left join in SQL?\r\nWhat is a primary key in SQL?\r\nWhat is a foreign key in SQL?\r\nWhat is the difference between a unique index and a primary key in SQL server?\r\nWhat is an interface?\r\nWhat is the ternary operator?\r\nWhat is DevOps?\r\nWhat is automated testing?\r\nWhat is a unit test?\r\nWhat is an integration test?\r\n\r\nWhat was the last book you read?\r\n"}, {"date": "22 Mar 2018", "title": "Marketing business manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at National University (San Diego, CA) in Mar 2018", "Interview Descriptions": "I was prescreened by a recruiter first and then had a phone interview with employer. The conversation was pretty casual with standard questions like: what do you like about this position, describe your current job, etc.", "Interview Questions": "What motivates you?"}, {"date": "8 Mar 2018", "title": "Faculty Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University (Phoenix, AZ) in Dec 2017", "Interview Descriptions": "Phone call with a racist interviewer.  Asked me to describe myself, but was cold and notably indifferent.  I met and exceeded their hiring criteria; she did not care. Doesn't hire white people.", "Interview Questions": "Tell us about yourself"}, {"date": "10 Mar 2021", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University (Scottsdale, AZ) in Oct 2017", "Interview Descriptions": "Disheveled process. Told them my salary needs in advance. Went through process and was verbally offered a job at a 15% less salary than my minimum. Why would they waste the time?  Told them thanks but no thanks. They called 2 days later and offered me my salary minimum. They said they would email the offer. Never did. They left a voicemail at a time they knew I would not be available to answer. Said that they felt uncomfortable with the salary. Extreme time wasters", "Interview Questions": "Tell us how to make a sandwich "}, {"date": "27 Sept 2017", "title": "Academic and Financial Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at National University (Scottsdale, AZ)", "Interview Descriptions": "Sat with 3 people. 2 from HR 1 a director of education. They asked me a series of question concerning how i would handle clients and what i value as great customer service. Questions regarding organization placement not position.", "Interview Questions": "Everyone has their own personalities here. What would you bring to the environment?"}, {"date": "16 Sept 2017", "title": "Enrollment Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University (Phoenix, AZ) in Aug 2017", "Interview Descriptions": "The recruiter got back to me quickly after applying. Had a phone screen interview which went well. I didnt get the job but I thought I did pretty good. Not sure what they were looking for.", "Interview Questions": "What do you know about Northcentral?"}, {"date": "11 Jul 2017", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at National University", "Interview Descriptions": "Submitted application. Was promptly contacted by a recruiter and told I'd been advanced to next round and would be contacted with next steps. Link was provided to complete more information which I did. Weeks went by and then was told by an automated email that I wasn't selected. Initial email gave the impression that I was selected to interview. I replied to recruiter and didn't get a response. In retrospect, it was very automated and impersonal and it was also misleading. Not a great sign of what it would be like to work there, I suspect.", "Interview Questions": "Provided a link to compete more information which included  providing references. "}, {"date": "7 Jul 2017", "title": "Records Evaluator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at National University (San Diego, CA) in Jul 2017", "Interview Descriptions": "I applied online, got an email to come in for an interview. Interviewed with three people very nice and laid back. Then got a call about salary if I was ok with their minimum to their maximum payout for that position. I said yes but preferred maximum. Then finally got a call saying I got the maximum payout. Did background check. Passed start Monday", "Interview Questions": "What do you know about national university?"}, {"date": "6 Jun 2017", "title": "Enrollment Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University (Phoenix, AZ)", "Interview Descriptions": "Phone interview. Simple questions. Took around 15 minutes to complete phone interview. Person was really kind and sweet. Phone interviews are always hard because there is no way to measure social and personality aspects of a person.", "Interview Questions": "Tell me about a time you dealt with an unruly customer."}, {"date": "15 Aug 2017", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University (San Diego, CA) in Jun 2017", "Interview Descriptions": "I applied and was asked to come in for an interview. I was interviewed by a panel in June. I was told that I would be moved forward in the process by the end of the same week and then that same day told that the process was on hold. I did not hear anything back for over a month. I was contacted again and asked to fill out a background check form, and then asked to redo the form.  I was offered the position and given a date for the new employee orientation. I was unable to attend due to a doctor's appointment that I could not reschedule and then was emailed and told that they were no longer considering me for the job.", "Interview Questions": "Tell us about yourself"}], [{"date": "4 May 2017", "title": "Staffing and Hiring Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at National University", "Interview Descriptions": "Interview process took 2 weeks, Phone call interview first, briefly went over job details and they asked about myself and experience and if I was interested.. Then called back in for a face to face interview, lasted about 10 minutes both interviews.  Easy.", "Interview Questions": "Tell me about a time when you were faced in  a difficult situation and how did you handle it, how do you prioritize you work responsibilities?  Do you plan on taking classes?"}, {"date": "14 Nov 2018", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National University (San Diego, CA) in May 2017", "Interview Descriptions": "The recruiter was very kind and knowledgeable, but the process was a hot mess. An interview was cancelled minutes before it was to take place because the position was filled. I was interviewed for the wrong position.  Multiple interviews were scheduled and rescheduled.", "Interview Questions": "N/A"}, {"date": "21 Aug 2017", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University (Scottsdale, AZ) in Apr 2017", "Interview Descriptions": "The interview process was very quick, Initial phone screen then was brought in one time to meet the entire team. I was happy I got to meet with everyone the same day instead of coming in multiple times.", "Interview Questions": "Please describe your background in relation to the position. "}, {"date": "7 Mar 2018", "title": "International Student Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University (San Diego, CA) in Mar 2017", "Interview Descriptions": "1. Introduction\r\n2. Question about your experience, strength, and weakness.\r\n3. Regular questions\r\n4. Asked my opinion about their department\r\n5. Interviewers had a piece of paper to take notes of my answers. They also have all questions on it. They were very kind.", "Interview Questions": " experience, strength, and weakness"}, {"date": "28 Dec 2017", "title": "Admissions Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University (San Diego, CA) in Feb 2017", "Interview Descriptions": "Applied online\r\nWas scheduled for a phone interview a few days after submitting an online application. The phone interview lasted about 20 minutes and was very relaxed. The interviewer explained the role and went over details of my resume. I was scheduled for an in-person interview about a week later.\r\n\r\nThe in-person interview last about 35-45 mins. I was called back a few hours after the interview and offered the position. A background check was required, which took almost 4 weeks to come back before I could even begin training.", "Interview Questions": "Describe a time when you had to speak with a difficult customer?"}, {"date": "1 Nov 2016", "title": "Associate Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at National University (Scottsdale, AZ)", "Interview Descriptions": "Fairly easy.\nCalled by recruiter, phone interview, 2 in-person interviews on site. Writing sample (email form) - \nPretty straight forward and quick. Entire process took about 3-4 weeks from submitting resume to job offer.", "Interview Questions": "Why do you want to work at NCU?\nWhat do you know about NCU?"}, {"date": "30 Sept 2016", "title": "Student Finance Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University (San Diego, CA)", "Interview Descriptions": "The interview process is very short, comprising essentially of an online application and one interview. The interview will normally take place at a campus, specifically the campus applied at, and will be conducted by 3-4 interviewers, consisting of at least one staffer, one campus supervisor, and one school executive. The interview questions are mainly general questions about interests and reasons for desiring the position. There will be one challenging question that asks about your personal definition of a specific word or phrase, though I don't recall what it was.", "Interview Questions": "What was the greatest challenge you have ever overcome?"}, {"date": "14 Jan 2017", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at National University (Scottsdale, AZ) in Sept 2016", "Interview Descriptions": "I went into the reception area and the director brought me into a room and asked questions related to academic background, what experience I had, if any, with a similar institution or if I had any experience working in the online environment or in the service industry.", "Interview Questions": "academic background"}, {"date": "7 Mar 2018", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National University in Sept 2016", "Interview Descriptions": "Applied through Glassdoor, was contacted for an in-person interview with two interviewers.  They were kind and warm, reviewed my experience and skills.  Conducted a background check that took a little while.", "Interview Questions": "Previous experience, recall a situation where advising was difficult and how you overcame it."}, {"date": "16 Jul 2016", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University", "Interview Descriptions": "First step was a brief phone interview. Mostly reviewed my resume and discussed the position. Second step was a one on one, 45-minute in-person interview with two people. They worked through a list of questions while they took notes and gave me time to ask questions at the end. It felt conversational throughout.", "Interview Questions": "What is the biggest misconception others have about you in the work environment?"}], [{"date": "15 Dec 2017", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National University in Jul 2016", "Interview Descriptions": "Spoke with Center Director and faculty from campus. Seemed thrown together and very vague questions. No HR personnel throughout any hiring or onboarding processes. Honestly felt like they would hire anyone who would show up because they can't seem to hold onto anyone in this position for longer than 2 years", "Interview Questions": "How do you deal with difficult situations?"}, {"date": "28 Jun 2016", "title": "Accounting Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University (Scottsdale, AZ) in Jun 2016", "Interview Descriptions": "Had a brief phone interview with recruiter and then was asked to come in for live interview.  I was at the latter stage since they told me they were performing first and second interviews.", "Interview Questions": "To provide summary of work experience"}, {"date": "22 Oct 2019", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at National University (Los Angeles, CA) in Feb 2016", "Interview Descriptions": "Very friendly and relaxed interview, starting with comfortable conversation about my intro to the posted job, and the business.   The interviewer was the same person I spoke with over the phone days before, and he stayed on subject and asked only pertinent questions related to the job.", "Interview Questions": "What areas do you consider are your strongest to teach?"}, {"date": "10 Sept 2017", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at National University (San Diego, CA) in Sept 2015", "Interview Descriptions": "Panel interview made up of 5 potential colleagues. All questions related to the position and I had considered during my preparation.  The panel lasted approximately 45 minutes and gave me a good idea of what working for the organization would be like.", "Interview Questions": "What is your 5 year plan for this position. "}, {"date": "22 Dec 2015", "title": "Elearning Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National University (San Diego, CA) in Sept 2015", "Interview Descriptions": "Initial phone interview, panel interview, meet the boss.  They explained the position and the difficulties they were having.  On the phone they asked me for my salary request, when I told her, the phone went silent.  I said is that too high, she said everything is negotiable.  Apparently not!", "Interview Questions": "Tell us about yourself"}, {"date": "3 Aug 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University (San Diego, CA) in Sept 2015", "Interview Descriptions": "- Got a phone screening\r\n- Made an appointment for an interview in person\r\n- Got interview in person with 2 supervisors\r\n- Waited for about a month to get the result\r\n- Got an offer and do background check", "Interview Questions": "- Asked about my experience. \r\n- What I have done from my previous job. \r\n- What was the problem I faced when I work and how I solved that problem.\r\n- Asked to make an activity calendar  (to see my creativity)."}, {"date": "8 Aug 2015", "title": "Admissions Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at National University (San Diego, CA) in Jul 2015", "Interview Descriptions": "It was a basic phone interview. The whole process was pretty quick. The phone interview had straight forward questions that you get for every interview. It was with two different members of the team. Both members asked questions. When I had questions for them, they answered very quickly. It was a positive experience.", "Interview Questions": "What computer programs are you familiar with? How would you handle dealing with different people? What do you know about the position?"}, {"date": "15 Jun 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National University", "Interview Descriptions": "The interview was very straightforward. The first step was a phone interview then I received a call back about setting up an in-person interview. When I arrived, the staff was warm and friendly. I interviewed with a panel consisting of 3 people. Overall, it was an easy interview process. Nothing out of the ordinary. Make sure to ask questions.", "Interview Questions": "How do you manage your time/projects/deadlines? What is your process?\r\nWhat are your top 3 strengths/weaknesses? \r\nTalk about a time you had trouble communicating within a team. What happened?"}, {"date": "26 Feb 2016", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University (San Diego, CA) in Jun 2015", "Interview Descriptions": "The interview was simple. It was formal but with a comfortable air. It was 1:1 and focused mainly on my qualifications and objectives. Interview was more of a conversation than an uncomfortable eye-to-eye question attack.", "Interview Questions": "Why do you think youre a good fit?"}], [{"date": "1 Sept 2019", "title": "Instructor, College Or University Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at National University (Los Angeles, CA) in Jun 2015", "Interview Descriptions": "After submitting my resume for the instructor / Adjuct professor position, I was invited for an interview by the department head.  It was not a pressure situation since the person conducting the interview was very pleasant.   They didn't waste time, getting to the point quickly as the the job requirements and what my teaching philosophy.", "Interview Questions": "Real-life questions.  What is your teaching philosophy?  What are you bringing to the position.  How can you help the students with real-life challenges in the industry?"}, {"date": "14 Jan 2016", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at National University (San Diego, CA) in May 2015", "Interview Descriptions": "Had to search for room interview was conducted in; very informal; lots of soap boxing; liked the fact that it was casual, but expected it to be more about work and not about my personal life. I don't believe other interviews at this school are conducted the same way. In fact, I believe they are more professional and are completed faster than mine.", "Interview Questions": "What is your experience with different scripts."}, {"date": "20 Jul 2016", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at National University (Scottsdale, AZ) in Feb 2015", "Interview Descriptions": "The hiring manager scheduled the meeting on a Saturday morning. When I arrived the person that was supposed to conduct the interview was not there. Instead they had the head of the enrollment department interview me. He took like 5 minutes sharing a story about him growing up fishing and how much of a straight shooter he is, and how many awesome abilities he has. Then he offered me the job.", "Interview Questions": "When can you start?"}, {"date": "28 Jan 2015", "title": "Instructional Designer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University", "Interview Descriptions": "Don't bother applying at a for-profit institution. Their online department runs like a outdated corporate training development without focus on academics and faculty freedom. It looks like senior administrators are afraid of losing their jobs.", "Interview Questions": "Normal questions are the most annoying. No challenge whatsoever."}, {"date": "2 Nov 2014", "title": "Records Evaluator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at National University (San Diego, CA)", "Interview Descriptions": "Very relaxed interview. Standard questions. Panel interview was made to be a comfortable experience. It almost felt as if the interviewer was tired of having interviews - maybe they had a high volume of applicants and interviews to go through. It was definitely a low anxiety situation.", "Interview Questions": "Describe a difficult experience you had with a coworker."}, {"date": "23 Jun 2014", "title": "Admission Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at National University", "Interview Descriptions": "it was quick about a week long process. No drug test or physical.  focus on past sales experience and that you care  about students. Also make such to have answers to what experience you have  with college and helping people. It was not a hard process, but  make sure to be ready to do a panel interview.", "Interview Questions": "what expereince do you have in sales or a retail setting?"}, {"date": "12 Jan 2016", "title": "Student Advocate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at National University (San Diego, CA) in Jul 2014", "Interview Descriptions": "There was a group interview with upper management and lower management. The questions were direct and behavioral. I was very nervous as I had never done a group interview before. I was able to be myself and be transparent about my desires for the future and my previous experiences and how I learned from them.", "Interview Questions": "Why do you want to work for National University?"}, {"date": "7 Jul 2014", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at National University (Long Beach, CA) in Jun 2014", "Interview Descriptions": "Had an interview with the manager. Overall pleasant with no difficult questions. Manager was seeking more information about my work ethic and why I want the position. The experience was not intimidating and went smooth.", "Interview Questions": "Can you mention a time when you had a situation with a coworker and what did you do to solve the problem?"}], [{"date": "25 Mar 2014", "title": "Advisor Credential Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at National University", "Interview Descriptions": "phone interview.  then panel interview.   more interested in writing my responses down in their ipads than actually connecting with me.", "Interview Questions": "where do you see yourself in five years"}, {"date": "25 Feb 2014", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at National University", "Interview Descriptions": "I had to go through 3 interviews, many of which had the basic questions.  HR process was ridiculous.  Ignorant process and ignorant place.", "Interview Questions": "Easy questions."}, {"date": "16 Jan 2014", "title": "IT Person Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National University (Scottsdale, AZ) in Jan 2014", "Interview Descriptions": "Was contacted on 12/19 to fill out a self assessment form. Had a phone interview with the manager 2 days later, it was rescheduled once.  He seemed in a hurry to get me in to meet the team and he seemed like he wanted to fill the position very quickly.  Had to wait until after the holidays to do the interview with the team.  Had an onsite interview to meet the hiring manager and team, only about 1/2 the people that were supposed to be there showed up.  Interview seemed to go great, at the end I asked manager if he had any doubts I could do the job, he said he didn't see anything that was stopping me moving forward.  Again he brought up the issue of me wanting to give 2 weeks to my current employer, this seemed to be something they did not like.  Trying to follow up 5 days later, no response.  Then again 2 days after that, go a response late in the day.  They decided they were going to continue interviewing other candidates, no feedback as to what the issue was.", "Interview Questions": "N/A"}, {"date": "26 Feb 2014", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University (Scottsdale, AZ) in Jan 2014", "Interview Descriptions": "interview process was a typical process.  average questions you might get anywhere.  normal interview process of coming in to meet, and passing the background.  I have nothing good to say about this organization. bad people, people getting fired right and left.  nobody has any security. people are rude, inconsiderate, arrogant for no reason.", "Interview Questions": "N/A"}, {"date": "29 Jan 2014", "title": "Human Resources Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at National University in Jan 2014", "Interview Descriptions": "Initial phone interview asked standard questions about acceptable commute, salary expectations and qualifications. In person interview was scheduled for 3 days later. The hiring manager and VP of HR interviewed together. The hiring manager reviewed the position requirements, typical behavioral-based questions and asked me to review my experiences listed on my resume. The VP asked more uncomfortable questions and was slightly aggressive.", "Interview Questions": "If you were offered a job at another company for a different position than what you are applying for now, would you take it?"}, {"date": "1 Mar 2014", "title": "Senior Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at National University (Scottsdale, AZ) in Jan 2014", "Interview Descriptions": "Initially contacted by human resources as an \"ideal\" match for the position.  After submitting two formal documents answering 17 questions, no further communication occurred.  The first round of questions took one week to write and review for formal business style and presentation.  Literally seventeen minutes after submitting the first nine question set, received an email to answer eight more.  Quite a few questions in the second set were exactly the same questions in the first set.", "Interview Questions": "Describe your proficiency with Microsoft .Net Platform to include MVC, WCF, WPF, Team Foundation Server"}, {"date": "20 Nov 2013", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University", "Interview Descriptions": "This was a quite a long time ago so I don't recall. Being a university though, I have noticed all the managers really appreciate when you do your research into the school. So do your homework.", "Interview Questions": "Mostly traditional questions here, nothing weird."}, {"date": "3 Sept 2013", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I interviewed at National University", "Interview Descriptions": "Phone interview, in person interview, reference check and background check", "Interview Questions": "What would you do if a deadline was present and you were not completely satisfied with you work?"}, {"date": "3 Apr 2016", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University (Sacramento, CA) in Sept 2013", "Interview Descriptions": "The interview process was very easy and could have been an informal type interview. The manager hiring was easy to talk to but his manager was emotionless and seemed too formal.", "Interview Questions": "Tell us why we should hire you over everyone else."}, {"date": "16 Aug 2013", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National University (San Diego, CA)", "Interview Descriptions": "I submitted an application and received a phone call the next day for an interview. The interview was great. The Admissions Advisors I interviewed with were incredibly friendly, positive and helpful. \r\n\r\nI was asked questions regarding my advising experience, experience with students and ability to comply with deadlines. \r\n\r\nThe interview was simple and friendly. Word of advice: Be yourself!", "Interview Questions": "What kind of manager or boss do you prefer?"}], [{"date": "17 Apr 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University (La Jolla, CA) in Aug 2013", "Interview Descriptions": "I applied for the position about 4 weeks before they have given a phone call for an interview. The interview was really quick, about a 20 minute interview. I was interviewed by three people at the same time and they only had three questions. \r\n\r\nThe three questions were very vague and not really about the job position, but more on personality. It looks as though they were trying to find someone who would be able to work as a team.", "Interview Questions": "The question that they emphasized the most was if there was another employee who was giving you issues- how would you handle the situation?"}, {"date": "22 Sept 2016", "title": "Core Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National University (San Diego, CA) in Jul 2013", "Interview Descriptions": "Answered ad and sent in my resume. I then received a call from the Chair of the department who reviewed my resume and she asked me several informal questions during a phone interview. She explained that she was looking for someone w/ actual business experience and who could bring personality assessment certifications to the job. I had those qualifications and I was hired!", "Interview Questions": "What are my qualifications for this position?"}, {"date": "16 May 2016", "title": "Financial Aid Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National University (San Diego, CA) in Jul 2013", "Interview Descriptions": "I met with 3 people which was very intimidating. They made me feel very comfortable. Only 1 person was in charge of the interview, the other 2 asked questions every now and again.", "Interview Questions": "Why do you want to work in higher education?"}, {"date": "24 Apr 2013", "title": "Center Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I interviewed at National University", "Interview Descriptions": "There was only one interview and it was with the Center Director and Associate Regional Dean.  Very simple and straight-forward.", "Interview Questions": "Not really any difficult questions that I remember... they did have questions for me but not the \"What would you do in this situation\" or anything. It was basically a conversation about my skills and the university, not so much an interrogation feeling!"}, {"date": "10 Feb 2017", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at National University (Scottsdale, AZ) in Mar 2013", "Interview Descriptions": "Brief with many irrelevant questions; could tell that recruiter/interviewer was out of touch with the academic world and its terminology.  If the recruiter/interviewer does not know what is going on, how can I be judged on my background and resume?", "Interview Questions": "Tell me about your academic background\r\nHow do you handle student conflicts regarding grading issues?"}, {"date": "30 May 2015", "title": "Retention/Transition Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at National University (San Diego, CA) in Mar 2013", "Interview Descriptions": "The interview was a panel of three people. Fairly general, traditional interview questions were asked. The entire interview was no longer than 45 minutes and only one interview was held", "Interview Questions": "What is your experience with VA education benefits?"}, {"date": "22 Aug 2016", "title": "Visiting Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University (Chicago, IL) in Mar 2013", "Interview Descriptions": "Online with a faculty recruiter. The interview lasted about 30 minutes. There were several questions in regards to the specific skill-set associated with the position. The recruiter asked about my skills in computer/online teaching and the technology tools used. The recruiter explained that the teaching method is totally online. I would have to pass a three week introduction online course in order to be hired for the position.", "Interview Questions": "How many years of experience do you have teaching at the graduate level?"}, {"date": "22 Feb 2013", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at National University", "Interview Descriptions": "know make the job will entails, do research about the school itself, and most importantly be yourself. It's better to be yourself in the interview than, be scripted and fake. Besides, the people that interview you are the ones that's going to be your coworkers.", "Interview Questions": "How much do you know about National University?"}, {"date": "23 Sept 2017", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University (San Jose, CA) in Feb 2013", "Interview Descriptions": "Submission of resume and cover letter online in response to job announcement.  I was called for an initial telephone interview by the department chair.  This was follow-up with a face-to-face interview on campus.", "Interview Questions": "What courses in management and leadership have you taught?"}, {"date": "24 Jun 2014", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at National University in Oct 2012", "Interview Descriptions": "Basically the hiring manager talked the whole time telling me about the company and the position then I had a group interview with the 'team' and a week later i got the offer", "Interview Questions": "Nothing"}], [{"date": "5 Apr 2014", "title": "Enrollment Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at National University (Scottsdale, AZ) in Sept 2012", "Interview Descriptions": "You must work as an enrollment advisor and succeed first then typically are allowed to interview for this position. Interviews are internal with enrollment leadership typically doing the interviews and making the decisions themselves then formally having HR do their thing but that's just a formality after the Leaders have  decided.", "Interview Questions": "Are you willing to work an shift? Not a tough question but tough to really want to work weekends or nights."}, {"date": "22 Jul 2016", "title": "Dissertation Chair Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University (New York, NY) in Jun 2012", "Interview Descriptions": "Two phone calls, one with a committee and the other with the Dean. Interviewees attempting to determine emotional intelligence and ability to handle many student dissertations. Told that the process involved over 1000 applicants and only 40+ were interviewed based strong research experience.", "Interview Questions": "Can you work with many students that are doing multiple forms of research?"}, {"date": "22 Sept 2014", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at National University in Jun 2012", "Interview Descriptions": "Initial interview with team leads and Associate Director of Enrollment (manager). They are looking for highlights of sales experience, and some understanding of higher education. Previous experience can work in your benefit however, your attitude and overall demeanor is what they will base their final decision on. NCU uses behavioral interviewing. This technique uses previous experiences to determine how people will react in the future. They have their own set of values that is in direct alignment with the company Quicken, who is directly linked to the University.", "Interview Questions": "Describe a time that you experienced a difficulty or opposing point of view with a manager."}, {"date": "24 Jul 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at National University (San Diego, CA) in Apr 2012", "Interview Descriptions": "The interview process was somewhat lengthy. Show that you know your field and are committed to teaching and helping others succeed. There are many of forms to fill out and the submission-response cycle is slow.", "Interview Questions": "Can you talk about your subject area for a solid two hours?\r\nTell me about (your field)"}, {"date": "8 Jan 2016", "title": "Assistant to the Dean Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at National University (San Diego, CA) in Feb 2012", "Interview Descriptions": "Brief, quick, professional, standard process. Nothing out of the ordinary and not a fantastic interview. It would nice to want to get to 'know' who you are hiring. I met with the HR rep and then with the Boss. There was no training and I had to fend for myself and work out what I was doing on my own once I got the job. The worst on boarding process I have ever encountered.", "Interview Questions": "Standard in the box questions"}, {"date": "28 Feb 2012", "title": "Laboratory Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at National University (Sherman Oaks, CA) in Feb 2012", "Interview Descriptions": "I interviewed with three very professional and polite individuals. I arrived nearly 30min early due to lack of LA traffic and was informed that the previous interview let out early so they would gladly take me in early. Lobby was full of items for National University classes circa 2011, I didn't spot anything for 2012 and it's already Feb. 2012. Reception was polite and informative, while the others in the shared office talked about \"non-work related\" conversation. All were dressed business casual. Interview was in a conference room overlooking LA county. The interview took a little over half an hour and parking was validated.", "Interview Questions": "Tell us about yourself."}, {"date": "23 May 2012", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at National University (San Diego, CA) in Oct 2011", "Interview Descriptions": "My interview took place in a conference room with 3 people - the Dean and two department managers.  While that may seem intimidating, they were really friendly and put me at ease.  They did a great job of telling me about the position and asked \"interview'ie\" questions but nothing too over the top.", "Interview Questions": "Describe a difficult situation you have been in at work and how you overcame it."}, {"date": "20 Jul 2012", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at National University (San Diego, CA) in Jun 2011", "Interview Descriptions": "Here are the questions I was asked in my interview: \r\n\r\n·What work ethic means to you\r\n\r\n·What integrity means to you\r\n\r\n· What you know about the university \r\n\r\n· Your ability use time management to complete goals/tasks\r\n\r\n· A common misconception about you\r\n\r\n· What kind of boss/work environment you work well with/in\r\n\r\n· An example of a time when you had a difficult client/situation and what you did to rectify the situation (communication and compassion is important here)", "Interview Questions": "What is A common misconception about you"}, {"date": "1 Jul 2013", "title": "Adjunct Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University (San Diego, CA) in Jun 2010", "Interview Descriptions": "Asked about other teaching experience and details of courses taken at the graduate level", "Interview Questions": "All questions as expected"}]]