[[{"date": "20 Aug 2021", "title": "Community Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Eastern Washington University", "Interview Descriptions": "Typical process for applying was this: Fill out an application, get recommendations from others.(  helps to get recommendations from existing CAs) then finally have interview. Interview was in front of a 5 person panel. Interview last about 15 mins.", "Interview Questions": "How can you help students in this role"}, {"date": "14 Jan 2021", "title": "Office Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Eastern Washington University (Cheney, WA) in Jan 2018", "Interview Descriptions": "Interview was easy going. Asked about my experience and how that will help me in that role. Asked basic interview questions.  Was very nice and easy to talk to.  Never felt intimated", "Interview Questions": "What do others see as your strengths?"}, {"date": "9 Sept 2017", "title": "Graduate Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Eastern Washington University (Cheney, WA) in May 2017", "Interview Descriptions": "I was interviewed by four upper level employees. It was just normal questions about my life, why do I want to become graduate assistant, what do I bring to the table, etc. There was no technical questions. They were very relaxed and it was very easy to express myself. Overall, I had great experience with this interview process and I enjoyed every minute of it. Best way to prepare yourself is to be yourself and answer questions with great confidence.", "Interview Questions": "Tell me a little about yourself."}, {"date": "15 Feb 2017", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Eastern Washington University", "Interview Descriptions": "It was generally simple and straightforward - just asking strengths and weaknesses and how you act under pressure. It's good to have sales experience as well and being really organized is definitely beneficial.", "Interview Questions": "Strengths and weaknesses "}, {"date": "30 Jan 2018", "title": "Office Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Eastern Washington University (Cheney, WA) in Aug 2016", "Interview Descriptions": "Individual interviewee with two interviewers. Many questions regarding work ethic and goals. Also, interviewers have also been in similar position as job applying for. Many questions were in regards to applicants ability to problem solve and answer questions that students may have in regards to the Writers' Center.", "Interview Questions": "Where do you see yourself after college, in about 4 years or more?"}, {"date": "28 Oct 2013", "title": "Fitness Instructor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Eastern Washington University", "Interview Descriptions": "The hiring process consist of a few of the assistant directors which are graduate students at Eastern Washington University.  They are looking for keywords such as fitness, personal training, and safety.  They would like to know that you are trying to become a personal trainer or work in the fitness industry.  If you have passed the first interview, you will get another with the head of the fitness center.", "Interview Questions": "I skipped the interview process but was well informed on the structure."}, {"date": "12 Jan 2016", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Eastern Washington University (Cheney, WA) in Oct 2013", "Interview Descriptions": "Day long interview process. Teaching sessions.  Hiring manager participated in about 1/8 of the day.  Students, faculty, and administrators were part of the process.  Campus tour.  Lunch panel.", "Interview Questions": "What is your budgeting experience."}, {"date": "5 Sept 2015", "title": "ALL Jobs Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Eastern Washington University (Cheney, WA) in May 2012", "Interview Descriptions": "The hiring process is generally by search committee. As a result, there is no consistency in the questions you will be asked or the situations you will be in. In its most general sense, the committee will review all of the candidate's packets given to the committee from HR. The packets are scored. Do yourself a favor by CLEARLY addressing in your cover letter how you meet each of the stated minimum and preferred qualifications. The clearer you are for the committee members, the better. Ignore a page limit - this is academia not business. \r\n\r\nThe process then consists, generally, of a telephone/Skype interview followed by a campus visit for the last 2-3 candidates. Your offer will come after that if you are selected. There is not a lot of negotiation space for salary, but there is some; take advantage of this opportunity to negotiate your salary. EWU does not give raises for merit so beyond COLA raises, your salary is static.\r\n\r\nFinally, understand that EWU's HR department has no incentive to move quickly and they live up to that expectation. Add in the reality that it is a state bureaucracy that encourages mediocrity and you have a pretty good feel for the time frame you can expect. It is not unreasonable to expect the process to take up to 6 months. 90 days is considered \"Fast Track\", and less than that is reserved for the President's pet projects. The further away from Showalter Hall your position will be (Showalter is the administration building), the longer you need to plan on the process taking.", "Interview Questions": "Tell us about yourself"}, {"date": "17 Aug 2015", "title": "Dining Services Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Eastern Washington University (Cheney, WA) in Feb 2012", "Interview Descriptions": "You would go to the food area you would most want to work in, depending on your hours. Filled out an application one of the supervisors would give you. Turn it in. and wait for a call.", "Interview Questions": "How do you deal with stress?"}, {"date": "26 Oct 2015", "title": "SAP III Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Eastern Washington University (Cheney, WA) in Nov 2011", "Interview Descriptions": "informal, with director and two other IT staff, easy questions mostly personality questions. not mush in the way of substance, The interview was a typical state employee interview. Staff was not very personable during interview process, everyone seemed scared of losing their jobs.", "Interview Questions": "Why I want to work here"}]]