[[{"date": "22 Jun 2023", "title": "HRP Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "basically it is a long winded process sur to nature of the setup so have to be patient on the outcome of the role advertised. it can take up to 2 months for the role to be concluded, so patience is all u need.", "Interview Questions": "as usual - nothing special to note"}, {"date": "13 May 2023", "title": "Finance Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore)", "Interview Descriptions": "there was an option for an online and in-person interview. a professional and inclusive environment. The campus visit was hard to navigate and there are no bus services within the campus.", "Interview Questions": "standard interview questions posed by interviewers"}, {"date": "15 Jun 2023", "title": "Data Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at National University of Singapore (Singapore) in May 2023", "Interview Descriptions": "Casual but not good. Their considered position and salary for my interview was far below expectations. While they flattered me on my experience and credentials, they expressed difficulty to consider me for more than an entry level position. I don't know if this is the norm, but i really questioned my reality when it was happening. My thought \"there are many fresh grads who are appraised much better than what they are considering now. Is my standing so so terrible, even with my years of directly relevant experience as a research assistant?\"", "Interview Questions": "Is this job scope ok with you?"}, {"date": "18 Apr 2023", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at National University of Singapore (Singapore)", "Interview Descriptions": "Give a presentation on a topic decided by search committee consisting of 4 professors followed by an interview with them. Questions ranged from teaching methods/beliefs to subject-specific questions from the course to be taught.", "Interview Questions": "How do you manage when different students have conflicting expectations?"}, {"date": "14 Apr 2023", "title": "Medical Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at National University of Singapore (Singapore)", "Interview Descriptions": "Many different stations to sieve out prospective medical students. Stations include a group station, personal statement station and several others. About 1200 shortlisted to fill 280 slots. Afterwards, situational judgement test done online in the form of mcq.", "Interview Questions": "N/A"}, {"date": "8 May 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore) in Apr 2023", "Interview Descriptions": "Apply job in career portal, gone through two Zoom interviews, first round meeting with hiring manager, second round talk to Director only visit the Center after confirm for processing employment", "Interview Questions": "Any Motivation to work instead of quiet quitting?"}, {"date": "23 Mar 2023", "title": "Marketing & Communications Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University of Singapore", "Interview Descriptions": "Straightforward and great, interviewers were friendly and there was no pressure. I was a fairly young applicant with limited experience but they were very willing to give me a chance to learn and I ended up staying with them for over a year as an intern!", "Interview Questions": "What are some of your relevant experiences?"}, {"date": "2 Mar 2023", "title": "Senior Executive Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 5 weeks. I interviewed at National University of Singapore", "Interview Descriptions": "Two rounds of interviews. The first round was with the hiring manager. It was a face-to-face pleasant interview. The second round was with department HR. Was also lovely. However, it was the NUS central HR who was not part of the interview process that gave an offer over the phone instead. The offer was an obvious lowball salary, probably due to not having a local degree. Felt that the central HR didn't look into the relevant experience when making the offer.", "Interview Questions": "Tell me more about yourself Tell me more about what you have done in your current job What are your strengths Why do you want to work with NUS"}, {"date": "2 Mar 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National University of Singapore", "Interview Descriptions": "The interview was done by the director, HR manager and prospective PI. They have mainly gauged my capabilities through my university transcript. The interview was more focused on figuring out if I was a good fit for any of their current main projects.", "Interview Questions": "What made you choose to work in this field?"}, {"date": "12 Jun 2023", "title": "Risk Management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at National University of Singapore in Mar 2023", "Interview Descriptions": "Interview conducted by people who do not seem to be knowledgeable about the subject matter. Panel split into 2 days because one panel member couldn't make it. Not sure if they are really serious about the interview?", "Interview Questions": "Do you have experience communicating and presenting to Board members?"}], [{"date": "6 Feb 2023", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at National University of Singapore", "Interview Descriptions": "Interviewed with the director of the institution. The interviewer asked questions regarding knowledge of the field of research, past experiences, and motivation of joining the institute. A lot on one's perspective of the industry and current market outlook.", "Interview Questions": "How do you think Singapore is lacking behind in this field and area"}, {"date": "8 Feb 2023", "title": "Graduate Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Video Personal Statement needed for MSc Business Analytics application. It was a short statement but that also meant the need to be concise and to cover as much information as possible within the limit.", "Interview Questions": "AI in Business trends and future plans"}, {"date": "31 May 2023", "title": "Management Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore) in Feb 2023", "Interview Descriptions": "Applied online in February, but did not hear from them afterwards. Heard from an acquaintance by April that the NUS recruitment process was already in the final stage. Hence, definitely not selected, but had no news from NUS, just complete radio silence. Compared to NTU, there might be some differentiation practised by NUS HR, whereby they place applicants with NUS background as top priority.", "Interview Questions": "N/A"}, {"date": "30 Jan 2023", "title": "Senior Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "The interviewers were very friendly and nice. They were clear when communicating their questions. I enjoyed the interview experience. Not sure if I will get the job but it was a good experience.", "Interview Questions": "N/A"}, {"date": "5 Jan 2023", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "2 stage process, 1st round with HR and team lead, 2nd round with Director for the department. Timing between the 2 interview is roughly 3 weeks. 1st stage is most important to clear while 2nd stage is generally a formality", "Interview Questions": "Tell me more about yourself"}, {"date": "20 Dec 2022", "title": "Executive Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Had 5 interviwers in one setting via zoom. One of the interviewer didn't turn on the zoom video. Felt it was quite rude. *** **** *** **** *** **** *** **** ***** **** ****", "Interview Questions": "Able to work weekends and OT?"}, {"date": "17 Dec 2022", "title": "Risk & Compliance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "2 rounds of interviews. First is with HR & Hiring Manager. Second interview with HOD and Hiring manager. The experience was quite conversational and a way to know each other. Quite straightforward process.", "Interview Questions": "Describe job experience/skillsets relevant to the role you applied"}, {"date": "26 Nov 2022", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Two round interview with class observation. demo teaching is required and recorded. Soft skills are observed, including how you handle with stress, your strengh and limitations. Self introduction following your CV content.", "Interview Questions": "demo teaching to introduce a supervised learning method"}, {"date": "22 Nov 2022", "title": "Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Pleasant and friendly interviewers. Not much questions but could sense the respect and appreciation on my experiences. Interviewers were late but followed with sincere apologies as they had to wait for all to join the interview together.", "Interview Questions": "Share with me your relevant background and experience"}, {"date": "11 Nov 2022", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "5 min speaking to prof was good. was able to speak to him and understand the job scope so that I could do my work efficiently and do it well", "Interview Questions": "Experience with research etc etc etc"}], [{"date": "9 Nov 2022", "title": "Senior Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore)", "Interview Descriptions": "It was a pleasant interview where the interviewer wanted to find out my strengths, weaknesses as well as more on the experience that I had. As the job would require working as a team, there was also questions regarding on teamwork.", "Interview Questions": "Strengths and Weaknesses Previous Job Tasks and Experience"}, {"date": "4 Nov 2022", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "The prof just asked me whether I want to continue to research under him. No other question involved. Then afterwards we discussed the current reaseach progress and future plan. Also discussed expected compensation.", "Interview Questions": "What is you expected salary?"}, {"date": "5 Sept 2022", "title": "Assistant Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "A panel of 4 interviewers took turns to ask questions from their perspective. It has staff from HR to the department head. \r\n\r\nIt was a casual session but it was stressful with the amount of questions from their end.", "Interview Questions": "How do you deal with a stressful situation"}, {"date": "27 Aug 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at National University of Singapore (Singapore) in Aug 2022", "Interview Descriptions": "I received an interview invitation two days after applying. It was a less than 24 hours interview notice so I only had one night to prepare for it. I arrived on time but had to wait another 15 mins because they were still interviewing another candidate. One of their staff came to me to chat casually about day-to-day work. He chatted for about 2 mins before informing me that the interviewers were waiting for me.  I was told there will be one interviewer but the turn out was three. I was only asked common interview questions and some follow-up questions to my research paper. No proficiency tests, no aptitude tests and no example questions.  At the end, I was informed that they will let me know if I qualify for the second interview stage (final). The whole interview lasted quickly - 15 mins.  I sense that it was an immediate rejection from their lack of enthusiasm.", "Interview Questions": "Interview questions in sequence:\r\n1. Do you know what you applied for?\r\n2. Do you know what is TMSI?\r\n3. How familiar are you with a microscope?\r\n4. Have you worked on a boat vessel before?\r\n5. Why did you not provide a cover letter?\r\n6. Tell me about yourself and why did you apply here?\r\n7. What is your expected salary range?\r\n8. Could you tell me more about your research paper? (Not exact words because interviewer stuttered alot but this is what I interpreted her question)\r\n9. Was the research paper published or was it a school assignment?\r\n10. What statistics and data analysis tools do you use?\r\n11. Do you have any questions for us?"}, {"date": "6 Jul 2022", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Interview was with the project PI and process was rather typical interview route. Two interview in total before offer was given.\r\n\r\nGenerally was rather straightforward if the background and experience is relatable to the project agenda.", "Interview Questions": "What are you knowledge and skills applicable to the project?"}, {"date": "4 Oct 2022", "title": "Teaching Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at National University of Singapore in Jul 2022", "Interview Descriptions": "Academic transcripts of all modules taken was reviewed\r\nInterview was done by past year TAs and the professor\r\neligibility for interview is decided by grade\r\n1 round of interview followed by a basic Q&A session", "Interview Questions": "In what ways do you think you are qualified for this role?"}, {"date": "5 Aug 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National University of Singapore in Jul 2022", "Interview Descriptions": "Applied for a RA role for social research. They asked me about my prior work and research experience and proficiency at quantitative and qualitative research, as well as my research interests.", "Interview Questions": "Tell us about your research experience."}, {"date": "21 Jul 2022", "title": "Website Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at National University of Singapore (Clementi New Town, ) in Jul 2022", "Interview Descriptions": "I applied for under NUS Student Work Scheme for a project under NUS Human Resource. The whole interview process was more like a chat than meeting. He presented me his requirements and asked whether I would be able to meet the expected deliverables. It was quite a chill interview.", "Interview Questions": "Introduce myself. Why would I want to get the project. How can I help to improve their website. "}, {"date": "17 May 2023", "title": "Lab Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at National University of Singapore in Jul 2022", "Interview Descriptions": "Friendly interviewers, basic questions asked. 1 round of interview. Interviewers explained on how the company words. Overall an enjoyable interview and experience. Overall a great company to work in if you are interested in the laboratory environment.", "Interview Questions": "Describe yourself, tell us more about your previous experiences"}, {"date": "20 Jun 2022", "title": "Finance Lead Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at National University of Singapore", "Interview Descriptions": "Interview process was relatively easy. \n\nDuring interview: HR clearly did not do her research. When she asked what’s my current salary,  I mention XXX and she said something along the lines that it’s so much. She said that in a face to face panel interview with other interviewers. Lol. She is interviewing someone fresh out of Big 4 audit where the salary is pretty transparent and the general consensus is it’s below market because the turnover is expected to be high in Big 4. Her comment just shows her lack of knowledge in the field where she is expected to have information. (I got minimum 20% pay rise in all my job offers FYI)\n\nPost-interview: After I rejected the offer, she kept trying to persuade me to accept but her persuasion techniques is terrible. When I rejected, she retorted “but you apply for it”.  I said if I apply to 10 companies, must I accept 10 job offers? Not sure if she is living in a cave - candidates have options, not just companies. An adequate HR personnel should try to market their company to you since you have already successfully market your skills to them.  She also called me multiple times on various days thereafter to persuade me to accept the offer. That’s the perfect way to tell me the job is so unattractive that nobody wants it that you have to keep calling me. You know that right?\n\nThe actual hiring manager was great though.", "Interview Questions": "Why do you want this role?"}], [{"date": "20 Jun 2022", "title": "Executive Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "They asked questions regarding my resume and what I did during my university holidays. They also described more in detail about what the job scope would be. There was 2 interviewers.", "Interview Questions": "Why do you want to join us?"}, {"date": "27 Nov 2022", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2+ months. I interviewed at National University of Singapore (Singapore) in Jun 2022", "Interview Descriptions": "Hiring process was straightforward. However the interview was strange as it involved different department personnel.\nQuestions are pertaining to the job & test of technical knowledge during the interview session.\nOffer took quite some time to generate & not much room for negotiation (pay package actually on lower end of scale. No AWS and bonus very low). However, I appreciated HR Business Partner frankness.", "Interview Questions": "What is your opinion on a specific situation"}, {"date": "3 Aug 2022", "title": "Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at National University of Singapore in Jun 2022", "Interview Descriptions": "Second round of interview was a panel interview with a group of management level interviewers. Quite intimidating for a junior level role. The interview itself was short and did not cover much grounds.", "Interview Questions": "Questions were directed more at my previous experiences"}, {"date": "1 Jun 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "It was a virtual interview at night. Involved typical interview questions - both behavioural and situational.  There were two interviewers. The interview helped me to understand more about the role.", "Interview Questions": "Tell me about yourself. Why do you want this role?"}, {"date": "8 Jul 2022", "title": "Executive/Senior Executive/Assistant Manager, Academic Affairs (2-year Contract) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University of Singapore (Singapore) in Jun 2022", "Interview Descriptions": "Executive/Senior Executive/Assistant Manager, Academic Affairs (2-year contract)\n\nApplied on 17 June via NUS careers portal. The hiring manager (RO) for this role emailed me on 29 June to scheduled 1st interview via Zoom with her team. Small team of 2 HR + 1 currently hiring due to previous employer transferred to another department. Need to handle over 400 new/current staff profile. Able to work from home 4 days, select 1 day to work in office. \n\nVery very warm and friendly female RO, both her team members seems to love her. The entire interview is pretty engaging and pleasant. Asked her team member questions as well. \n\nShare about the job in detail and asked what I'm currently doing. As I do not have prior HR hiring experience, the RO say if they select me, I will start from Executive which is reasonable.", "Interview Questions": "Let us know more about yourself?"}, {"date": "20 May 2022", "title": "Manager/Senior Manager SCALE Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National University of Singapore (Singapore)", "Interview Descriptions": "Was interviewed by 3 folks 2 ladies 1 guy. The guy was a prof so far this is the only place that still prefer physical interview while others are already on zoom and teams. \r\n\r\nThroughout the interview seems like they think that u could not match their criteria and often tried to rebuke me. Till date no news nothing don’t even have the basic courtesy to give candidates an answer.", "Interview Questions": "Na as they were asking funny questions. "}, {"date": "29 Apr 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "The interview is manageable. Highly depend on your relationship with your supervisor. Normally, it should not be an issue if you already got to know your supervisor before the interview", "Interview Questions": "Are you interested in doing this kind of research?"}, {"date": "1 Apr 2022", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Had a very good experience and sharing session with the researchers and professor. Preparation on the research project you are applying is essential as they will review your strength and suitability from your understanding and approach", "Interview Questions": "Experience and interest on the project"}, {"date": "5 Jun 2023", "title": "Assistant Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore) in Apr 2022", "Interview Descriptions": "I got an email and then a call from the staff. Following that the staff sent me a zoom invite and i attended the interview on zoom. It was a fast process. Sometime later a second round of interview was arranged.", "Interview Questions": "Where do you see yourself in the next 5 years?"}, {"date": "12 Mar 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Submitted documents and went through 2 rounds of interviews, first with centre staff and finally the Principal Investigators of the project.  Overall a very pleasant interview session with the institute I interviewed for.", "Interview Questions": "Share about research experience, and very specific questions related to the research study"}], [{"date": "8 Mar 2022", "title": "Staff Writer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Very hard. Questions not clear. Way too many interviewers. I'm not sure why they have a committee to do interviews. It can be done with minimal effort. Hopefully they change this for the next round.", "Interview Questions": "What do you want to change about yourself. "}, {"date": "1 Mar 2022", "title": "Master Degree Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Two interviewers, standard questions about why singapore , why their program, what is my strength and weakness. They may extend from your answers and ask more. The interview lasted about 20 minutes.", "Interview Questions": "why singapore , why their program, what is my strength and weakness"}, {"date": "1 Mar 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Smooth, easy.\r\nFirst, just a cv screening and then they will arrange some time with you for the interview. After that the feedback will send to you very soon. I think overall is a good experience", "Interview Questions": "tell me about yourself (resume)"}, {"date": "22 Feb 2022", "title": "Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "a 10 mins interview with two lecturers\n5 questions were asked and its very chill and relaxing\nvirtual interview through zoom and they ask the general questions like tell me abt urself and why the job/course", "Interview Questions": "whats your biggest setback in life"}, {"date": "11 Feb 2022", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "You need to present your own work in detail by slides and propose some future directions. There are some questions about your past research works and why you choose to work there.", "Interview Questions": "The reason why you want to work there."}, {"date": "29 Mar 2022", "title": "Lecturer/Senior Lecturer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National University of Singapore (Singapore) in Feb 2022", "Interview Descriptions": "The interview phenomenon was smooth and took around 1 hour. However,  there was no response after the interview. It is considered highly unprofessional for a top rank university toward an academic position. It is understandable for an admin position, but I feel rude for not informing an academician of the outcome until I wrote them an email after two months of no news, despite the fact that an email was sent to them within an hour after the interview.", "Interview Questions": "Why did you choose NUS?\r\nTell us 3 values you can bring to our department."}, {"date": "30 Mar 2022", "title": "Senior Research Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at National University of Singapore (Singapore) in Jan 2022", "Interview Descriptions": "Easy going people to talk with, but mostly professors and experienced researchers will ask very technical question and make sure candidates are having high commitment to take up the role", "Interview Questions": "Do you have research experience?\nDo you know how to operate certain instruments to carry out analysis?\nWhat is your experience in this field?"}, {"date": "24 Feb 2022", "title": "Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore in Jan 2022", "Interview Descriptions": "They are friendly and nice. Feel comfortable talking to them. The interview took a total of 30 minutes and the questions asked are relevantly easy. There are a total of 2 rounds of interviews.", "Interview Questions": "What are some of the problem you faced when you are a student?\r\n\r\nPlease introduce youself. "}, {"date": "9 Jul 2023", "title": "ML intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore) in Jan 2022", "Interview Descriptions": "A short interview of 30 min, mostly it was based on the work that you've did previously, the projects you've made also some mathmatics related questions and some background check for the project", "Interview Questions": "describe the projects you've made"}, {"date": "17 Dec 2021", "title": "Executive Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Interview process was short and succinct. Interviewer ask for a short introduction and state job requirements.  Interviewer was professional and outline the job expectations as well as try to seek for your relevant skillset.", "Interview Questions": "What are the excel skills thar you process ?"}], [{"date": "8 Dec 2021", "title": "Senior Research Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "It is about 15 mins to talk about your previous research experience and what kinds of skills you have.  \nThe lab lead introduced their research projects and ask some related questions.", "Interview Questions": "What kinds of professional skills you have?"}, {"date": "6 Dec 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore) in Dec 2021", "Interview Descriptions": "I applied for the position and heard back 3 days later. I had to complete some tasks (fairly easy,  just summarizing a literature review and some Excel work) to be done in a week. 2 days after the submission of my tasks, they informed me of my interview which took place shortly after.\r\n\r\nThe interview was with 5 people, and it went really smoothly. I enjoyed it and the research fellows and assistants were engaging and interested in what I had to say, so that gave me a great impression of the team. I went into the interview rather apprehensive about the job scope, but after a great interview, I became even more excited for the role. They got back to me after one week with an offer, which I accepted.", "Interview Questions": "1) Describe your strength and weakness\r\n2) What sort of programming languages do you know\r\n\r\nIt was a pretty casual and informal interview just to get to know me and gauge whether my personality will fit in with the team's dynamics.\r\n"}, {"date": "10 May 2022", "title": "Senior Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at National University of Singapore (Singapore) in Dec 2021", "Interview Descriptions": "Was very thorough and i enjoyed learning more about the company and the role. Was around 45mins long and i spoke to both my reporting officer and the director of the department. Very insightful", "Interview Questions": "Scenario question on how i will handle an event from scratch "}, {"date": "5 Feb 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at National University of Singapore (Singapore) in Dec 2021", "Interview Descriptions": "Interview process was fairly quick and straightforward. Interviewers were friendly and polite throughout the process. All the questions asked were related to the job position. Overall it was a pleasant experience.", "Interview Questions": "- Introduction\r\n- Prior experiences\r\n- Relevant skills and experiences\r\n- Future plans \r\n- Scenario questions \r\n"}, {"date": "29 Nov 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "It was a very straightforward 1-on-1 interview. I was asked for a face-to-face interview at the company. After arriving, I was let inside and led to their own personal office. The interview itself took about 30 minutes. There were questions about my experience, interest, and some test situational questions as well.", "Interview Questions": "Tell me about yourself, why this position, how long do you see yourself in this position, and some scenario questions. "}, {"date": "21 Nov 2021", "title": "Research Assistance Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore", "Interview Descriptions": "asked about availability, number of hours per week u can put in, describe job role and requirements and about what i would do in different situations for example a question is if your team mate does not do work, what would u do", "Interview Questions": "N/A"}, {"date": "21 Nov 2021", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National University of Singapore (Singapore)", "Interview Descriptions": "Conducted during the pandemic, so they set up a zoom interview. Only 15min slots reserved for each candidate, and interviewers seemed rushed. Interviews included 2 faculty members, in kind of a good cop-bad cop positioning.", "Interview Questions": "Asked a lot of personal questions including citizenship details, parents' occupational background, etc., which seemed fairly unrelated to the role and pretty unprofessional. Only vaguely-related question they posed was about which other schools I've applied to."}, {"date": "9 Nov 2021", "title": "Senior Executive/Manager (Corporate Communications) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore", "Interview Descriptions": "It was over zoom. Participants had to complete 2  assignments. One is to edit a prospectus and another was to come up with a copy in 45 mins. Following which, they will evaluate and contact you for an actual interview.", "Interview Questions": "This was a pre-interview test."}, {"date": "13 Oct 2021", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore", "Interview Descriptions": "Few rounds of interviews, the first one being the shortest.  I think generally the process was rather smooth.  I was called up for a second interview within the next week or so and the following one within a few weeks.", "Interview Questions": "What do you aspire to do in the future?"}, {"date": "10 Oct 2021", "title": "Adjunct Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "It was held on campus in one of the faculty offices, with the head of department and a few others, all sitting around a small table. It was like an informal chat, to get to know each others' backgrounds, research interests and teaching interests.", "Interview Questions": "What would you be able to teach?"}], [{"date": "17 Sept 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Worst interview experience. 2 interviewers in the panel. From the very beginning even before the session started, both of them already sounded uninterested. Throughout the session, they had a monotonous tone and were extremely rude and unpleasant. While answering questions, they would find whatever ways to rebut your responses, and even doubt your abilities by responding in a sarcastic manner. Honestly makes me wonder if this is an interview or an interrogation. You would think an institution like this would have decent interviewers but I guess I thought wrong.  Perhaps the institution should consider accessing staffs before they can be qualified to be an interviewer cause not everyone is cut out to be one.  Even had the basic courtesy to email them after the interview to thank them for the opportunity but received no response. Overall VERY unprofessional.", "Interview Questions": "What makes you think you are suitable for the job?"}, {"date": "8 Sept 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "One to one interview structure. It was really chill and they ask pretty standard interview questions. The PI was really genuine and wanted to understand you as a person. HR got back to me pretty quickly as well. Got the offer on the spot.", "Interview Questions": "Tell me more about yourself. "}, {"date": "1 Sept 2021", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "I felt that the interview was very easy.  The interviewer was friendly and knowledgeable about the jobscope so it was easy to get more information about the job from her.", "Interview Questions": "N/A"}, {"date": "20 Aug 2021", "title": "Management Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "There were several rounds, including online assessments, a group interview round, an individual interview round and a tea session with senior management. In the group interview round, it was a group discussion and presentation. In the individual interview round, they would ask more about your background, and what kinds of departments you were interested in.", "Interview Questions": "I was asked how I would count all the bicycles in Shanghai"}, {"date": "3 Aug 2021", "title": "Teaching Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at National University of Singapore (Singapore)", "Interview Descriptions": "It was a group interview. We were made to feel comfortable but the questions were deep, extensive and thorough. We were questioned on our individual teaching styles, our potential reactions to situations, our philosophies on education etc. Our personalities were also indirectly analyzed.", "Interview Questions": "Questions included hypothetical situations and various teaching methodologies and philosophies. "}, {"date": "26 Dec 2021", "title": "Teaching Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National University of Singapore in Aug 2021", "Interview Descriptions": "There were two rounds in the interview process:\n1. A 30-minute conversation with the professors teaching the course.\n2. A 45-minute teaching demo with the professors and some students.\n\nAll the interviews were held over Zoom due to the COVID-19 pandemic.", "Interview Questions": "Prepare a presentation on the scientific method."}, {"date": "17 Apr 2023", "title": "Assistant Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University of Singapore (Singapore) in Aug 2021", "Interview Descriptions": "Swift, legitimate questions and best of all, they follow-up with you post-interview. There will be two persons attending the interview with you, and interview wasn't in a formal setting. I would suggest taking note of the job description as their questions are more focused on your hard skills.", "Interview Questions": "Tell me more about your past projects"}, {"date": "29 Jul 2021", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "I submitted my application online and there was only 1 round of interview. The interview was quite pleasant. The interviewers were friendly and were able to clarify on the job role.", "Interview Questions": "- Tell me about yourself\n- Where do you see yourself in 5 years?"}, {"date": "1 Jul 2021", "title": "Research Apprentice Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at National University of Singapore", "Interview Descriptions": "There was no interview process. i was already in contact with the profession who is interested in letting me be a research apprentice. After application, i was accepted.\r\n\r\nHiring process: Contact the prof who you want to work with and asked him about the role. After discussion, if he is interested in hiring you, you should get then role pretty easily", "Interview Questions": "There was no interview questions"}, {"date": "1 Jul 2021", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Interview with team lead to discuss job skills and suitability. Interview with department head to assess job fit. Final interview with Human Resources Department to do last background checks and referee checks.", "Interview Questions": "What are your strengths and weaknesses?"}], [{"date": "6 Jun 2023", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University of Singapore in Jul 2021", "Interview Descriptions": "Asked a few standard questions about why I wanted the job, my teaching pedagogy, whether I was interested in pursuing PhD. It was quite informal and casual and the interviewer was quite candid.", "Interview Questions": "What is your teaching pedagogy and how will you apply it to [Specific Module]?"}, {"date": "16 Jun 2021", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "I interviewed with the Department of Chemistry at NUS. This consisted of research talk (public), a proposal defence (closed door), and many 1-on-1 meetings with faculty members. A few of the faculty members were *extremely* rude during the 1-on-1s, e.g.,  cuts you off mid-sentence, asks you questions and then not letting you finish your response before interrupting, unsolicited sarcastic remarks, and a generally hostile demeanour.  The department could also do better to strengthen their Singaporean core, i.e., many of the professors are foreign workers.", "Interview Questions": "Standard technical questions about your past research and your proposed future research."}, {"date": "9 Jun 2021", "title": "Peer Advisor Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore", "Interview Descriptions": "45 minute face to face interview where they asked questions relating to the CV, short event management  questions. Interviewers were 2 FT staff and 2 senior PALs. Pretty relax and chill. dont stress", "Interview Questions": "Incident management"}, {"date": "24 Jun 2021", "title": "Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National University of Singapore in Jun 2021", "Interview Descriptions": "This was for a position with CFG of NUS. There were 3 rounds of interview - The first was with a  HR representative, then a panel of 3 interviewers including Department Manager. In this round, you would be given a prompt to create a presentation, no longer than 10 minutes. You present it and answer questions from the panel. The  final round interview is with the Director and another senior staff.", "Interview Questions": "What skills are employers looking for in fresh graduates?"}, {"date": "15 Sept 2022", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University of Singapore (Singapore) in Jun 2021", "Interview Descriptions": "Very easy, with the professor and manager. They asked standard questions and only one round of interview. The professor was also friendly which make the interview to be less tense.", "Interview Questions": "Strength and weakness. Tell me about yourself."}, {"date": "17 Nov 2021", "title": "Administration Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University of Singapore (Singapore) in Apr 2021", "Interview Descriptions": "Fairly simple process, the interviewers do not expect much especially for fresh graduates. They will not ask difficult questions but your intentions of joining the department. So just be prepared to answer those kinds of questions.", "Interview Questions": "Why did you choose to work here?"}, {"date": "26 Mar 2021", "title": "PhD Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Straight forward, done over zoom, so wasn't too bad as a whole. Was in a breakout room with 3 interviewers. Asked pretty standard questions, so do your preparations well and you should be fine.", "Interview Questions": "Tell me about yourself. "}, {"date": "25 Mar 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Talked about skills that are useful for the position, future plans for development and potential projects to accomplish within the contract. Learned a lot about the laboratory culture and get to know the people, and facilities to conduct experiments.", "Interview Questions": "What are your plans for the next five years?"}, {"date": "24 Mar 2021", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "good and smooth. \r\nquestions about PhD and other research \r\nneed to explain the entire PhD work and also Masters work\r\nasked about the career goals\r\nwhy want to join academia\r\nwhere do you see yourself in next 5 years \r\nhow good are u a team player", "Interview Questions": "Phd work and the data "}, {"date": "24 Mar 2021", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Friendly and talked a lot about what the interviewee actually did in the past projects and professional experience. What mathematical and programming skillset the interviewee has. What is the expected career path? What is your ideal position?", "Interview Questions": "What was your role in and contribution to the project?"}], [{"date": "22 Mar 2021", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Interviewers were very friendly, more like a chit chat session and get to know more about you session rather than a very serious interview. There were two interviewers in total.", "Interview Questions": "What are your plans after graduation "}, {"date": "3 Aug 2021", "title": "Research Associate (Centre for International Law) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University of Singapore in Mar 2021", "Interview Descriptions": "The JD stated that shortlisted candidates would be invited for a test and interview. After I completed the test and interview, I was invited to another test. Not only did they not give notice of the additional round, they rushed me to take leave to do it despite me telling them I had a lot of urgent commitments at work. The interview was also scheduled in a very haphazard manner, before they even saw the results of the test.  In the end, they didn't even have the courtesy to reject me.", "Interview Questions": "What was an impact studying law had on your life"}, {"date": "25 Jun 2021", "title": "Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at National University of Singapore in Mar 2021", "Interview Descriptions": "1st interview via zoom. Easy\r\n\r\nSecond interview Need to do written assessment and powerslides for 2nd interview. Present to a group panel. Whole process about 45mins\r\n \r\nInterviewers were friendly, asked the usual questions.", "Interview Questions": "Where you see your self in the next few years"}, {"date": "14 Apr 2022", "title": "Executive Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore) in Mar 2021", "Interview Descriptions": "Neutral and not much questions asked. Very generic…….. Vibes is not there. No recommended. ….. ok \r\n—-\r\nCan consider if you want to work at these area or if you stay nearby.", "Interview Questions": "Describe about yourself.  What are some good points?"}, {"date": "1 Feb 2023", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at National University of Singapore (Singapore) in Mar 2021", "Interview Descriptions": "very easy and comfortable since my PI has worked with me for around 2 years and he knows me well. PI can decide on the candidate by himself. So YOU Only need to get the support from your PI.", "Interview Questions": "Future plan salary expectations any research ideas for future work"}, {"date": "25 Feb 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at National University of Singapore", "Interview Descriptions": "Direct interview with Professor, technical question related to research experienced and previous experiments and projects.\r\n\r\nOne time interview only. Documents process and decision for hiring tooks months. HR is quite slow in processing offer and many people has to approve before offer letter comes out.", "Interview Questions": "Can you present your research projects?"}, {"date": "24 Feb 2021", "title": "Senior Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "It was quick, and I got to know the department better too. One interview round only.\r\n\r\nSubsequent admin clearance after verbal offer took awhile to be approved. But everything generally went smoothly.", "Interview Questions": "Why did you apply for this department?"}, {"date": "26 Mar 2021", "title": "Research Asisitant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at National University of Singapore (Singapore) in Feb 2021", "Interview Descriptions": "Relatively casual. Interviewer wanted to know more about future plans, etc. Also asked about research interests. Did not have to prepare anything in advance for the interview. No additional tests to take.", "Interview Questions": "1. skillset\r\n2. future plans\r\n3. research interest"}, {"date": "13 Jun 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National University of Singapore in Feb 2021", "Interview Descriptions": "Virtual interview with the faculty members and other research team\r\nSimple and direct. \r\nPrincipal investigator will ask about your opinion on the current research trend etc. \r\nThe HR screening process is however long around 1 month", "Interview Questions": "What can you tell me in details about this project"}, {"date": "8 Dec 2022", "title": "Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Tampines New Town, ) in Feb 2021", "Interview Descriptions": "Smooth and was friendly. The discussions laid out were inclusive of the benefits and tasks outlined. This was a pleasant experience and transparent. Appreciated the positive process. There was also on the job expectations and training that was useful.", "Interview Questions": "What is your interest in project and research?"}], [{"date": "11 Jan 2021", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Three rounds with senior management. Slow hiring process, too much paper work and they might take three months to offer. Questions are both behavioural and role specific, prepare on current affairs as well.", "Interview Questions": "Previous background, skills, how can you value add to the role"}, {"date": "18 Feb 2021", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at National University of Singapore (Singapore) in Jan 2021", "Interview Descriptions": "Application was sent in smoothly and easily, very straightforward. It was good and nurturing, well thought and interviewer was respectful of the answers. Everything went smoothly and waiting for outcomes of the results.", "Interview Questions": "How can you contribute to the team?"}, {"date": "28 Dec 2020", "title": "MBA Candidate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Skype Interview;\r\nit takes about 1 hour, in the later afternoon;\r\nand the process is quite good; the professor is very nice.\r\nI was the last one to interview. At the end of the interview you have chance to ask the interviewer question, too.", "Interview Questions": "1. Introduce yourself on your experience, job, and education\r\n..."}, {"date": "26 Dec 2020", "title": "Accountant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "First-round interview after a resume screening. I received an interview invitation 3 weeks after I submitted my resume. The first-round interview was just like a normal conversation. Walked through my resume and questioned about my former experience. It seems that they would like to know cultural fit.", "Interview Questions": "1. Why do you apply?\r\n2. My former work experience. Why I quit etc. "}, {"date": "7 Dec 2020", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University of Singapore", "Interview Descriptions": "Fast and direct because the interview is arranged when you are deem suitable for the research project. Usually the employer will ask more about the technical skills that the candidate have and to share some details about the project that the employer want the candidate to be involved in", "Interview Questions": "Past experience about the project that I am working on"}, {"date": "5 Nov 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore) in Oct 2020", "Interview Descriptions": "Typical interview as with any other company. The principal investigator spent most of the time doing the talking describing the lab and work environment etc...interviewer was enthusiastic and questions were asked through the interview process.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "28 Oct 2021", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore) in Oct 2020", "Interview Descriptions": "Interview was done via zoom with the PI and the lead professor of the SINGA scholarship.  The interview had questions such as: why pursuing a PhD in Singapore? What are your research interest? What are your plans after finishing your PhD?", "Interview Questions": "The interview had questions such as: why pursuing a PhD in Singapore? What are your research interest? What are your plans after finishing your PhD? "}, {"date": "28 Sept 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "research skill test containing two parts, writing a literature review and a statistical question by stata,average difficulity, one week to complete\r\ninterview, ask about past experience and future plan, about 20 minutes", "Interview Questions": "Past experience and future plan"}, {"date": "21 Sept 2020", "title": "Laboratory Technologist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "calm, fun, interviewer was not intimidating. fast process not more than 30 minutes for the whole interview; questions ask by interviewer are basics to get to know you more & how competent you are", "Interview Questions": "how well do you cope with stress"}, {"date": "15 Sept 2020", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore", "Interview Descriptions": "Straightforward, ask about research experience and career aspirations. Interview panel consisted of 3 persons including your principal investigator and co principal investigator. There were two rounds of interview. After selected, had to go through medical checkup and wait for HR to process application. Took about 1 month.", "Interview Questions": "What do you see yourself doing in 5 years time? Why you want to join?"}], [{"date": "14 Sept 2020", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Asked me questions on chemistry topics, my experience in teaching. Friendly interview. Also asked me how I would teach a class of twenty students, my methodology, marking method, etc. They asked me for references so I gave. Even gave a mock class.", "Interview Questions": "1. What are the different types of interactions found in macromolecules?\r\n"}, {"date": "2 Sept 2020", "title": "MSC Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National University of Singapore", "Interview Descriptions": "1) Online application\r\n2) Receive confirmation email and select feasible date or interview(first come first served)\r\n3) Skype video call with two interviewers (one program director + CEMS program )\r\n4) Wait for the result", "Interview Questions": "1)  Background checking on the information you mentioned in CV;\r\n2) Tell me about a book that you read recently that interests you"}, {"date": "14 Aug 2020", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at National University of Singapore", "Interview Descriptions": "Straightforward interview process as job description clearly states what is expected for applicants. The application was also easy as you just need to apply online by sending in your CV and personal statement.", "Interview Questions": "Why do you want to apply to this position?"}, {"date": "1 Feb 2021", "title": "Software Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at National University of Singapore (Singapore) in Aug 2020", "Interview Descriptions": "Online quiz and approached by nus iss staff to guide you along . Interview process is quite fast and just have to sit for one session which is the online assessment", "Interview Questions": "Team with some one you don’t want to work with"}, {"date": "23 Sept 2020", "title": "Vet Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at National University of Singapore (Singapore) in Aug 2020", "Interview Descriptions": "Went through a total of 3 interviews, 1st and 2nd interview were nice and both went well.  However, the last interview, a peer interview, did not go well. There was a total of 8 people in the interview and they took turns asking questions. The interviewers, who were supposed to be my future teammates if I was to be hired, sounded haughty and was overall negative and had demoralising remarks towards my answers.  They said they would send a reply email after the interview regardless of the outcome, however, I have not heard from them since (even when I sent an email to ask for updates on the application). It is very unprofessional and impolite as I was  very interested in the job but have not received any reply even though they said they will email back.", "Interview Questions": "They did not ask much questions, just kept saying how teamwork is important and they want someone who has initiative. "}, {"date": "23 Nov 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore) in Aug 2020", "Interview Descriptions": "Just had one round of interview with a panel of people in the department I am in. They replied me on email the next day letting me know that I had been accepted.", "Interview Questions": "Q. What do you know about our department?\r\nQ. Why do you want to join this department?\r\nQ. What are your interests?"}, {"date": "1 Jun 2022", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 6 months. I interviewed at National University of Singapore (Singapore) in Aug 2020", "Interview Descriptions": "there were at least teo levels of interview required. A formal one with the job requestor, and the respective team lead.\r\nThen another one with an appointed neutral panel under the same cluster", "Interview Questions": "past experiences, how your capabilities can help the task"}, {"date": "27 Jul 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University of Singapore", "Interview Descriptions": "Mostly sharing of past experiences and acquired skills, pretty chill. PI just want to know more about applicants, and their future career plans. It was through Zoom and lasted around 30 minutes.", "Interview Questions": "Why apply this job"}, {"date": "5 Sept 2020", "title": "Laboratory Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at National University of Singapore (Singapore) in Jul 2020", "Interview Descriptions": "First interview was with your future colleagues. Second interview was your managers. They were sarcastic during the interview and thinks that what you said are lies. They acted like I owned them.", "Interview Questions": "Why do you want to join us."}, {"date": "2 Feb 2021", "title": "E&P Trainee Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1+ week. I interviewed at National University of Singapore in Jul 2020", "Interview Descriptions": "Straightforward and simple. There were 3 people interviewing me through Zoom. \r\nThere was only 1 interview round and they contacted me within a week to let me know that I have a job offer.", "Interview Questions": "Do you have social media experience? What are your strengths and weaknesses? What are you looking for in the job? Where do you see yourself in the future?"}], [{"date": "22 Oct 2020", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at National University of Singapore in Jun 2020", "Interview Descriptions": "Due to circuit breaker, my interview was conducted via zoom. It was a comfortable setting and my interviewers were very friendly. They do look at your CV or resume and ask you some questions based on your experiences.", "Interview Questions": "What are you keen to take up this role? "}, {"date": "11 Jan 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at National University of Singapore (Singapore) in Jun 2020", "Interview Descriptions": "Interview process was pretty straightforward, with just one round of interview with the department heads. They asked about research interests, and reasons for applying, the research experiences and skills possessed etc.", "Interview Questions": "Why did you apply for this job and what do you want to gain from this job?"}, {"date": "14 May 2020", "title": "Finance Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 months. I interviewed at National University of Singapore", "Interview Descriptions": "The interview took forever to come. However, the 3 interviewers are very friendly and will guide you along during the interview process. It was a nice experience though the interview lasted around 45 mins.", "Interview Questions": "What and how can you add value to the organisation?"}, {"date": "12 May 2020", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore", "Interview Descriptions": "Two rounds of interview. The first was with the manager and the second was with the director and same manager. Straightforward interview questions. They were friendly and overall pleasant experience.", "Interview Questions": "Tell me about yourself"}, {"date": "21 Sept 2021", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National University of Singapore (Singapore) in May 2020", "Interview Descriptions": "Was interviewed by 3 professors who asked me about details of the final year project I worked on. The intention was for me to apply my model to something that they were planning to work on.", "Interview Questions": "Unfortunately my questions were highly specific to the work that I was doing."}, {"date": "6 Aug 2020", "title": "Teaching Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at National University of Singapore (Singapore) in May 2020", "Interview Descriptions": "The initial part of the application process was OK. The interview took about 1.5 months to come, but to be fair I applied quite early in the application cycle. The interview went well, and I was told they would get back to me with further steps. And then radio silence.\r\n\r\nFor almost 3 months.\r\n\r\nEvery time I emailed them to inquire on the progress of my application, they would say that they were still processing the application and that they would get back to me when they have news.  They wouldn't give me a timeline as to when they would get back to me either. \r\n\r\nAfter 3 months, the semester started and I figured they weren't going to give me the job so I accepted another job offer. But the lack of courtesy to tell candidates that they weren't under consideration, even when they checked in via email, was extremely unprofessional. It left a very bad impression on me and would make me think twice about reapplying.", "Interview Questions": "Some technical questions from the module they were hiring for."}, {"date": "9 Dec 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at National University of Singapore (Singapore) in Apr 2020", "Interview Descriptions": "Interview process is swift, not too difficult and quite casual if you are well acquainted with the professors personally. \r\nBe prepared to answer questions like your area of interest especially in research.", "Interview Questions": "What is your area of interest?"}, {"date": "16 Mar 2020", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "talk to the prof, explain you work and give a talk \r\nmight need to write some math formula \r\nstat department, so might ask some basic stats and probability questions\r\nonly 1 round", "Interview Questions": "explain your research "}, {"date": "10 Jul 2020", "title": "Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at National University of Singapore (Singapore) in Mar 2020", "Interview Descriptions": "There were few rounds of interview, with hiring manager, big boss and finally a panel interview with the big bosses, HR and HOD\nThe process was quiet lengthy and took more than a month to get an offer\nDon't expect a big hike as they are not a private organisation with huge turnover or profits\nI got a decent hike but other benefits were not that great compared to previous job\nNo AWS, but there is performance bonus", "Interview Questions": "Lot of Technical questions based on role you appled for and about your existing job"}, {"date": "19 Jan 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at National University of Singapore (Singapore) in Mar 2020", "Interview Descriptions": "I got an virtual interview invitation a couple months after I applied online. The interview was with 3 people, museum director, another manager, and a HR manager. Interviewers left me less than 5 minutes to ask my own questions and director completely turned down my question about what benefits the job would offer. Just said \"the usual\". A thorough questioning of my current job and responsibilities with not much regard for my other experiences. Questions related to museum collections management and collections development. No questions about \"why NUS\" went straight into questions about my job.", "Interview Questions": "Tell me about your job and responsibilities."}], [{"date": "12 Feb 2020", "title": "Associate Management Programmer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at National University of Singapore", "Interview Descriptions": "Group assessment, self-introduction and panel interview.  One of the interviewers was not very professional in the way the questions and statements are phrased. \r\nPanel interview does not seem like an interview and would not provide a good understanding of the candidate.", "Interview Questions": "Why do you want to work at NUS?"}, {"date": "13 Feb 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore", "Interview Descriptions": "It was more of a casual interview so it wasn’t as stressful as expected. It was an interview with the Principle Investigator and he wasn’t overly formal or anything so I wasn’t as nervous as compared to other interviews.", "Interview Questions": "Past experience"}, {"date": "6 Feb 2020", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "I wrote my own grant and was hired under it. So there was not much of an interview after the grant was approved. Try to find someone who can refer you: it helps in getting your email answered.", "Interview Questions": "Not applicable to my case"}, {"date": "20 Feb 2023", "title": "HR Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National University of Singapore in Feb 2020", "Interview Descriptions": "Questions are to the point. There was a written test. Happy with the rate the entire interview progressed. Efficient use of time. Out come was made known almost instantly. You go in with your eyes open. No surprises", "Interview Questions": "1. Which hr system did you use previously"}, {"date": "25 Sept 2021", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National University of Singapore (Singapore) in Jan 2020", "Interview Descriptions": "two rounds of interviews \nthe second round is a job talk\ntypical academic interviews\nmay contact candidates in staggered batches so don't worry if some people are already invited for interviews and you haven't heard anything", "Interview Questions": "similar to other schools. tough questions during the job talk"}, {"date": "4 Mar 2023", "title": "Executive of Alumni Engagement Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National University of Singapore (Singapore) in Dec 2019", "Interview Descriptions": "It comes in 2 stages - an interview and then a written assignment on a computer. The interview was done by 2 snobbish women that made me want to stand up and leave in the middle of their interview, which is something I would have done if it happened now because I've decided to stop tolerating rude interviewers. (I'm writing this review belatedly.) they asked many irrelevant questions that were completely outside of work and qualifications. They picked up on part of my resume that mentioned my volunteering experience at dog shelters and one of the women said \"but dogs can be noisy right?\" with some disgusting expression on her face. They were the ones that asked me about it so why ask about something you clearly hate and think is beneath your species? I replied \"they're cute so it doesn't matter\" and she looked as if she was jealous of a dog. The other woman was no better. Asked about my previous company like they have some preoccupation about the past and when I answered what I didn't like about it (they didn't properly guide newcomers), she said, \"they never hold your hand?\" dripping with sarcasm as if my reply could possibly be wrong when it is literally an opinion question she asked. And there is a clear difference between common sense to guide newbies and hand-holding. Again, if you don't want an answer then don't ask. You can also clearly see her attitude towards her job and newcomers in the way she thinks that newcomers should know how to do everything by themselves and that the old staff need not do anything at all, which is absolutely nonsensical.", "Interview Questions": "Why did you leave your last company?"}, {"date": "28 Jun 2020", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University of Singapore (Singapore) in Nov 2019", "Interview Descriptions": "The interview was one to one. It was smooth and in a positive environment. The interviewer was patient and discussed the project in detail and asked if I am interested in joining.", "Interview Questions": "Previous research projects"}, {"date": "19 Jan 2021", "title": "Laboratory Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University of Singapore in Nov 2019", "Interview Descriptions": "Interview was relatively short and straightforward, nothing too intimidating. 3 interviewers in total, 1 from the HR department. Interview went smooth, basically looking through your resume and chatting to get to know you better to see if you are a good fit for the role.", "Interview Questions": "Skillset and expertise\r\nAvailability to work over weekends\r\nWillingness to learn new softwares\r\nPast experience"}, {"date": "17 Oct 2019", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at National University of Singapore", "Interview Descriptions": "It's ok and pleasent. The professor asked many questions, which mainly focused the transcript and research experience. All listed grades and awards were asked, grade level....Then we talked about research area. The limitation and obstacles of current research.", "Interview Questions": "Discribe your research area and its prospect"}, {"date": "14 Sept 2019", "title": "Associate Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Some questions regarding the area of research lab you are applying for. Basic programming skills and questions and matlab questions also. The interview is not quite formal and only one round is needed.", "Interview Questions": "How many byte is one char type used."}], [{"date": "2 Sept 2019", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Standard interview questions and some technical questions relating to the project that you've applied for. Interview questions about data collection and analysis with sample data from the project. Interview was with the project head.", "Interview Questions": "How would you address a hypothetical problem in the project"}, {"date": "25 Sept 2019", "title": "Specialist/Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National University of Singapore (Singapore) in Sept 2019", "Interview Descriptions": "The entire process was brief; received a call for an interview scheduled a week later. There were 4 people in the room. Most of the questions came from the professor for the department. Interview took 15 mins.  Was told to wait 2 weeks for a response, however no response from HR after an update email being sent (unprofessional at best)", "Interview Questions": "What are you future plans if you get this job? "}, {"date": "5 Dec 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at National University of Singapore (Clementi New Town, ) in Sept 2019", "Interview Descriptions": "I applied for another role on the advert. However, when I went there, they looked at my CV and advised another role for me, which I am more interested in. I did not get to meet the PI in 2 interviews but met about 4 of the post-docs and had a little lab tour upon requests. The interviewers were very nice and it was more of a chit-chat than a very formal interview.\r\n\r\n I was asked to request my referees to submit references separately and privately to the PI after the first interview. The 2 interviews were 1 month apart and the offer came another month after. A week after the PI offered via email, HR contacted me to submit my documents. HR then informed me that they would need about another 2 months for internal processing of my documents. From the first interview to the date where I would start my job, that would be about 5 months. Do be prepared for the long application process.", "Interview Questions": "Explain on how your expertise can help the lab and what you would like to learn from us?"}, {"date": "26 Aug 2019", "title": "Laboratory Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at National University of Singapore (Clementi New Town, )", "Interview Descriptions": "There were 4 people involved during the interview and each took their turn to provide questions related to their field. The whole interview process took around one and the half hours and after that, there was a short tour where there was a walk to a specific laboratories", "Interview Questions": "Why should they hire me"}, {"date": "16 Aug 2019", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Called up for interview, went for interview conducted by PI and research fellow, asked general questions about myself and some technical questions regarding their research field, waited for a week for their offer", "Interview Questions": "Tell me about yourself and your own research experiences\r\nTechnical questions (lab, research field)\r\nWhat do you see yourself in next 3 to 5 years\r\nWould you do PhD?"}, {"date": "28 May 2023", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at National University of Singapore (Singapore) in Aug 2019", "Interview Descriptions": "Easy, doesn't involve a lot of questions, but do note that the role is highly dependent on the professors. So know them well before you accept the offer. The role is also usually not described in the job description. You will likely do everything the profs asks", "Interview Questions": "What are the experience you have on xx process?"}, {"date": "27 Jul 2019", "title": "SCIENTIFIC OFFICER Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at National University of Singapore", "Interview Descriptions": "Straight-forward interview, need to know the machine you'll be operating well (in this case, was the NMR), they're very sure of what kind of candidates they are looking for. Esp in the CMMAC, they're looking for experts. So if you're a fresh graduate, try for teaching lab (scientific officer) roles instead.", "Interview Questions": "What do you know about the NMR? Have you operated it before, how to operate it?"}, {"date": "29 Jan 2020", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at National University of Singapore (Singapore) in Jul 2019", "Interview Descriptions": "2 rounds of interview. Short, with friendly conversation. Did not specifically touch on my job scope. Was not willing to share the pay I was getting and unwilling to give me my market value salary.", "Interview Questions": "My IT knowledge background, if i was willing to work shift."}, {"date": "26 Jul 2019", "title": "Academic Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at National University of Singapore (Bukit Timah, ) in Jun 2019", "Interview Descriptions": "There are two round interviews. One in English and one in Mandarin.  In the first round interview, there will be a written test to check professional vocabulary on public policy.  It took two weeks to shortlist for next round interview.", "Interview Questions": "What is your strength/ weakness in your last work? How do you deal with government relationship?"}, {"date": "2 Jun 2019", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "The process took 4 weeks. I interviewed at National University of Singapore (Singapore)", "Interview Descriptions": "I knew of the job from an acquaintance who knew the principle investigator of the project. After he introduced us, we had a one on one interview where he described the overall scope of the project and asked me some technical questions. After a week or so I was contacted by an adminstrative staff from the school to verify my background and then was offered a job when everything checked through. Had a medical checkup at the school and started work a month or so later.", "Interview Questions": "PI described the project and asked me some technical questions on graph analysis."}], [{"date": "16 Nov 2019", "title": "Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at National University of Singapore (Singapore) in Jun 2019", "Interview Descriptions": "Email, job scope questions, not much difficulty. I was invited to go on a tour of the area and familiarise myself with the environment. Given a full set of resources required to work the job.", "Interview Questions": "Aims/goals  of the duration of work"}, {"date": "31 May 2019", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at National University of Singapore", "Interview Descriptions": "I could directly email the concerned supervisor. It was a very quick process. face to face or skype interview options available, interview questions mostly based on academic and research experience, research proposals,", "Interview Questions": "Research experience and skills"}, {"date": "24 May 2019", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Professional questions related to the field of interests, very nice interviewers. The total process didn't last long. You may have a vision about how you can improve the quality of your work.", "Interview Questions": "Professional questions"}, {"date": "17 Mar 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at National University of Singapore in May 2019", "Interview Descriptions": "Single interview with principal investigator (PI). Talked about previous lab skills and given a task to test response speed. PI shared about the project that you will be involved in.", "Interview Questions": "Talk about yourself and your final year research project and the lab skills you possessed."}, {"date": "30 Apr 2019", "title": "Associate Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at National University of Singapore (Singapore) in Apr 2019", "Interview Descriptions": "A very long application form followed by a campus visit which was very well organised and included a presentation, a teaching lecture, and a panel interview, conducted over two days. Informal meetings with faculty were pleasant and also well organised.", "Interview Questions": "What are your publication plans for the future?"}, {"date": "2 Nov 2022", "title": "Senior Executive Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at National University of Singapore (Singapore) in Apr 2019", "Interview Descriptions": "I was asked technical questions to determine if you knew your work and job scope. First interview with the bosses and then the second interview with the rest of the team", "Interview Questions": "Marketing calculations for social media"}, {"date": "20 Mar 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore", "Interview Descriptions": "The job was advertised on many job search websites. I applied to 1 of them and weeks later I was selected for an interview. The setting was quite informal thus making the session comfortable enough to be yourself.", "Interview Questions": "Are you able to commit some of your weekends just to deliver results?"}, {"date": "7 Apr 2020", "title": "Undergraduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at National University of Singapore (Singapore) in Mar 2019", "Interview Descriptions": "Mostly evaluating your ability to teach and your passion for the subject. They want to see whether you are genuinely interested in teaching people and whether you can convey your thoughts effectively", "Interview Questions": "Explain recursion"}, {"date": "14 May 2019", "title": "Professional/Non-academic Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at National University of Singapore (Singapore) in Mar 2019", "Interview Descriptions": "I applied online and got an interview invitation about 1.5 weeks after submission.  The interviewer didn't introduce him/herself.  Interviewer spoke 80% of the time which defeated the purpose of the session.  I didn't get an opportunity to showcase my achievements and ideas.  Poor interview session.", "Interview Questions": "What made you shift from one industry to another? "}, {"date": "12 Jun 2019", "title": "Executive Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore) in Mar 2019", "Interview Descriptions": "It was really fast and they asked questions on my background and work experience. The lady was nice and asked leading questions covering my team's portfolio and my own portfolio. Asked about my teamwork capabilities.", "Interview Questions": "Long term plans and study plans. Including what I did previously and the Challenges I forsee in my new role. "}], [{"date": "8 Jan 2021", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National University of Singapore (Singapore) in Mar 2019", "Interview Descriptions": "There is a written test. Followed by two  interviews, first with the hiring manager and second is with the director of the department. The hiring process is a bit slow as I understand there will be different approving people to hire someone new. May also chase the HR to speed up the process if need be.", "Interview Questions": "About the past experience I have and how well can I adapt to the role that I am applying"}, {"date": "14 Jun 2022", "title": "Grad Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University of Singapore in Mar 2019", "Interview Descriptions": "Interview was very smooth and it was more like a conversation than an interview.  Professor interviewed me and he was very nice to tell me about his research and his goals.", "Interview Questions": "Tell me about yourself, your long term goals, your research interest, what was your previous job and what did you do there"}, {"date": "4 Sept 2022", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National University of Singapore in Mar 2019", "Interview Descriptions": "Interview for research fellow position, asked me a few questions about my research background and publications. Find the job poster from Jobstreet, first contacted by an admin staff. Offer received in 1 week after interview.", "Interview Questions": "What is your background?\nAre you keen for this position?"}, {"date": "25 Jun 2019", "title": "Research Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at National University of Singapore (Singapore) in Mar 2019", "Interview Descriptions": "Nothing much, asked about what i knew about the ongoing research in the current healthcare field, as well as any trends which were more prominent in recent days. Was handed a list of ingredient survey to look at.", "Interview Questions": "How to balance nutritional profiles"}, {"date": "12 Oct 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National University of Singapore (Singapore) in Mar 2019", "Interview Descriptions": "My interview was long and conducted by my prof. He made sure both of us were a right fit for each other and that I would know what I was getting into.", "Interview Questions": "All the questions are technical"}, {"date": "20 Feb 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at National University of Singapore", "Interview Descriptions": "NUS took about 2 weeks before an interview was set up. The whole interview process was a smooth one and it was also a pleasant one. However, offer was not given immediately after the interview. Neither was there any deadline given before answer was known.", "Interview Questions": "Tell me about your experience. "}, {"date": "4 Apr 2019", "title": "Management Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National University of Singapore (Singapore) in Feb 2019", "Interview Descriptions": "3 stages of interview, first round was a group interview with HR team. Second round panel interview with HR director and few other directors from different departments. Last round group interview again with President, Provost and CFO.", "Interview Questions": "Why do you want to join the NUS Management Associate Programme? "}, {"date": "30 Jan 2019", "title": "Student Service Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at National University of Singapore (Singapore)", "Interview Descriptions": "I was interviewed by my immediate supervisor as well as the ops manager at the same time.\r\nThe hiring decision is based on the supervisor's evaluation after going through a trial period.", "Interview Questions": "Are you able to stay calm under the pressure of customers?"}, {"date": "17 Jan 2019", "title": "Research Fellow Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Get contact with the project leader and interviewed with HR. The interview is telephone interview which lasted about 30 min. Some scientific questions were asked. If your field is fit for the project, should not be a problem.", "Interview Questions": "What do you like about research?"}, {"date": "22 Feb 2021", "title": "Undergraduate Teaching Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at National University of Singapore (Singapore) in Jan 2019", "Interview Descriptions": "Interviewed by the faculty, can be face to face or online due to the nature of Covid, email follow up on offer acceptance. Required in depth understanding of the module you are teaching, will be tested for professor.", "Interview Questions": "detailed run through of the module syllabus "}], [{"date": "3 Jun 2021", "title": "Assistant Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore in Jan 2019", "Interview Descriptions": "Very professionally handled. interviewers were nice and open-minded, knowledgeable. I was having a good experience during the interview. the process took 1 hour and end with a very good note.", "Interview Questions": "Strength and weaknesses - share example of the top 3 strengths"}, {"date": "1 Jun 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at National University of Singapore (Singapore) in Jan 2019", "Interview Descriptions": "Apply online, technical interview. Explain what you have done in your past projects and what is your role. What achievements have made for those projects. Is there any improvement can be done?", "Interview Questions": "What you have done on your projects"}, {"date": "9 Feb 2019", "title": "Administrative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National University of Singapore (Singapore) in Dec 2018", "Interview Descriptions": "I received a call for interview about 3 weeks after my application.  \r\nI was told there were two rounds of interview .\r\nI had attended the first interview but was not selected for the second one.", "Interview Questions": "1) Tell me about yourself?\r\n2) How can you contribute to the job which I have applied?\r\n"}, {"date": "12 Nov 2018", "title": "Management Assistant Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at National University of Singapore", "Interview Descriptions": "It was a quick process from interview to hsigning contract. Got the call just one day after applying. Went for the interview the following day and was offered the 2-3days later. Interviewer was very very detailed in explaining the job scope even showed around the working environment.", "Interview Questions": "The normal interview questions."}, {"date": "31 Oct 2018", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at National University of Singapore", "Interview Descriptions": "I knew the PI before joining. He liked my previous work and asked me to join his group. We discussed about future prospects and the direction in which the group was heading. It was a casual conversation.", "Interview Questions": "Technical questions related to my previous work."}, {"date": "30 Jul 2019", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore) in Sept 2018", "Interview Descriptions": "Application to interview takes approximately 3 months. Very long wait time. Medical process and on-boarding takes up another 2 weeks. Started as contingent staff while waiting for full time contract from HR. Interviewed by Senior Assistant Director and Senior Assistant Manager.", "Interview Questions": "Conducted an excel test."}, {"date": "28 Jan 2019", "title": "Executive/Senior Executive, Education-Plans Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore) in Sept 2018", "Interview Descriptions": "I applied online and was shortlisted for an interview. There were two rounds of interview. First round was HR and one department head, second round was the same HR officer and two other department heads. My interviewers were very friendly with me and with each other, and I had the sense they enjoyed working together. The interview questions were not very difficult so I think my answers were probably not what they wanted. This job requires quite a lot of admin, so they kept asking me about it -- whether I liked it, whether I was good at it...", "Interview Questions": "Do you like detailed work?"}, {"date": "29 Jun 2021", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National University of Singapore in Aug 2018", "Interview Descriptions": "Was more like a casual chat to understand my technical training. A light-hearted interview process. No personality-sort of questions. Online meeting with two interviewers. Only one round of interview. Requested for 3 referrals.", "Interview Questions": "Discuss your PhD research topic. "}, {"date": "6 Oct 2018", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at National University of Singapore (Singapore) in Aug 2018", "Interview Descriptions": "The interview process was quite fast, the PI asked about your research experience. What kind you research are you planning to carry out, what are your research interests. Basically, it mainly  depends on your past research experience.", "Interview Questions": "What are your research interests?"}, {"date": "12 Jul 2018", "title": "Senior Finance Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "The whole process was quite smooth. There was no written test and the officer in charge asked me the usual interview questions like eg self-intro and shared with me details of the position. She also answered my queries with regards to the position too.", "Interview Questions": "Self Intro, Career History and achievements"}], [{"date": "4 Jan 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at National University of Singapore (Jurong West New Town, ) in Jul 2018", "Interview Descriptions": "Not much, my supervisor asked if I wanted a job after graduation and I accepted. Following which I was asked to fill out the required forms online. Asked to upload documents such as my transcript among other things.", "Interview Questions": "Are you interested in taking up a research position here."}, {"date": "14 Jul 2018", "title": "Senior Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National University of Singapore (Singapore) in May 2018", "Interview Descriptions": "1st Interview: With the manager of the department that you will be working on\r\n2nd Interview: With HR, Directors of the IT department\r\nAfter that they will call and offer you regarding the compensation.\r\nThen you will need to come down to sign the contract and do the medical checkup at their university clinic. Results come out a few days later. Once your medical check is cleared, then it means all processes have been completed and you can tender resignation at your current company.", "Interview Questions": "Your reasons for applying the job. There are technical multiple choice questions during 1st interview. 2nd interview is non-technical."}, {"date": "29 Dec 2022", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at National University of Singapore (Singapore) in May 2018", "Interview Descriptions": "Very straightforward. The PI interviewed me directly and asked about relevant skills and prior experience working in research fields. I am a fresh graduate so all the technical skills I share were things I gained during my FYP project. The whole process was informal and very much casual. But that's probably because I've worked with the PI for my FYP and thus he knew me very well and the interview was just there as formality.", "Interview Questions": "Describe your FYP and your contribution? What could be done more (on my FYP)?"}, {"date": "29 Apr 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore", "Interview Descriptions": "Mostly based on applicants' resume. Interview will talk more about achievement in resume and what you seek to achieve through the internship. In addition, interviewer is also interested to know how the role through the internship would help you in your future career.", "Interview Questions": "Where do you see yourself in 5 years time?"}, {"date": "13 May 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at National University of Singapore (Singapore) in Apr 2018", "Interview Descriptions": "I had a nice chat with the immediate supervisor. It was a friendly 1-1 interview. the content of interview is more towards what projects are available and what am i interested in.", "Interview Questions": "are you interested in this or that project?"}, {"date": "9 Jan 2020", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at National University of Singapore (Singapore) in Apr 2018", "Interview Descriptions": "The entire process takes one 1 day. The professor asked me to meet him in the office and briefly talked about his research and it is quite informal. The professor is very nice and after breif discussion he gave me the offer", "Interview Questions": "Why do you want to work as a research engineer"}, {"date": "15 Feb 2020", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at National University of Singapore (Singapore) in Apr 2018", "Interview Descriptions": "Online job application on the NUS job portal followed by one on one interview by the project PI. Got the offer in 1 month. Overall 3 month process including medical examination and workpass approval.", "Interview Questions": "Technical background related to the project"}, {"date": "4 Jun 2019", "title": "Research Executive Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University of Singapore (Singapore) in Mar 2018", "Interview Descriptions": "It was a very informal, casual, and relaxed interview, with standard questions. The fact that it was for a contract position with not a lot of competencies required may have contributed to that.", "Interview Questions": "What do you know about the role?"}, {"date": "29 Apr 2018", "title": "Accounts Assistant - National University of Singapore Society Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at National University of Singapore (Queenstown Estate, ) in Mar 2018", "Interview Descriptions": "Very bad experience and impression overall. Waited for more than 30 mins for the interviewers and they started to criticize about my handwriting when they arrived (didn't apologize for being late). First of all, they didn't bother to read the resume before inviting candidates to the interview. Second, after they read my resume during interview, one of the interviewers keep passing negative remarks about my job experiences saying that its not adequate enough and then give me that \"disdain'' look. One of the interviewers then asked about personality (which is not an appropriate question to be raised).", "Interview Questions": "What do your friends see you as? (inappropriate question to be asked during job interview)"}, {"date": "20 Nov 2018", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 months. I interviewed at National University of Singapore (Singapore) in Feb 2018", "Interview Descriptions": "prof or PI will call and request to meet. Based on experience you ll be hired. mostly all posting is for their own students. the HR is super slow in giving an offer letter. the process takes 4 months", "Interview Questions": "your previous research work"}], [{"date": "14 Mar 2018", "title": "Master Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore in Feb 2018", "Interview Descriptions": "it took 10-15 mins for 5-6 questions, and there will be 2-3 admission teachers, and one of them will ask you question, the rest observe you. be well prepared, it is not easy to pass interview", "Interview Questions": "1, why you choose this subject?\r\n2, what do you want to do after this course?\r\n3, why should we take you over others applicants"}, {"date": "27 Nov 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University of Singapore in Jan 2018", "Interview Descriptions": "They asked you about my past experience and the courses I have learned. And some questions related to my courses. \r\nFollowed by a case interview on how to design an experiment/steps to validate a research result.", "Interview Questions": "Why are you interested in this position? What courses you have learned?"}, {"date": "7 Feb 2018", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore) in Dec 2017", "Interview Descriptions": "No questions asked on competencies. Interviewers are unfriendly and the session felt like an interrogation instead.\r\nInterviewers did not ask for areas of competencies candidate can bring. The interview gave negative vibes and lack skills in making candidate feel comfortable to share relevant skills and experience.", "Interview Questions": "Why do u leave all your previous jobs?"}, {"date": "9 Nov 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at National University of Singapore", "Interview Descriptions": "Very friendly human resources staff and immensely helpful with the paperwork!\r\nQuestions asked:\r\nPrior Experience \r\nWhat skills match that required by the role\r\nWhy you want the position\r\nAre you willing to working with animals as it was an animal model based research role", "Interview Questions": "N/A"}, {"date": "6 Nov 2017", "title": "Laboratory Technologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National University of Singapore (Singapore) in Nov 2017", "Interview Descriptions": "I applied through the NUS career portal and was called up around 3-4 weeks later for an interview. The interview was conducted by 4 interviewers. They asked questions one by one about your background, your knowledge of the job you are applying for, not really much on technical skills or questions.", "Interview Questions": "Tell me more about yourself"}, {"date": "19 Oct 2020", "title": "Management Assistant Officer (Career Services) Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore) in Nov 2017", "Interview Descriptions": "HR asked alot of questions and probe deep for each question asked. I felt that the whole interview was stressful and was not sure if I could get the job.", "Interview Questions": "why i do i want to leave the previous job"}, {"date": "16 Oct 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Interview by my phd supervisor, talked about work plan and research tasks. Nice and friendly environment in his office. meet with the research team and presented my work. the interview is very research oriented, without asking anything about personal life and personality", "Interview Questions": "tell me about your research plan in the future"}, {"date": "3 Apr 2018", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at National University of Singapore (Singapore) in Oct 2017", "Interview Descriptions": "It was pretty quick, took about less than 20 minutes in total. I talked to manager and 3 other future colleagues. They were friendly and seemed everybody was busy with their works then. Quite relax and easy one.", "Interview Questions": "working experience, any questions about the new job, etc"}, {"date": "27 Oct 2017", "title": "Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National University of Singapore (Singapore) in Sept 2017", "Interview Descriptions": "I applied on 27 Aug. Had the first interview on 7 Sep where I had to complete an essay question. Got called back for a second interview on 13 Sep. Interviewers were friendly.", "Interview Questions": "How would I would react in different scenarios "}, {"date": "15 Aug 2017", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at National University of Singapore", "Interview Descriptions": "Interview face to face, discuss problems related to the job, takes a while to respond back.\r\nCan get S pass or E pass\r\nInterviewer has good knowledge of the task\r\nHe can quickly evaluate your skills", "Interview Questions": "Why do you apply for this job"}], [{"date": "1 Apr 2018", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at National University of Singapore in Aug 2017", "Interview Descriptions": "First mailed , then Interview through Skype. Once selected , you have to inform them if you can join. After few days HR team will handle all the joining processing and work pass details.", "Interview Questions": "Current project work."}, {"date": "31 Oct 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University of Singapore (Singapore) in Aug 2017", "Interview Descriptions": "The interview was very casual. There were 2 interviewers, one is the hiring Prof while another one is his research fellow. The interviewers were talkative and nice to talk with. Very simple questions were asked based on my CV and papers published. In overall the interview went well and according to them they will get back to me on the salary package by the following week. However there was no response from them since then. Emailed to them every 2 weeks but no reply too. Eventually I gave them a ring and only then they told me that the hiring on hold......\r\nIt's so unprofessional way of follow up. They could have informed me easily by replying to my email. Couldn't find any reason of not replying any of the 3 emails I have sent. \r\nDefinitely not a supervisor/team that I would like to work for.", "Interview Questions": "Skills, previous work scope"}, {"date": "8 Nov 2017", "title": "Business Development Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore) in Aug 2017", "Interview Descriptions": "Simple process. Interviewer asked about previous job experience and talked about the nature of the job, pay structure in the organisation, then a tour of the workplace. More like conversation than interview.", "Interview Questions": "tell me about yourself"}, {"date": "28 Apr 2018", "title": "Lab Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National University of Singapore (Clementi New Town, ) in Jun 2017", "Interview Descriptions": "They will look at your past experience and your portfolio. They will look into your communication skills with the hiring manager. They will ask for your expected salary and look into the previous renumeration you had.", "Interview Questions": "What are your portfolio."}, {"date": "25 Dec 2019", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore) in Jun 2017", "Interview Descriptions": "Its a brief interview on what your research interests are as well as your plans to achieve them. My interview was rather informal and relaxed. However,  its worth noting that the interview process is very dependent on the department and the professors.", "Interview Questions": "What is your background and what are research interests?\r\nHow do you plan to achieve them?\r\nHow would you approach your research topic? "}, {"date": "25 May 2017", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at National University of Singapore (Singapore)", "Interview Descriptions": "Had one on-site interview with the PIs (3 of them). Two from NUS itself, and 1 from a collaborating institution. They were friendly and they asked mostly technical questions as well as my plans for future.", "Interview Questions": "How I made the PDMS replicas of arterial models"}, {"date": "21 Aug 2017", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at National University of Singapore (Singapore) in Apr 2017", "Interview Descriptions": "My supervisor is very nice and understandable. He discuss with me about the future planes and what we can do together. Then I applied online and the process is smooth.", "Interview Questions": "Describe your past research experience"}, {"date": "6 Aug 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore) in Apr 2017", "Interview Descriptions": "There were two rounds 1) Technical round - relating to the technical skills I posses which are relevant to the work \r\n2) HR round - relating to the soft skills including communication skills and team work", "Interview Questions": "Why should we hire you?"}, {"date": "7 Nov 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at National University of Singapore (Singapore) in Mar 2017", "Interview Descriptions": "Grades most important. They will look at your grades and ask you questions to test your competency. Please do not apply if you do not have at least an A-. Must be able to speak well and not have stage fright.", "Interview Questions": "How will you conduct this lesson?"}, {"date": "20 Feb 2017", "title": "Research Engineer (Chemical Engineering) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at National University of Singapore in Feb 2017", "Interview Descriptions": "It was easy. Just a short introduction about myself. Why I am interested in doing research. What I was doing after graduation. The professor was an enthusiastic and friendly person. For most of the time, the professor was sharing about what the project is about and trying to get me interested.", "Interview Questions": "What was I doing after graduation?"}], [{"date": "5 Mar 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at National University of Singapore in Feb 2017", "Interview Descriptions": "generally they already know you, and only ask questions what you have done before, see if that is inline with the current project. you just honestly answer the questions and show you are capable to work for their project.", "Interview Questions": "what is your previous project like"}, {"date": "19 Nov 2017", "title": "Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore in Feb 2017", "Interview Descriptions": "Long, need to wait for a few weeks for interview call and during the interview, they asked basic and predictable questions. The hiring manager looks expressionless, bored with her job.", "Interview Questions": "What are your strengths and weaknesses"}, {"date": "8 Jan 2017", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at National University of Singapore (Singapore)", "Interview Descriptions": "two rounds of interviews about a couple of weeks apart\r\nfirst round was with head of department and human resource exec\r\nsecond round was with vice-dean in-charge of department and human resource director", "Interview Questions": "what relevant skills can you bring to the job\r\nwhat do you expect to get/learn from the job\r\nwhere do you see yourself in 5 years"}, {"date": "29 Jan 2017", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at National University of Singapore (Singapore) in Jan 2017", "Interview Descriptions": "Application materials sent to the department --> Skype interview (2 weeks) --> Campus visit --> result pending. The interviewing committee was nice in thinking about how my research experiences and expertise may contribute to the department.", "Interview Questions": "1. Research interests \r\n2. Courses interested in teaching \r\n3. The long term plan (i.e., stay in Singapore in the long run)"}, {"date": "27 Dec 2018", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at National University of Singapore (Singapore) in Jan 2017", "Interview Descriptions": "It was a technical interview. I had a discussion with the professors. \r\nAfter which, we had a discussion with my capabilities, strengths and weaknesses. my previous work experience. \r\nWhich was all good and fine.", "Interview Questions": "my previous work experience?"}, {"date": "13 Mar 2017", "title": "Graduate Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at National University of Singapore (Singapore) in Jan 2017", "Interview Descriptions": "Was largely based on my in class performance. It also depended on the fact that my research area coincided with the organisation's interests. The work hours also greatly matched my modules.", "Interview Questions": "research specialty"}, {"date": "5 Jul 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at National University of Singapore (Singapore) in Jan 2017", "Interview Descriptions": "first submit CV and cover letter through email, then they inform you to do an online interview. During the interview, 2 professors from the department  ask me about research experience, research interest and future plan.", "Interview Questions": "what's the future plan?"}, {"date": "5 May 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at National University of Singapore (Singapore) in Jan 2017", "Interview Descriptions": "The Project was research on nuclear governance and law. Interviewed by 1 Research Associate and 2 Assistants, they asked about my previous experience and why I wanted to join the project.", "Interview Questions": "How do you think you can contribute to the Project without any previous experience in nuclear law."}, {"date": "15 Feb 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at National University of Singapore (Singapore) in Dec 2016", "Interview Descriptions": "I cannot remember the exact interview questions. However, after submitting the CV, there was only one round of interview with two directors of the department that I applied for.\r\n\r\nThe questions that they asked were typical interview questions such as why did you apply, what interests you in this field, do you have any related experiences in this field (does not have to be work experience).", "Interview Questions": "Why are you interested in this field?"}, {"date": "25 Sept 2017", "title": "Deputy Audit Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National University of Singapore (Singapore) in Dec 2016", "Interview Descriptions": "Applied online and was asked for an interview about 2 months later. Was interviewed by 4 interviewers and no technical questions asked. Basically we spoke about my prior working experience.", "Interview Questions": "Why do you want to explore this opportunity and is there a push/pull factor?"}], [{"date": "27 Nov 2016", "title": "Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National University of Singapore (Singapore)", "Interview Descriptions": "I applied for the job position via the university's job portal. I interviewed at National University of Singapore. Was contacted for an interview within a week. Went through the first round of interview pretty well and was asked to attend a second interview. Second round interview with higher management was challenging.", "Interview Questions": "Tell me more about yourself."}, {"date": "1 Aug 2019", "title": "Credit Research Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National University of Singapore (Singapore) in Nov 2016", "Interview Descriptions": "Comprehensive interview, one about yourself and your knowledge of the department, the other more technical. Might have a test as well if you have to do a test because sometimes there is a test. Ok now I have more that 30 words.", "Interview Questions": "What are your three main strengths and weaknesses?"}, {"date": "4 Oct 2016", "title": "Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University of Singapore (Singapore)", "Interview Descriptions": "Met up with hiring dept twice and did 1 verbal assessment and 1 written assessment on 2nd interview to test candidate's knowledge. Hiring dept sent another written assessment via email. Felt that the assessments could have been sent before interviews and key decision maker should be in the first round of interview.", "Interview Questions": "Tell me about your opinions on our website"}, {"date": "31 Oct 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at National University of Singapore (Singapore) in Oct 2016", "Interview Descriptions": "Interviewed by the professor who was looking for candidates with financial management experience in the government/ public sector. The professor also was looking for research skills. The interview was conducted by the professor and later by the HR manager. The interview lasted for 25 minutes.", "Interview Questions": "Questions were related to policy development, financial management concepts and policy implementation challenges. "}, {"date": "15 Aug 2017", "title": "Marketing Communications Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore) in Sept 2016", "Interview Descriptions": "You have to go through two rounds of interview - one with the HR and some head sitting in, and the other with the Director. However, nowadays, it seems like they just do the first round out of formality if you are a friend of someone in the office and then have a coffee session with the Director and that's done.", "Interview Questions": "How do you see yourself fitting in and contributing to the department?"}, {"date": "19 Feb 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at National University of Singapore (Singapore) in Sept 2016", "Interview Descriptions": "Submitted my resume to the school and got offered to go for an interview really quickly. I applied via 3rd party sites like jobstreet etx, but heard back 6 months later, after I was already hired.  The interview was pretty casual. Prepared for the interview by reading up on what employer is specialized in.", "Interview Questions": "Asked about my past experiences, interests and future aspirations. No difficult questions"}, {"date": "10 Jul 2019", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University of Singapore (Singapore) in Sept 2016", "Interview Descriptions": "A short interview process with questions on your previous work and research experience.  Discussed the research project, roles and responsibilities.  Also discussed the job prospects after the research funding is over.", "Interview Questions": "Tell me more about your research at..."}, {"date": "19 Nov 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National University of Singapore (Singapore) in Aug 2016", "Interview Descriptions": "It is a one-to-one interview. The PI asked me about some basic programming knowledge. Also some problems I put on my CV.  We also discussed some foreseen issue about the ongoing project.", "Interview Questions": "Why do you want to research ?"}, {"date": "16 May 2019", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore in May 2016", "Interview Descriptions": "Not difficult. It is a standard interview process to hire faculties.  I do not think it is a difficult interview. The situation can be different batch by batch.  Please follow the on line guideline to prepare. Good luck.", "Interview Questions": "N/A"}, {"date": "26 Sept 2018", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore) in May 2016", "Interview Descriptions": "First your supervisor selected will give your a skype interview.  If you do not select a supervisor in online application. Then two staff in management office will ask general questions.", "Interview Questions": "They ask me research experience in my resume and why I want to join them"}], [{"date": "29 Apr 2019", "title": "Sports Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at National University of Singapore (Singapore) in May 2016", "Interview Descriptions": "2 rounds of interview. 1st Interview with a panel of 5 including reporting officer, hr representative and main heads. 2nd interview includes a written test (1hr in duration) and a less informal interview/chat with the Dean of Student Affairs.  Chat session was around 20-30mins and casual. Also included reporting officers and direct head.", "Interview Questions": "How would you be able to contribute to NUS"}, {"date": "29 Aug 2018", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 8 weeks. I interviewed at National University of Singapore (Singapore) in May 2016", "Interview Descriptions": "First was writing an email to the PI to express interest in applying for a position. Next was an interview with the PI, followed by a presentation to the lab during lab meeting. Q&A, and individual meetings with lab members.", "Interview Questions": "Why do you want to join my lab?"}, {"date": "20 Sept 2018", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at National University of Singapore (Singapore) in Feb 2016", "Interview Descriptions": "Direct interview with the professor and discussed my internship experience. The professor likes employee with good academic record so he also asked about the grades I obtained from the undergraduate study. The overall interview is quite smooth and the professor is very nice and polite. Great interview experience.", "Interview Questions": "why do you want to do research?"}, {"date": "13 Nov 2016", "title": "Management Assistant Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at National University of Singapore (Singapore) in Feb 2016", "Interview Descriptions": "Online application and followed by a face to face interview, asked about general questions, need to understand the job scope you are applying for. It is a good experience and the interviewer s quite friendly.", "Interview Questions": "What is  your strength?"}, {"date": "3 Feb 2016", "title": "Senior Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National University of Singapore (Singapore) in Jan 2016", "Interview Descriptions": "Panel interview with 2 from HR and 1 Director from the department. It was quite casual and comfortable. The HR people made the interview very light and easy.\r\nApplied online, 2 weeks later, I got a call for the interview. Offer came in 1 week later.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "3 Feb 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University of Singapore in Jan 2016", "Interview Descriptions": "Face to face with professor questions on research experience and how detailed you are with citation as well as whether you have enough time to commit to projects whether you are careful with citation", "Interview Questions": "Are you meticulous"}, {"date": "17 Dec 2015", "title": "Systems Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore", "Interview Descriptions": "It took them two weeks after application to call me for interview. The interview was okay but because I was a fresh grad, I guess I didn't have the right qualifications. Didn't ask any technical questions.", "Interview Questions": "What projects did you work on while in university?"}, {"date": "14 Mar 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at National University of Singapore (Singapore) in Dec 2015", "Interview Descriptions": "The interview for research position really completely depends on the PI (principal investigator) that you're applying for. He/she has the complete freedom and choice for the interview style. In my case, it's just a very casual talk on the laboratory together with a laboratory tour to gauge the suitability for both sides.", "Interview Questions": "Tell me what is your research interests and why do you choose to work in our research field"}, {"date": "14 Sept 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at National University of Singapore (Singapore) in Nov 2015", "Interview Descriptions": "Not very formal, just causal conversation and discussion about the goal of this position. The employer was nice enough to discuss every concern I have to prepare me better for this position.", "Interview Questions": "What skills do you have for this job?"}, {"date": "30 Sept 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at National University of Singapore (Singapore)", "Interview Descriptions": "The interview panel consists of your direct supervisors as well as any other person who you are likely to work closely with. \r\n\r\nBe prepared for technical questions as well as to state your motivations for applying for this position. \r\n\r\nGenerally as a research assistant you are expected to further your studies and they will be happy to accommodate to that. It is a plus if you intend to further your career in this field.", "Interview Questions": "Where do you see yourself in 5 years time?"}], [{"date": "29 Jul 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at National University of Singapore (Singapore)", "Interview Descriptions": "It took around 3 month to hire a person from other country, I went there for a workshop and luckily got time to discuss my interest with the professor. He interviewed me for an hour and satisfied with the knowledge and interest towards research and I was hired.", "Interview Questions": "NLP,ML,Data Structure etc"}, {"date": "19 Jul 2019", "title": "Asst Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore) in Aug 2015", "Interview Descriptions": "It was professional with the immediate supervisor and her boss making up the interview panel with the usual interview questions asking background, skills for them to assess your fit to the job and company.", "Interview Questions": "What were you working before and tell us more about your previous work experience"}, {"date": "3 Sept 2015", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National University of Singapore (Singapore) in Aug 2015", "Interview Descriptions": "Quick and simple. The panel not asked much tough questions but just make sure I was clear on the duties and responsibilities of the position and not demanding for the career path", "Interview Questions": "Do you clear about this position&amp;amp;#039;s duties?"}, {"date": "17 Jun 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National University of Singapore (Singapore)", "Interview Descriptions": "The interview was not a typical one as the interviewer is not a local. There was no questions like \"what do you see yourself in 5 or 10 years?\". All the questions asked were very practical and relevant to the post applied. There were questions to assess your character as well.", "Interview Questions": "Why do you want to leave your current job?"}, {"date": "1 Apr 2019", "title": "Asst Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University of Singapore (Jurong West New Town, ) in May 2015", "Interview Descriptions": "Friendly interview process. They test you on in depth knowledge. They ask you all your experiences and your contributions in previous roles. Specific requirement for the job may not be told upfront but there will be related questions to see if you will stand up to the challenge on the job for which you are being hired.", "Interview Questions": "How could are you in negotiating?"}, {"date": "22 Apr 2015", "title": "Administrative Staff Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University of Singapore", "Interview Descriptions": "Face to face interview.  Questions asked from the employers were straightforward.  Interview process was approximately thirty minute.  Did not go through different levels of interview session.  Received offer within 1 week. Considered quite fast.", "Interview Questions": "Asked about the nature of the previous job."}, {"date": "17 Aug 2015", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at National University of Singapore (Singapore) in Apr 2015", "Interview Descriptions": "Received an email informing of me being shortlisted. The interview itself was pretty straightforward, behavioral questions and questions pertaining to your resume. The interview panel consisted of the main research professor and your future supervisor, and it was not daunting, but rather a relaxed atmosphere.", "Interview Questions": "Share with me one time that you have to be extremely meticulous in your work."}, {"date": "10 Feb 2015", "title": "Management Assistant Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore", "Interview Descriptions": "interview process about 1 week.  Normal interview process with questions, interviewed by department   manager and head. takes about few days after interview to get the offer. \r\nAfter shorlisted, need to do medical check up", "Interview Questions": "usual questions like tell me more about yourself, strengths and weakness.  how do you counter your weakness if the role cannot afford this weakness"}, {"date": "26 Aug 2019", "title": "Senior Administrative Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National University of Singapore (Clementi New Town, ) in Jan 2015", "Interview Descriptions": "Took a month from application to 1st interview, hiring manager gave me quite good overall impression of organization. Working environment is conducive and food options aplenty. A lot of training courses available fot staff to take to learn.", "Interview Questions": "Previous work experience"}, {"date": "17 Aug 2015", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at National University of Singapore (Singapore) in Jan 2015", "Interview Descriptions": "A quite nice professor. We talked for 10 minutes when I was taking a vocation in Singapore in Jan. After that, I went back to HK to continue my master study and kept contacting with Prof.", "Interview Questions": "Why do you want to do research?"}], [{"date": "5 Jul 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at National University of Singapore (Singapore) in Jan 2015", "Interview Descriptions": "I emailed the institute about needing a job, they called me in one day. Casual chat in the chief PI office, they saw my resume.  I was asked questions by a prof, which I answered. After that though, there was a long wait between the interview and them telling me they liked me, to actually offering me a place. they took a few months.", "Interview Questions": "About my knowledge and skills"}, {"date": "1 Nov 2014", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "There are two rounds of interview. The first one is a phone interview and the second is a face-to-face interview.\r\n\r\nFor the phone interview, the professor required me to call him at a stipulated time. When I called him, he picked up on first ring so it came across he remembered but just did not want to call. I take it as poor interview etiquette and to mean he is not reachable unless by appointment if you become his staff. \r\n\r\nThroughout the interview, he was speaking meanly in a very nice way. He was asking for first authorship kind of work from me and asked about technical questions different from those used in his area of work and in his advertisement. He also asked whether I could write papers for grants which I came to understand it is his job scope as a professor.   When I mentioned I did not have some of those I don't have (I knew about 70% of what he asked already), he went, \"Oh, the kinds of job you had usually had your name on the publications last. People like you are good at analyzing things but had so much difficulty writing papers.\" \r\n\r\nTo be reasonable, he is paying less than S$3000 for this RA position and he is demanding intellectual work which is more likely his job scope.Then he should have asked for first authorships in his job criteria.\r\n\r\nAfter I hanged up, I felt that he probably saw me a waste of time so he asked me to call him. Well, I have attended interviews in other universities to know things work in a better humane sense.\r\n\r\nHe even commented how people from other industries came to his interview and he did not want to see those people. Hence, the phone interview. Well, to be fair, the job market is getting very bad for job seekers. People just want to put food on their tables. For him as a junior ranked professor to make such comments to stranger interviewees, it's very unkind of him.", "Interview Questions": "Expect technical questions different from those he stated in his job advertisement."}, {"date": "6 Nov 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Met with Principal Investigator. Experiences related to project, what you can offer, explain experimental methods (i.e different type of PCR, some biology related questions etc). Took less than 30 minutes and was informal and easy going.", "Interview Questions": "N/A"}, {"date": "25 Apr 2018", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 6 months. I interviewed at National University of Singapore (Singapore) in Nov 2014", "Interview Descriptions": "Depends on academic Principal investigator and the selection committee. HR process takes Long time. Too many procedures and formalities to follow. Had to wait more than 6 months for offer.", "Interview Questions": "Relevant experience "}, {"date": "13 Nov 2015", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at National University of Singapore in Nov 2014", "Interview Descriptions": "interviewed by project PI, who is also my PhD supervisor, so the process is rather easy since he knows me for quite a time. the project is continuous work for my phd work", "Interview Questions": "related to the project"}, {"date": "13 Oct 2014", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore in Oct 2014", "Interview Descriptions": "Was given and Early interview. Arrived and told to read a report, prepare the slides and give a presentation. \r\nReasonable length of interview and was told the hiring process is long. No specific time frame given.", "Interview Questions": "N/A"}, {"date": "22 Mar 2017", "title": "Student Service Ambassador Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at National University of Singapore (Queenstown Estate, ) in Aug 2014", "Interview Descriptions": "The interviewer invites you into a small meeting room and starts a friendly private chat. She wants to know more about your character and whether you are willing to commit.", "Interview Questions": "What are your previous working experience?"}, {"date": "27 Apr 2014", "title": "Executive - Student Affairs Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore", "Interview Descriptions": "1 interview\r\nFun culture, but cliquish. People don't take the effort to make newcomers feel welcome", "Interview Questions": "N/A"}, {"date": "23 Apr 2014", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at National University of Singapore (Queenstown Estate, )", "Interview Descriptions": "the interview is really very technical. You just talk with professor or project PI.", "Interview Questions": "technical related questions"}, {"date": "30 Mar 2014", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore", "Interview Descriptions": "2 interviews. 2nd interview involves presentation.", "Interview Questions": "N/A"}], [{"date": "19 Aug 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore) in Mar 2014", "Interview Descriptions": "Had only one round of interview. lasted about 40 to 45 mins. was primarily asked my interest in joining the lab, what do I expect to learn from this lab, when is the earliest availability date. I got the job on the first interview.\r\n\r\nWas brought into the lab to meet the colleagues. There was also a lab test on the dilution factor for this particular compound. thought I would probably fail because I literally couldn't answer it.", "Interview Questions": "what do you see yourself in 5 years time? What is your interest in joining the lab?"}, {"date": "16 Sept 2016", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at National University of Singapore (Singapore) in Feb 2014", "Interview Descriptions": "Interview was not to the point and has other agenda. Asked a lot of question but also was checking out the candidate and not focus on the capability and experience and after got the job, what was expected of the candidate was not as per when in job. Ended up blame for not performing as per job requirement in a very short time. Everywhere has a learning curve and this was just purely biasness. Harsh environment either you survive and work all the life there or finish the contract and leave or even earlier.", "Interview Questions": "Previous experiences"}, {"date": "9 Mar 2018", "title": "Senior Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National University of Singapore (Singapore) in Jan 2014", "Interview Descriptions": "Interview questions were standard and fairly easy. Getting hired seem to be a breeze. They asked me a set of routine questions and put me to a test. The second round interview was also fairly standard.", "Interview Questions": "Why do you want this job?"}, {"date": "6 May 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at National University of Singapore (Singapore) in Jan 2014", "Interview Descriptions": "Since this is an out-sourced temporary contract position, the interview position was really fast. I did not email/correspond with the company myself, all was done through the recruitment agency. When I was asked to go for the interview, it was done by a Senior Executive whom I would report to directly. I think all he/she needed to know was if I were able to do the work required or not.", "Interview Questions": "Nothing at all. Just the simple question of me being qualified, why would I want a temp job."}, {"date": "24 Jan 2018", "title": "Senior Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at National University of Singapore (Singapore) in Jan 2014", "Interview Descriptions": "The process was long to wait because the human resource department is extremely inefficient to filter and shortlist people. By the time they called, prob the candidate already gotten a better offer.", "Interview Questions": "Why did you leave your last job?"}, {"date": "20 Oct 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at National University of Singapore (Singapore) in Jan 2014", "Interview Descriptions": "1 submit CV, The most important thing is to state what you are familiar with  is quite relevant to their projects  2 interview with PI, try to describe your research experience and technique skills in detail  3 offer the process duration is mainly based on the nus admins' efficiency", "Interview Questions": "Most of the questions are related to research experience and technique skills"}, {"date": "16 Dec 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Employer (Prof) would ask you about your inclinations and willingness to work past office hours (as expected for research related work). The prof would then describe his/her current works and the findings and he/she would ask you few questions on how would you be able to help out in the lab. They would bring you to meet their lab members and would allow you to have a small chat with them and let you have interactions with them.", "Interview Questions": "They might ask technical questions"}, {"date": "11 Dec 2013", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at National University of Singapore", "Interview Descriptions": "The hiring process of NUS for TA position normally takes about 3-4 weeks. The potential candidates are mainly from the PhD students inside each department. However, in some cases, they will be recruiting from outside.  \r\n\r\nThe interview is generally standard. They asked you about your teaching background. Be confident and be firm.", "Interview Questions": "Your skill sets might be not matched with their needs. But never mind, you can show that the fundamental philosophy of teaching is the same by applying the same method.  "}, {"date": "22 Nov 2013", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at National University of Singapore (Singapore)", "Interview Descriptions": "Mailed to a proffessor on my research interests.. \r\nHad a call with him about my current area of work and what I wish to do ..", "Interview Questions": "Nothing.. just questions about my experience"}, {"date": "26 Sept 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University of Singapore", "Interview Descriptions": "I saw the opening on the institute's website. The next day I sent out the email, they contacted me, which is faster than I expected. They arranged a phone interview the next day for my personal details.\r\n\r\nThe real face-to-face interview was the week after. I met the professor who needed the assistant. It was quite casual. We sat in his office on the couch and he asked several questions, like my experience, my career plan, etc. The whole interview lasted for about 40 minutes. Then he told me that I could go out to the office to mingle with people working in the office, which I didn't because they seemed busy.\r\n\r\nA week later, I sent a very polite email to the professor to thank him to give me the interview opportunity. On the same day, they sent me an email and told me that they decide to give me the job offer!\r\n\r\n(But it does take them long to get an EP for foreign employees)", "Interview Questions": "What are your plans for your career development?"}], [{"date": "22 May 2017", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore) in Sept 2013", "Interview Descriptions": "The process took place in the department office and was more of an informal, general question. It is not as exhaustive as job interview, and the panel was genuinely interested to know the reason why you choose to be a PhD.", "Interview Questions": "What was your previous research project? Why did you choose to do a Ph.D.?"}, {"date": "18 Aug 2013", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "no comment", "Interview Questions": "N/A"}, {"date": "27 Jan 2017", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at National University of Singapore (Singapore) in Aug 2013", "Interview Descriptions": "I was interviewed by a panel made up by three professors. There were two other candidates for the same position. The questions were standard interview questions and the interview lasted about half an hour.", "Interview Questions": "Where do you see yourself in 5 years time?"}, {"date": "19 Apr 2017", "title": "Management Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at National University of Singapore (Singapore) in Jul 2013", "Interview Descriptions": "Casual, not stressful. Takes time to get to understand you better to judge your suitability to the role.\r\nTakes time to explain the role as well. Was able to fully anticipate what is expected of you.", "Interview Questions": "Whether if your interests lies in the role that you applied."}, {"date": "19 May 2013", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "I applied to the ARL. The head of the lab is a genius and an exceedingly good human being. The interview process was excellent: it was basically a long chat about my previous projects and experiences.", "Interview Questions": "What is the fundamental assumption of law of large numbers?"}, {"date": "5 Jan 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at National University of Singapore (Singapore) in May 2013", "Interview Descriptions": "The interview process is quite straightforward. I was interviewed by the two professors in charge. The two professors are quite famous and established in the field. They went through the basic interview questions with me, such as going through the education background and internship experiences.\r\nThe important part is to show your interest in research and demonstrate your knowledge on the area of research.", "Interview Questions": "Why do you want to do research?"}, {"date": "3 Dec 2015", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at National University of Singapore (Singapore) in Apr 2013", "Interview Descriptions": "For international students simply apply through contact Singapore for the internship you are required. Then you will be contacted by the professor and he will see if your interests match. If it does send a copy of your CV for them to take a look. Usually this is followed by a phone interview or face-toface interview. You will then eventually get the job offer!", "Interview Questions": "Why do you want to enter research? What is your interest in the field."}, {"date": "18 Jun 2017", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore) in Apr 2013", "Interview Descriptions": "Two rounds of interview - once with the reporting officer and another with the upper management. I was asked to talk about my job experiences and career aspirations. The interviewer spoke more than I did. I was not asked to sit for a written test but subsequent candidates had to sit for it.", "Interview Questions": "Job experience, career aspirations "}, {"date": "6 Mar 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "interview with the principal investiagtor", "Interview Questions": "N.A. Just read up and understand about the ongoing research/projects in the lab."}, {"date": "23 Aug 2017", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Singapore) in Mar 2013", "Interview Descriptions": "There are two stage interview with one face to face and another to see the higher management. Questions involve job fit and what you can contribute to the organisation. The next stage is more to for the management to see you.", "Interview Questions": "Tell us your experience that is beneficial to our organisation"}], [{"date": "23 Feb 2017", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at National University of Singapore (Singapore) in Mar 2013", "Interview Descriptions": "The interview is efficient and concise. Two faculty professors interviewed me, and the questions were generic. FYP is something important to them as that is the main research experience that a undergraduate student may have. Academic result is also important, and you need to prepare some explanation if you did not perform so well on certain subject.", "Interview Questions": "Why do you want to pursue a PhD study?"}, {"date": "17 Sept 2015", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at National University of Singapore (Singapore) in Feb 2013", "Interview Descriptions": "The Interview Process took about two hours sitting with Professor to discuss about my potential role in the lab. Followed by checking through together every line on the CV and the discussion went straight into what ideas do I have to push forward certain projects, before assigning me to one. I think I did a good job in proposing valid experiments to answer certain questions the project faced.", "Interview Questions": "Academia does not pay well. Why do you still want to pursue academic positions when private sector pays better?"}, {"date": "26 May 2014", "title": "Graduate Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at National University of Singapore (Singapore) in Jan 2013", "Interview Descriptions": "One on one interview where i was asked more about my interest in the field of robotics. Additionally iwas asked about my skills in mechanical designing. They also wanted to know if i was comfortable with arduino programming and basic electrical and electronics designing and hands on working and fabricating", "Interview Questions": "Knowledge on novel actuators"}, {"date": "22 Jun 2015", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at National University of Singapore (Singapore) in Sept 2012", "Interview Descriptions": "1. CV submission\r\n2. 3-hour of face to face interview with project PI, a professor of NUS. He will ask on all details that are written on you CV. Explain your education from undergraduate to PhD, explain every project you have ever involved in. Explains your publication and programming skills. \r\n\r\nRemember that all sentences written on your CV may be asked.", "Interview Questions": "Q: Elaborate your PhD research topic\r\nQ: Explain what do you know about the current project\r\nQ: Explain how your own topic is related to current project"}, {"date": "21 Jul 2015", "title": "Laboratory Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at National University of Singapore (Singapore) in Sept 2012", "Interview Descriptions": "I knew someone within the department and there was a job opening in the department so I was referred to my current boss. We emailed and fixed a day for the interview. \r\n\r\nIt was a very casual and relaxed interview with my boss. That may not be the case for other positions. We talked about my qualifications and research interests and the boss showed me around the lab. That was pretty much it.\r\n\r\nHR took more than a month to process my job application though so do be prepared to wait a while.", "Interview Questions": "What are your lab experiences?"}, {"date": "29 Jul 2016", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University of Singapore (Singapore) in Sept 2012", "Interview Descriptions": "Hired to handle programming for research purpose. The interviewer asked experience in programming, whether I am familiar with handling pointer, how do I learn new programming languages, any idea about what they are doing, and my future plan.", "Interview Questions": "- Experience in programming\r\n- Familiarity with pointer\r\n- Interest in research\r\n- How do I learn new programming languages\r\n- Any idea about what they are doing\r\n- My future plan"}, {"date": "11 Aug 2015", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at National University of Singapore (Singapore) in Sept 2012", "Interview Descriptions": "The principal investigator decides if he / she wants to hire you. Once agreed the professor will submit the application form to the faculty office for processing. The application process requires 2 referral letters and the usual documents. After approval the HR side will contact you to do a medical check up at the health center after which you can start work. There can be a lack of communication between the preparation of the contract and the start. Typically they will send it to the professor rather than directly to you.", "Interview Questions": "Describe past research experience"}, {"date": "10 Aug 2012", "title": "Master of Science Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 6 months. I interviewed at National University of Singapore (Singapore)", "Interview Descriptions": "I did my Master of Science in Mechanical Engineering in the year 2011-2012. I specialized in Mechatronics which was an interesting course given the fact that it is versatile in its structure and the learning was fun. I did a series of 7 mini projects (including projects from mechanical, electrical and software domains) to complete the course and they were useful and interesting.", "Interview Questions": "There was no difficult phase as such but it was a hectic one year period for me since I took 5 modules per semester instead of the nominal 3 modules. It was fruitful since I passed out with good grades ans saved one year's tuition fees."}, {"date": "20 Oct 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at National University of Singapore (Singapore) in Jul 2012", "Interview Descriptions": "There was not a vacancy when I applied. But I contacted the department I was interested in and suggested that I work part-time for them. I simply met up for a semi-casual interview with the Principal Investigator and also met with the team after wards. It was semi-casual and the other interviewee wore casual attire ( jeans and t-shirt) seems like research positions may be quite lenient.", "Interview Questions": "Asked about my past experience. Interest in the department studies. Keen to do outdoor work, flexibility of weekends."}, {"date": "10 Sept 2013", "title": "Research Analyst Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National University of Singapore (Singapore) in Jun 2012", "Interview Descriptions": "1st round: invitation of written test (including basic financial knowledge and programming skills)\r\n2nd round: interview with research analysts level (key competneces you are qualified to take this job)\r\n3rd round: interview with research associates\r\n4th round: interview with senior management (e.g. why do you want to choose RMI)\r\n5th round: talk with HR to discuss welfare packages", "Interview Questions": "it's 2nd round interview, can be very specific about the skills listed on your resume, you must be very careful about what you write on it"}], [{"date": "22 Aug 2012", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National University of Singapore (Singapore) in Jun 2012", "Interview Descriptions": "Interview with professor. High GPA is a bonus.", "Interview Questions": "Why do you want this particular topic."}, {"date": "3 Nov 2015", "title": "PhD Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at National University of Singapore (Singapore) in Apr 2012", "Interview Descriptions": "phone interview. the question is easy and interviewer is ok. question is something about research and quicksort. phd is hard to apply here. people are competitive. computer science depart here is super good.", "Interview Questions": "something about research and quicksort"}, {"date": "31 May 2015", "title": "Systems Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at National University of Singapore (Singapore) in Aug 2011", "Interview Descriptions": "This interview was many years ago way before 2011.  It was a straight-forward one-to-one interview with the IT senior management.  If there were supposed to be more than 1 round of interview or testing, I was not aware.", "Interview Questions": "The senior manager kept asking how my slight colour blindness would hamper my ability to perform the duties e.g. need to change colour of website very urgently and deprived of common design software e.g. photoshop."}, {"date": "8 Jul 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at National University of Singapore (Singapore) in Jun 2011", "Interview Descriptions": "very casual, depends on your future boss.  can be a very quick talk over coffee.  people are very honest here. just be yourself and share your interest in research", "Interview Questions": "any plan for further study"}, {"date": "30 May 2014", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at National University of Singapore (Singapore) in Jun 2011", "Interview Descriptions": "You need to approach the professors before you start to apply. The interview is done if you meet the supervisor during some academic conference/workshop. The salary is standard, not much negotiation involved.  The working environment is good. Single or double-share office is provided.", "Interview Questions": "You have to study the research of the group so that you can find a good match when you approach the professors. "}, {"date": "3 Sept 2012", "title": "Laboratory Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University of Singapore (Queenstown Estate, ) in Jun 2011", "Interview Descriptions": "Three panel interview.  Asked me general work ethics questions, lab research experience, how well I manage order and paperwork.", "Interview Questions": "N/A"}, {"date": "8 Oct 2015", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 months. I interviewed at National University of Singapore in Jun 2011", "Interview Descriptions": "just one call, ask about some generally questions. Then discussed about the project, exchanged some ideas. if you have experiences, it should be very easy. The professors only call a few persons, so i think the interview is just a final check-up.", "Interview Questions": "research experiences.."}, {"date": "10 Sept 2015", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at National University of Singapore (Singapore) in Apr 2011", "Interview Descriptions": "ask you about your research experience , your grades and uni/ society activities. please bring your certificates  publications and transcripts . interviewers  very nice and friendly . the whole process is very smooth and gd", "Interview Questions": "whats your strength and weakness"}, {"date": "5 Mar 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at National University of Singapore (Singapore) in Jan 2011", "Interview Descriptions": "Informal, casual, based on previous experience with professor. The professor had taught me previously so he knew my academic ability- the issue was if I was organized and meticulous as well as willing to do tasks which were more on the menial than  academic sort.", "Interview Questions": "Are you organized and meticulous"}, {"date": "25 Jun 2012", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at National University of Singapore (Singapore) in Dec 2010", "Interview Descriptions": "I've known the professor who was interviewing me for over an year, as i did my masters thesis under him.", "Interview Questions": "MEMS"}], [{"date": "9 Aug 2011", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at National University of Singapore (Singapore) in Mar 2010", "Interview Descriptions": "I had the two phone interviews when I was in Beijing. The time difference is a bad thing ( I had to get up at 5am), and the interviewer's accent always make me to ask for repeating the questions, which annoyed him. He was not patient and I was also nervous. The interview goes not smooth. You can expect the results.", "Interview Questions": "Find the smallest element in a stack"}, {"date": "25 Jun 2010", "title": "Research Fellow Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at National University of Singapore (Singapore) in Feb 2010", "Interview Descriptions": "Met up with the department heads and dean.\r\n\r\nonce you get past the head (which you probably have contact already), if the former approves you, \r\n\r\nthe dean will most likely allow you through.", "Interview Questions": "What is your vision for the department if you were given a chance to run it in the next 5 years?"}, {"date": "7 Mar 2012", "title": "Research Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at National University of Singapore (Singapore) in Jan 2010", "Interview Descriptions": "Communication was excellent. Admin was good. It is just that one of the person interviewing (was recruited a few months before) was also of the same cadre and had a very negative attitude.", "Interview Questions": "Do you have experience with a particular research experience"}, {"date": "22 Jun 2011", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at National University of Singapore (Singapore) in Jul 2009", "Interview Descriptions": "I think I didn't completely prepare for the interview. I was very nervous,  sometimes even don't know what I wanted to say. However, the interviewer was very nice? they asked me things let me know what I wanted to say and relax. There after, I think the interview is OK. to me, I mean.", "Interview Questions": "N/A"}, {"date": "22 Aug 2013", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at National University of Singapore (Singapore) in Feb 2009", "Interview Descriptions": "They provide me with the flight+ accommodation cost for the interview in Singapore. The interview was pretty straight forward, they asked about my past experience and my knwledge about the waste water treatment process", "Interview Questions": "How do you handle being away from your home country and living in a totally different environment?"}]]