[[{"date": "24 Aug 2022", "title": "Adjunct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ashford University", "Interview Descriptions": "The first thing was a phone interview conducted by a recruiter.  I also had to respond to a list of written interview questions. Then, I was sent an email confirming that I was selected for the position.", "Interview Questions": "What is your philosophy of education?"}, {"date": "19 Jan 2022", "title": "Janitor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Ashford University", "Interview Descriptions": "Very thorough   had to clean the elevator shaft of oil dust debris and a few party decorations and organize a pantry. Would recommend. Speed round of 12.  Winner takes all", "Interview Questions": "Can you Sell me this mop"}, {"date": "20 Mar 2021", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ashford University", "Interview Descriptions": "This was back in 2018, so the process has probably changed. It was a phone screening with an HR representative then an in-person interview with 2 managers. Process was very straightforward.", "Interview Questions": "One portion had interviewers do a “phone call” to a potential student with the manager acting like the student."}, {"date": "13 Oct 2020", "title": "Online Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Ashford University in Oct 2020", "Interview Descriptions": "The interview was virtual on indeed. It was concise and to the point. I moved on to the next step in the interview process. The person I interviewed with was very polite and professional, which made me feel more at ease.", "Interview Questions": "What is your teaching philosophy? "}, {"date": "30 Sept 2020", "title": "Adjunct Faculty Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ashford University (New York, NY)", "Interview Descriptions": "I applied and was contacted by a recruiter, was asked my teaching philosophy and experience as it relates to my field. \n\nWas told I was being moved on to the next phase to interview again. Never was called back even though the interview went well.", "Interview Questions": "Whats your teaching philosophy for teaching?"}, {"date": "5 Mar 2020", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Ashford University", "Interview Descriptions": "A process that gauges your teaching philosophy and how it will benefit students. The process really reflected  Ashford University's values. They also do a good job with training new hires and existing employees.", "Interview Questions": "Share with us your experience teaching online and what platforms have you used?"}, {"date": "3 Feb 2023", "title": "Core Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ashford University (Cal-Ida, CA) in Jan 2020", "Interview Descriptions": "Recruiter call first and screen and then sets you up in a panel interview then a the provost and Dean. Recruiter interview short and screens to make sure you meet qualifications", "Interview Questions": "Why are you interested in this position"}, {"date": "3 Sept 2020", "title": "Online Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Ashford University (Denver, CO) in Dec 2019", "Interview Descriptions": "A lot of deeper questions and they were untruthful by saying the job is 12-Hours a week. Good questions about work experience and life experience. They want highly qualified employees.", "Interview Questions": "How do you interact with people online?"}, {"date": "6 Aug 2019", "title": "Access and Wellness Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ashford University", "Interview Descriptions": "I met in a conference room with the director and other counselors working for the Access and Wellness department. They had a list of questions they all took turns asking the questions.", "Interview Questions": "How do you maintain a work life balance?"}, {"date": "20 Sept 2018", "title": "Enrollment Services Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Ashford University (Denver, CO) in Sept 2018", "Interview Descriptions": "Applied online, phone screening, followed by a video call, then in person interview. Management screwed up my time for the in person interview.  I sat for over an hour waiting just to be told they scheduled me for a different time I was confirmed via email.", "Interview Questions": "What was your biggest accomplishment."}], [{"date": "14 Jan 2019", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ashford University in Apr 2018", "Interview Descriptions": "Ashford recruiter contacted me to schedule initial phone interview. Once successful, had webconference interview with Assoc Dean and panel of faculty. Second webconference interview with same panel and final interview with Executive and Assoc Dean.", "Interview Questions": "Course development experience / Resources I used to support my instruction"}, {"date": "2 Mar 2018", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Ashford University", "Interview Descriptions": "It was done over Skype since I wasn't currently living in San Diego at the time. It was a typical interview. What are your greatest strengths, greatest weaknesses, tell me about a time when...", "Interview Questions": "What is your greatest weakness?"}, {"date": "3 Aug 2017", "title": "Online Associate Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ashford University", "Interview Descriptions": "I was first given a \"written interview\" that asked me to answer a set of questions and compose statements of teaching philosophy and subject matter expertise, that then became the basis for the telephone interview that followed.", "Interview Questions": "What were the three most significant advantages and disadvantages of teaching online."}, {"date": "14 Apr 2017", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ashford University (San Diego, CA)", "Interview Descriptions": "Say they're impressed if you've worked in social service, mental health or teaching.  Then interview you only about serious sales experience.  Especially commissioned, favored if you can prove persuasion, up-selling, and getting clients to bring you friends and relatives  in the context if patting themselves (and you) on the back.", "Interview Questions": "See above."}, {"date": "13 Apr 2017", "title": "Enrollment Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Ashford University (Denver, CO) in Apr 2017", "Interview Descriptions": "This was quiet the extensive interview process for a call center job. I was reached out by a recruiter via Indeed, has one phone interview with her, multiple testing, another skype interview, needed 5-7 references to respond by email immediately, and then a face to face interview. All behavior type interview questions", "Interview Questions": "Tell me about a time you helped someone win something but didn't get any credit for it"}, {"date": "5 May 2017", "title": "Student Mentor - Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ashford University (Salt Lake City, UT) in Apr 2017", "Interview Descriptions": "Had a phone interview with a recruiter to ask preliminary questions followed by an adobe intreview the next day.  Two days later had a interview with a Senior Manager.  Did reference and background checks.  Had a job offer two days later.  Everyone was friendly which made the process very stress-free.  I was given the opportunity to showcase my skills and experience.", "Interview Questions": "What do you know about WGU?\r\nWhy would WGU be a good fit for you?\r\nHow would you handle a student who is meeting his/her timeline?"}, {"date": "10 Dec 2016", "title": "Student Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ashford University (New York, NY)", "Interview Descriptions": "Pretty straight forward ,phone then onsite and later an offer. Very corporate process and questions felt like they were out of a book. Do a general interview questions search and you should be fine.", "Interview Questions": "Basic questions "}, {"date": "7 Dec 2016", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Ashford University (New York, NY)", "Interview Descriptions": "phone interview plus two in person interviews. Very easy interviews but slightly unprofessional. The interview process was very casual and they hardly asked any questions. In and out in 15 minutes. Offered job on the spot but had to wait for official offer. Interview was on Thursday and started the following Monday which included two weeks of training before you are let out onto the sales floor", "Interview Questions": "What would you say to a student who changed their mind about pursuing their education?"}, {"date": "12 Aug 2016", "title": "Online Core Faculty Full-time Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ashford University (San Diego, CA) in Aug 2016", "Interview Descriptions": "A Talent Acquisition specialist called unscheduled a few weeks after I applied for the position.  He talked about the position and asked about my interest.  I told him I could not quit my day job right now and asked if the hours were flexible.  He stated most definitely - nights and weekends would be great.  He then set up a formal interview with him for a few days later. During this 30 minute interview, he asked typical faculty teaching questions such as how to engage students online, etc. He then said congratulations, I was moving on to the next step.  He set up an interview with the Assistant Dean and three Program Chairs. I had to complete the formal application and obtain responses (via online reference system) from four references. I completed all of this.  During the final interview, they stated this was a full time position that would require that I quit all other employment. I stated I had asked that specific question before continuing this process - and no, that was not possible at this time. (Too close to retirement - Plus it was a reduction in salary).  They continued with questions and asked about my interest in Adjunct work. I am not sure why the Talent Acquisition person did not tell me the truth about having to quit all other employment.  This wasted many people's' time.", "Interview Questions": "Tell me about what you are currently doing."}, {"date": "11 Apr 2018", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ashford University (Denver, CO) in Feb 2016", "Interview Descriptions": "They talk about the job and make it seem impactful. Pretty easy interview my manager just talked about their accomplishments back in the day. Make small talk and if they like you they will hire you. They also need people so they may seem desperate to hire you.", "Interview Questions": "How do you handle stress?"}], [{"date": "7 Jan 2016", "title": "Online Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Ashford University (Remote, OR) in Jan 2016", "Interview Descriptions": "The interview was a pleasant experience.  I met with the department chair via a telephone call and the interview was a nice two way discussion.  I learned more about the college and the job and was asked questions that were relevant.", "Interview Questions": "Goals"}, {"date": "14 Nov 2015", "title": "Enrollment Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at Ashford University", "Interview Descriptions": "I didn't apply for a position here. They contacted me and said my resume fit the position and they wanted me to do an interview. Before the interview they had me watch a video on what the position was and then when I went to the interview they said \"forget what you see in the video. That's not what the position really is.\" It was a very underhanded attempt to get me into the interview. They also contacted one of my references asking really strange questions about his IP address, completely unrelated to the job or me. I also talked to several people after my interview who worked there who told me not to take the job. I think the reviews on here speak for themselves. Wouldnt waste your time.", "Interview Questions": "they have you do a role play"}, {"date": "17 Sept 2015", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ashford University (San Diego, CA)", "Interview Descriptions": "Easy, Straight Forward, They want to see how positive you are and if you can carry a conversation.\r\n\r\nThere is a also  a role play where they want you to talk someone into going to school. HINT: Use open ended questions, build rapport, ask why they requested information and what assistance they need from you.", "Interview Questions": "What makes you a great team player?"}, {"date": "22 Feb 2017", "title": "Enrollment Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Ashford University in Aug 2015", "Interview Descriptions": "- Phone interview (I was out of state)\r\n- For those who were in- state, they were offered an in- person interview\r\n- Three week intensive, but paid, training\r\n- No one could miss any of the days", "Interview Questions": "Have you had to overcome any objections to meet goals?"}, {"date": "24 Jul 2015", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ashford University (San Diego, CA)", "Interview Descriptions": "Very fast, he asked me 5 or 6 basic questions and that was it. I've heard the interview process is now my in-depth. I think I hit the key notes of build string relationships with prior customers.", "Interview Questions": "What's my experience with rejection on the phones."}, {"date": "17 Jul 2015", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Ashford University (San Diego, CA) in Jul 2015", "Interview Descriptions": "I received an email from my recruiter, which lead to a telephonic interview. The telephonic interview was very thorough. I was asked questions off my resume and asked about experiences concerning the job itself. My recruiter provided me with a video so I could see exactly what the job entailed. This is a sit down, telephonic type of work. Basically I was asked if making phone calls and being hung up on and or negative people on the phones would be ok for yourself coming on board? My recruiter did an excellent job informing me and asking me fact finding questions to see not only if it was a good fit for them, but also if I felt is was a good job for myself.\r\nNext step I talk to a Supervisor face to face within the organization. I was very impressed with him, I was very impressed with the office building. The interview itself was somewhat reiterated from the telephonic interview. I was also asked questions off my resume and experience and or how much college I had accomplished. I also was asked to do two role play scenarios.", "Interview Questions": "Do you have a problem talking on the telephone? What experiences can you tell me when a certain situation arose. Be prepared to answer from past experineces"}, {"date": "24 Aug 2016", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Ashford University (Denver, CO) in Jul 2015", "Interview Descriptions": "Preliminary phone interview to get to know you and ask general interview questions. Then the second step is a mock phone call with a prospective student on the line. Here the interviewee asks you questions that a prospective student might ask and brings up objections that a prospective student might have to enrolling.", "Interview Questions": "Mock phone call with a prospective student. "}, {"date": "11 Nov 2015", "title": "Online Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Ashford University (Los Angeles, CA) in Jul 2015", "Interview Descriptions": "Before the telephone interview I had to answer several pre-interview questions about my teaching philosophy.  Approximately two weeks later a telephoned interview was scheduled with a recruiter who asked one question.  The entire telephone interview was a total of 15 minutes.  One week later received an offer letter.", "Interview Questions": "How would you address a student that turned in late assignments and wanted to drop a course?"}, {"date": "29 Jul 2015", "title": "Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Ashford University (San Diego, CA) in Jul 2015", "Interview Descriptions": "The interview process started with a quick phone interview then an in-person interview. You were asked typical interview questions - such as why you think you would fit this role, your strengths, weaknesses, why you chose ashford and recruiting, etc.. You found out if you got the job within 24-48 hours after your interview.", "Interview Questions": "What is your main weakness"}, {"date": "19 Jun 2015", "title": "Institutional Researcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Ashford University", "Interview Descriptions": "Standard questions, your strengths and weaknesses, your experiences, your educational background. They also asked whether I am familiar with the company. If hired, what will be my contributions. They describe their work place/environment.", "Interview Questions": "Tell us about your experience in institutional research"}], [{"date": "29 Feb 2016", "title": "Enrollment Service Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Ashford University (Denver, CO) in Jun 2015", "Interview Descriptions": "When Ashford is hiring they use many tools for find talent to join their team. Indeed.com contacted many of the last new hires. The hiring process is so simple, anyone can become an advisor at Ashford. All you have to do is show up, be able to talk and then you are offered employment\r\n\r\nPhone interview\r\nIn person interview", "Interview Questions": "Roll Play telephone conversations"}, {"date": "14 May 2015", "title": "Military Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ashford University (San Diego, CA)", "Interview Descriptions": "Phone interview followed by a call back and face to face interview.  It was described as a counseling position, when in reality it was an unofficial sales position.  If you don't make your quota in sales calls, student retention and sign-ups, you are eventually let go.  \r\n\r\nDon't be fooled folks.  It is a business.", "Interview Questions": "Are you still close with all of your military contacts?"}, {"date": "18 Nov 2015", "title": "Financial Service Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Ashford University (San Diego, CA) in May 2015", "Interview Descriptions": "Very standard interview questions.  Come with lots of examples about how you handled different scenarios.  When interviewing internally for lateral or promotion positions be prepared to make a video presentation which will be reviewed by a panel of managers and directors from other departments.  The hiring process for these jobs are completely irrelevant of your job performance.  You can be the most educated and qualified but if your video does not impress and you do not do a good job during your individual interview then you might as well just look for another job elsewhere.  Company loyalty and hard work will not help you.", "Interview Questions": "N/A"}, {"date": "10 Apr 2015", "title": "Admissions Counselor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Ashford University (San Diego, CA)", "Interview Descriptions": "Phone then one on one interview. Easy interview simple questions about how you would answer the phone calls. Sales calls and how they require some experience with sales. It's a call center environment and also included a month long training and required to pass training before hitting floor.", "Interview Questions": "N/A"}, {"date": "25 Apr 2015", "title": "Student Records Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Ashford University (San Diego, CA) in Apr 2015", "Interview Descriptions": "I received this interview from an Ashford recruiter who I worked with with a previous position that I applied for. She called me once it opened up, we did a phone interview that day. The next day I was scheduled for an in person interview at Ashford with a manager and a senior student records coordinator. I answered the questions with specific answers, was honest, and made sure to be myself. When I got home the recruiter called me saying the manager wants to offer me the position!", "Interview Questions": "How well can you multi task?"}, {"date": "1 Sept 2015", "title": "Student Advising Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ashford University (Denver, CO) in Apr 2015", "Interview Descriptions": "very detailed process, applicants were required to provide different types of information on academic background and advising leadership. Interview in total took about 3 weeks. Process is separated and ran outside of the department. Applicants went through three separate interviews and also provided a three minute video on why they felt they were good candidates for the position.", "Interview Questions": "Standard interview questions"}, {"date": "5 May 2015", "title": "Adjunct Instructor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ashford University in Apr 2015", "Interview Descriptions": "The initial application and pre-interview process is a bit on the long side. After you submit an application and CV, you are asked to complete a very long packet. This is before an interview; much of the information is generally only needed after you are offered the job. You have to submit official transcripts, get references submitted, etc. The interview is very short, about 20 minutes, and is completed by someone on the HR team. That is it. There is not really a time to speak with the decision maker; I suspect much of the decision is based on what is on your CV and not so much on who you are. The interview was easy, but also tough as there was just two questions.", "Interview Questions": "How do you engage the students?"}, {"date": "20 Mar 2015", "title": "Librarian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ashford University", "Interview Descriptions": "I had two phone interviews.\r\n\r\nFirst was a 30 minute phone screen with a Recruiter.  He was not able to answer any of my questions about the library, and he seemed quite indifferent to my answers.  It was like interviewing with a transcribing machine.\r\n\r\nSecond was a 1 hour conference call with three people from Library Services.  They were very nice and professional, though their questions were still pretty generic.\r\n\r\nIn both interviews, I asked about the legal issues surrounding the company as a concern about job security.  They didn't seem bothered that I asked, but I don't know whether it affected their decision not to give me an offer.", "Interview Questions": "How do you keep up to date on current issues in libraries? (i.e. they wanted the names of specific blogs that I read, etc.)"}, {"date": "14 Mar 2015", "title": "Admissions Counselor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ashford University (San Diego, CA) in Mar 2015", "Interview Descriptions": "At first everything was moving along quickly. Applied and the next morning (wednesday) received an email from my recruiter scheduling a phone interview. Scheduled the phone interview for the next day (thursday) and had an in person interview that next day (friday). \r\nInterview went well a couple questions threw me off because they were worded really weirdly and then at the end has an awkward role play. The only disadvantage about the role play is that no one interviewing is trained to know how they want us to carry out the convo. All I was told was to start talking..\r\nFollowing the interview my interviewer said I would hear back from my recruiter within 24-48. My interview was on a friday so I figured I would give it till tuesday that next week. Now an entire week later still-- NOTHING. I wouldn't have a problem with waiting, but the fact that I was told something and still haven't heard back at all is really unprofessional. I even emailed my recruiter with a question and have yet to hear a response. \r\nHaven't been offered or defined yet so the wait continues...", "Interview Questions": "how would you sell something to someone after they rejected it already?"}, {"date": "25 Mar 2015", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ashford University (Denver, CO) in Mar 2015", "Interview Descriptions": "Simple process; first contacted by phone through a talent acquisition manager then they will instruct you further and schedule your interview, you must have four former managers and or co-works fill out a skills survey and submit it once completed you are ready for your interview. The interview process is with one or two admission managers who will ask you to role play once or twice a typical phone call, you as the counselor them as the student. Once finished they will tell you what you did good and what you could have done better. From there the interview is straight forward.", "Interview Questions": "What would you bring to Ashford University?"}], [{"date": "12 Feb 2015", "title": "Online (\"Associate\") Adjunct Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ashford University", "Interview Descriptions": "The \"Interview\" I had was completely automated, where I was sent an \"Interview Questions\" document and many other auto generated emails and reminders.  Multiple layers of tasks including having references complete an online survey, paying to send all of my official transcripts directly to them etc.... BUT no one ever actually spoke to or with me, and I received an automated rejection email after spending hours completing all of these second round tasks.\r\n\r\nSubject: Associate Faculty  - Your Time is Valuable\r\nWe understand your time is valuable and that’s why our goal is to provide you feedback as quickly as possible.  At this time, we have elected to pursue other candidate(s) for the Online Associate Faculty position.  Please accept our appreciation for the time you have dedicated to your job search within our institution(s)/organization.  We encourage you to join the conversation and visit our Career Center to stay current on all of our upcoming position(s).  \r\nThank you for your interest in our institution(s)/organization (Ashford University, University of the Rockies or Bridgepoint Education) and we wish you success in your future endeavors. \r\nSincerely, \r\nTalent Acquisition", "Interview Questions": "What do you perceive as your greatest strengths in a teaching position?\r\n"}, {"date": "27 Oct 2015", "title": "Enrollment Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Ashford University (San Diego, CA) in Feb 2015", "Interview Descriptions": "Very responsive - submitted application Saturday and received an email Monday. Had a phone interview and in-person interview. The phone interview was very informative - gave realistic picture of the job and salary expectations. The in-person interview was formal yet comfortable. Interview was very personable and asked good questions about my resume. Be sure to bring a couple copies of resume. I interviewed on a college student Friday so environment was very fun and relaxed.", "Interview Questions": "Role Play a phone call with a potential student - very interesting and tough situation."}, {"date": "14 Jan 2015", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I interviewed at Ashford University", "Interview Descriptions": "Role play scenario. It took approximately thirty minutes.  Interviewer was on his/her phone a lot.  Did not seem like anyone there cared about student success at all.  Reminded me of wolf of wallstreet. I would not recommend this place to anyone with morals. \r\n\r\nThe company basically takes advantage of a very specific disenfranchised socioeconomic demographic and exploit them. Ruining the US economy and placing the students in debt.", "Interview Questions": "Role play with a potential student over the phone."}, {"date": "29 Jul 2015", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Ashford University (San Diego, CA) in Jan 2015", "Interview Descriptions": "Phone call, in person, offer. They are pretty desperate to hire anyone as enrollment is shifting downward and outlook is negative. I had a sales background so they countered me when I refused their first offer.", "Interview Questions": "N/A"}, {"date": "9 Aug 2016", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Ashford University (San Diego, CA) in Nov 2014", "Interview Descriptions": "I had a interview on the phone at first which was really intense because the man who did it had no personality whatsoever, then was invited for a in-person interview ran late because the person that was supposed to interview me called in sick at the last minute, and was given a call a few days later offering me the job.", "Interview Questions": "Tell me about a difficult situation that you had to deal with."}, {"date": "9 Feb 2016", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Ashford University (San Diego, CA) in Oct 2014", "Interview Descriptions": "Started with an email, and a short phone call reviewing basics of the position from an HR rep.  Followed up by completing online personality test of some sort, as well as watching a video on a day in the life of an Ashford admissions counselor.  Once completed, I was contacted for a second phone interview with another HR rep, and then scheduled for an in-person interview.  I was interviewed by the manager who selected to hire me.", "Interview Questions": "We role played as if she was a prospective student"}, {"date": "27 Jun 2014", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ashford University (San Diego, CA)", "Interview Descriptions": "I had an initial phone interview with a recruiter who sounded very rushed and busy. I then had a face-to-face interview at their corporate headquarters at Evening Creek. The building was very nice, but the girl at the reception area seemed overworked. 1-on-1 interview with HR.", "Interview Questions": "Questions weren't the hardest, but were geared around my ability to recruit new students and what my motives were for getting the job. The recruiter was very nice and knew her job well. She actually worked her way up into that position. "}, {"date": "4 Jul 2016", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Ashford University (San Diego, CA) in Jun 2014", "Interview Descriptions": "The interview began with an initial call from a recruiter, this was helpful as he gave me a sense of what type of engagement might be necessary over the phone. The second part was a sit-down with my manager. I could tell that they were trying to see if I could hold a conversation.", "Interview Questions": "They guided me through a mock sales call with a prospective student."}, {"date": "20 May 2014", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Ashford University (Poway, CA)", "Interview Descriptions": "I don't remember much about the interview except that I was interviewed by a random manager.  He hired me and passed me back to the recruiter to tell me about starting.  I had applied twice online with no response.  It wasn't until I met a recruiter at a Job Fair that I finally was called for an interview.", "Interview Questions": "I don't remember any difficult questions.  I was primarily asked about my previous experience."}, {"date": "25 May 2017", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ashford University (San Diego, CA) in May 2014", "Interview Descriptions": "Very quick. On phone then in person interview. They asked basic questions about your past experiences and where you would like to be in the future. No tricky questions. Most likely the person who interviews you will be your manager.", "Interview Questions": "Where do you see yourself in 5 years. "}], [{"date": "14 Nov 2018", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Ashford University (San Diego, CA) in Apr 2014", "Interview Descriptions": "Interview is relatively brief; training process takes several weeks.  Once you are chosen you are placed in a \"class\" with other adjuncts to complete the training.  When you successfully complete the class you are given classes to teach.", "Interview Questions": "Experience, teaching strategies, teaching philosophy"}, {"date": "19 Mar 2014", "title": "Financial Services Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Ashford University", "Interview Descriptions": "Interview process was more like a conversation rather than a structured interview.  Good questions were asked to see if you were a fit.", "Interview Questions": "Tell me a time that you had to work with a difficult customer? How did you handle it."}, {"date": "21 Feb 2014", "title": "Admissions Department Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. I interviewed at Ashford University", "Interview Descriptions": "I have interacted with recruiters from Ashford University twice, and both experiences were negative. The first recruiter found my profile on LinkedIn, invited me to apply to an Admissions Counselor position, and dangled a large salary and relocation packages in front of me. I decided to apply, and then heard nothing. When I followed up by email a week later, I received a canned response thanking me for applying, and informing me that Ashford is currently only hiring internally. Again, SHE contacted ME and asked me to apply, not the other way around!\r\n\r\nThe second time I contacted a recruiter to inquire about a management position posted on Ashford's web site. The recruiter responded immediately and said she would be calling me that day to talk. The next morning I emailed her because she never called. She responded by saying the position had been filled, and she would be in contact the next week. Two weeks went by and never heard back. I finally emailed to let her know I was no longer interested and would be pursuing other opportunities, to which she replied congratulations and never offered any explanation for her lack of follow-through.", "Interview Questions": "Never got to this point thanks to poor follow-through by their recruiters."}, {"date": "3 Apr 2014", "title": "Admissions Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ashford University (San Diego, CA) in Feb 2014", "Interview Descriptions": "Applied online for one position. A recruiter called to recommend a different position and ask if I was interested. I appreciated that the recruiter was open to matching my experience more closely with another and higher position than I originally applied for. One-on-one interview was unfocused. Associate Director seemed uninterested in me and in a rush. Seemed arrogant and distracted.", "Interview Questions": "The Associate Director started by saying we were short on time and to make my answers brief. This made answering very difficult as I felt I needed to keep it short rather than provide context and details. He just used a checklist and asked no follow up questions."}, {"date": "27 Jan 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ashford University", "Interview Descriptions": "Went smoothly. I was contacted through email and an interview was set up on the phone.  I completed a phone interview with HR and then with the hiring committee.", "Interview Questions": "Explain a difficult situation with a coworker and how I handled it. "}, {"date": "9 Jan 2014", "title": "Military Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Ashford University", "Interview Descriptions": "First there is the initial phone call from Bridgepoint HQ then they schedule you a second phone interview.  This second phone interview has call examples, and detailed, \"for example\" type situations for you to respond to.\r\nFinally, there is an in-person interview, usually with your manager.\r\n\r\nOn the day of orientation, there is a TON of people there and it's a little off-putting.", "Interview Questions": "N/A"}, {"date": "15 May 2015", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Ashford University (San Diego, CA) in Jan 2014", "Interview Descriptions": "THEY found me on LinkedIn, the process took about 3 weeks. I did an initial interview on the phone with a recruiter, then scheduled another phone interview with an HR manager. Once they decided I'd be a good fit, I was scheduled for an in-person interview with the hiring manager. This interview lasted about 30-45 minutes where I was asked about my relevant experience and they explained the position to me very vaguely. Once that was over, I had to complete an computer test and then was told I'd be followed up with within a week.", "Interview Questions": "They asked me to role play a phone conversation with only a very vague idea of what I was to be doing"}, {"date": "14 Jul 2015", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ashford University (San Diego, CA) in Jan 2014", "Interview Descriptions": "It was fairly easy. You apply online and get a call back from a recruiter, then do a referal email. Last stop is a face to face interview with a manager", "Interview Questions": "How would you get someone to open up who is angry with you?"}, {"date": "11 Sept 2015", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Ashford University (San Diego, CA) in Dec 2013", "Interview Descriptions": "First phone interview, typical questions.  Second interview at site location....mass interview with many people waiting in the lobby to be interviewed.  The interview was relatively easy and took about 20-30 minutes.", "Interview Questions": "I was asked to demonstrate how I would sell a product after being told what points to highlight in my pitch."}, {"date": "8 Nov 2013", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ashford University", "Interview Descriptions": "Filled out an application online.  They called me asked me a bunch of questions I passed that.  Came in for a face-to-face interview and I was hired.", "Interview Questions": "It was so many years ago I don't remember"}], [{"date": "6 Oct 2013", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ashford University (San Diego, CA) in Oct 2013", "Interview Descriptions": "Applied online, received call following day for recruiter, two days later received call from senior recruiter and two days later had the interview and spoke with the \"so called\" director of human resources. I asked early in if this was a sales position and was told \"no\" but when I was interview all questions asked led to a sales position.", "Interview Questions": "They do a role play where you are on the phone and talking to a potential student trying get them to enroll."}, {"date": "9 Oct 2013", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Ashford University (San Diego, CA) in Oct 2013", "Interview Descriptions": "I was contacted through a recruiter advising me they had a career opportunity available. The first initial phone call was pretty standard information about the position, the environment and skills needed. The recruiter I spoke with then set up an actual phone interview (with the same recruiter) for 5 days after the initial conversation. He sent me links in an email as my homework I needed to have completed before the phone interview. The homework consisted of listening to call clips and answering questions and uploading my resume online. During the phone interview he asked me questions about previous work experience and gave me scenarios and asked me if I would feel comfortable handling them.\r\nAfter that he invited me for a face to face interview the next day, early in the morning. He told me I needed to complete both of the links in his email prior to the interview. The first link was an official application and the second was 4 references with at least 2 being from previous Managers. It was difficult to contact everyone and get them to fill out the information prior the that next morning. \r\nThe face to face interview was in a conference room with one other person he asked questions and wrote them down on a piece of paper word for word. They were pretty typical questions. The last part of the interview was a role-play scenario, he told me three pieces of information about the person I was calling and asked me to carry a conversation with the caller. After that call, he gave me feedback and we role-played again.", "Interview Questions": "-Name a time you had a disagreement with one of your supervisors and how to you resolve it?"}, {"date": "10 Sept 2013", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Ashford University (San Diego, CA)", "Interview Descriptions": "pretty drawn out. three phone interviews (all of which seemed just to brag about what benefits you will receive if hired)", "Interview Questions": "They make you do a \"mock telephone call\" with a student. Pretty awkward. "}, {"date": "19 Sept 2013", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ashford University (San Diego, CA) in Sept 2013", "Interview Descriptions": "Submitted application on line and about 2 wks later received an email from their Sr. Recruiter. Had a quick conversation about the position the next day, then scheduled for a phone interview the following day.  I had to watch a video with 5 questions that needed to be answered within 3 minutes before my scheduled phone interview.  This was very insightful about the role of an admissions counselor. The following day, there was a formal interview with a manager.  Both the recruiter and Manager provided a fair assessment of the company and position. I did some research prior and was impressed with their honestly and dedication to the organization.", "Interview Questions": "The role play was unexpected. "}, {"date": "19 Sept 2013", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Ashford University (San Diego, CA) in Sept 2013", "Interview Descriptions": "Applied on the Ashford University website, received a phone call the next day with a recruiter and was told what the first step in the process was going to be, the first process was to complete a 'virtual day in the life' of the position of AC and answer a few questions, next day recruiter called again and had a informal phone interview and had to fill out a reference form and got scheduled a formal interview at the facility, next day went in for the formal interview, facility was pretty nice and people were very welcoming and kind, interviewer came downstairs in the waiting area and we went off to a conference room and had a formal interview..", "Interview Questions": "All the questions were expected in any interview, questions about yourself and ways you approached situations that pertain to the job description. Had an idea of the role play but was not fully prepared for it which probably screwed me over. "}, {"date": "25 May 2014", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Ashford University (San Diego, CA) in Sept 2013", "Interview Descriptions": "Phone, Internet test, and face-to-face.  They first do a phone interview, then if they like you, you have to pass a web-based role play test.  Then in the face-to-face interview, they ask behavioral questions and then there is a role play exercise in which you want to use open-ended questions.", "Interview Questions": "Give an example of a time in your life when you had to persevere."}, {"date": "24 Feb 2017", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ashford University (San Diego, CA) in Aug 2013", "Interview Descriptions": "I applied online,shortly there after I got a call, I went in for an interview in their downtown office. The interview was a one on one with a manager and was very casual. After the interview I had to submit transcripts. This all took place within a couple of weeks.", "Interview Questions": "Did mock phone calls with the interviewer."}, {"date": "8 Sept 2013", "title": "Institutional Research Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ashford University (San Diego, CA) in Aug 2013", "Interview Descriptions": "Two phone Interviews: first phone interview with a corporate recruiter ( to judge communications and background match) and then a longer phone interview with a hiring manager (experience and skills).  Then, video interview with a director (formal and awkward, no introductions)and the research team members (Casual, unstructured). The team just asked me questions about my background experience. Next would have been a skills test on SQL Server.", "Interview Questions": "Behavioral question during the third interview:  tell me about a time when you had to present...?"}, {"date": "8 Oct 2013", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ashford University (San Diego, CA) in Aug 2013", "Interview Descriptions": "All the reviews are spot on - yes, you initially receive a phone call from a recruiter, explaining the position, benefits, and rate of pay.  Second phone call, a few days later, from the same recruiter, asking your thoughts about the video, which details \"a day in the life of.\"  Then, more questions, regarding the position, where some are situational.  Then your recommended for an in-person interview that includes, a manager, and director. For some reason, only the manager interviewed me, probably because the director was busy, or called in sick that day.  Whatever, not a big deal.  The manager was friendly, but I felt over dressed in a suit.  He was wearing jeans, and a polo shirt, untucked.  Again, the manager asks what you think about the position, since your on the phone all day, everyday.  Heavy dialing.  Lastly, I inquired about a quota, and he said there isn't one, but this month is 4 (well, that means there IS one).", "Interview Questions": "None, everything straight forward.  The usual questions asked."}, {"date": "8 Oct 2014", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ashford University (Denver, CO) in Aug 2013", "Interview Descriptions": "Applied online and was contacted by phone by a recruiter.  Typical 10 minute phone screen, then scheduled to phone interview with a hiring manager, then brought on-site with hiring manager.  Then, one more phone interview with the entire hiring team.  Was offered the position within a few days after the interview.  Total process 2 weeks.", "Interview Questions": "I was asked to role play and pretend I was the admissions counselor.  "}], [{"date": "9 Aug 2014", "title": "Admission Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Ashford University (San Diego, CA) in Jul 2013", "Interview Descriptions": "They have phone interviews, Videos to watch to see if you can handle the grind of what they want you to do, then you go to a in person interview on site.", "Interview Questions": "How did you handle a dificult/ angry person in the past work environment?"}, {"date": "14 Jun 2016", "title": "Admission Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Ashford University (San Diego, CA) in Jul 2013", "Interview Descriptions": "The interview process was average and pretty easy. I was very comfortable with the interview. She made it very easy. After the interview, I realized that this is the place I want to represent.", "Interview Questions": "Why do you want to work for us?"}, {"date": "20 Jul 2013", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Ashford University (San Diego, CA) in Jul 2013", "Interview Descriptions": "Phone Interview with a recruiter, Phone Interview with Senior Recruiter, In Person Interview with Manager at Ashford.", "Interview Questions": "Is there anything I should know about you and why you should be hired?"}, {"date": "11 May 2013", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ashford University (San Diego, CA)", "Interview Descriptions": "Filled out online application. Received a phone call from a recruiter and he informed me of the position, salary, and general details. He asked if I was interested in the position and scheduled a phone interview. After the next phone interview they called me in for an interview with a director and manager. Very basic interview questions that were pretty similar to any other interview I've been to.", "Interview Questions": "Role playing. In the interview they had me role play like I was speaking to a prospective student on the phone. "}, {"date": "19 Sept 2014", "title": "University Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Ashford University (San Diego, CA) in Apr 2013", "Interview Descriptions": "4 interviews. Group interview. First 2 were with HR and the recruiter. Then, came in and interviewed in person with hiring manager. Finally, invited to a group interview. Based on the question asked, we were evaluated for our ability to do conceptual thinking, personality evaluation and presentation skills.", "Interview Questions": "Talk to person next to you. Then address the group as to why person should be hired."}, {"date": "20 Mar 2013", "title": "Associate Financial Aid Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at Ashford University", "Interview Descriptions": "1. Basic phone interview with someone from HR\r\n2. In person interview with my to be managers\r\n3. Personality and Intelligence test", "Interview Questions": "N/A"}, {"date": "1 Mar 2017", "title": "Admission Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Ashford University (San Diego, CA) in Mar 2013", "Interview Descriptions": "Good, but wish they went more in to detail about the career growth options. Job was very different from what the interview displayed the role. Took some adjustment time", "Interview Questions": "Role play"}, {"date": "19 Apr 2013", "title": "Digital Services Librarian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ashford University (San Diego, CA) in Mar 2013", "Interview Descriptions": "I submitted my application via their online HR system. A few weeks later, I heard directly from one of their recruiters. We scheduled a 30-minute phone interview for a few days later, where she asked me some basic questions about my background. When I asked a few questions specific to the position, she was unable to answer them and said I could ask them at the next round, which was a phone interview with the librarian who would be my supervisor. That interview was scheduled the following week and was an hour in length, and also included another member of the team. Their questions were more detailed about my background, but I did get get the \"what is your biggest weakness?\" question. A few days later I was invited to an in-person interview. That interview was at Ashford's headquarters, and was a panel interview with the entire library team, about 8 people in all, who took turns asking questions. This interview also lasted about an hour. Many of the questions were scenario based: \"how would you answer a reference question being posed by a student over the phone? what are some of the challenges you see with doing reference work in a virtual environment?\"", "Interview Questions": "What are some of the challenges you see with doing reference work in a virtual environment?"}, {"date": "3 Jun 2015", "title": "Outreach Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Ashford University (Clinton, IA) in Mar 2013", "Interview Descriptions": "I met with the Admissions manager and Regional Admissions Manager. It was a 1 hour interview. The managers were very friendly and welcoming. They asked questions mainly on my personality and how I can manage in a team setting.", "Interview Questions": "What skill sets will do you have that will contribute to the admissions team?"}, {"date": "23 Jun 2015", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Ashford University (San Diego, CA) in Mar 2013", "Interview Descriptions": "Over the phone interview, than an in person interview. Asked about my strengths and had me pretend I was on a call. Very easy. 2 people were in the room and questioned me. They were very polite.", "Interview Questions": "Why would you be a good counselor?\r\n\r\nAre you able to make high volume calls?"}], [{"date": "9 Jan 2018", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Ashford University (San Diego, CA) in Jan 2013", "Interview Descriptions": "The interview process begins with a phone interview with Human Resources department. If a candidate meets background and qualities that are desired the candidate will have the opportunity to move forward in the interview process. A panel interview usually takes place to ensure the candidate meets more than one member of the team.", "Interview Questions": "What are your strengths and how can they be applied to this role?"}, {"date": "16 Jan 2016", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ashford University (San Diego, CA) in Jan 2013", "Interview Descriptions": "No interview.  Just an application process and an orientation. The whol;e process took a few months, but was all done online and through email.  No in person interview was required and the process went pretty smoothly overall.  Once I was accepted for the position, I went through a four week orientation that was paid for.", "Interview Questions": "No interview questions.  Just an application process with general questions about teaching style and experience. The essay questions required about one page (250 words to answer and were relatively easy and straight forward.  Once completed, I emailed the whole package back and was hired within a few weeks of their receipt of my interview questions."}, {"date": "15 Feb 2016", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Ashford University (Denver, CO) in Dec 2012", "Interview Descriptions": "1 on 1 interview with an admissions manager. It was on site in the human resources office. I learned about the school, the position, and opportunities for advancement. The manager asked me a bunch of questions about my background and we did a role play for a sales phone call. The manager had been with the company for a couple years and seemed very knowledgeable  on the position. The interview would have been more informative if I had been able to see the floor and environment before accepting the position.", "Interview Questions": "Role play a sales call"}, {"date": "1 Feb 2016", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ashford University (San Diego, CA) in Nov 2012", "Interview Descriptions": "I had an interview with human resources and then I had an interview at the office with the hiring manager, potential coworkers and others in the organization. It was a fairly straightforward process with a list of questions that they read off that were typically general in nature and then some questions about some items that were specific to the job itself.", "Interview Questions": "Describe a time in which you had to manage a conflict in the workplace."}, {"date": "11 Oct 2012", "title": "Student Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ashford University (San Diego, CA) in Oct 2012", "Interview Descriptions": "I had an initial phone interview which was more of a description of the job from a recruiter and she asked if I was interested. Then I had an on site interview where two people interviewed me, each asking questions from a sheet. It was typical stuff, \"Name a time when you had trouble with a customer and how did you handle it?\" That type of thing.", "Interview Questions": "Why do you want to work for this company?"}, {"date": "12 Feb 2014", "title": "Help Desk Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Ashford University (San Diego, CA) in Aug 2012", "Interview Descriptions": "First it was an online application.  This was followed up by email communications and then a phone call to schedule the interview.  Then you showed up for the interview and waited quite a while.  The interview was conducted by three people, and they alternated asking questions.  Mostly they were typical questions asking about your work history/experience, and then the usual \"where do you see yourself in 3 years\".  The bad part was what I guess where questions designed to test my problem solving ability, but they were just asked like they were a typical question.  See below....", "Interview Questions": "\"Simple question, how many pay phones are there in New York City?\""}, {"date": "12 Jul 2016", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ashford University (Denver, CO) in Apr 2012", "Interview Descriptions": "Was interviewed by a nice guy. It took about a half hour and he just asked me about my current employment. I remember being asked about a difficulty I've had to face previously with another person at work.", "Interview Questions": "Did not pay attention to my answers or questions, just told me about the job"}, {"date": "14 Jun 2012", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Ashford University (Denver, CO) in Mar 2012", "Interview Descriptions": "I went through a staffing agency so the agency called references and verified background information on their behalf. After, the university called and did a basic phone screening. Following the phone screening, we needed to watch a video to determine if this was right job which we were given 48 hours to complete. After the completion of the video, we were called in for a 1:1 interview in which we did some basic role playing with the recruiter.", "Interview Questions": "What is a way that you displayed leadership in previous positions?"}, {"date": "24 Sept 2013", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ashford University (Clinton, IA) in Feb 2012", "Interview Descriptions": "The interview process consisted of a telephone conversation, during which I was asked general questions and responded in same. Nothing extremely detailed was requested, but I gave the interviewer a great deal of information about myself and my background, both educational and personal. The hiring process involved a one month online training program, which was very limited in scope, and was not very demanding at all. However, this training program was extremely elementary and very insulting to anyone possessing any form of teaching experience.", "Interview Questions": "There was no question I found to be unexpected or difficult. What was unexpected was the overall generality of the questioning, as nothing was education specific."}, {"date": "3 Sept 2015", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Ashford University (San Diego, CA) in Feb 2012", "Interview Descriptions": "I had one phone interview and then was called in for an in person interview. I had friends that worked their and helped me get the job so I don't know if that changed the process at all. It was all relatively quick, but that was also at a time that they were hiring a lot of new employees.", "Interview Questions": "Tell us a time you experienced conflict at work and how did you handle it.\r\n"}], [{"date": "15 Jan 2014", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Ashford University (San Diego, CA) in Dec 2011", "Interview Descriptions": "I was screened initially over the phone. I knew an employee, but I felt that the interview process/questions was thorough and detailed, and they really wanted to know if I would be a fit. I was asked all types of questions ranging from basic customer service-type questions to more pointed ones regarding academic advising.", "Interview Questions": "I really don't recall exactly, but it was along the lines of what to do if my boss asked me to act unethically..."}, {"date": "12 Jun 2012", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 5 days. I interviewed at Ashford University (Denver, CO) in Dec 2011", "Interview Descriptions": "you apply online and get a phone call from a recruiter, they ask you some initial questions that aren't too hard just to get to know you then they set up a one on one..from what i heard a lot of the one on ones were different, but you generally meet with a random manager of a team, they talk about helping people and you helping people achieve their dreams and what makes you a good person to work there, some obstacles challenges, etc...they emailed me an offer in a couple of days", "Interview Questions": "what would you rank first, money, prestige, career"}, {"date": "25 Sept 2015", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Ashford University (San Diego, CA) in Dec 2011", "Interview Descriptions": "Simple, Phone interview, an in-person interview and then a second in-person interview. Both interviews asked very similar questions, so after I did the first in-person interview, I was well prepared for the second in-person interview.", "Interview Questions": "Do you have any sales experience?"}, {"date": "14 Jun 2013", "title": "Admisisons Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ashford University (San Diego, CA) in Dec 2011", "Interview Descriptions": "they gave me two phone interviews with people called \"talent\" reps, they lied to me told me I would be calling people who cared about the school and knew about the school , then one informal interview.", "Interview Questions": "N/A"}, {"date": "13 Nov 2011", "title": "Admission Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Ashford University (Denver, CO) in Nov 2011", "Interview Descriptions": "This was a very usual experience. I applied for the position of Admissions Counselor about 2 days later I received a rejection letter via email. Less than 2 hours later I received a call from a recruiter at Ashford University requesting a telephone. She and I spoke at length and she asked many interview like questions.       i thought this was the telephone interview. She asked if she could schedule a telephone with me the next I agreed. She sent me a customer service skills test, application and a form to list my references. The next day called my for the \"telephone interview\" and asked the same questions from the day before. I passed the telephone interview and was schedule or an in person interview a couple of days later. I went to the in person interview was interviewed by 2 men, who was very in experience in conducting interviews. The 2 men seemed impressed. One guy kept saying \"If we can get a Yes\" you will start on Nov 14th. The very next morning I received a rejection letter stating \" We want someone with more experience\" No where in the ad did they state they wanted someone with previous Admissions Counselor. This is after a reference check with consisted of a questionnaire.", "Interview Questions": "What other industries are looking at for employment?"}, {"date": "18 Jan 2013", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ashford University (Denver, CO) in Oct 2011", "Interview Descriptions": "The hiring and interview process was fairly smooth and professional.  I did ask a couple of key questions that I realized after I was hired were not answered honestly.  I asked if it was a sales position and if there were quotas.  Both were answered as no, but it definitely was a sales position and they expected you to enroll a certain amount of students per month.  They aren't allowed to say they have enrollment requirements.", "Interview Questions": "A mock phone call with a student when you just walked in the door and weren't really sure what the position entailed. "}, {"date": "21 Jul 2015", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Ashford University (San Diego, CA) in Oct 2011", "Interview Descriptions": "phone interview and then one on one. Process went very quickly and I received an offer within 1 day of one on one interview. Interviewer presents company very differently from actual on the job experience.", "Interview Questions": "tell me about yourself"}, {"date": "6 Feb 2012", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Ashford University (Denver, CO) in Oct 2011", "Interview Descriptions": "I met one of the recruiters at a job fair, which was followed by a phone interview.  In the phone interview he asked questions trying to get to know me and my background.  My recruiter was very nice, the phone interview was relaxed enough and we moved forward with a in person interview after.  The next interview was with two managers, although one was a newer manager who didn't say much at first.  They asked basic interview questions finding out why it was I wanted to be there, motivation, then we did a role play.  Overall the process was pretty easy and I received and offer later that day.", "Interview Questions": "Describe a time when you had a conflict with someone you worked closely with and how did you resolve it?"}, {"date": "25 Jul 2012", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ashford University (San Diego, CA) in Sept 2011", "Interview Descriptions": "Round 1: Short phone interview w/ HR. Mostly behavioral questions. Round 2: Online personality tests and MS Office proficiency tests. Round 3: 1/1 with HR rep at the Sunroad building. The process took about 4 weeks.", "Interview Questions": "\"I am a single mom of 3 living in a rural area. I graduated from high school 15 years ago. You give me phone call. How would you go on to tell me about Ashford University and enroll to an online program?\" "}, {"date": "17 Sept 2011", "title": "Admissions Counser-Denver Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Ashford University (Denver, CO) in Sept 2011", "Interview Descriptions": "The first call was an HR rep selling the position, the second call was  a phone interview of about 20 minutes, and the last part of the interview was a face-to-face interview. At the interview I was informed to expect to make about 300 calls a day. I am glad I did not get offered the counselor position because there is no way to have a customer-focused conversation when the average call would be about 2 minutes. Be prepared to respond to \"Role-play\" with the interviewer.", "Interview Questions": "Can you role play....?"}], [{"date": "26 Jan 2012", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 4 days. I interviewed at Ashford University (San Diego, CA) in Aug 2011", "Interview Descriptions": "Found job on indeed.com, went to the website and created profile, received phone call and first phone interview. Recieved second phone interview. Then 1:1. Following that was an office skills test, a personality test, and an outlook express test. Offered job following these assessments.", "Interview Questions": "Describe a time when you had to work with someone you didn't get along with?"}, {"date": "18 Aug 2011", "title": "Enrollment Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 days. I interviewed at Ashford University (San Diego, CA) in Aug 2011", "Interview Descriptions": "The first two phone calls were simply to sell me on the position and the quick start date of September 6th.  Everyone was nice and very professional, but it seemed like they were all reading from a script.  I am not sure why I did not get offered a position maybe I was too arrogant with some of my answers, because after reading these reviews it seemed like a shoe-in.  I did ask the interviewer a few tough questions at the end so I may have hurt my chances there.  Seems like they only review employees performance annualy as opposed to semi-annualy due to the Senat hearings.  Seems like it would be a good place to work, but you would be subject to intense micro-management.", "Interview Questions": "Do you have a problem making a lot of phoen calls?"}, {"date": "14 Aug 2011", "title": "Admissions Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Ashford University (Denver, CO) in Jul 2011", "Interview Descriptions": "I had 2 phone house interviews and 1 in house interview before I was offered the position.  The first phone interview was very short (15 minutes) with an HR specialist followed by and online personality test.  I wasn't asked many questions they mostly described the job and the company and confirmed I was ok with the position and the salary.  The second phone interview I was asked questions about my experience etc.  This was followed by an in house interview of similar nature.  The second phone interview and in house interview were about 30-45 minutes.", "Interview Questions": "Have you ever taken an online course?"}, {"date": "22 Apr 2014", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Ashford University (San Diego, CA) in Jul 2011", "Interview Descriptions": "It was a one on one interview. While I was working there they changed the interview process. Last I knew it was still a one on one interview, but they make you pretend to get on a phone call with a potential student and ask how you would go about enrolling them.", "Interview Questions": "What are some major benchmarks you have achieved so far? "}, {"date": "17 Sept 2011", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Ashford University (San Diego, CA) in May 2011", "Interview Descriptions": "Recruiter called me, asked a few basic questions on my resume, told specifics of the job and asked if I would be interested.  Passed that round, scheduled a formal phone interview the following day, asked a few other questions, and passed that round.  Then scheduled a 1:1 in person interview, and was told I'd hear back within a few days.  I got a call back later that same day and said it went great, and made a conditional job offer.  Had to provide references to fill out a survey on me and my job abilities and show I had knowledge of how to use Microsoft Outlook and Excel.  Then accepted the job offer and attended 2 weeks paid training before hitting the \"floor.\"", "Interview Questions": "Would be be offended if someone hungup on you or cursed you out on the phone?"}, {"date": "8 Sept 2013", "title": "Military Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Ashford University (San Diego, CA) in May 2011", "Interview Descriptions": "I had 2 telephone interviews, then a face to face interview. Lots of paperwork. Easier than I thought.", "Interview Questions": "If I thought I could talk about military financing options. "}, {"date": "12 Feb 2014", "title": "Student Services Auditor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ashford University (San Diego, CA) in Apr 2011", "Interview Descriptions": "Straight forward and basic.  Examples of questions include: \"Tell me about a time you failed\" or \"Tell me about your greatest success in business\"", "Interview Questions": "\"Tell me about a time you overcame a major obstacle\""}, {"date": "28 Jul 2015", "title": "Student Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ashford University (San Diego, CA) in Feb 2011", "Interview Descriptions": "Very easy and straight forward. They want to know you are committed to building a career at Ashford University. They also want to make sure that you as an employee are comfortable carrying the responsibilities of your position", "Interview Questions": "Why should we hire you? What are some of your weaknesses?"}, {"date": "13 Jan 2012", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 5 days. I interviewed at Ashford University (San Diego, CA) in Jan 2011", "Interview Descriptions": "The first interview is a short phone interview and then you move on to a personal interview.\r\nThey want to know your sales background and how you would overcome objections. They present a hypothetical situation where a student objects to going to school and you are supposed to overcome their objection.\r\nThe entire process went fairly quickly and in less than a week I was able to start working.", "Interview Questions": "Was there ever a time when you did not meet sales goals/ quotas and what did you do?"}, {"date": "21 Jun 2011", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Ashford University (San Diego, CA) in Nov 2010", "Interview Descriptions": "Fairly simple interview process. Standard questions (customer service/sales based). Looking for people with sales or customer service experience. Interviewed. Received an offer via email. Had 24 hours to complete paperwork.", "Interview Questions": "Tell us about a time you had a conflict in the work place? "}], [{"date": "18 Mar 2014", "title": "Associate Faculty Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Ashford University (Denver, CO) in Nov 2010", "Interview Descriptions": "Very simple phone interview.  I was actually in a noisy hospital waiting room when they called, still did the interview and got the job.", "Interview Questions": "What will you do to help retain students in your courses?"}, {"date": "5 Aug 2010", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Ashford University (San Diego, CA) in Aug 2010", "Interview Descriptions": "This place will hire ANYONE who has even attempted college. Pay is almost the same across the board regardless of degree. Training is absolutely brutal and basically mental torture, anyone with half a brain could learn what they teach you in 2 weeks in 2 days.", "Interview Questions": "How do you deal with rejection?"}, {"date": "30 Sept 2014", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Ashford University in Aug 2010", "Interview Descriptions": "The company usually gives a simple phone interview with basic interview questions before offering an in person interview. After you successfully pass this step you are offered an in person interview with the hiring manager and possibly a few others. \r\n\r\nI was offered the job several hours after leaving the in person interview.", "Interview Questions": "Nothing really surprising, all questions where standard for a interview. "}, {"date": "5 Jul 2013", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Ashford University (San Diego, CA) in Apr 2010", "Interview Descriptions": "I was hired within 3 days. Extremely fast process because I was referred by a friend.", "Interview Questions": "Nothing seemed unexpected. Just be passionate about education."}, {"date": "19 Apr 2011", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 days. I interviewed at Ashford University (San Diego, CA) in Mar 2010", "Interview Descriptions": "Phone interview. Told me about available positions. I chose to interview for the position that paid the most. Also the most miserable job I have ever taken.", "Interview Questions": "N/A"}, {"date": "19 Sept 2014", "title": "Enrollment Advisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Ashford University in Feb 2010", "Interview Descriptions": "Inital call, then interview with HR Personnel Standard questions. Job Description not as accurate for the position.Overall interview process is average and to be expected for this position. After intial call and interview then you receive a call back with an offer of salary  amount.", "Interview Questions": "N/A"}, {"date": "18 Dec 2010", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Ashford University (San Diego, CA) in Jan 2010", "Interview Descriptions": "It for me was a difficult interview. They were mainly concerned with sales experience, skills, and past results. They were also concerned with this job being a lifetime choice. They wanted you to have memorized information in regards to ashford and bridgepoint education. I needed to express that I had a passion for helping students.", "Interview Questions": "What are specific examples in your past of dealing with a difficult customer"}, {"date": "4 Jan 2010", "title": "Enrollment Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Ashford University (San Diego, CA) in Nov 2009", "Interview Descriptions": "It was fairly quick.  I was contacted and interviewed mostly about education and what I thought about education.  After that I came in for a face to face interview where we discussed my experience and how i felt about working on the phones and calling people and having phone relationships for a living.  Additionally, I was asked to watch someone work for 1 hour.", "Interview Questions": "Describe a time when you did something dishonorable."}, {"date": "11 Dec 2011", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ashford University (San Diego, CA) in Oct 2009", "Interview Descriptions": "Phone interview with HR. Then asked to come in and participate in group interview with 10 other candidates. Then did 1 on 1 interview with hiring manager. Was recommended for sales by matriculation manager, and scheduled another interview with two enrollment managers. Once hired, participated in two week training seminar with 30 new hires. After first two months, only half remained because they were not hitting their enrollment goals or because they quit. Extremely high turnover rate. Would make 100-250 phone calls daily.", "Interview Questions": "I'm a single mom with two kids and a full- time job, so I don't have time for school. How do you respond?"}, {"date": "14 Jan 2013", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Ashford University (Clinton, IA) in Jun 2009", "Interview Descriptions": "I don't quite recall, but I remember the interview process being standard. It consisted of a phone interview and a skype call. All of the questions were basic and can be found and practiced on any internet interview sites as they relate to education and teaching", "Interview Questions": "What is your role in the retention of students."}], [{"date": "21 Aug 2012", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ashford University (San Diego, CA) in Feb 2009", "Interview Descriptions": "Applied online. Phone interview then an interview with the in house recruiter.", "Interview Questions": "What is your opinion on education"}, {"date": "11 Sept 2012", "title": "Financial Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Ashford University (San Diego, CA) in Feb 2009", "Interview Descriptions": "A couple Finance Managers will interview and ask basic questions. It is a quick interview and are asked mostly about background with financial aid.", "Interview Questions": "Everything is pretty basic."}, {"date": "20 Sept 2011", "title": "Student Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Ashford University (San Diego, CA) in Jan 2009", "Interview Descriptions": "The two interviewing managers lied to me about what the Student Services Auditor position entailed.  I came from an advising background, thinking I was going to another academic advising position.  I was lead to believe I would be counseling and guiding students through their education.  Unfortunately, after a week in the job I realized it is a customer service position mixed in with sales.  None of these job duties were explained to me.  I definitely feel lied to and deceived by the two interviewing managers.", "Interview Questions": "All of the questions were your basic interview questions--strengths, weaknesses, example of achievement in workplace, example of challenge in workplace, etc.  Google interview questions and you will be good to go."}, {"date": "23 Oct 2012", "title": "Matriculation Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ashford University (San Diego, CA) in Jan 2009", "Interview Descriptions": "Seemed casual at first when I came in for interview but that was prior to company changing dress code policy.  Went into a vacant office in one of the buildings and had an interview with two managers at the time.", "Interview Questions": "How to deal with difficult students "}]]