[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": ".", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Jul 2023", "job_title": "Neighbourhood Coach in Cirencester, England", "duration": "N/A", "pros": "people who work there are very helpful", "cons": "Most people say that salary could be higher"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Generally fed-up staff with high turnover", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "9 Jul 2023", "job_title": "Coordinator in Chipping Sodbury, England", "duration": "N/A", "pros": "At least on the surface, a real attempt at helping people through social housing Efforts made towards improving workplace environment Environmental ethos in terms of building new houses sustainably My manager was really great, though most managers were really not good. Amazing sick-leave policy and generally felt like Bromford would take care of you if bad times fall upon you (never had something like this happen to me fortunately but it did feel like they would care and support you)", "cons": "Overworked, poorly paid 'lower down' staff Increasingly insistent on working at the office, even if that means working there on your own with very little integration with colleagues (to the point of tracking your lanyard tap-ins at the door) Doesn't feel like Bromford empowers its tenants, but instead generates repeated cycle of unemployed people with no incentives to work (and therefore lose their cheap rent) so begs the question of what Bromford stands for / how they help the world (this coming from someone who strongly supports council housing and social welfare)"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Place to Work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 May 2023", "job_title": "Service Delivery Graduate in Wolverhampton, England", "duration": "N/A", "pros": "Friendly place to work, everyone is always willing to help- the culture is great! The DNA of Bromford really shines through each colleague. So many different initiatives for all to get involved in through EDI groups, loads of opportunities for ideas to be put forward. Many benefits are available which encourage and promote wellbeing. Flexible working is available as well as having the opportunity to work at any of the 4 offices. The grad scheme has given me the opportunity to work alongside leaders which really motivate you and offer great opportunities allowing you to develop as an individual. The grad scheme constantly looks for ways to develop the grads in many areas outside of their role.", "cons": ". . . . ."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Great place to be apart of", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "24 Jun 2023", "job_title": " in Wolverhampton, England", "duration": "N/A", "pros": "everything I'm a long term colleague", "cons": "constant change fast paced great place"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Sic Transit Gloria", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "13 May 2023", "job_title": "Anonymous Employee in Dudley, England", "duration": "N/A", "pros": "The people, colleagues, were fantastic. Lots of really good people trying to do great things with next to nothing, and oftentimes succeeding. Great work/life balance and trust based working.", "cons": "Complete change in senior leadership team gutted the Bromford culture. A \"merger\" with another housing association lead to the installation of a CEO who appears aloof and disengaged. Very little scope to move around or get promoted unless you work at head office."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great company, great staff", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Apr 2023", "job_title": "Anonymous Employee in Tewkesbury, England", "duration": "N/A", "pros": "Good employee benefits. Flexible working Training and development Great staff", "cons": "Communication between senior leadership and staff could be better. Hard to get to speak to senior leadership team. Little or no response to request or emails. Senior leadership can be seen, but you can’t actually engage, so can feel like your voice can’t be heard. This might be for clarity, ideas, or feedback."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Supported to develop", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "26 May 2023", "job_title": "Assistant HR Business Partner in Wolverhampton, England", "duration": "N/A", "pros": "Supported to develop and obtain formal qualifications. Focus on mental health and work life balance Friendly; great colleagues.", "cons": "Systems can be tricky to get information from sometimes"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "24 May 2023", "job_title": "Housing Officer in Wolverhampton, England", "duration": "N/A", "pros": "Great moral between colleagues Flexible Profession opportunities Lots of benefits", "cons": "Nothing to report at this time"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Avoid if you value your wellbeing and mental health", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "17 Apr 2023", "job_title": "Coordinator in Wolverhampton, England", "duration": "N/A", "pros": "Flexible working, although this is no longer that unique as a benefit. Best thing about Bromford is that I did make some good, solid friendships.", "cons": "I can see that Bromford still receives some pretty good reviews but I've noticed that these tend to be from new colleagues - it's pretty rare you'll see 5 stars from colleagues who've been in their role longer than around 3 years. This will likely be put down to longer serving colleagues 'resisting change' or suchlike. I can assure you that this is not the case for me. When I first joined Bromford I felt a real sense of pride at being part of such an amazing organisation - there was a brilliant culture, people genuinely cared about each other and about Bromford's overall purpose. I felt like I belonged to one big family with shared values and colleagues literally oozing the DNA it prides itself on. Social housing is, by its very nature, a challenging environment so it's absolutely essential that people work together as one team, collaborate, have each others' backs, receive clear direction and communication and always have the end goal in sight at all times. Sadly, this is not the case now. For the last 2 years of my employment, I found almost every single day draining and frustrating. Nobody knows who does what, there are lots of \"it's not my job\" and the poor neighbourhood coaches are constantly hung out to dry by senior management. As for the DNA - well, it seems that this is now just a pretty set of graphics to impress new starters. Many colleagues still live and breathe the DNA, some still have Bromford running through their veins, but I don't feel that this is modelled by the senior leadership team. Yes, change is absolutely necessary (and important) but the rate of change and knee jerking that goes on at Bromford is just ridiculous and unsustainable. Many of the execs have no social housing experience but that's apparently okay because that's what their directors/heads of are for. Which would be fine ... if only they actually empowered and listened to those people! Perhaps, instead of trying to aspire to be like Virgin, Amazon or some other corporate giant, the focus should be on actually getting the fundamentals right first. Customers are social housing tenants - they don't have a choice which housing association they go to, they get what they're given and all they want is a safe, warm, affordable, home. Of course, there's nothing wrong with aspiring to be the best but I think Bromord is a long way off - tasking neighbourhood coaches to run around their patches before Christmas, frantically fitting Co2 alarms into their customers' houses (because of another team's failings with compliance) does not feel like a Virgin or Amazon way to conduct business. Neither does the way the attempted cyber attack was handled. Yes, from an IT perspective it was dealt with excellently and could have been far worse - but, yet again, those on the front line were left to deal with the fallout of this, with no tools or guidance to help them navigate their way around the many difficult conversations they had to have with their customers. It's always the same - those on the lowest pay get the rawest deals. Those driving around in their Teslas would absolutely not want to have some of the difficult conversations with customers that the neighbourhood coaches are forced to have. Going out shadowing once a year and visiting one or two customers does not cut it. It took me some time to find the confidence and strength to start seriously looking for another job as, aside from everything else, I gradually became deskilled - my role was unrecognisable from the job I originally came to do and there was no consistency in the expectations of the job either. Initially, I protected myself from everything going on by concentrating on my own 'bubble' - I believed that as long as I just focused on my immediate team and ignored the bigger picture I'd manage. But even the bubble developed punctures in the end because, sadly, toxicity and negativity has a way of filtering through. I am just so grateful that fate stepped in with an amazing job opportunity and that I got out before any further damage could be done. So, my advice to anyone thinking of joining Bromford is do so at your own peril. It depends what kind of culture you want to work in, it will suit some people as everyone has different expectations. Of course, it might even turn itself around again one day in the same way it does when there's a new government. Who knows? I do hope so for the sake of those who've stayed loyal."}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "So many great aspects yet fundamental flaws", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Apr 2023", "job_title": "Neighbourhood Coach in Gloucester, England", "duration": "N/A", "pros": "The organisation has a great emphasis on wellbeing and has good intentions to get things right, yet it still seems to fail.", "cons": "Too many friends aligned at senior leadership, which is resulting in people not being accountable for their actions. Fundamental flaws in areas such as income going unaddressed."}], [{"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Toxic and bullies", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "23 Apr 2023", "job_title": "Finance in Wolverhampton, England", "duration": "N/A", "pros": "Working in the past under Chief exec Mick Kent the company was rated 5th best in the country it was a great place, Management valued and communicated with all the staff", "cons": "Now the Management treat staff as resources not humans, the toxic atmosphere is unfortunately now of fear and bullying. Staff are leaving in droves"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Review", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "3 May 2023", "job_title": "Financial Analyst in Wolverhampton, England", "duration": "N/A", "pros": "it is a nice place to work", "cons": "there has been a lot of changes which havent been implemented the best"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Only Talk the Talk", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "31 Mar 2023", "job_title": "Scheme Manager in Wolverhampton, England", "duration": "N/A", "pros": "Some lovely people, helpful and polite.", "cons": "Customer service shocking when things go wrong. Lower paid staff left to deal with poor company policies. Abandoned by upper management. No one prepared to stand up for their customers. Management want anything for an easy life"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "A wonderful Place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "12 Jul 2022", "job_title": "Anonymous Employee in Wolverhampton, England", "duration": "N/A", "pros": "The people! The people at Bromford are like no other - The company really puts their colleagues first and it shows through the people they hire. I never came across a colleague who wasn't warm and inviting and open to having conversations or helping you out and i worked for the company for over 4 years! \r\n\r\nThe flexible working policy - What it says on the tin! They really mean flexible in its true sense, Whilst working at Bromford i was able to attend my Childs school, shows, appointments and take time to spend with family without needing to book annual leave.\r\n\r\nLeadership - Whilst I cannot speak for the whole company, I worked in ICT. Their leadership is 2nd to none, knowledgeable, approachable, friendly, flexible & not afraid to get their hands dirty.\r\n\r\nThe facilities & working devices - Always top tear Bromford is not afraid to spend company keeping the facilities clean. suitable, sustainable & attractive. Same goes for the devices allocated to colleagues they are more than fit for purpose and regularly update them to ensure they are fit for purpose.", "cons": "Benefits - When I joined the benefits were unusual and above the market average. Since Covid hit more companies are offering similar benefits and Bromford will need to be open to changing whats on offer if they want to stay above the market average. \r\n\r\nSalary - Not in line with national or local averages across the board."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great team and company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Apr 2023", "job_title": "Lettings Assistant in Wolverhampton, England", "duration": "N/A", "pros": "Customer focus Team work Managers", "cons": "Work life balance CE Case load"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "INA tole", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "27 Apr 2023", "job_title": "Income Advisor in Wolverhampton, England", "duration": "N/A", "pros": "People and the diverse culture", "cons": "No opportunity to progress within company"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Changed culture", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Apr 2023", "job_title": "Team Leader in Wolverhampton, England", "duration": "N/A", "pros": "Mostly friendly colleagues who want to do a good job.", "cons": "Little to no progression opportunities."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Poor pay and poor management", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "25 Apr 2023", "job_title": "Lettings Advisor in Wolverhampton, England", "duration": "N/A", "pros": "Colleagues are great. Flexible working.", "cons": "Pay very poor compared with other organisations. Management have favourites and believe rumours. Would not recommend working here, I can't wait to leave"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Managers not trained for the job.", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "23 Feb 2023", "job_title": "Multitrade Operative in Gloucester, England", "duration": "N/A", "pros": "Good work colleagues. Coffee card.", "cons": "Management out of touch with customer and employee complaints. Customerservice to many complaints from tenants."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Bad", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Mar 2023", "job_title": "Manager in Wolverhampton, England", "duration": "N/A", "pros": "Nice recently refurbished office facility, good benefits", "cons": "This place has lost sight of its purpose. Poor leadership, pays lips service to staff but no real interest in staff or customers experiences, focus is purely on profit, big numbers, external ratings,"}], [{"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "It’s OK", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "26 Sept 2022", "job_title": "Anonymous Employee in Birmingham, England", "duration": "N/A", "pros": "Excellent colleagues and line manager, no micro management, flexibility to manage your day, varied workload. Friendly and approachable CEO.", "cons": "Out of touch upper management, lots of management speak and jargon but little real support for or understanding of colleagues, very commercialised now and lost touch with the customer base in favour of profit making, lots of pay discrepancies, very limited opportunities for progression in some roles."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "23 Feb 2023", "job_title": "Anonymous Employee in Wolverhampton, England", "duration": "N/A", "pros": "Culture Trust based flexible working", "cons": "Systems and number of objectives"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Flexible Employer", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Feb 2023", "job_title": "Head of Pre-Construction in Birmingham, England", "duration": "N/A", "pros": "Family friendly working practices and flexible working.", "cons": "Dispersed workforce making collaboration more difficult"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Positive", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 Jan 2023", "job_title": "Coach in Gloucester, England", "duration": "N/A", "pros": "Flexible, good prospects, the best colleagues", "cons": "Different parts of the business need to learn how to effectively communicate and collaborate"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Brutal Bromford", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Nov 2022", "job_title": "Income Management Officer in Gloucester, England", "duration": "N/A", "pros": "Don’t believe the hype. The ONLY good thing about Bromford are they marketing team who sell you heaven when you are gifted hell. The DNA is like a cult - they try to brainwash you into their way of thinking then emotionally break you when you don’t comply with being a yes man. They are toxic and a broken company. If you value your mental health, do not even consider a job here.", "cons": "Absolutely everything to do with this company is a con."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": "N/A", "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Neighbourhood Coach", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Dec 2022", "job_title": "Neighbourhood Coach in Mangotsfield, England", "duration": "N/A", "pros": "Manage your own diary, coffee card of £30 pm.", "cons": "Company doesn’t care about staff or customers. The NC role is abused by every department. This role is extremely mentally taxing. So much Anti-Social Behaviour which was never mentioned in the job description and interview."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 5, "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Job", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "16 Sept 2022", "job_title": "Engineer in Bristol, England", "duration": "N/A", "pros": "Worked for bromford for several years. Good benefits ie gym memberships etc , reasonable salary van and tools supplied uniform pension", "cons": "Has become a stressful place to work constant change and upheaval , members of teams off work with stress , we are encouraged to develop and progress our careers and our skill sets but are constantly overlooked when roles are available, and roles get given to people through the back door ,it’s not fair , it’s not what you can do or how good you are its who you know 🙁"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "It's all about targets and numbers", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "16 Jun 2022", "job_title": "Customer Solutions in Wolverhampton, England", "duration": "N/A", "pros": "1) Flexible working.\n2) Good team manager.", "cons": "Firstly, this company does not put value on their employees. Staff turn over is high, workloads are unmanageable and pay doesn't match the work expected. They are all about targets, so teams do not work effectively together for the customer and do what's right, they do what will ensure they hit their targets for their specific team and what is \"policy\".\n\nYou can't get anything done, because teams cannot answer a question in an email, they just come back with information completely irrelevant to what you've asked. You'll find your self chasing people everyday, to be lied to when they haven't done anything with it after weeks of chasing.\n\nTo add to this, they took my bonus away because I was leaving. Even though i worked many extra FREE hours for the company in evenings, nights and weekends and worked as hard as anyone else in the company. Disgusting attitude and what a way to treat staff, you are just a number here and they'll replace you with some other poor sod.\n\nThere is also no accountability and you end up picking up duties other teams should be doing daily, when something is overdue because other teams in the business putting no importance resolving complaints it'll come back on you. \n\nOverall the experience has left a bitter taste in my mouth in a nutshell.\n\n> Commerial, not really \"customer first mentality\"\n> No accountability for other teams not doing what is asked and agreed.\n> Unmanageable workload meaning I had to do many extra hours just to manage my day to day work.\n> No value put on employees, only 12 month contracts offered, and the \"you are just another number\" feeling to it.\n> Removal of a bonus which was announced before I left, and if i had handed in my notice 2 days after the 20/6/22 I'd have still got a bonus. Beyond ridiculous.\n> Absolutely no time for unskill and additional training without falling behind on workload.\n> Can get very clicky, and certain teams are \"busy\" but spend more times on breaks and \"having a laugh\" than offer appropriate support.\n> Customer contact not able to do the right thing for the customer because of \"targets\". Again, not customer focused at all.\n\nMy own team I can't fault, they are resilient and work hard. Deserve much better."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Torrid time working in a pressure cooker - avoid", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "3 Aug 2021", "job_title": "Call Centre Staff in Wolverhampton, England", "duration": "N/A", "pros": "Making a difference to social housing\r\nLocation", "cons": "Role description - This isn’t just a call handler role, you are a social worker dealing with high pressure situations and rude customers who will bombard the call centre with abuse. 9 times out 10 its been Bromfords fault that the customer is annoyed as majority of repairs team & management promises are not followed through - be expected to take calls from people who are on edge at a constant with no support on how to handle them except phone their housing manager (who are overworked with too big an area to cover so people get neglected - most don’t answer their phones to customers)\r\n\r\nManagement- hardly ever in the call centre and will forget to follow up customer calls requesting to speak to higher management resulting in further mayhem. \r\n\r\nInternal investigations - poorly handled\r\n\r\nSalary - poor compared too rates with other companies specialising in the same skills (CEO stated location was the issue for not giving parity with call centre down south west ways even though WV office was doing majority of their work!)"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Brilliant company with great flexibility", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 May 2022", "job_title": "Income Management Advisor in Gloucester, England", "duration": "N/A", "pros": "- Excellent flexibility - within reason you can choose your own hours, location of work etc.\r\n- Brilliant diversity and inclusion ethos throughout the business. I’ve come in as someone with a hidden disability and have been supported incredibly by both my immediate colleagues and management. \r\n-Roaming Working - I love that I can choose how to manage my diary and where to work to suit my workload and various tasks. They’ve renovated the Tewkesbury office so it is a real pleasure to go there to work and make use of the facilities. The desk and meeting room booking system is innovative and really helpful. \r\n- The company regularly looks at how they can make life better for their employees. They are always looking for feedback and despite what other reviews say, I do genuinely believe they use this feedback to shape the culture and benefits of bromford. \r\n- Personable and approachable senior leaders. They offer a scheme where you can take our a member of our  Leadership 50 team out to shadow you for a day. This is such an excellent scheme and really builds relationships throughout the business. It also shows the senior leaders the type of issues we can face day to day which means they can put things into place to help! \r\n- Great social opportunities  such as the Bromfest Event held yearly. There’s a real sense of ‘team spirit’ and I’ve met lifelong friends just in the 10 months I’ve been here. \r\n-good opportunity for progression. You are encouraged to work on projects that help with career progression and there are so many training courses available to help you learn what you need to do to progress.\r\n-fair salary plus £500 per year for health and well-being fund e.g private healthcare or gym membership etc. Good pension. We also get the Rewards portal with lots of discounts for all sorts of places. Not to mention the bonus scheme!! \r\n- Diverse and useful training opportunities. You are encouraged to take advantage of the excellent training courses and online learning available to you. This covers not only things that would help with your current role but you can also sign up to training and courses to help with career progression. One of the mandatory sessions is for new starters called ‘this is bromford’. During this session you not only get to meet other new starters, but have the opportunity to spend time with the CEO who really takes his time to get to know everyone. \r\n- Generous holiday allowance with the ability to buy more holiday or sell holiday if you wish.\r\n-Flexible team leaders who let you get the job done without interfering or trying to micro-manage. They are also incredibly supportive and regularly block book times in their diaries to be available to assist you with anything you need help with (e.g difficult visits or general training). \r\n-The transformation project - although people are always a little frightened of change, the new systems will make life so much easier. The training has been brilliant and the communication around the roll out has been good too.", "cons": "Car parking at the offices is limited which can sometimes be a struggle."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "A generous company who value their employees", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Sept 2022", "job_title": "Neighbourhood Coach in Tewkesbury, England", "duration": "N/A", "pros": "Flexible working\r\nFlexi benefits including healthcare packages and gym membership", "cons": "Lack of progression opportunities\r\nLarge company sometimes present communication getting lost"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "A Bullying culture is being encouraged", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "6 Apr 2022", "job_title": "Customer Experience Manager in Birmingham, England", "duration": "N/A", "pros": "A small army of great people doing their best, against a tide of incompetence and arrogance.\r\nFantastic customers, who deserve better", "cons": "A bullying culture being nurtured and encouraged from the top of Customer Experience, of all areas. If you have an unhappy team, this is passed on to customers. Colleague engagement at an all time low, customer advocacy crashing through the floor.\r\nPerformance has never been worse, and moral is in a dangerous state.\r\nWhat was a fantastic place to work, is now nothing more than a toxic environment, with a constant flow of resignations by experienced , valued employees."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Getting there", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "17 Sept 2022", "job_title": "Senior Manager in Tewkesbury, England", "duration": "N/A", "pros": "Great people. Real energy. Strong purpose.", "cons": "Some processes need fixing still"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Not a great place anymore", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "25 Nov 2021", "job_title": "Investment Planning Manager in Wolverhampton, England", "duration": "N/A", "pros": "Great colleagues, team spirit, customer focused and flexible working across the board, even before the pandemic", "cons": "Too reliant on external consultants, senior executives not listing and little done to address concerns raised by colleagues. Poor training for new starters due to over worked colleagues resulting in a high turnover of new starters. Managers/ leaders constantly under pressure to take on more work which impacts on all the teams. Over last 2 years a high number of very experienced long serving colleagues have left the business and although the posts are being filled there is now a large knowledge gap.\r\nToo many poorly planned restructures over a short period without allowing new processes to be embedded, along with delays in infrastructure changes to support the restructures. On the surface it looks a good place to work and was, but unfortunately there are many unhappy colleagues and it appears the situation is not improving as there is a big disconnect between colleagues and senior leaders"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "ok", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Aug 2022", "job_title": "Lettings Advisor in Lichfield, England", "duration": "N/A", "pros": "Work from home in office 2 days", "cons": "Micro managed in everyday tasks when more than capable to do it myself on my own"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Inclusive, caring, strong purpose", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Jun 2022", "job_title": "Transformation Lead in Wolverhampton, England", "duration": "N/A", "pros": "Really great team, helpful colleagues, lots of opportunity and challenge with a fabulous purpose to help more people thrive in a safe, secure warm home they can call their own.", "cons": "I haven't a negative word to say. My experience has been amazing"}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Management need to improve and look at the turnover.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "30 May 2022", "job_title": " in Wolverhampton, England", "duration": "N/A", "pros": "Flexible working arrangements. Good company ethics.", "cons": "Many senior appointments have been poor choices. The company is trying to run before it can walk. Future plans are great but the basics are not right yet. Very difficult to get a promotion from inside and managers do not like to be challenged or informed of the lack of knowledge they have of current systems."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "A great company no more", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "21 Jun 2022", "job_title": "Anonymous Employee in Birmingham, England", "duration": "N/A", "pros": "Flexible working, benefits, team members", "cons": "Now a very corporate company, cold and starting to feel like micro management.. Higher management are gradually draining away what we loved about housing. It’s now about figures not people."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Confused organisation", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "1 May 2022", "job_title": "Manager in Tewkesbury, England", "duration": "N/A", "pros": "Flexibility \r\nGood opportunities if your face fits", "cons": "Huge disconnect between senior leaders and everyone else.\r\nNo autonomy afforded to middle management.\r\nThe business pretends to be all about customers and colleagues thriving but it’s main focus is profit and building more houses."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Place & People", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "13 Jan 2022", "job_title": "Coordinator in Wolverhampton, England", "duration": "N/A", "pros": "Still a great place to work and fabulous colleagues after 15 years. There have been many changes along the way but we continue to move with the times, evolve and pull together whilst keeping the common focus on our customers.", "cons": "Loss of long service benefits on new T&C’s in particular reduced annual leave, having to book 3 a/l days at Christmas instead of 1 on legacy contract and loss of anniversary days. ☹️\r\n\r\nNeed to retain our identify as Bromford."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 4, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Reel you in with empty words then leave you fighting an unwinnable fight.", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Nov 2021", "job_title": "Income Advisor in Bristol, England", "duration": "N/A", "pros": "The team on the ground are all hardworking dedicated genuine people showing the DNA . work together and support each other.", "cons": "anyone above the operational front line leaders do not care about the staff and it shows. The higher up the more disconnected they are as they have no idea what staff do or what customers are really going through which results in no support for the staff to do their job in supporting customers. It's a shame as i love helping people but am left fighting an unwinnable fight"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "friendly and freedom", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "16 May 2022", "job_title": "Employment Coach in Wolverhampton, England", "duration": "N/A", "pros": "flexible working, trusted employees, great working environment", "cons": "no structure for the team, no pay reviews, get forgotten and left behind"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Bromford nearly broke me", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "11 Mar 2022", "job_title": "Neighbourhood Coach in Gloucester, England", "duration": "N/A", "pros": "Flexibility was the only thing that kept me there. Team mates are the best people.  They really do care.", "cons": "This is not the job it once was, or the job advertised. Management have no idea about what is happening on the ground.  Front line staff are drowning under everyone else’s work,  they barely have time to do their own.  Letting properties is soul destroying.  It feels like Bromford do not care about their customers or staff  these days.  I have been ashamed at the state of some properties I have had to let.  If I refused I was told ‘this is lettable standard’.   Older properties not taken care of at all at void stage.   New builds with corners cut and let before the site was safe.  The quality of repairs is diabolical.  Trying to get a repair done in the first place is like pulling teeth.    Much was said and shared regarding the mould issues highlighted by ITV at the detriment to other problems.  Customers seem to be allowed to speak to NC’s how ever they wish and they are never challenged by management.   I was fortunate to start on a good wage and received pay rises most years.. many others weren’t.  Very much if your face fits you’ll be ok.   NC’s worked throughout lock down,  no furlough for us!  We were used as cannon fodder during this period.  Still expected to be in peoples homes etc.   Senior managers all recently received new Teslas and we got a kitkat and some badly fitting socks.   My well-being was not taken care of of during my time with Bromford.  Only when I went off sick was management quick to be seen to care.   Lots of support whilst off sick and on my phased return,  if only that could be done prior to going off sick,  when I asked for help I was made to feel like a failure.  Bromford is not a good or healthy place to work anymore. Which is a shame,  I used to love my job prior to the merge."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Going downhill", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Feb 2022", "job_title": "Electrician in Birmingham, England", "duration": "N/A", "pros": "Decent pay, overtime opportunities and good benefits", "cons": "Really bad management! Poor communication, very “clicky” all about who you’re mates with rather than your abilities and although they still talk the talk it doesn’t seem as the they care or invest i to their employees as they did before the previous ceo left."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "The rot has set in.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "20 Jan 2022", "job_title": "Anonymous Employee in Birmingham, England", "duration": "N/A", "pros": "Very few, if any, positive features remain. Particularly for the Midlands region.", "cons": "Bromford used to be a very proud, midland based, housing developer which could understand development risk and looked after it’s customers and employees.\r\n\r\nSince the merger with Seven Vale and Merlin, Bromford has become a bloated organisation which has forgotten its past and is now little\r\nmore than another generic large scale housing association with little ambition or connection with its customers and staff. The previous Bromford ethos remains in name only. A shame."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Poor place to work (Gloucestershire)", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Mar 2022", "job_title": "Multi Skilled Operative in Gloucester, England", "duration": "N/A", "pros": "Some good benefits\r\nPay isn’t bad", "cons": "Toxic atmosphere between teams. \r\nSenior management have no clue about what really happens lower down , too busy thinking about what colour Tesla to get next.\r\nRepairs managers have no clue and are bullies. \r\nPlanners don’t seem to know how to read a map. \r\nHR incompetent, wouldn’t bother trying to contact them they don’t get back to you."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Frustrating experience", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "12 Apr 2022", "job_title": "Customer Service Advisor in Wolverhampton, England", "duration": "N/A", "pros": "Good training and collaborative work environment", "cons": "Lots of outdated systems\r\nLack of communication between departments led to massive issues at company\r\nApathy amongst staff\r\nLong standing issues with upper management"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "1 May 2022", "job_title": "Neighbourhood Coach in Gloucester, England", "duration": "N/A", "pros": "Great team , left to get on with job", "cons": "Internal communication needs improvement take ownership"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Apprentership", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Jan 2022", "job_title": "Apprentice in Lichfield, England", "duration": "N/A", "pros": "Great support, welcoming, helpful, ambitious and lots of room for development", "cons": "Joined during pandemic - hard to say as I have not been able to have the full experience"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Fabulous culture, have been made to feel very welcome as a new starter", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Dec 2021", "job_title": "Chief Risk Officer in Tewkesbury, England", "duration": "N/A", "pros": "The people\r\nThe range of benefits including final salary pension scheme, flexible choice of benefits\r\nChoice of locations to work from \r\nGood mix of office and work from home\r\nPurpose of the company", "cons": "I'm struggling to find a con. For me it is a smaller organisation than I'm used to and that was a personal challenge, though not a con - just different."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Too much", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Nov 2021", "job_title": "Neighbourhood Coach in Bristol, England", "duration": "N/A", "pros": "The team are amazing \r\nHard working \r\nGenuinely care\r\nDo their best", "cons": "Anyone higher than first line of managers us disconnected from reality. Keep pushing the work down with no resources. No clue what we do or what we're facing yet make decisions without any knowledge of the people who do the work. The DNA attracted me but only front line staff live it.\r\nBusiness grew too big too fast and trying to run before they can walk. Need to fine tune the bread and butter before you start trying to make a souflet"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Do not believe the marketing hype - avoid at all costs.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Nov 2021", "job_title": "Income Management Advisor in Gloucester, England", "duration": "N/A", "pros": "For such an awful company, Bromford has the best staff. Many have survived mergers and many years of turmoil and are simply awaiting pensions payday - the majority of new starters leave (very quickly.) The ONLY good thing about Bromford is the amazing people but they are leaving in their droves.", "cons": "I accepted a job at Bromford naively believing the sales hype. I loved the idea of the Bromford DNA, was completely sold by how I was told that employees were valued and I embraced the idea that I could really make a difference. Fast forward 14 months and I realised I had been brutally conned. I have never, ever worked for a company with such an unhappy workforce. Where people regularly leave work in tears and are being signed off with stress due to the incompetent management and pressures of the job. It is considered the norm.\nThe directors swan around in their brand new Tesla’s whilst the staff are told payrise are frozen. I was actually told by my ‘manager’ that ‘we work in social housing for the love of the job.’ Interesting then that the directors enjoy a six figure salary and fat cat bonuses so that ethos does not carry through to the top. Oh, but it’s ok, because when they do cancel your payrise……they send you a KITKAT! For a company that proclaims it values it’s carbon footprint….they posted 2000 individual boxes which contained one KITKAT to its staff. What a degrading, condescending, marketing failure. Here is a novel idea Bromford - pay your staff what they are actually worth and forget the cheap marketing gimmicks which hugely backfired.\nAnother novel concept from Bromford; manipulate the pandemic and employ intelligent and passionate individuals on a really low salary. Because you can. Then, when the pandemic eases and people start to leave (to companies who actually value them), employ some more….but pay the new staff 25% more than the current ones. Oh, and to add insult to injury, ask the existing staff to train the new staff even though they are paid more! Don’t even think about raising it in a meeting though - our manager frequently rolled her eyeballs and even said she was ‘bored’ with the complaints about salary.\nStress levels within Bromford are ridiculously high - I have worked in many companies and it is immediately apparent how unhappy everyone is. Not just in income but also Lettings, repairs, contact centre, neighbourhood coach’s etc….the list is endless. Apparently the turnover is ‘within expected parameters’ though so that’s absolutely fine then!\nBromford enjoy paying expensive consultants lots of money (they clearly don’t do it for the love of the job unlike the Bromford minions), to produce very pretty charts. These pretty charts are produced at least twice a year and the pretty charts are discussed with the Tesla driving directors. They should show how happy everyone is at work and whether it’s a ‘great place to work.’ Very often the charts aren’t pretty enough for the directors and don’t show the data they would like them to show. And so, they send out yet more carefully scripted surveys to staff (who have so much time to play colour by numbers ) and the expensively paid consultants have another go.\nFinally, the DNA. Do not be fooled - it is merely a marketing ploy to make you believe they care. They do not. Phrases such as ‘we benchmark salaries’, ‘we appreciate your feedback and will take that back’, ‘mental well-being is important’ are regularly regurgitated yet are meaningless and soulless. They do NOT want you to embrace the DNA at all. They DO want you to Be Suppressed,  Be Stressed, Be Compliant, Be Happy with Being Underpaid, Undervalued and Treated Like a Replaceable Non Entity by Management with Over Inflated Egos. But - it’s ok - because the particularly bad management won awards on their management skills!\nValue your mental health? Turn, very quickly, and run, very quickly, far far away from Bromford. If you are considering a job here, reach out to former employees and - quite simply - don’t do it."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Mar 2022", "job_title": "Finance Assistant in Wolverhampton, England", "duration": "N/A", "pros": "Very Supportive employer, has good opportunities", "cons": "No cons at the moment"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Not as good as it used to be", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "6 Feb 2022", "job_title": "Neighbourhood Coach in Birmingham, England", "duration": "N/A", "pros": "Line manager is nice and team lovely", "cons": "Rubbish pay compared to other companys"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great organisation to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Jan 2022", "job_title": "Anonymous Employee in Wolverhampton, England", "duration": "N/A", "pros": "It makes you feel at home as soon as you start", "cons": "Starting in the middle of Covid has been difficult but Bromford have done everything they can to support this"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great organisation to work for", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "30 Jan 2022", "job_title": "Talent Specialist in Wolverhampton, England", "duration": "N/A", "pros": "Great people working hard to improve the lives of others", "cons": "Parking at the Wolverhampton office was a challenge, however we were always looking for a solution."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Scheme Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "15 Feb 2022", "job_title": "Scheme Manager in Wolverhampton, England", "duration": "N/A", "pros": "Hork and home life balance", "cons": "Pay is better at other business'"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Jan 2022", "job_title": "Customer Service Advisor in Wolverhampton, England", "duration": "N/A", "pros": "Great people and management are excellent", "cons": "None so far, cant complain at all"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Micky mouse organisation", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "27 Nov 2021", "job_title": "Income Management Adviser in Gloucester, England", "duration": "N/A", "pros": "The front line staff. Neighbourhood coaches and income advisers. Hard work and great supportive team", "cons": "The business doesn't have a clue what they're doing. \r\nExec team have a goal but don't know what the workers do or face. They don't know the regs let alone follow them. Embarrassing to have been duped as the so called DNA attracted me. \r\nShame only frontvlime staff live the values"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "18 Jan 2022", "job_title": "Customer Service Advisor in Wolverhampton, England", "duration": "N/A", "pros": "The people here are great", "cons": "No cons in my opinion"}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Generally good employer - merger & transformation agenda has dominated over supporting colleagues", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "8 Jul 2021", "job_title": "Marketing in Wolverhampton, England", "duration": "N/A", "pros": "Generally, a supportive working environment although areas of siloe working still apparent - not quite 'one team' approach although the intent is there", "cons": "Has grown with merger, and systems changes and transformation have placed substantial pressure on people. Has lost some of the genuine care for individuals, as can appear as quite a monolithic corporate machine. At most senior leadership level, the culture is being talked rather than walked - can feel there is a mismatch between what's said and what's done."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great Values", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "22 Nov 2021", "job_title": "Neighbourhood Coach in Gloucester, England", "duration": "N/A", "pros": "Good benefits and great colleagues.", "cons": "Not a lot of scope for promotion."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Serious moral problems", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Dec 2021", "job_title": "Business Partner in Bristol, England", "duration": "N/A", "pros": "Lots of decent colleagues otherwise little to say.", "cons": "Low morale\r\nLeadership gas nose dived\r\nLack of appreciation for staff\r\nPay\r\nSlowly offering worse and worse terms"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Oct 2021", "job_title": "People Services Assistant in Wolverhampton, England", "duration": "N/A", "pros": "Great Work life balance at Bromford", "cons": "No cons that i can think of"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Sept 2021", "job_title": "Anonymous Employee in Wolverhampton, England", "duration": "N/A", "pros": "Great people, who are very passionate about what they do", "cons": "Lots of competing priorities, hard to deliver everything against"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "4 Sept 2021", "job_title": "Anonymous Employee in Birmingham, England", "duration": "N/A", "pros": "Great organisational culture, flexible working arrangements and good pension scheme", "cons": "None that I can think of from my experience"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Poor management and low salary", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Dec 2021", "job_title": "Income Management Advisor in Chipping Sodbury, England", "duration": "N/A", "pros": "Flexible working\r\nGreat team and employees", "cons": "Poor management \r\nPoor pay\r\nNo pay rise"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Fantastic Place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Aug 2021", "job_title": "Analyst in Wolverhampton, England", "duration": "N/A", "pros": "Team work Flexible working hours my Leader trust me Valued!", "cons": "Constant Change Communication Top level arent always honest with us"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Place To Work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "11 Nov 2020", "job_title": "Income Management Officer in Wolverhampton, England", "duration": "N/A", "pros": "Excellent Benefits (Holidays, Flexible Benefit Scheme, Pension)\r\nFlexible Working - In March, when the Government put the country into lockdown, Bromford and their IT department pretty much managed to get all office based colleagues working from home within 48 hours - quite some achievement\r\nAttention to Colleague Wellbeing (in particular during the recent lockdown)", "cons": "Communication was a bit hit and miss previously under the previous executive team, but this is being improved on in leaps and bounds with regular weekly updates from Robert Nettleton, CEO, and the executive team, and regular all Company Team meetings giving opportunity to answer colleagues questions live, and meetings with the Board and frontline colleagues"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Housing officer", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Oct 2021", "job_title": "Neighbourhood Coach in Gloucester, England", "duration": "N/A", "pros": "Not every day is the same", "cons": "Pay is not reflecting responsibility"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place even better team", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Jun 2021", "job_title": "Customer Service Advisor in Wolverhampton, England", "duration": "N/A", "pros": "Caring Team and extremely supportive- career progression and support is constantly offered", "cons": "Don’t change anything it’s great"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Best company I have worked for", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Nov 2020", "job_title": "HR-Operations Manager in Wolverhampton, England", "duration": "N/A", "pros": "Hugely supportive team with a great can do attitude to everything and everyone welcoming and friendly.\r\nHad a great induction and lots of help and support from my line manager.\r\nFantastic wellbeing initiatives", "cons": "Some processes over complicated and could be simplified, I know this is an area that is being improved."}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Bromford is changing", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "10 Apr 2021", "job_title": "Letting Advisor in Wolverhampton, England", "duration": "N/A", "pros": "Flexible\r\nCaring people \r\nStrong customer focused", "cons": "Merlin takeover \r\nSenior leaders not trustworthy \r\nTurning into a commercial business not social housing"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A breath of fresh air", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Nov 2020", "job_title": "Neighbourhood Coach in Gloucester, England", "duration": "N/A", "pros": "From my interview and throughout my time with Bromford, I have felt valued and part of an exciting time for the organisation despite the circumstances surrounding Covid. The direction is clear and Bromford invest in their staff which gives great career progression opportunities.", "cons": "None to report as I have not had a negative experience."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great Place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Apr 2021", "job_title": "Neighbourhood Coach in Banbury, England", "duration": "N/A", "pros": "Very supportive and growing organisation", "cons": "Expansion into different areas outside of main offices"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Absolutley love it !!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Feb 2021", "job_title": "Feedback Analyst in Wolverhampton, England", "duration": "N/A", "pros": "Its an amazing company, where everyone has been friendly to me and really appreciated my work.", "cons": "Glass door wont let me put nothing so here is a pointless sentence to read :)"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Clear communication and great colleagues", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Nov 2020", "job_title": "Anonymous Employee in Wolverhampton, England", "duration": "N/A", "pros": "Great leadership, clear and open communication through the business. Clear strategic goals. Colleague are passionate about working towards the same goals and understand our customers. Fabulous colleagues. - there is always a smiling face and warm hello! Work life balance is real!", "cons": "Parking sometimes challenging (pre covid), not sure if they will be a problem again however always found somewhere."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great employer", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "22 Feb 2021", "job_title": "Neighbourhood Coach in Gloucester, England", "duration": "N/A", "pros": "Flexible trust based working system in place which suits me", "cons": "There are no cons for working at Bromford"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "A solid company, aided by a caring team.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Jan 2021", "job_title": "Weekend Receptionist in Aylesbury, England", "duration": "N/A", "pros": "A very supportive team who consistently assists each other to provide a collective service.", "cons": "Some demanding, occassionally confrontational situations between customers and colleagues."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Bromford is a great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Feb 2021", "job_title": "Neighbourhood Coach in Wolverhampton, England", "duration": "N/A", "pros": "Pension, rewards, support and great colleagues", "cons": "I have no major cons to contribute."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Bromford have changed their ways, and are not living up to their kind, caring reputation", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "22 Dec 2020", "job_title": "Anonymous in Wolverhampton, England", "duration": "N/A", "pros": "Great Benefits.\r\nColleagues work hard and go above and beyond.\r\nFlexible working.", "cons": "Poor Leadership \r\nInconsistent communication \r\nMorale is very low\r\nTrust has been lost\r\nRestructures have resulted in some great colleagues leaving the business.\r\nBromford prides itself on helping customers to thrive, though ignores colleague wellbeing, adds undue pressure and gives little support."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Depressing", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "28 Apr 2021", "job_title": "Telehandler Driver in Wolverhampton, England", "duration": "N/A", "pros": "I suppose the security of a job", "cons": "Lazy management zero progression and zero accountability"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Bromford", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Feb 2021", "job_title": "Housing Support Worker in Telford, England", "duration": "N/A", "pros": "Good team work, in localities", "cons": "Management higher up need to listen to their employees"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Low pay", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Jan 2021", "job_title": "Neighbourhood Coach in Wolverhampton, England", "duration": "N/A", "pros": "Flexible working, management will listen if you want to talk but cannot make changes", "cons": "Job is forever changing and added pressure"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Good place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "10 Feb 2021", "job_title": "Planner in Wolverhampton, England", "duration": "N/A", "pros": "Flexible working, Friendly colleagues, good benefits", "cons": "Large workload, pay isn't standardised"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "19 Jan 2021", "job_title": "Head of IT in Wolverhampton, England", "duration": "N/A", "pros": "Culture, people, vision, purpose and sense of achievement", "cons": "More focus on key delivery"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Bromnford DNA", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Nov 2020", "job_title": "Associate Director of Procurement in Rugeley, England", "duration": "N/A", "pros": "Great stable company, with a great DNA that will develop you as an individual and support you through your career.", "cons": "Huge opportunity to develop processes, however making change in public sector environment difficult."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "great company", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Jan 2021", "job_title": "House Cleaner in Wolverhampton, England", "duration": "N/A", "pros": "flexible working, good benefits, opportunities", "cons": "senior management are not help accoutable"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Nov 2020", "job_title": "Housing Enabler in Bromsgrove, England", "duration": "N/A", "pros": "Great work life balance\r\nTrust based flexible working from day 1\r\nGenuine focus on staff wellbeing and mental health", "cons": "Lots of change happening at the moment\r\nDecisions about contracts are sometimes left until the last minute"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "9 Years", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Dec 2020", "job_title": "Finance Analyst in Wolverhampton, England", "duration": "N/A", "pros": "Great team on the Finance floor", "cons": "No longer the family feel it used to have, after the merger of three companies into one"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Nearly my 15 year anniversary", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "11 Jan 2018", "job_title": "Colleague Coach in South Wingfield, England", "duration": "N/A", "pros": "Trust and belief in both customers and colleagues. \nSolution focused \nGrow your own culture \nTrust to get the job done without micromanagement \nFlexible \nInspiring CEO\nA fabulous bunch of people to work with \nSupportive but they challenge you to progress. \nFun!!", "cons": "Sometimes the speed of change is hard to keep up with, but you get used to that:)  Bromford is all about innovation which has to be a good thing,"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "The best", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Nov 2020", "job_title": "Customer Service Advisor in Wolverhampton, England", "duration": "N/A", "pros": "The team \r\nThe training \r\nThe support especially during the pandemic \r\nThe career opportunities \r\nThe company as a whole", "cons": "Honestly I can’t think of one !"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Fell asleep in heaven. Woke up in hell.", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Nov 2020", "job_title": "Team Leader in Tamworth, England", "duration": "N/A", "pros": "None, do not apply to work here", "cons": "Overworked staff. Fear of redundancy. New ‘Chief of People’ is a bully. Do not apply to work here."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "5 years...always changing...always fun!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "7 Jun 2018", "job_title": "Anonymous Employee in Wolverhampton, England", "duration": "N/A", "pros": "- Always trying to be as pro-active as possible and stay ahead of the game.\r\n- Not scared of change.\r\n- Management trust you...to make decisions, to challenge the 'norm', to work flexibly, to manage your own work load...they simply just trust you!\r\n- They back your career development; ensuring you go on relevant courses and allowing you to progress and develop in a variety of roles at the company. \r\n- Great benefits - great pension offerings, holiday entitlement, flexible benefits etc.\r\n- The people!  Colleagues at Bromford are fantastic; always happy to help, insightful, friendly, caring, funny and they all love the company and work very hard to ensure its success.\r\n- Bromford's morals and social purpose - We are all about unlocking our customer's potential and helping them be the best they can; a home is just a springboard; we help them with so much more.", "cons": "The only one is that sometimes people are so passionate about Bromford and wanting to see it succeed that the lines between work:life balance can become a little blurred!  This is all through the Colleague's own choice though as they are so keen to achieve the very best results for our customers."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Two years down,  many more to go.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Mar 2018", "job_title": "Team Leader in Wolverhampton, England", "duration": "N/A", "pros": "Happy to say that Bromford's approach to it's customers is mirrored with colleagues, we all want the best for each other and that's reflected in relationships that are built on a daily basis.   The phrase Bromford family may sound unusual to those outside of the organisation  but considering how much Bromford is growing it's amazing what a close knit group of colleagues we have and that're all working together to try and help our customers be the best they can be.", "cons": "There are changes that are required within Bromford, from the ground up, but the desire to change and improve is evident.  We all want to offer an outstanding service to our customers but, at times, this is impaired by our infrastructure. The good news is that we're investing very heavily and there will be some big changes over the next few years which will dramatically improve this."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "15 years and still loving working for Bromford", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "3 Jul 2019", "job_title": "Neighbourhood Coach in Wolverhampton, England", "duration": "N/A", "pros": "The people are fantastic, I have really good working relationships with my managers, colleagues and customers.  The flexibility to manage my day to best suit both myself and customers is brilliant.  I have ownership of my role and take pride in the work I do that benefits the properties, communities and customers in my patch.  The training provided is excellent and the colleague benefits are good.  It is a busy, stimulating and challenging role which I love.", "cons": "It is important to be able to adapt to change, as an evolving company there are regular changes which do have an impact on how I do my job.  It can be stressful at times being on the front line with customers, but colleague and managers are supportive, however is does help to have a resilient character."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Bromford taking the lead on health and wellbeing", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Jul 2019", "job_title": "OD Coach in Tewkesbury, England", "duration": "N/A", "pros": "Since becoming part of the organisation I have been really impressed with the level of support I have received during a period of change. Bromford have been transparent, go to great lengths to consult people through a range of channels and keep us all fully informed with what's going on in the wider business. I feel fully engaged with my team, line manager and the wider organisation.\r\nI've also been lucky enough to be invested in to become a Mental Health First Aider (along with roughly 70 other colleagues) which gives me the opportunity to support colleagues in crisis, or intervene proactively to prevent a crisis from ever occurring. For me this is a sure sign that I'm with the right employer, a place who cares for its people, invests in our health and wellbeing along with a fantastic programme of colleague development.", "cons": "Parking can be a bit frustrating at times, but we do have a creative system in place to tackle this."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Its not perfect but...", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "7 Dec 2017", "job_title": "Manager in Wolverhampton, England", "duration": "N/A", "pros": "I've worked at Bromford for just over 15 years in a number of roles at various levels of responsibility. How you are treated and the reality of achieving a work life balance is very dependant on which team you are in and the leader with over all responsibility. It would be naïve to believe that everyone has the same experience. Personally though, I have always had great leaders and the ability to flex my diary to achieve a healthy balance and mean I can do what I need to at home. Colleagues are overall friendly and willing to help each other - I haven't yet found anyone not willing to help if I need them to.", "cons": "Not everyone gets the same opportunities and its very clear that their are internal politics at play - which don't appear to be managed despite them being well documented and discussed"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "I love working for Bromford but recently have had a few sticky moments but Bromford has been great and got me through.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "6 Jul 2019", "job_title": "Mobile ICT Support Analyst in Cirencester, England", "duration": "N/A", "pros": "Having worked for Bromford for over 15 years I have had the opportunities to grow so much. I started as a CSA and the ethos to promote from within has allowed me to be where I am now. The flexible working has allowed me to be able to have a great work/life balance and the relationships of trust across the business is something that is growing even more with the new CEO.\nBeing at work is not a chore, even with the added pressure of Transformation, it is busy but having the support of (good) leaders is great.", "cons": "As mentioned we are on a Transformation programme just now , it is busy.  A lot of change happening but with the correct attitude Bromford is still a Great Place To Work (GPTW)"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Celebrating my 15 years at Bromford", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "19 Dec 2016", "job_title": "Neighbourhood Coach in Cirencester, England", "duration": "N/A", "pros": "Bromford have really invested in me as a person, I started as Fosseway's first ever Customer Service Operator, and have moved through the organisation to Housing Service Adviser, A generic Housing Officer to the Housing Manager, soon to be Neighbourhood Coach, they helped me gain my HNC in Housing. However tough my day might be I always go home knowing I have made a difference.  I have previously worked in Catering, Finance, Factory work and this has been by far the most rewarding and challenging.", "cons": "Bromford has great ideas but sometimes it is hard to keep up with all the changes."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Awful employer in my opinion!", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "8 Sept 2016", "job_title": "Home Income Advisor in Lichfield, England", "duration": "N/A", "pros": "There are some great opportunities if you love to live your whole life based around this company. Basically if you are a brown nose robot then go ahead you will fit in great.", "cons": "I was a Home Income Advisor and did not enjoy being part of evicting vunerable people from their homes. My manager told me I was not HARD enough on the Tennants, and when I said to her that just isn't how I am with people she said I needed to change!!......Surprisingly I only lasted 6 months despite my performance figures being excellent and I was told I didn't have the  Bromford DNA.....lol. I didn't really care!!\nThey are supposed to be a non profit organisation  but they charge any tiny bit of damage to the Tennant and do not fix problems without a fight. The Customer Service team are rude and very off hand with the Tennants and staff."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Locality Coordinator", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Feb 2017", "job_title": "Locality Coordinator in Lichfield, England", "duration": "N/A", "pros": "So far, I'm finding Bromford to be a fabulous place to work - the induction and training process is second to none, there are lots of online learning opportunities too. There is absolutely no excuse to 'not know what you're doing', it's all there to access. The people here are very kind, supportive and welcoming, I actually haven't felt new since the day I started.", "cons": "None that I can think of yet! I know that Bromford isn't for everyone, it's quite a unique place to work. Also, different teams will have different experiences but I'm very happy from where I'm sitting."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Wouldn't want to work anywhere else!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "19 Jul 2020", "job_title": "Neighbourhood Coach in Dudley, England", "duration": "N/A", "pros": "The company cares about their customer and colleagues. This has been proven this year by the way the company has prioritised the well being of all colleagues. We have received thank you cards for all our hard work through the pandemic and little treat boxes arriving through the door totally unexpected for all colleagues.Our CEO has kept in touch with all colleagues throughout the pandemic. Bromford provide flexible benefits packages, \r\n a generous holiday allowance and are keen to offer lots of training to help you . In my role I have flexible working too.Just wanted to share this with you if you are looking for employment. Don't miss out on working for a great company that cares.", "cons": "No negatives on the company"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "What makes Bromford a great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Jan 2017", "job_title": "Lettings Advisor in Wolverhampton, England", "duration": "N/A", "pros": "The People! Everybody is so welcoming and happy to help. Ive just completed my probation period, and the help and training I had along the process was amazing! After never working in 'Housing' before, I was a complete newbie. But I now feel confident in our process in the lettings team. I keep going on about the people, but it really is the people that make Bromford a great place to work. The Benefits are also the best from previous business's that I have worked for! Also Bromford like to encourage you to better yourself and offer great opportunities for progression and qualifications!", "cons": "I honestly cant think of any Cons at all. Apart from if you like working in a regimental office environment, this is not the place for you! It is so relaxed here! (within reason of course)"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Project Manager", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 Mar 2017", "job_title": "Project Manager in Solihull, England", "duration": "N/A", "pros": "I had time allowed to focus on quality of our newbuild housing product. This was a welcomed change and rare in the development industry. My work in particular was varied and I learnt a great deal from my short time at Bromford. Depending on circumstances, I would return to work for Bromford.", "cons": "Pay scales, although reviewed recently, are not comparable to industry rates. New pay scales are welcomed and are better in some cases than competitors. Annual bonus is not performance linked and not comparable with industry rates.\r\n\r\nAlthough the tablets/laptops provided are useful, other brands seem to be better suited."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Just the best Colleagues and Friends", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "9 Oct 2019", "job_title": "Anonymous Employee in Wolverhampton, England", "duration": "N/A", "pros": "I have just received my 15 year Bromday… I received a lovely book full of memories over the past years…. I can honestly say that one of the things that have kept me striving to achieve my best are the colleagues I work with.  I have worked and are still working with some great people and it’s the people that I work with that makes the difference every day.  They pick me up when I’m down, offer support when needed and laugh when we can.  This is what get the work done and makes Bromford a fun place to work.", "cons": "Losing some long standing colleagues "}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Potential", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 May 2020", "job_title": "Lettings Advisor in Wolverhampton, England", "duration": "N/A", "pros": "The best reason to work at bromford is that the company is very flexible, the majority of colleagues are very nice and will go out their way to help you. The leaders are generally very nice and transparent.", "cons": "The company doesnt not pay to sector standard. Nearly all companies within the west midlands pay more than bromford for the same job. I have seen lots of experienced colleagues leave in the last few years because of this."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Organisation with confidence plus direction", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Mar 2017", "job_title": "Multiskilled Engineer in Andoversford, England", "duration": "N/A", "pros": "I'm a new starter in Bromford working as a repairs team member, and have 3 years previous experience working in occupied property within social housing. So far I'm refreshingly being met with a good deal of enthusiasm from colleagues who have varying degrees of time behind them here. It's clear from the induction that Bromford is working for the long term social good of its customers and is proactive in addressing issues to be expected as an organisation grows. All good so far!", "cons": "Nothing that I understand is already being addressed. I look forward to putting my own small stamp on the work I carry out in the areas I find myself working in."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Successful completion of probation period", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Jun 2017", "job_title": "Neighbourhood Coach in Lichfield, England", "duration": "N/A", "pros": "Forward thinking, people focussed business.  Genuinely care about customers and colleagues.  Huge investment in terms of colleague training, support and provision of information both in person and in BeBromford - covering both interpersonal and technical skill and knowledge.  Bigger Picture and The Bash - wonderful!!  All management, including Senior Management very accessible.", "cons": "Would benefit from more streamlined processes - particularly with regard to scheme management/issues and repairs. Recently spent several hours in resolving an urgent problem with bin chute blockages.  Establishing ownership of contract and time involved in organising contractor attendance resulted in extended customer/resident dissatisfaction.  Looking forward to Bromford 2.0 - as hopefully this will provide the facility of finding the right information at the right time."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "JUst passed Probation!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Aug 2018", "job_title": "Locality Manager in Birmingham, England", "duration": "N/A", "pros": "Great place to work,\n\n1. Great flexibility on the hours we work , with balance between work and home\n2. Senior Leaders really listen to colleagues which is great\n3. Lots of colleagues have been with Bromford for many years as it has grown in size and success, this really struck me as a great measure of how an organisation looks after colleagues, plenty of people I have met in my first 6 months have progressed within Bromford, I haven't seen this done so well in other organizations and is great to see here at Bromford.", "cons": "I truly don't have any! :)"}], [{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Reflects what i do", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "5 Apr 2018", "job_title": "Anonymous Employee in Solihull, England", "duration": "N/A", "pros": "Bromford are very flexible and keen to promote a good work/home life balance.  Without the flexibility I have had over the 10 years, working full time would have been very tricky.  I have been fortunate enough to have excellent line managers how have been very open and happy to have honest conversations, even though sometimes they may have been difficult.\r\nBromford offers plenty of opportunity if you want it and equally if you like what you do there is no pressure to change or move.", "cons": "All companies have their niggles, however I don't feel I have anything particularly negative to say, my experience has been positive. My only gripe would be salaries are not amazing but the flexiblity does often outway the monetary value."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Bromford employee", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Oct 2018", "job_title": "Neighbourhood Coach in Cirencester, England", "duration": "N/A", "pros": "Staff are great, everyone made me feel part of the team on my first.  I was quite shocked and taken back with a welcome card and a nice balloon on my desk, lovely way to start a new job.  Also the flexibility around working hours which is great.", "cons": "None I can think of."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Never a dull moment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 Jun 2019", "job_title": "Neighbourhood Coach in Stoke-on-Trent, England", "duration": "N/A", "pros": "Two and a half years in post and still feels new.\nEvery day is a new challenge to overcome safe in the knowledge that you have the support of a great team and inspirational leaders .\nI have received more training opportunities in 2.5 years than in 15 years with my previous employer .\nOpportunities  to engage in training  important areas that will benefit your colleagues ,your customers and your self .\nRecently had the opportunity to take part in comprehensive training to become a Mental health Ambassador which I am very proud of .\nWorking for a leadership team that value work life balance and operates from a position of trust is invaluable.", "cons": "Lone working has its challenges"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to workl", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "27 Sept 2016", "job_title": "Anonymous Employee in Wolverhampton, England", "duration": "N/A", "pros": "The people and the respect for others is second to none, we have a really good package available to us and there is progression if that's what you're looking for.  Colleagues really look out for each other and we are encouraged to think for ourselves, be innovative and say when we think things are wrong.", "cons": "Like many organisations facing a changing world,  car parking and technology are the biggest challenges  for us but we are constantly looking at ways to improve this experience for our colleagues to ensure they see Bromford as a great place to work."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "My experience with Bromford", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Dec 2016", "job_title": "Feedback Advisor in Wolverhampton, England", "duration": "N/A", "pros": "Working at Bromford has been such a great experience for me. The wages are more than fair, the people are helpful, friendly, and personable, and the management is so well put together. Everyone really is on a level playing field here, especially considering there is no segregation, for example, no offices. Management, or leaders, sit within their teams, get involved and take interest in the colleague's work and lives, but not to the point of micro management, it's a nice balance.", "cons": "I cannot think of any cons, albeit I have not been here a huge amount of time."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Neighbourhood Coach", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "31 Mar 2018", "job_title": "Neighbourhood Coach in Cirencester, England", "duration": "N/A", "pros": "Wow, where to start! Very friendly colleagues. 1st day welcome with a lovely balloon and 'new job' card signed by everyone. The training has been fantastic, there's a lot to learn. EVERYONE is so very helpful. Fantastic employees rewards package. Work/life balance is amazing, still something I need to get used to!  3 weeks in, a very positive experience so far :)", "cons": "If I had to pick a negative, it would have to be the travelling to various locations around Birmingham/Wolverhampton  and Lichfield for training. BUT, this isn't every week, and will only be for a short while during probation. Also, training starts at 10am, this takes the pressure off of worrying about traffic delays."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "incompetent, uninterested, mismanaged, aggressive & blinkered by their DNA", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Sept 2016", "job_title": "Electrician in Andoversford, England", "duration": "N/A", "pros": "None. This is a terrible company. They fail their customers on a daily basis, and mistreat their staff. Morale is rock bottom thoroughout the company. The management has been sucked up the company through acquisitions, so illiterate and incompetent people find themselves in charge of large teams and are totally out of their depth. This is done by design as they are to simple to question flawed management decisions at higher levels.", "cons": "Victorian management ethos, without the Victorian education. Consistently under perform to such an extent I would park a company vehicle away from my home in case annoyed tenants do something stupid and personal. Middle management are in a world of their own. They don't listen even though they say they are keen to take on new ideas."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Neighbourhood Coach role", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "3 May 2019", "job_title": "Neighbourhood Coach in Redditch, England", "duration": "N/A", "pros": "I totally agree with everything that Bromford represents and thoroughly enjoy putting the role standards into practice. There is a fantastic level of respect from and trust from managers with mobile working and managing your own workload but this gives me such a sense of pride that I am solely responsible for improving my patch and helping individuals from all walks of life flourish.\n\nThere are fantastic benefits on offer as well as a competitive salary and you do feel really valued as a team member here.", "cons": "The only down side to the role is that it can be quite isolating so its always important to meet regularly with team members"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Fantastic Place To Work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Apr 2018", "job_title": "Anonymous Employee in Wolverhampton, England", "duration": "N/A", "pros": "I'm 6 months in and can honestly say that moving to Bromford was one of my best decisions. The companies goals and outlook are great and the DNA is lived by everyone from Senior Leaders down throughout the entire company.\r\n\r\nEveryone is open and friendly, and my immediate team have been incredibly welcoming and a huge support over the last few months.\r\n\r\nI enjoy the work and interacting with my colleagues and most of all am loving my work life balance now. I'm looking forward to what the next 6 months and beyond will bring at Bromford.", "cons": "There are none that I can think of."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A positive beginning.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Feb 2018", "job_title": "Support Worker in Telford, England", "duration": "N/A", "pros": "I think Bromford is an outstanding company to work for. They care for both their staff and customers. We are one big team and everyone I have met since starting in October, upholds Bromfords Ethos and values to the best of their ability. Bromford provides a springboard to people to better their lives and contribute to society by providing safe, and suitable homes. Not only that but Bromford  offer supported housing schemes and neighbourhood coaches to give assistance to those requiring varying degrees of  help and assistance.", "cons": "There is nothing negative I can say about Bromford."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Overall a great place to work.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Sept 2018", "job_title": "Anonymous Employee in Wolverhampton, England", "duration": "N/A", "pros": "Positive working environment, ever changing & interesting. Great technology available and the company aren't afraid to invest money where needed to improve. Hands on management in many teams who get involved with the people on the ground day to day and who are open to hearing suggestions.", "cons": "To ridged pay scales. Don't consider individuals work loads, work ethics or ability its more around this the pay scale for that job. - I think this causes good people to consider leaving for salary progression where they otherwise wouldn't."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "5 Dec 2017", "job_title": "Business Manager in Wolverhampton, England", "duration": "N/A", "pros": "I have worked at Bromford for 25 years and have loved working with people who care and have an ethos of doing the right thing.  Having brought up my family during that time it has also been an amazing plus to work for an organsiation that has a healthy attitude to the work/life balance!", "cons": "There are none but don't expect a quiet life at Bromford, we all care about what we do and that means working hard and going the extra mile!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Fantastic company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Dec 2017", "job_title": "Neighbourhood Coach in Stratford-upon-Avon, England", "duration": "N/A", "pros": "I have been working at Bromford as a neighbourhood coach for nearly 6 months now and have to say I thoroughly enjoy my job. The training and support I have received from day one has been excellent, do you have flexibility to plan your day and there is always someone on hand to help and advise you. The job is varied and the company is forward thinking. I look forward to having a long standing career with Bromford!", "cons": "None so far  I can think of"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Neighbourhood Coach", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Jul 2019", "job_title": "Neighbourhood Coach in Cirencester, England", "duration": "N/A", "pros": "The is flexibility in the hours you work as this is not a 9-5 post and this can work with family life . I have found the team supportive and friendly and enjoy meeting customers to build up relationships so as Bromford we can coach our customers with new aspirations and not just be he knock on the door when rent is not paid.", "cons": "There are times that you may not see team members for a while as you are lone working on patch. Make time to connect."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Neighbourhood Coach", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "9 Apr 2019", "job_title": "Neighbourhood Coach in Tamworth, England", "duration": "N/A", "pros": "The people, your colleagues.. Support each other..", "cons": "I Think personally that the job I do is not reflected in my wages and for me as a single person, once bills have been paid I'm not left with much at all and have to rely on credit cards and overdraft. This is difficult but I do the job I do because I love it."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Electrical Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "13 Jun 2018", "job_title": "Electrical Manager in Burntwood, England", "duration": "N/A", "pros": "Been working at Bromford over 5 years, fast pace and focused company, started as an Electrical Engineer and have progressed... this is a great example of our 'Grow your Own'.\r\nCompany overall has a great structure and vison towards Customer and employee wellbeing... \r\nIn Brief, wish I had joined the company years ago!", "cons": "...eerrrr.....none, honestly a great company to work for."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "SALES ROLE", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "31 Jan 2019", "job_title": "Sales Representative in Lichfield, England", "duration": "N/A", "pros": "Secure rewarding role where I genuinely feel I am trusted to work without micro management being necessary.", "cons": "Distinct lack of some colleagues taking responsibility in their roles. Appears to be a buck passing environment and I,m not convinced the No Blame ethos is not meaning the same as I take no responsibility"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Scope to grow and improve yourself.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "31 Mar 2015", "job_title": "Project Worker in Stroud, England", "duration": "N/A", "pros": "Plenty of training. Can complete ocn level 2 in support. You have scope to explore your own ideas for the scheme.", "cons": "Pay is embarrassing. Management is even more embarrassing. Don't expect to be appreciated for your work or receive any praise or reward. I missed 2 pay rises because management never informed me that I needed to attend refresher training."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Fantastic socially focused organisation.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "27 Feb 2018", "job_title": "Head of Locality in Daventry, England", "duration": "N/A", "pros": "- Great leadership and strategy.\r\n- Organisation based on trust - colleagues capacity built to go and do the right thing not the rule thing!\r\n- Excellent onboarding process.\r\n- A top Housing Association that hasn't lost its core social purpose. Bromford are about people as assets (colleagues and customers) and our homes are a springboard.\r\n- Excellent work/life balance, taking into account agile working and flexibility around customer needs.", "cons": "There are no cons, other than limited parking at our Wolverhampton office! ;-)"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "5 great years at Bromford", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "14 Dec 2018", "job_title": "Anonymous Employee in Wolverhampton, England", "duration": "N/A", "pros": "The people - it's the greatest bunch of people to work with\nFlexibility - Bromford supports a flexible working style which really helps with a work/life balance\nOpportunities - Bromford is always growing and changing which creates amazing opportunities for colleagues to learn new skills and progress", "cons": "We have lots of changes on the horizon at Bromford which can bring challenges, but we have the right people leading and it's all for the right reasons."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Feb 2019", "job_title": "Colleague Coach in Gloucester, England", "duration": "N/A", "pros": "People are genuinely lovely, made to feel very welcome and have plenty of support through induction and into the role.  Bromford has a culture of trust, which enables flexible working and ensures people have a great work life balance, whilst working smart.  Bromford welcome constructive challenge and new ideas.\nWhat really sold me on Bromford was the people and culture, I am really proud to work here.", "cons": "None that I can think of at present."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "A disappointing employer", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Aug 2017", "job_title": "Anonymous Employee in Wolverhampton, England", "duration": "N/A", "pros": "Some great work colleagues, who make you feel welcome, and are keen to make a difference for Bromford's tenants and residents", "cons": "Far too many occasions where job appointments and promotions are based on who you know or are related to, rather than on merit"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Multitrade engineer, gloucestershire", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "28 May 2018", "job_title": "Multitrade in Gloucester, England", "duration": "N/A", "pros": "Good team member communication, variety of work, always someone to help you.", "cons": "Ooh call out  is to many in a week for the pay, spend more time driving between jobs than time spent working each day. Planners in Wolverhampton cannot plan your working day in Gloucestershire."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "What a brilliant 5 years!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "7 Apr 2020", "job_title": "Property Surveyor in Wolverhampton, England", "duration": "N/A", "pros": "Great colleagues to work with and so helpful when assistance or support is required. Each day is a different day which consists of office work, working from home and site inspections with some challenges however enjoyable at the same time.", "cons": "Sometimes the lack of car parking spaces can be an issue although we do have the benefit of working from home which is a bonus."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Leading by innovative example!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 May 2017", "job_title": "Anonymous Employee in Birmingham, England", "duration": "N/A", "pros": "Absolutely everything. \r\nColleagues with positive attitudes,  development opportunities, flexible working approach,  great systems and the right tools to do the job all in a supportive environment.  Most importantly the refreshing approach to quality customer service that is reflected in the positive outcomes for communities.", "cons": "Doing a great  job lets keep evolving.  No experience of cons except that system connections can let you down sometimes."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "My experience working at Bromford", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "19 Jun 2020", "job_title": "Financial Analyst in Wolverhampton, England", "duration": "N/A", "pros": "Colleagues are always so helpful and supportive, the option of working from home is always available, you are trusted to complete your own work within the deadlines, Bromford supported me 100% in achieving my AAT Level 2 qualification, there is a lot of focus on colleague satisfaction, a good home/work life balance is always promoted by leaders", "cons": "None that have stuck in my mind"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Refreshing Change!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Jun 2019", "job_title": "Neighbourhood Coach in Chipping Sodbury, England", "duration": "N/A", "pros": "Bromford really have a clear understanding of what they want to look like as a company, and putting people first is really important.  It's refreshing to work for a business that say their going to invest in people and do.", "cons": "As with all businesses going through change  it can feel like things are all up in the air.   Though things are changing for the better, it can sometimes feel hectic."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Opportunity if you roll your sleeves up", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "19 Jan 2017", "job_title": "Data Analyst in Wolverhampton, England", "duration": "N/A", "pros": "Effort is rewarded, A real family (including disagreements, love and human connection), good coffee, Infinite cake.", "cons": "Sometimes it can be hard for opportunities to catch up to you, but hard work, dedication, effort, energy and living the Bromford DNA does give you opportunities to grow."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good experience", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "24 Oct 2015", "job_title": "PA to the Head of Neighbourhood in Cirencester, England", "duration": "N/A", "pros": "Their ethos & management are very good compared to other companies I've worked for. Honest, passionate & always trying to do their best. Fantastic induction process & annual group meeting!", "cons": "Naturally there's a management/worker divide especially with the repair teams but that could be solved with pay rises & some more repair/office integration."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Not what it seemed", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "13 Jan 2020", "job_title": "Neighbourhood Coach in Solihull, England", "duration": "N/A", "pros": "Links with other projects , and company perks", "cons": "5 stage interview process\r\nJob not as described, in reality an housing office job \r\nAt the time very low ethnic minorities candidate \r\nStaff had no culture understanding \r\nLarge amount of travelling \r\nFace don't fit they get rid of you in probation \r\nRoles where redesign with lower salary at a later date"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "15 years service - wouldnt want to be anywhere else", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "6 Dec 2018", "job_title": "Retirement Living Manager in Wolverhampton, England", "duration": "N/A", "pros": "Love that I work for a company who actually care for there customers and colleagues.  Colleague wellbeing is a priority for Bromford.", "cons": "Nothing as yet and after 15 years service I doubt I will find anything"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Fantastic company with great ethics", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Oct 2017", "job_title": "Anonymous Employee in Telford, England", "duration": "N/A", "pros": "All the colleagues seem genuinely happy and willing to help you be the best you can be in your roll. Management are open to suggestions and promote a team environment, from day 1 you feel like a member of the family.", "cons": "As yet I can't think of any, the company are ticking all the boxes I'd want them to."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Empowering environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 Jul 2018", "job_title": "Anonymous Employee in Wolverhampton, England", "duration": "N/A", "pros": "Empowering environment where you're supported and encouraged to achieve your potential\r\nCareer opportunities and role flexibility\r\nFlexible working and overall work-life balance\r\nThe people", "cons": "The parking at EC, but it is right outside the building and free, and just means you may need to double-park someone."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Beware of the false culture!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "29 Apr 2018", "job_title": "Anonymous Employee in Wolverhampton, England", "duration": "N/A", "pros": "Working from home, free drinks, good flexible benefits", "cons": "After far too long wondering who was about to talk about me behind my back, I had to leave. It was just such a strange, but completely false culture. Maybe my expectations were too high having read previous reviews, or there are several people working there who have basically been brain washed!\r\n\r\nYou are actively encouraged to be nice and lovely to everyone, and most people are nice and lovely, then they go and do something awful behind your back and make your life miserable by gossiping and being generally nasty.\r\n\r\nIf your face fits, you've got a job for life. It clearly doesn't matter if you can do the job or not, or if you have any experience in it, only that you know someone who likes you and is able to influence that decision.\r\n\r\nIf you want to be a consultant at Bromford, this is also no problem. In fact, you could leave and come back as a consultant and earn quadruple what you were earning before and no one will bat an eye lid! In fact, bring your friends too, it's no problem there.\r\n\r\nIf you love a meeting for the sake of a meeting, and making yourself look really busy when actually you've done nothing and not left the house all week, you can easily do it here and no one will mind."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Brilliant company, great people and excellent benefits.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 Dec 2019", "job_title": "BI Developer in Wolverhampton, England", "duration": "N/A", "pros": "People are great. Money is good. Work is very interesting. Our company purpose is amazing. Subsidised Gym opposite. Flexible working hours. Certainly forward thinking in terms of new technologies/software, and a lot of people with great expertise to help push the company forwards. I love working here. Loads to get stuck into, and lots of collaboration.", "cons": "Nothing significant that I've found."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "I feel cheated", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "9 Jan 2020", "job_title": "Labourer in Chipping Sodbury, England", "duration": "N/A", "pros": "It was a good company to work for but bad management", "cons": "I was employed as a labourer in Chipping Sodbury.\r\nAfter years and of service I was made redundant last year.\r\nI have recently heard that the business are employing labourers through an agency and did not contact me to offer my old job back.\r\nI had been a loyal employee and feel the company didn’t treat me right. No morals"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Bromford", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "9 Apr 2019", "job_title": "Housing in Wolverhampton, England", "duration": "N/A", "pros": "honest , flexible ,hard working ,  professional organisation", "cons": "colleague benefits , particularly the car scheme"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "In  world of secular uncertainty security in a job is priceless.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "11 Jul 2019", "job_title": "Neighbourhood Coach in Birmingham, England", "duration": "N/A", "pros": "Exceptional training, really care about colleagues, investing in colleagues, recognize the need for mental health support and willing to spend money on implementing this, great team environment, flexible employer, superb annual leave, innovation for the future. Job security", "cons": "Not always consistent or cohesive"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great people. Great organisation. Great culture.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Jan 2020", "job_title": "PSA in Wolverhampton, England", "duration": "N/A", "pros": "The people at Bromford are incredibly welcoming and supportive. I have been at Bromford for only 4 weeks and have been provided with so many opportunities and so much  training.  Very impressed with the leaders who unlike other companies will support you and really do want the best for you.", "cons": "No downsides come to my mind."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Support worker", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "21 Dec 2017", "job_title": "Support Worker in Stroud, England", "duration": "N/A", "pros": "A great company to work for with many added perks like Bromford rewards scheme. I also enjoy attending our annual Bromford Bash in Birmingham. I have found this a great place to see where the company is heading and to meet up which colleagues from other schemes and services.", "cons": "HQ is quite far away so training is sometimes a bit far."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Bromford Experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "11 Feb 2019", "job_title": "Gas Surveyor in Wolverhampton, England", "duration": "N/A", "pros": "Bromford treats everyone as equal and really respect  the work they do for the customers.", "cons": "The pay structure does not always match the job role throughout the business. Some colleagues can perform the same job role/title in different teams and be paid a different wage."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Treat your employees just as well as you treat your customers", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "9 Nov 2015", "job_title": "Anonymous Employee in Wolverhampton, England", "duration": "N/A", "pros": "They have some great ideas and are very forward thinking", "cons": "Treat disabled employees very poorly, also if you don't fit in you can experience bullying that goes unchallenged"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Good company to work for. Even with a contract they will get rid of staff easily", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "16 Jan 2016", "job_title": "Support Worker in Birmingham, England", "duration": "N/A", "pros": "Very good teams. Good management. Open environment and the whole management chain is accessible to all.\r\nGood work life balance (thats not uniform across all teams/deps)", "cons": "They only care about the bottom buck. Got rid of many teams with measly compensation packages.\r\nNo career progression for 99%"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "They really care about their staff", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Apr 2020", "job_title": "Neighbourhood Coach in Lichfield, England", "duration": "N/A", "pros": "Trusted to complete your job without micro management but supported well to carry your job out well. Great team spirit everyone helps each other its like a family.", "cons": "I have not found any cons as of yet"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Interview Process", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Nov 2016", "job_title": " in Wolverhampton, England", "duration": "N/A", "pros": "The office staff are all very friendly and helpful.  You are made very welcome from day 1 even when on a short term contract you are not treated any different", "cons": "Its only a short term position I would love for it to be a full time position as love working here and everyone is great"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Probation Review", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Dec 2016", "job_title": "Money Adviser in Cirencester, England", "duration": "N/A", "pros": "Great team spirit. \r\nA company that really values colleagues and customers and who is committed to doing the right thing by both of them.\r\nTraining\r\nFlexible working hours\r\nRight tools to do the job\r\nAccessible senior leadership team.", "cons": "So far I have yet to find any cons."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "landscape gardener", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Jul 2018", "job_title": "Landscaper in Lichfield, England", "duration": "N/A", "pros": "Great company to work for, good pay and staff are really friendly and helpful to new starters and long time colleagues. Management are always happy to help, this company is also a great way to meet a wide range of people, with their own different background, beliefs and cultures.", "cons": "Not a bad thing so far."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Recruitment Process", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Sept 2016", "job_title": "Neighbourhood Coach in Shrewsbury, England", "duration": "N/A", "pros": "I found the assessment day a great way to get to know Bromfords way of working and I felt really at ease and went away feeling very positive about the role I was applying for.", "cons": "So far I have no bad points!!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Bromford Gas Engineer", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Aug 2018", "job_title": "Gas Engineer in Cheltenham, England", "duration": "N/A", "pros": "Good van, full kit provided to do the job. \r\nGreat staff, good support from management. \r\nGreat training,\r\nNice and busy. \r\nGreat company to work for very professional.", "cons": "The only thing I would change is the work t-shirts they look old and dated not a nice fit or material."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Changing Company", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "21 Aug 2019", "job_title": "Sales in Wolverhampton, England", "duration": "N/A", "pros": "Lovely people everyone very friendly and welcoming.", "cons": "Inconsistency across teams some can work from home others cant.  Team managers some really know their stuff others handed job with no experience and no training."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Working at Bromford", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "3 Oct 2016", "job_title": " in Wolverhampton, England", "duration": "N/A", "pros": "The organisation is positive, innovate, flexible, financially strong with great colleagues and an environment within which you can develop.", "cons": "For those coming from a very commercial organisation, the culture may take some getting used to and it is very different."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Recent Addition to the Bromford Team", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Dec 2016", "job_title": " in Wolverhampton, England", "duration": "N/A", "pros": "A very positive, enjoyable place to work where colleague involvement is actively encouraged. There is always someone nearby to help you settle in and the company overall has been very welcoming from the day I joined.", "cons": "No real negatives to mention; I'm very happy to have joined!"}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Brilliant 6 months!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "2 May 2017", "job_title": "Neighbourhood Coach in Lichfield, England", "duration": "N/A", "pros": "all colleagues have been so welcoming and helpful really felt part of the team straight away! No day is the same in my job role and have learnt so many new life skills!", "cons": "Sometimes struggle with shutting of from work when I get home...something I need to work on"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Nov 2018", "job_title": "Infrastructure Manager in Wolverhampton, England", "duration": "N/A", "pros": "Flexible, Friendly, Innovative and forward thinking. A real client focused delivery model", "cons": "None that I have found so far"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Electrician", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Nov 2016", "job_title": "Electrician in Stourbridge, England", "duration": "N/A", "pros": "The people are really friendly. From day one you are made to feel part of the Bromford family.The work life balance is available as the holiday entitlement is very generous. The opportunities to develop yourself are encouraged.", "cons": "I can't think of anything that would be considered a con."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Assistant", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Aug 2017", "job_title": "Innovation Assistant in Wolverhampton, England", "duration": "N/A", "pros": "Great office space, amazing helpful colleagues, really great benefits package, good pensions! Overall just a really nice place to work. I enjoy getting up to come to work every morning!", "cons": "I really don't see any cons - It's a great experience so far!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great first impressions", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Feb 2018", "job_title": "Anonymous Employee in Wolverhampton, England", "duration": "N/A", "pros": "Great communication throughout the interview/selection process and before starting employment with Bromford.  Very detailed induction and everyone has been very welcoming and generous with their time.", "cons": "Not aware of any yet!"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Working at Bromford", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Dec 2016", "job_title": "Neighbourhood Coach in Lichfield, England", "duration": "N/A", "pros": "rewarding, exciting and challenging in a positive way. Wonderful colleagues.", "cons": "Different environment to what I have been used to and so much change has happened since I came into the role."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Extremely positive about my future career", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Mar 2017", "job_title": "Neighbourhood Coach in Worcester, England", "duration": "N/A", "pros": "Extremely positive working environment, exceptionally helpful colleagues, colleague benefits to take advantage of and flexible working environment to meet the needs of my role and home life.", "cons": "6 months in.... I have yet to find any"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "GPTW - but change is a way of life!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "29 Jul 2019", "job_title": "Employment Coach in Wolverhampton, England", "duration": "N/A", "pros": "Honest, Trusting, Flexible Working, Autonomy", "cons": "Lower than market rate pay"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "A Great Place To Work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "22 Apr 2020", "job_title": "Repairs Team Planner in Wolverhampton, England", "duration": "N/A", "pros": "Very Flexible. promote home/work life balance. colleagues are always supportive and helpful as we share the same Bromford DNA. Great benefit packages. making a positive impact on the community.", "cons": "Nothing big enough to mention really"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Aug 2019", "job_title": "Learning & Development Coordinator in Wolverhampton, England", "duration": "N/A", "pros": "I work in a great team and get to meet many of my colleagues within the company.  Everyone is so supportive and we all work well together.", "cons": "I should have come to work here ages ago!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Bromford", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Jan 2017", "job_title": "People Services Assistant in Wolverhampton, England", "duration": "N/A", "pros": "The people are great to work with, we have a great range of benefits to choose from and I would recommend working here to anyone.", "cons": "More flexibility at times would make my life a little easier, other than that I can't complain :)"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "5 years working for Bromford and I'm still amazed at what the people and Bromford do for there customers and colleagues", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "21 Apr 2017", "job_title": "Landscaping Team Leader in Wolverhampton, England", "duration": "N/A", "pros": "Bromford will all ways help you and have a passion in what they do", "cons": "There is none it's a great place to work"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great but with some tweaks will be Superb!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 May 2018", "job_title": "Anonymous Employee in Wolverhampton, England", "duration": "N/A", "pros": "Fast pace, high want to do, great energy, forward thinking", "cons": "Hold leaders to account, very supportive culture can sometimes stifle accountability and growth in direct reports."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "5 year anniverary", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "9 Oct 2019", "job_title": "Change Manager in Wolverhampton, England", "duration": "N/A", "pros": "Excellent company to work for who look after their colleges very well. Great opportunities to further your career,   great holiday entitlement and good benefits package.\nWork colleges are all very helpful.", "cons": "Car parking at the main offices is an issue."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Customer Service Advisor", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Apr 2018", "job_title": "Customer Services Advisor in Wolverhampton, England", "duration": "N/A", "pros": "Great place to work. Staff are really well looked after and everybody wants to help each other out. You are also actively encouraged to progress and are provided the tools to do so.", "cons": "Only downside is the car park :)"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Locality Manager", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "13 May 2019", "job_title": "Locality Manager in Tamworth, England", "duration": "N/A", "pros": "They are extremely supportive, and understanding. Very flexible in terms of working practices", "cons": "Not for everyone in terms of the expectation of you, need to work hard but you will reap benefits, but coaching and self serve may not be for everyone"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great people", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Jan 2020", "job_title": "Computer Operator Specialist in Cirencester, England", "duration": "N/A", "pros": "The teams are so friendly and it is a lovely relaxed atmosphere, great with the flexible working policy to fit around my family life", "cons": "Struggle to get some teams to with with the values and do what is best for the customers"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Passing my probation with the Lettings team", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Dec 2016", "job_title": "Lettings Advisor in Lichfield, England", "duration": "N/A", "pros": "Good benefits, friendly atmosphere, option of flexi-time which is appreciated, good team spirit with regard to Christmas, birthdays and building team moral.", "cons": "Do not always get paid full hours of overtime worked and need to request."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Adam Heap", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "30 May 2017", "job_title": "Gas Installation Manager in Wolverhampton, England", "duration": "N/A", "pros": "Great colleges to work with. Very supportive management structure  and company ethos that lends itself to being able to progress in the company. Great track record of growing your own. Great benefits.", "cons": "Travel times between offices and SDC's."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Started as Apprentice on a 1 year contract and 5 years down the line still enjoy working at Bromford", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "5 Dec 2017", "job_title": "Finance in Wolverhampton, England", "duration": "N/A", "pros": "Bromford Colleagues\r\nGreat place to work\r\nSome Good Benefits", "cons": "Wage increases needs to be looked into for the lower paid colleagues"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Opportunities Manager", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "12 Dec 2017", "job_title": "C E O in Walsall, England", "duration": "N/A", "pros": "great culture, great colleagues, great manager and director", "cons": "lots of changes in structure and reporting lines led to uncertainty"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Dec 2017", "job_title": "Anonymous Employee in Wolverhampton, England", "duration": "N/A", "pros": "Love the culture here, different to other places I have worked. Has a flexible approach to working and colleagues are really friendly. Great benefits.", "cons": "Can't think of any at the moment"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "All good", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Mar 2017", "job_title": " in Wolverhampton, England", "duration": "N/A", "pros": "7 months in now, just finished my probation. Great company, happy, fun, friendly colleagues.\r\nEvery day is different, but every day (mostly) is good.\r\nVery customer focused, with a must do attitude.", "cons": "Too many cakes & biscuits."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Support Worker", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Mar 2017", "job_title": "Support Worker in Stroud, England", "duration": "N/A", "pros": "Bromford has really good training opportunities and is very good as ensuring support from the team.", "cons": "Bromford is a big organisation, things can get muddled and take time to sort out, especially when booking customer repairs."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Oct 2019", "job_title": "Money Adviser in Wolverhampton, England", "duration": "N/A", "pros": "Love the flexible working policy as it helps to sustain a positive work life balance.\nI have felt valued as a colleague right from my first day.\nApproachable management", "cons": "There are no cons so far!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Working at Bromford", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "10 Oct 2016", "job_title": "Anonymous Employee in Wolverhampton, England", "duration": "N/A", "pros": "The people and culture make Bromford a great place to work. I also love that I can balance work and home life with my part-time hours.", "cons": "I honestly don't have any to share!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Apr 2019", "job_title": "Flaig Support Worker in Telford, England", "duration": "N/A", "pros": "Friendly helpful staff and feel instantly part of the team", "cons": "I would continue as you are.  Great company with great people"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Jul 2018", "job_title": "Anonymous Employee in Wolverhampton, England", "duration": "N/A", "pros": "Colleagues, Environment and feeling of doing something worthwhile.", "cons": "Parking at Exchange Court can be a nightmare!"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "A good place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Jun 2019", "job_title": "Support Worker in Lichfield, England", "duration": "N/A", "pros": "Genuine friendly colleagues and a place where you will learn a lot and develop your skills set.", "cons": "Sometimes the organisation can seem very corporate due to its size."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Came to Bromford 15 yrs ago & have experienced plenty of opportunities to develop and grow", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "7 Feb 2020", "job_title": "Learning and Development Manager in Wolverhampton, England", "duration": "N/A", "pros": "Supportive leaders,  clear strategy, DNA", "cons": "No real cons for me"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "It's a great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Mar 2020", "job_title": "Business Continuity Manager in Wolverhampton, England", "duration": "N/A", "pros": "The people, the approach and the benefits", "cons": "Haven't come across any yet..."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great company with supportive managers", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Jun 2017", "job_title": "Anonymous Employee in Wolverhampton, England", "duration": "N/A", "pros": "Great colleagues\r\nSupportive managers\r\nFlexible working environment - hotdesking \r\nNot status oriented - even the CEO doesn't have her own office", "cons": "Endless 121s and performance reviews \r\nLittle investment in development"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work !", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 May 2018", "job_title": "Neighbourhood Coach in Cirencester, England", "duration": "N/A", "pros": "Great colleagues, flexible working, excellent training, innovative, your opinions matter", "cons": "Business is large, you must put yourself out there"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Nice people bad company", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 May 2019", "job_title": "Money Adviser in Wolverhampton, England", "duration": "N/A", "pros": "Good work colleagues and work environment.", "cons": "Bad Management\r\nBullying\r\nChanging employment agreements \r\nNo incentives"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Working at Bromford", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "21 Jun 2019", "job_title": "Landscaping Manager in Wolverhampton, England", "duration": "N/A", "pros": "Commitment to your Future \nTo Challenge your self and others \nFUN", "cons": "100% Genuine company that will look after from day one"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "5th year anniversary", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "14 Oct 2019", "job_title": "Multi Skilled Engineer in Burntwood, England", "duration": "N/A", "pros": "- Local work \r\n- Generous annual leave \r\n- Bromford reward scheme that offer discounts on everyday essentials \r\n- Working hours", "cons": "- Having a tool allowance oer engineer would be good"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Ok place to work.", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "9 Feb 2020", "job_title": "Compliance Officer in Bristol, England", "duration": "N/A", "pros": "Good learning opportunities. Was able to complete the courses I wanted as long as they were job related.", "cons": "Management not always supportive, some managers at great some not so."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Forward thinking, keep on moving.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "16 Nov 2016", "job_title": "Anonymous Employee in Wolverhampton, England", "duration": "N/A", "pros": "Autonomy in your role, trusting, innovative, ambitious, customer focused, caring management, IT savvy.", "cons": "Culture isn't for everyone, lack of commerciality, pay and reward needs a review."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Contact centre", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Aug 2017", "job_title": "Anonymous Employee in Wolverhampton, England", "duration": "N/A", "pros": "Bromford only chooses the cream of the crop and results in working with the best", "cons": "Hard work and customers can be rude at times but the majority are lovely"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Do Not Understand This Section", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Dec 2017", "job_title": "Empty Homes Gas Engineer in Andoversford, England", "duration": "N/A", "pros": "Good Holidays, Good Pay, Freindly Workmates, Good Line Manager", "cons": "Difficulties In Purchasing Gas With Pricurement Card"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A beutiful family", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "29 Oct 2018", "job_title": "Anonymous Employee in Birmingham, England", "duration": "N/A", "pros": "Great colleagues, working hours, salary, career development, ethos.", "cons": "No cons-seriously no cons, honest and truthful no cons."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Go for it", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Oct 2019", "job_title": "Landscaper in Gloucester, England", "duration": "N/A", "pros": "Job security friendly  team you are treated  fairly and with respect", "cons": "None that I have found"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Skills Coach", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Jun 2017", "job_title": "Skills Coach in Wolverhampton, England", "duration": "N/A", "pros": "Agile, fun, people focussed, supportive, innovative, brave, social value", "cons": "Below average pay, but excellent benefits."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Transformational working", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Jul 2018", "job_title": "Neighbourood Coach in Cheltenham, England", "duration": "N/A", "pros": "Totally different culture to previous employers, everyone is very pleasant and friendly, flexible and caring.", "cons": "There haven't been any so far."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "GAS SURVEYOR", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Oct 2018", "job_title": "Gas Surveyor in Wolverhampton, England", "duration": "N/A", "pros": "working with a great team and great people", "cons": "there are no downsides to working at bromford"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "new starter", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Nov 2017", "job_title": "Sales Consultant in Stourport-on-Severn, England", "duration": "N/A", "pros": "the hours I currently work I get Sundays & Mondays off which is fab", "cons": "non to date, only been working for them since September 2017"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Bromford review", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Dec 2017", "job_title": "Customer Service Advisor in Wolverhampton, England", "duration": "N/A", "pros": "Excellent benefits, great work place, support is always there when you need it.", "cons": "Salary is below average, but everything else does make up for this."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Bromford Review", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "14 Nov 2018", "job_title": "Team Leader in Wolverhampton, England", "duration": "N/A", "pros": "Great culture, Friendly, Fantastic colleague benefits, Positive, Forward thinking.", "cons": "Merger with Merlin has caused uncertainty around jobs"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Place To Work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "25 May 2017", "job_title": "Anonymous Employee in Wolverhampton, England", "duration": "N/A", "pros": "great colleagues, great atmosphere, great benefits", "cons": "communication between teams can be a little slow"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "landscaper", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Apr 2018", "job_title": "Landscaper in Birmingham, England", "duration": "N/A", "pros": "Great work environment look after there workers well all round good firm", "cons": "No downsides really at all"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Beat my expectations", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Oct 2018", "job_title": "E H Manager in Birmingham, England", "duration": "N/A", "pros": "Great culture, great people. good career progression", "cons": "parking! not entitled to any benefits until after probation"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "GPTW", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "17 Jun 2020", "job_title": "Financial Analyst in Wolverhampton, England", "duration": "N/A", "pros": "Compassion, respect and understanding\r\nOpen and honest communication", "cons": "Less security and redundant. Not enough about communications about the offices re-fubs and closes."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "I enjoyed my job, very happy", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "23 Apr 2019", "job_title": "Housing Manager in Lichfield, England", "duration": "N/A", "pros": "The people were fantastic and I enjoyed working there", "cons": "A few too many changes made me look elsewhere."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Best company I've worked for", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Jun 2019", "job_title": "Customer Service Advisor in Wolverhampton, England", "duration": "N/A", "pros": "Good pay. Flexible hours. Good progression opportunities if wanted. Amazing team", "cons": "Nothing, great company to work for"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A fantastic place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Aug 2018", "job_title": "Business Analyst in Wolverhampton, England", "duration": "N/A", "pros": "Nice culture\nLots of benefits\nFlexibility\nGood salary\nA business you can trust", "cons": "The car parking can be a bit intimidating"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Sept 2018", "job_title": "Anonymous Employee in Cirencester, England", "duration": "N/A", "pros": "Great company to work for. Fantastic ethos and positive colleagues", "cons": "Great deal of change happening so makes some colleagues uneasy"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Review", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 Sept 2019", "job_title": "Multiskilled Engineer in Birmingham, England", "duration": "N/A", "pros": "Job suitability  and good company to work for", "cons": "ICT  can be confusing at times"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "27 Sept 2020", "job_title": "Lettings Team Leader in Tewkesbury, England", "duration": "N/A", "pros": "Friendly colleagues, good training and great benefits offered", "cons": "None enjoyed my time working for SVHS and then Bromford"}], [{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Electrician", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Oct 2017", "job_title": "Maintenance Electrician in Wolverhampton, England", "duration": "N/A", "pros": "Friendly environment, good holiday and pension", "cons": "Salary below national average, a lot of driving"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Fabulous company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Aug 2017", "job_title": "Anonymous Employee in Birmingham, England", "duration": "N/A", "pros": "Value driven organisation that cares about it customers and colleagues.", "cons": "Not found any as yet"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Bromford", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 Jan 2018", "job_title": "Anonymous Employee in Lichfield, England", "duration": "N/A", "pros": "Good work/home life balance\r\nGood culture\r\nThey retain staff", "cons": "Poor salary compared to other employers"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Midlands", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Jul 2018", "job_title": "Gas Fitter in Andoversford, England", "duration": "N/A", "pros": "Great team on gas installs", "cons": "Vans too small for job"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Small association with a family feel", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Jul 2020", "job_title": "Management Accountant in Gloucester, England", "duration": "N/A", "pros": "Friendly environment, great teams with friendly leadership", "cons": "Few to no career progression prospects"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Neighbourhood Coach", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 Nov 2017", "job_title": "Neighbourhood Coach in Birmingham, England", "duration": "N/A", "pros": "Wow, where to start!\r\nFlexible\r\nTrusting\r\nAmazing colleagues\r\nFriendly\r\nAwesome training\r\nSupportive", "cons": "Ummm, dont know of any"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "5 Aug 2019", "job_title": "Systems Analyst in Wolverhampton, England", "duration": "N/A", "pros": "Great Colleagues with a great team spirit.", "cons": "Career progression can become limited."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "It", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "9 Sept 2020", "job_title": "IT Support Specialist in Wolverhampton, England", "duration": "N/A", "pros": "Flexible working \r\nNice people\r\nLocality \r\nGreat office", "cons": "Management needs improving to be more fair"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Don’t work at Bromford", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "8 Oct 2019", "job_title": "Coordinator in Wolverhampton, England", "duration": "N/A", "pros": "Benefits package, flexibility, nothing more", "cons": "They lie to you, make promises they can’t keep"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Poor Workmanship", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "12 May 2018", "job_title": "Anonymous Employee in Lichfield, England", "duration": "N/A", "pros": "Job secure with big company", "cons": "As a tradesman you'll be asked to either bodge or pennypinch"}]]