[[{"date": "6 Feb 2023", "title": "COVID-19 Screener Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Winnipeg Regional Health Authority", "Interview Descriptions": "It was pretty easy. Does not need any experience. You might get hired on-spot if they are looking for someone real quick. But, it is better to be prepared for the interview.", "Interview Questions": "What does your availability look like?"}, {"date": "21 Mar 2023", "title": "Diet Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Winnipeg Regional Health Authority in Mar 2021", "Interview Descriptions": "It was Easy going. Behavioral questions and situational questions. Panel interview by two Managers . Accommodating and felt casual conversation . Be ready with your documents Police Clearance and Certificate of Food Handling.", "Interview Questions": "Describe a time when you have to disagree with your Manager"}, {"date": "2 Aug 2018", "title": "Director of Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at Winnipeg Regional Health Authority (Winnipeg, MB)", "Interview Descriptions": "Phone screen, then interview  with the Chief Human Resources Officer, then interview with senior management at Deer Lodge Centre. They told me I was short listed and there was only one other candidate and they would get back to me either way. NO ONE EVER CALLED ME BACK. TERRIBLE candidate experience.", "Interview Questions": "How do you go about getting to know your new team?"}, {"date": "29 Dec 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Winnipeg Regional Health Authority", "Interview Descriptions": "Post your resume online through their website.  If you are unionized the highest ranking seniority gets the position.  If you are non union, you may get a call for an interview.", "Interview Questions": "Computer programs you are familiar with and documents  you have created, typing speed, formatting documents, situations you've been in with another coworker - conflict, what you learned from it etc., how you handle competing demands, dealing with the public situations, how you set up for a meeting"}, {"date": "27 Apr 2019", "title": "Dietetic Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took a year or more. I interviewed at Winnipeg Regional Health Authority (Winnipeg, MB) in Dec 2017", "Interview Descriptions": "4 years of school and then you submit your resume, cover letter, transcript, and volunteer hours. Then once you submit that they let you know if you receive an offer in January. Once the offer is received you have to take another research specific course in your undergrad.", "Interview Questions": "Why are you a candidate for this program?"}, {"date": "4 Sept 2019", "title": "Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Winnipeg Regional Health Authority (Winnipeg, MB) in Nov 2017", "Interview Descriptions": "Contacted via telephone first.  Then followed up with me via email with time and date of interview.  Met one on one, on site. Was relaxed atmosphere and offered something to drink first.  Spoke casually for a few minutes. I was then asked approx. 8-10 Behavioural questions.   \r\nInterview was approximately 30 minutes.", "Interview Questions": "Comfortable with the hours and salary?"}, {"date": "15 Oct 2016", "title": "Administrative Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Winnipeg Regional Health Authority (Winnipeg, MB)", "Interview Descriptions": "Emailed resume application and contacted by phone to arrange interview.  They were accommodating to the limitations of my schedule by offering a couple of options for the interview time. Interviewed by a panel of closest colleagues and direct supervisors.  Comfortable, friendly and conversational atmosphere.  References were called and rganization required criminal records check and child abuse registry check.", "Interview Questions": "Asked for expanded description of experiences specific to job duties and several behavioural \"tell me a time when\" questions."}, {"date": "17 Jul 2019", "title": "Organ Donor Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Winnipeg Regional Health Authority (Winnipeg, MB) in Aug 2016", "Interview Descriptions": "Two group panel interviews. Due to being on Vacation at the time I had to do the first interview over the phone. I was then selected for a second interview which done in person. Criminal check was needed as well as a child abuse check was needed. Plus 3 references.", "Interview Questions": "How did you become interested in this program"}, {"date": "24 Oct 2016", "title": "Accounts Payable Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Winnipeg Regional Health Authority (Winnipeg, MB) in Jul 2016", "Interview Descriptions": "Interview was really easy. They wanted one person so badly so they took only one initial round of interview with the manager then there was a typing test.In 1 day they said their hiring decision and everything was smooth.", "Interview Questions": "everything was general and explained about the job roles."}, {"date": "18 Jul 2015", "title": "Training Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Winnipeg Regional Health Authority", "Interview Descriptions": "30 minute testing on Excel 2007, 2 hour panel interview with three members of the team - two of whom were very professional. The project lead was disorganized, asked most of the questions, and wasn't particularly pleasant.", "Interview Questions": "Tell us about a time when things didn't go the way you wanted them to, and what you did about it?"}], [{"date": "3 Apr 2015", "title": "Administrative Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Winnipeg Regional Health Authority (Winnipeg, MB) in Oct 2014", "Interview Descriptions": "Clean. Structured.  3 step process. Questions were all scenario based. Interviewed by a pannel of three senior leaders. There was also a requirement to present and prepare a business case to a pannel of leaders in the organization. The salary negotiations were limited as there are very strict pay bands. There is no negotion room on vacation allowance.", "Interview Questions": "How would you handle an incident resulting in 15 percent staff tun over?"}, {"date": "2 Apr 2014", "title": "Administrative Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Winnipeg Regional Health Authority (Winnipeg, MB)", "Interview Descriptions": "Group interview - required that I provide technical details on how to conduct the work.", "Interview Questions": "N/A"}, {"date": "30 Sept 2014", "title": "Clinical Engineering Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Winnipeg Regional Health Authority (Winnipeg, MB) in Apr 2014", "Interview Descriptions": "Applied through U of T clinical engineering program's internal posting \r\nConference call phone interview for about 30-45 minutes with 3 staff members: they explained what their department does and what project they're hoping to carry out in the summer. Each of the 3 members took turns to ask questions. \r\nOverall, the work environment was great, the staff were very friendly, and I enjoyed carrying out the project.", "Interview Questions": "How do you see yourself carrying out this project considering your background and experience?"}, {"date": "12 Apr 2013", "title": "Public Health Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Winnipeg Regional Health Authority", "Interview Descriptions": "I got called at 1 pm on the Thursday asking me to come in the following morning at 9 am for an interview. When I advised the interviewer that I was unable to make it on such short notice, I was then told in a nasty tone that the only other interview time available would be 2 pm the next day (this time was not originally offered). I was told there would be a 30 minute test prior to the interview. When I asked what kind of information would be tested, once again I received a nasty answer \"I can't tell you that. Just be prepared\". I arrived at the interview and was given the test (a question to the effect  \"describe a time that you made full use of your public health skills\". I was then interviewed by two managers in Public Health. The interview went fine. They asked for my references. Afterwards I was sent an email from one of the managers requesting that I forward information about the FTEs of my last jobs. I forwarded this on. I found out that my references were never called and a week later, one of the managers left a message stating I was unsuccessful.  I think they had someone in mind for the job- I was overly qualified for the job (master's prepared) and have experience in public health. Overall, I felt the WRHA was very disrespectful. Who calls at 1 pm expecting to interview you the next day at 9am and then wastes your time further by asking for references, not calling them, asking for FTEs, etc.", "Interview Questions": "usual questions pertaining to \"recall a time you had to resolve a conflict\""}]]