[[{"date": "25 Apr 2023", "title": "HR Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at CHRISTUS Spohn Health System (Corpus Christi, TX) in Mar 2023", "Interview Descriptions": "Signed all of my paperwork and then told me that the department was overstaffed. This was a huge setback for me as I’d stopped looking for employment elsewhere when they signed my internship agreement", "Interview Questions": "Availability dates; interests; skills; experience"}, {"date": "7 Nov 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at CHRISTUS Spohn Health System (Corpus Christi, TX) in Aug 2022", "Interview Descriptions": "I emailed the point of contact I was given for my senior capstone class, and received a reply within about a week's time. I was told that before a decision was made, an online interview was typically conducted to be sure that the student would be a good fit for placement. We scheduled an interview over Zoom that lasted for a little over an hour. After that, I was told that I would be contacted by the end of that week and that they would let me know whether I would be accepted or not. I was then contacted and accepted via email and asked to provide availability for in-person/on-site hours, and was also asked to come in to full discuss a schedule and fill out paperwork.", "Interview Questions": "Tell me something about yourself. How did you hear about this position? What are your strengths and weaknesses? What do you know about this company/organization? Do you have any questions for me? Where do you see yourself in 6 years? What areas or departments are you interested in?"}, {"date": "2 Feb 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at CHRISTUS Spohn Health System", "Interview Descriptions": "Easy to talk to, was not very intimidating being interviewed as a new graduate. Very professional . Received a call back within the next two days. They answered my questions clearly.", "Interview Questions": "Patient scenarios for an unstable patient "}, {"date": "14 Sept 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CHRISTUS Spohn Health System", "Interview Descriptions": "It was quick and easy, I didn't feel any pressure. I enjoyed the process, I believe it's much easier now with the pandemic. Got hired immediately, I recommend applying here", "Interview Questions": "N/A"}, {"date": "21 Jul 2021", "title": "CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CHRISTUS Spohn Health System", "Interview Descriptions": "Phone call interview that was about 15 min and just a pre screen was done before actually getting an email from the location I actually applied to. That only took about 2 days to hear back and then a actual in person interview which went by really fast.", "Interview Questions": "Work quality and how dependable I am"}, {"date": "21 Sept 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CHRISTUS Spohn Health System", "Interview Descriptions": "panel interview with about 5 to eight managers from different units and different hospitals around the area. I was very nervous but they made me feel welcome. I enjoyed being able to ask them questions too", "Interview Questions": "Why did you become a nurse?"}, {"date": "1 Jul 2020", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at CHRISTUS Spohn Health System in Jun 2020", "Interview Descriptions": "Interview then tour, took a while. I was able to meet some of the staff and other individuals throughout the hospital, which was really very nice. I believe everybody was really nice and helpful. They made me feel very welcomed.", "Interview Questions": "Where do you see yourself in 5 years? Long term and short term goals? "}, {"date": "31 Mar 2021", "title": "Caregiver, CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CHRISTUS Spohn Health System (Corpus Christi, TX) in Aug 2019", "Interview Descriptions": "It was easy and friendly. I really enjoyed it. It went well. I did well. Not something to be worried about. Very easy going. They were very nice. They enjoyed talking about my career vision and my education vision.", "Interview Questions": "how many years of experience in the hospital?"}, {"date": "21 Jul 2019", "title": "Human Resources Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at CHRISTUS Spohn Health System in May 2019", "Interview Descriptions": "I applied online, and received a phone call asking about my availability on when I can do an interview. There was an initial screening done through telephone. They asked interview questions about my experience. Once you've finished that portion, they ask you when you are next available for the next interview in person.", "Interview Questions": "Describe a challenge you have dealt with and how you fixed it."}, {"date": "11 Mar 2019", "title": "Chief Building Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at CHRISTUS Spohn Health System", "Interview Descriptions": "I had phone interviews with 2 managers and both managers were very professional and direct. They explained to me what they were looking for in the position and answered my questions very satisfactorily.", "Interview Questions": "One question asked was about my Supervisory experience."}], [{"date": "13 Jan 2020", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CHRISTUS Spohn Health System (Corpus Christi, TX) in Mar 2018", "Interview Descriptions": "I interviewed with fellow social workers and was offered the job the next day. I attended training for one day. It was about a two week hiring process and fairly easy.", "Interview Questions": "How do you handle conflict?"}, {"date": "4 Mar 2016", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CHRISTUS Spohn Health System", "Interview Descriptions": "First I received a phone call from HR, which in fact ended up being a phone interview, just a couple days after applying for the position. I was then scheduled for an additional phone interview with the unit manager for the next day. Next, I was invited for an on-site/peer interview, which I have yet to go to. They have been very kind and friendly, which is helpful with easing nervousness.", "Interview Questions": "What are your goals over the next 5 years?"}, {"date": "18 Dec 2015", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at CHRISTUS Spohn Health System (Corpus Christi, TX)", "Interview Descriptions": "They asked appropriate questions and were not intimidating. They asked for my previous training and certification as well as my skills. They also showed me around the laboratory. it was group panel interview, the head of the department on blood bank, the lead tech, one of the evening shifters, and one of the senior tech was part of the interview.", "Interview Questions": "Where do you see yourself 5 years from now?"}, {"date": "6 Jul 2015", "title": "Certified Occupational Therapy Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at CHRISTUS Spohn Health System", "Interview Descriptions": "It was a peer interview with 12 other people. Everyone was friendly and tried to make me feel comfortable. The only negative was that half of the people interviewing me came in late which was distracting and made me even more nervous.", "Interview Questions": "They asked me a series of questions. One of which was what was how would I handle conflict between me and a supervisor."}, {"date": "19 Dec 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at CHRISTUS Spohn Health System", "Interview Descriptions": "Group interview process. Recruiters take forever to get back to you or call you. Once you get called for an interview than it can be difficult to make a time for the group interview. The group interview is a set of standardized questions you must answer in front of a mixed panel of potential co-workers and managers. Once this process is completed it can take several weeks to hear back about status.", "Interview Questions": "Same as the national average"}, {"date": "29 Mar 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at CHRISTUS Spohn Health System (Corpus Christi, TX) in Dec 2014", "Interview Descriptions": "They will ask about your past and present work experience.  State all of the machines, equipment handled.  Number of years of experience.  Education earned.  Trainings undergone.   When can you start of work.", "Interview Questions": "Do  you have experience with CathLab?"}, {"date": "12 Jan 2015", "title": "HR-Recruiter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at CHRISTUS Spohn Health System in Sept 2013", "Interview Descriptions": "I was called in for an interview after the application I made online. I walked into their office and started waiting for my appointment. Every single person that noticed me waiting did not hesitate to say \"Hi\" and most of them even ask me if I need anything in the mean time. I must say it is a very friendly environment. I met with three recruiters in a meeting room for the interview. All of them were so friendly and made me comfortable with the interview before we went into questioning. They used a cross-questioning method and all three employers asked questions without an order. They explained company culture and what they expect from me in a very friendly and professional manner. One of the best interviews that I have had in my career despite the fact that I was not offered for the job.", "Interview Questions": "How can you benefit our organization?"}, {"date": "28 Sept 2013", "title": "Pharmacist Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at CHRISTUS Spohn Health System (Corpus Christi, TX) in Apr 2013", "Interview Descriptions": "The company held a hiring conference and potential interns were asked to bring resumes and CVs.  The interviews were from fifteen to thirty minutes long and consisted of the usual questions.  After the interviews, students were advised to wait a few weeks before expecting to hear anything.  Contact was made by phone and email.", "Interview Questions": "What do you expect to gain from this experience?"}, {"date": "4 Feb 2014", "title": "Nurse Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 7 weeks. I interviewed at CHRISTUS Spohn Health System in Sept 2012", "Interview Descriptions": "Peer Review interview", "Interview Questions": "Do you plan in staying in Corpus Christi"}, {"date": "7 Jul 2015", "title": "Certified Nurses Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at CHRISTUS Spohn Health System (Corpus Christi, TX) in Apr 2012", "Interview Descriptions": "Sent in an online application, received a brief phone call interview, then moved on to a panel interview which consisted of about 6-8 managers from the various departments, then once I passed that panel I proceeded to a group of three who interviewed me.", "Interview Questions": "Given a situation in which a patient was upset, how would you handle it?"}], [{"date": "18 May 2012", "title": "Healthcare Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at CHRISTUS Spohn Health System (Corpus Christi, TX) in Mar 2012", "Interview Descriptions": "The interview process was a full eight hour day consisting of multiple interviews. At 8am we started with a group interview with all the ancillary managers. The nursing departments interviewed me next. Then I had a one-on-one with the Administrator and a lunch interview with the Medical Director. The department staff interviewed me in two separate groups. I don't believe there was a difference between the two groups other than they were available at different times. I ended the day with an HR interview. \r\n\r\nThere were tons of behavioral based questions, technical questions by the staff, and the Administrator put me through a bunch of real-life scenarios. He was really straight-forward, and blunt which was a different style than the rest of the interviews. Be prepared to explain in detail why you want to work there and he'll try to put you on the defensive. If you say your challenge is keeping up your staff's morale, he's likely to ask why he should  hire you if you haven't figured out how to keep up morale? It was interesting, challenging and fun in a weird way.", "Interview Questions": "I have people that can balance productivity and morale. If you're challenged by that, why should I hire you?"}]]