[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Lovely Children's Charity", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "4 May 2021", "job_title": "Administrator in Havant, England", "duration": "N/A", "pros": "My job is very rewarding as I know that the work I do, contributes towards OTW providing free of charge camps for children with health conditions, their parents and siblings. My colleagues are extremely friendly, helpful and are very dedicated to providing safe and fun camps for our campers and families to enjoy.", "cons": "Due to Covid restrictions, not being able to work in the office with my colleagues."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Rewarding workplace", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Apr 2021", "job_title": "Camper & Families Administrator in Havant, England", "duration": "N/A", "pros": "I have been with Over The Wall for about 18 months now. The job can be challenging at times but it is also very rewarding. I have great support from my colleagues and work with a lovely team of people who work so hard to provide the best experience for the children and families that we support. The charity provide a flexible working approach that allows me to balance my home and work life. After many years working in a corporate environment, I really enjoy being a part of charity that can offer such wonderful, life changing experiences to these families. I really hope we can get back to offering residential camps in 2022 so I can attend a camp and see for myself the wonderful work that the charity does.", "cons": "I don't really have anything negative to add"}]]