[[{"date": "10 Aug 2022", "title": "Busniss Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MJHS (New York, NY) in Dec 2021", "Interview Descriptions": "Long interview process. First, you will meet with the manager, the director, and other people from different departments—a long interview process. First, you will meet with the manager, the director, and other people from different departments.", "Interview Questions": "Question on SQL and Excel function "}, {"date": "26 Nov 2021", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MJHS", "Interview Descriptions": "First round was a phone screening, then they asked to take Excel and MS word test, third round was interview with the HR, in fourth round they took a panel interview.", "Interview Questions": "Why do you want to work for this organization?"}, {"date": "20 Oct 2021", "title": "Member Services Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MJHS (Brooklyn, NY) in Jul 2021", "Interview Descriptions": "The process is not lengthy. 3 weeks from first HR contact. There are 3 interviews, plus you have to take a word/excel assessment online.  Not hard if you are well versed in Microsoft.", "Interview Questions": "How do you handle irate callers? Examples."}, {"date": "14 Jun 2021", "title": "Customer Service Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MJHS", "Interview Descriptions": "Not lengthy. It was straight to the point. It was not really said it would be an interview. It was nice and simple but more to be done is what I was told.", "Interview Questions": "What is my customer service experience "}, {"date": "23 Mar 2021", "title": "Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at MJHS", "Interview Descriptions": "Recruiter sent me 3 requests via email, I scheduled with her an appointment to have a conversation from there at a specific time. She called around that time, had a very unprofessional conversation with her, and just hung up at the end.", "Interview Questions": "The job description states you will need a valid drivers license and require a personal vehicle to commute with, do you have a personal vehicle."}, {"date": "27 Feb 2021", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MJHS (New York, NY) in Jan 2021", "Interview Descriptions": "Virtual interview with HR rep and operation manager.  Interviewers were polite and friendly. Took word and excel skill test. Overall OK interview with both HR and operation manager. Job description was well explained. Good benefit but starting salary is low.", "Interview Questions": "What is your plan for the next 2 years. "}, {"date": "15 Dec 2020", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MJHS (New York, NY) in Dec 2020", "Interview Descriptions": "2 weeks after applying, I was contacted by an HR Assistant. I was so excited as I have always wanted to work for this company. The HR assistant informed me that I would be interviewing with a recruiter and we scheduled a phone interview for the next day. My phone interview was for 3:45pm but the recruiter never called. I emailed the HR assistant to inform her that I have not spoken to the recruiter. We rescheduled for the following Monday at 3pm. Once again, the recruiter did not call me. Furthermore, I emailed the HR assistant to let her know that I would be moving on with other endeavors. I felt as though the recruiter didn’t care to interview me. Otherwise, he wouldn’t have missed two scheduled interviews.", "Interview Questions": "They did not ask any questions."}, {"date": "5 Oct 2021", "title": "Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MJHS (Brooklyn, NY) in Dec 2020", "Interview Descriptions": "You will get a call from HR for phone screening then a face to face with HR then face to face with management. After all candidates are interviewed HR will reach out with an offer.", "Interview Questions": "What made you choose MJHS\r\nTell me about yourself \r\nReason for wanting to find new employment \r\nWork history "}, {"date": "16 Jan 2021", "title": "RN CM Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MJHS (New York, NY) in Jun 2020", "Interview Descriptions": "4 panel review process, virtual due to covid. Typical interview questions were asked. Description of position was given. Emphasized fast paced, busy days, must be organized and flexible. Caseload varies.", "Interview Questions": "How do you organize your day?"}, {"date": "6 Mar 2020", "title": "Director, Organizational Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MJHS (Brooklyn, NY) in Feb 2020", "Interview Descriptions": "Very positive, smooth experience.  People were very knowledgeable about the company and position I was applying for; the senior leaders I met with were all very much aligned with identifying the job responsibilities and expectations of the position.", "Interview Questions": "Describe a situation when you had to work with a difficult executive?  How did you manage the relationship?  What was the outcome?"}], [{"date": "5 Dec 2019", "title": "Busineess Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at MJHS", "Interview Descriptions": "first, there will be a phone interview asking about your available time and basic introduction. Then it will be on site. You will be able to meet the team and see the whole office.", "Interview Questions": "tell me a bit more about your previous interns. "}, {"date": "2 Jan 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MJHS (Brooklyn, NY) in Jul 2019", "Interview Descriptions": "It was a two part interview. It was ok. The questions were justified but really don't think it was necessary to be interviewed by two different people. Overall it took longer than expected.", "Interview Questions": "Why did you choose to be a CNA?"}, {"date": "10 Jan 2020", "title": "Hospice Care Planner Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at MJHS (New York, NY) in Mar 2019", "Interview Descriptions": "met with the HR manager first where he asked me general questions about my past work experience. I then took a pharmacology test which I passed. I then met with two managers where they asked me more questions and told me more about the job.", "Interview Questions": "Why do you want to leave your current position?"}, {"date": "5 Feb 2022", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at MJHS (New York, NY) in Mar 2019", "Interview Descriptions": "Very good, understanding, friendly, simple, non tricky questions, your interest, learning more about your education history, background, why are you interested in this position, etc. Also, asked some basic questions, what do you want to learn gain new skills", "Interview Questions": "Why are you interested in this position"}, {"date": "2 Apr 2019", "title": "Per Diem Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MJHS (New York, NY) in Feb 2019", "Interview Descriptions": "The interview was easy and informative. The staff made me feel very comfortable as soon as I stepped into the door. I'm glad I got the job. I can't believe I didn't find this company before!", "Interview Questions": "Tell me about your previous experience that has to do with your customer service skills and how you went above and beyond for that person?"}, {"date": "1 Feb 2021", "title": "Medicaid Service Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at MJHS (New York, NY) in Jan 2019", "Interview Descriptions": "Excellent questions. Kind process. A skills test was also completed on microsoft and excel\r\nThe company facility was nice and the interviews was not very long. Touched bases on education and work experience. Inquired about my earliest start date.", "Interview Questions": "How would you handle an upset client"}, {"date": "27 Nov 2018", "title": "RN Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MJHS (Brooklyn, NY) in Nov 2018", "Interview Descriptions": "Phone Screening, In person interview, and Reference Check. The overall interview is fair, you meet with a recruiter followed by 2 managers, if they are considering to move forward with your application you are asked to submitted 5 references 3 of which are previous or current managers. I felt the process was a waste of time, not only for me but also for the people who provided references. After references are submitted then your application is reviewed and a decision is made. As for salary, even if they know they cannot fulfill salary expectations they will still have you interview and offer you a salary outside of your expected salary range. Their reasoning is salaries are based off years of nursing experience. Word of advice, if a candidate will be offered a salary less than what was expected please do not let your candidates go through the full application process. Also please consider asking for references after the job is offered.", "Interview Questions": "Tell me about your current role"}], [{"date": "23 Oct 2018", "title": "RN Case Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at MJHS (Brooklyn, NY) in Oct 2018", "Interview Descriptions": "First I had an interview with HR. The lady was very nice professional and polite. Second interview was with the clinical director and with another person who never introduced herself and was on her cell phone in the beginning", "Interview Questions": "Why would I like to work for them? How did I solve a complex situation? What did I do in the past when there was a house with bed bugs?"}, {"date": "1 Jul 2018", "title": "Member Services Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MJHS (Brooklyn, NY) in Jun 2018", "Interview Descriptions": "You get to a computer room where you will be tested on your skills. The computer tests are based on Word, Excel, and a typing test. You will be required to have 5 references if hired from 3 bossess and 2 coworkers.", "Interview Questions": "Why do you want to work for the member services position?"}, {"date": "19 May 2018", "title": "Appeals Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at MJHS", "Interview Descriptions": "No stress interview, started on time. Entire interview with HR and department was a little under 2 hours in which they tell you ahead of time. Very professional staff.", "Interview Questions": "Questions weren't difficult. \"Tell me about yourself\" is the question some find challenging because where do you start with that one."}, {"date": "8 Feb 2018", "title": "Network Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at MJHS (Brooklyn, NY)", "Interview Descriptions": "Responded to a job posting.  Met with a manager to go over my background.  Did not have a technical interview at that time. Manager was concerned with skills to back up his more senior staff.", "Interview Questions": "What is your typical day at work like?"}, {"date": "6 Apr 2018", "title": "Benefits Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at MJHS (Brooklyn, NY) in Feb 2018", "Interview Descriptions": "I interviewed with 2 individuals, the district sales manager and regional director of sales, both of whom like my interview and invited me to meet with the vp of sales. During the interview with vp, he kept chastising me about the duration of my work history, \"why did you only stayed there for only 2 years, etc.\" Once the interview was over, he made no guarantees I would be hired. Several weeks went by, and again I was invited for another interview this time with a recruiter. After the interview the recruiter sent me an email requesting 5 references, that included 3 prior managers. At this stage in the process, I was convinced I was a 'shoe-in' for the job. I contacted my references, (all of which were happy to vouch for me) and submitted it to the recruiter. Several days go by without so much as a phone call from anyone in the company so I took the initiative and called the recruiter, who informed me that he was waiting on some feedback from the director of sales, that I needed to do nothing else and await a response.  I waited several more weeks with no word for the anyone within that organization, I once again contacted them, this time the district sales manager (whom was very pleasant to talk too.) after taking several deep breaths, he finally said the company had decided to go with someone else!! I felt like someone punch me in the stomach! Why in the world would this company sucked me into thinking I had the job and then blow the air out of my bubble? As a final warning to any potential interviewee to this organization, do your homework about this company, don't fall into any false promises of employment. And most of all if you fall into the same trap I did, run away as fast as you can.", "Interview Questions": "why did you leave your jobs after only a short amount of time?"}, {"date": "2 Jan 2018", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MJHS (Brooklyn, NY)", "Interview Descriptions": "Screening call via phone\r\nIn person interview with HR\r\nIn person interview with Key Stakeholder and then Interview with C-level exec\r\nWas not a difficult or involved process but the individuals were disingenuous", "Interview Questions": "Describe your experience"}, {"date": "4 Apr 2022", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at MJHS (New York, NY) in Jan 2018", "Interview Descriptions": "Initial interview with HR Manager. Then interview with Hiring Manager. The process is quick . The level of work expectation is not reported at interview . Staff is set up to fail.", "Interview Questions": "Tell us how you deal with difficult people "}, {"date": "5 Mar 2018", "title": "PMO Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at MJHS (Brooklyn, NY) in Dec 2017", "Interview Descriptions": "The process initially started out great. I was contacted by an HR rep for the PMO manager opportunity.  I had an initial phone screen and was scheduled to meet with the SVP to discuss the role. After meeting with her, she recommended for me to come back for a second round of interviews, this time including a case question. This is where the process went bad. The HR rep who had initially recruited me for the role ended up leaving the company and I was told that a new HR person would be handling my file. I didn't think anything of it since I already made it to the final round of interviews and hopefully would do well enough for an offer to be made. The round of interviews went well and I was subsequently emailed a reference form to fill out and send to 5 professional references.  On this email was when I noticed that the role on the reference form was a completely different role than what I had interviewed for. Confused, I contacted the new HR rep who was completely unprofessional. I emailed him inquiring about the mishap...no response. I would call...no response. Finally over a week later he responds saying \"we feel that you are better suited for this other (junior) role.\" Mind you, I had never actually spoken to him before and the role was never discussed at any point in time during my interview process. I even contacted the former HR rep and he confirmed that I was only being considered for the role that I had interviewed for. After asking the new HR rep to confirm with the SVP, he then lied and said that he had verified this information. Still confused, at with no other options at this point, I contacted the SVP myself to confirm what was going on. Mind you, I had already spent about a month or so interviewing for this role. She then confirmed my position and stated that I was not being considered for the role that the HR rep mentioned and that basically he was incorrect. She asked me to continue filling out the reference sheet, and that she would correct the mishap. I then sent out 6 professional references, urging them to write my references quickly in order to speed up the process. After getting them all to submit within about a day or 2, I then waited another 2 weeks to hear back from HR. Only to get an automated email stating that I was no longer being considered for the junior role! (nevermind the fact that it was still referencing the incorrect role). Confused, I emailed the HR rep who of course had no response. I suspect he was upset that I had gone over his head to contact the SVP . I then contacted her again and then was told that \"I was actually been considered for the correct role still, but that because I contacted her, it showed poor judgement and now I wouldnt get the role\". Crazy. One of the main rules as a PM is to escalate when decisions must be made and the individuals at the table are not able to make these decisions. I have no idea what she would expect anyone to do when they have spent between 1-2 months of their time interviewing for a particular role and then HR is so out of wack that they have you slated for a completely different role and are lying about validating this information rather than just taking the time to validate and rectify it. This experience let me know that MJHS is just messy and unprofessional.", "Interview Questions": "Describe a weakness"}], [{"date": "12 Jun 2018", "title": "Managed Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at MJHS in Sept 2017", "Interview Descriptions": "I went through a staffing agency who book the interview. I interviewed at their site where I would potentially work. There was a few questions and I was hired right after. I did the routine blood work and back ground check.", "Interview Questions": "Describe your last job."}, {"date": "18 Jun 2016", "title": "Managed Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MJHS (New York, NY)", "Interview Descriptions": "Applied online process took a few days...got a call for a quick phone screening from hr who asked about my previous experience and was told that I will get a call back the following week...got the call and was asked to come in for an interview..when I arrived to the interview  first I had to take an assessment test(typing,Microsoft word and excel) then interviewed with hr after with department manager who was very nice I must say, we talked for most of the interview she was basically telling about the job and what is expected, she ended the interview by telling me she loves me already and can't wait to work with me!!! I knew I had the job already 😉", "Interview Questions": "What do you know about MJHS?"}, {"date": "19 Jun 2016", "title": "Hospice and Palliative Care Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MJHS (New York, NY) in Jun 2016", "Interview Descriptions": "Applied online. Brief 5 min phone interview. Went into NYC office to meet with hiring manager and social worker manager. Before 2 interviews, took a brief \"test\" to describe what I would do in a particular situation. Interview ran smooth, was just myself, very comfortable. Great company!", "Interview Questions": "Why hospice? Why now?"}, {"date": "22 Mar 2016", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at MJHS (Brooklyn, NY)", "Interview Descriptions": "Called, they told me to apply online. went to the site. It was easy to navigate. Once I applied I made an arrangement for a 1:1 meeting. Very pleasant. . . . . . . . . . . . . . . . . . . . . . . . .", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "22 Nov 2015", "title": "Coordinator of Care Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at MJHS (New York, NY)", "Interview Descriptions": "Very quick process on boarding was completed online. After interview email was sent requesting references, then once completed and valid an offer was provided on the telephone within a few days. Information was conveyed through email and log in provided.", "Interview Questions": "What is your responsibilities at your current position?"}, {"date": "3 Sept 2015", "title": "Human Resources Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at MJHS", "Interview Descriptions": "Went in via a staffing agency. I Interviewed with Human Resources director who I would be working other. Answered the basic interview questions, but it was mostly a conversation. Felt like we hit it off, plus my experience matched what was needed.  Interview went well. I was offered the job a few days later.", "Interview Questions": "We talked about my background."}, {"date": "18 Oct 2015", "title": "Marketing Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MJHS (Brooklyn, NY) in Jul 2015", "Interview Descriptions": "it was very easy. hr was nice and moved very quickly with the hiring process. receive a call from hr asked about my experiences and set up interview the following week. met with the hiring manger who was very laid back and super sweet. he wanted me to move on the next phase and meet the directer of marketing. directer was unable to meet with me that day and had to reschedule for another day. meeting directer was very intense was not prepared for the way he approach me.(be prepared know what your going to say and be positive and firm). after a brutal experience with the directer he suggested hr to move forward with the hiring.i received an offer letter later that day.", "Interview Questions": "why did you leave previous job?  "}, {"date": "28 Jun 2015", "title": "Social Worker Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at MJHS (Brooklyn, NY) in Apr 2015", "Interview Descriptions": "First I met with the recruiter, who asked me some general questions such as why I would like to work for the company, my experience, qualifications, etc and then she introduced me to two clinical managers who further interviewed me. They described the position and responsibilities and asked me about my background, skills and previous jobs. Everyone was very nice and pleasant and I was pretty comfortable during the entire interview process.", "Interview Questions": "Your strengths and weaknesses"}, {"date": "10 May 2015", "title": "Credentialing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at MJHS (Brooklyn, NY) in Mar 2015", "Interview Descriptions": "Horrible. Person who interviewed me was extremely RUDE and unprofessional. Left there in tears! I couldn't believe a manager would be so unprofessional and rude to a candidate. I left thinking I wouldn't work there if they begged me to.", "Interview Questions": "Asked me questions not even related to credentialing."}], [{"date": "13 Jan 2015", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MJHS", "Interview Descriptions": "I interviewed with the Director of HR and I have to see that's one lovely lady. I was a little nervous at first but she made me feel at ease and very comfortable. So I was able to answer her questions with a clear head. The questions were very engaging, back and forth communication. The process was not very long. As soon as I was medically cleared, I started.", "Interview Questions": "Why did I want the job? \r\nNot unexpected or difficult, but if you don't know what you're interviewing for it's easy to mess up. The best advise I can give you is know what you're interviewing for. If you know and understand the job and you actually want to do it, the interview will go well!"}, {"date": "29 Dec 2014", "title": "CENTRAL OFFICE Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MJHS", "Interview Descriptions": "The interviews were great and easygoing but scheduling them were a nightmare. They took weeks to schedule a single interview. But then you go and you have a great experience so you don't dwell on the time lost. It's how they wheel you in. They make you a verbal offer and so begins an arduous hiring process. It was terrible. After taking weeks to schedule multiple interviews, HR took several more weeks to submit the official offer and start date. All the while you stop looking because they tell you over the phone the position is yours and give you a possible hire date. Date come and goes with no communication. Before you know it they have pushed off you're hire date several more weeks and you can't do anything about it because you've already stopped looking and/or declined other potential offers thinking you were going to start work soon.", "Interview Questions": "Where do you see yourself in ten years?"}, {"date": "5 Oct 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at MJHS (Brooklyn, NY) in Sept 2014", "Interview Descriptions": "Submit resume and called in for interview\r\nGeneral nursing questions meet with upper nursing management. Not too stuffy easy especially if you have some experience. They like enthusiasm. They do hire without experience also.", "Interview Questions": "Why did you want to become a nurse?"}, {"date": "13 Mar 2016", "title": "Home Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at MJHS (Brooklyn, NY) in May 2014", "Interview Descriptions": "the interview was casual, you take a computer IQ test with HR, you meet with HR and then you will meet with the head of the department you are applying for.", "Interview Questions": "N/A"}, {"date": "13 Nov 2013", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MJHS", "Interview Descriptions": "2 step interview process focused on experience with high volume recruitment.", "Interview Questions": "There were no difficult questions. They were are straight forward."}, {"date": "29 Jan 2016", "title": "Clerical Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at MJHS (Brooklyn, NY) in Jan 2013", "Interview Descriptions": "The first interview was conducted with the department head. After that, the candidate is interviewed by an HR personnel. During the interview process, computer aptitude with Excel and Microsoft is measured, Successful completion of the test is compulsory.", "Interview Questions": "How do you see yourself fitting with the company?"}, {"date": "13 Dec 2013", "title": "Manager Business Initiatives Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at MJHS (Brooklyn, NY) in Jan 2012", "Interview Descriptions": "Internal candidates within the company can apply for the position. With the approval of their current Supervisor, the candidate then applies for the position and based on the support of their Supervisor and the SVP, the candidate is then approved for the job/position. Once the candidate accepts the offer and the salary proposed, he/she then begins the new position within 2-3 months.", "Interview Questions": "Why do I want the position? Seriously!"}, {"date": "18 Sept 2012", "title": "Analyst Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at MJHS (Brooklyn, NY) in Feb 2009", "Interview Descriptions": "First contacted by HR to discuss prior work experience, specifically in the health care industry.  Some scenario-type behavioral questions asked, but nothing too difficult.  After this interview, I met with two managers to discuss experience and further scenario questions [situation to show strength, weakness, problem employees].", "Interview Questions": "How would you handle a problem with person 'X'?"}]]