[[{"date": "5 Jun 2023", "title": "Network Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The University of Vermont Medical Center (Burlington, VT) in May 2023", "Interview Descriptions": "Virtual interview invite from HR, followed up with request for multi-part interview in person, with two different sets of interviewers. Invited back for third and final interview with two executive level individuals. Received email thereafter requesting I be available for a call. (the \"we've gone another direction\" call)", "Interview Questions": "How do you cultivate trust and how do you know you are doing a good job?"}, {"date": "15 Mar 2023", "title": "Call Center Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The University of Vermont Medical Center", "Interview Descriptions": "Telephone followed by in person. Smooth and just be yourself. Likely to see if you are personable. STAR method questions. Overall a low stress interview. And they get back to you quickly.", "Interview Questions": "Tell us about a difficult situation and how you overcame it."}, {"date": "8 Jun 2022", "title": "Talent Acquisition Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The University of Vermont Medical Center", "Interview Descriptions": "It was a digital interview with the current coordinator and the manager.  They asked appropriate question and provided time for questions at the end of the interview.  The interview did not feel rushed, and I felt my answers were valued by the hiring team.", "Interview Questions": "How do you handle multitasking and high stress situations."}, {"date": "3 May 2022", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The University of Vermont Medical Center (Burlington, VT) in Dec 2021", "Interview Descriptions": "Applied online, took about 2 weeks for a response. Did a pre-recorded questions and answer through Microsoft Team. Week later got an invitation for an interview with hiring manager and team.", "Interview Questions": "Why do you want to work here?\r\nHow do you resolve conflicts?\r\nHow would your manager describe you?\r\nHow would your coworkers describe you?"}, {"date": "25 Oct 2021", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at The University of Vermont Medical Center", "Interview Descriptions": "The interviewers were pleasant to speak with. It was a very fast paced working environment. Be very prepared with your interview questions and make sure to have questions of your own.", "Interview Questions": "Where do you see yourself in 5 years? "}, {"date": "19 Aug 2021", "title": "Talent Acquisition Sourcer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at The University of Vermont Medical Center in Aug 2021", "Interview Descriptions": "I had two virtual interviews, the first with the supervisor and the 2nd with two employees in the HR department. The interview with the supervisor went well, she had a list of questions to ask and the interview was more structured, more professional. The interview with the two employees wasn't. One of the employees seemed disinterested, I didn't get a good vibe from her. They hadn’t looked over my resume before the interview either, which for HR professionals that’s not a good practice. It seemed like they were asking questions off the top of their heads, some of which could’ve been answered if they had looked at my resume beforehand. I was told they’d “be in touch” about next steps. While I was visiting their website a few weeks after the interview, I saw they reposted the position. Then they got back to me a few days later about their decision.", "Interview Questions": "What’s your experience with social media?"}, {"date": "26 Jul 2021", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The University of Vermont Medical Center (Burlington, VT) in Jul 2021", "Interview Descriptions": "It is a recorded video interview, which means your answers are recorded instead of a virtual meeting with recruiter. You will have 10 second to think about your answer and 20 second for preparation of presenting your answer.", "Interview Questions": "Please introduce yourself\nHow are your friend describe you?"}, {"date": "20 Jul 2022", "title": "Accounting Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The University of Vermont Medical Center (Burlington, VT) in Jul 2021", "Interview Descriptions": "The process was done online. I did not speak with a person. I left a video to each question provided. You were given 2 minutes to answer each question. the Question came from a posted video from the recruiter.", "Interview Questions": "What are your Salary requirements?"}, {"date": "4 Mar 2021", "title": "LNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The University of Vermont Medical Center", "Interview Descriptions": "I did a video interview with recorded questions and answers first,  and then did a live interview with the nurse manager, assistant nurse manager, and nurse educator. The questions were straightforward - nothing tricky.", "Interview Questions": "Why I wanted to be an LNA."}, {"date": "21 Jan 2021", "title": "Nurse Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The University of Vermont Medical Center", "Interview Descriptions": "a 4 week process containing 1 video interview by HR and 3 individual department interviews, 5 references are needed from previous supervisors, standard interview questions, each interview is 30 minutes long", "Interview Questions": "What is a weakness that you have?"}], [{"date": "29 Sept 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The University of Vermont Medical Center in Sept 2020", "Interview Descriptions": "Easy going, interviewed with two unit managers (site coordinator)\nThere were mostly behavioral/emotional intelligence questions\nAsked about previous healthcare and work experience and why I wanted the position at their clinic", "Interview Questions": "How do you deescalate patients who are upset?"}, {"date": "29 May 2020", "title": "Applications Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at The University of Vermont Medical Center (Denver, CO) in Apr 2020", "Interview Descriptions": "First there is an HR screening, then interviews with managers, then group interviews.\n\nEveryone is very kind and the benefits seem fantastic, but be sure to get clarity regarding salaries early on. There was a lot of confusion between what HR led me to believe in the first interview versus what I was ultimately offered in the last interview. After six weeks and many interviews I was very disappointed/saddened and felt misled by the HR recruiter once the final offer was made to me. There’s also no room for negotiation at all, it felt very “take it or leave it.”\n\nAlso, the higher pay scales listed here for IT aren’t accurate (or UVMHN has reduced their pay scales); senior level analysts/professionals cap out at the bottom of market value, especially for Epic analysts.\n\nWith that said, the organization seems to compensate fairly for professionals with 2-5 years’ experience. If you have more than that, the salaries flatten significantly and it appears you’re locked into a certain pay grade. Advanced degrees hold no value in salary negotiations.\n\nFinally, the relocation package is very small, with I believe a cash payout (I believe of 1k) followed by receipt submissions up to about 5k.\n\nIf you’re in Vermont already the pay may be adequate. If you’re open to relocation to many places and would like to work with Epic, there are currently numerous positions listed throughout the country (some remote) that offer better compensation and similar benefits.", "Interview Questions": "What are your weaknesses/strengths?"}, {"date": "29 Oct 2019", "title": "IT Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The University of Vermont Medical Center (Burlington, VT)", "Interview Descriptions": "good it was a bit unhuman it all started with video interview they can't even take the time to talk to you. I feel like a number and not a human when they do this.", "Interview Questions": "good it was a bit unhuman it all started with video interview they can't even take the time to talk to you"}, {"date": "18 May 2021", "title": "Logistics Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at The University of Vermont Medical Center (Burlington, VT) in Sept 2019", "Interview Descriptions": "First a phone screening call.\nFollowed with an interview call with 2 others. They asked me about myself and then launched into questions. I did not get the job as they 'hired' from within. I have the feeling this job was written specifically for someone already on staff.", "Interview Questions": "Tell us about your relevant experience "}, {"date": "27 Feb 2020", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The University of Vermont Medical Center (Burlington, VT) in Jun 2019", "Interview Descriptions": "Video interview and then in person. Met with 3 supervisors in-person and when over resume. Was asked about my relationship with others and how I respond to issues and pressure.", "Interview Questions": "How do you respond to pressure?"}, {"date": "14 Nov 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The University of Vermont Medical Center", "Interview Descriptions": "Not very good. You can tell they're desperate for nurses. I applied for 4 positions and got calls for each and single one of them. It was pretty easy to get a job.", "Interview Questions": "When I'd be ready to start"}, {"date": "31 Aug 2018", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The University of Vermont Medical Center (Berlin, VT) in Aug 2018", "Interview Descriptions": "Met for 20-30 minute intervals with 5 different physicians, an NP, and the practice manager.  It was a total of 3 hours long.  It was a very streamlined process and didn't involve the hospital tours and other unnecessary steps that many other interviews entailed.", "Interview Questions": "Where do you see yourself in 5-10  years"}, {"date": "3 May 2018", "title": "LNA Inpatient Rehab Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The University of Vermont Medical Center (Burlington, VT) in Apr 2018", "Interview Descriptions": "Very friendly interviewer. Laid back and relaxed. Didn't realize that I was not an RN and thought I was interviewing for a different position, but very chill. There was only one interviewer and he offered me a tour at the end of my interview.", "Interview Questions": "Tell me about your work? "}, {"date": "23 Jan 2018", "title": "Practice Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The University of Vermont Medical Center", "Interview Descriptions": "One sided video interview which was  the first step. Straight forward generic questions. Nothing related to the particular job but more for the leadership capabilities. The questions were given 2 mins to answer. There was the option to repeat the question and 30 seconds to prepare your answer.", "Interview Questions": "Why UVM? Why are u looking to change jobs? "}], [{"date": "12 Jan 2017", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The University of Vermont Medical Center (Burlington, VT)", "Interview Descriptions": "I applied online and had a phone screening interview. I was brought in for a half day of interviews with numerous people in the department. The experience was very positive.", "Interview Questions": "Why do you want to work in healthcare?"}, {"date": "9 Jun 2016", "title": "Staff Nurse I - Intern In the Operating Room Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at The University of Vermont Medical Center (Burlington, VT) in May 2016", "Interview Descriptions": "General application online through UVM Health Career site. Applied April 7th, scheduled an interview May 18th.  In person interview panel, consisted of a four hour shadow with an OR RN and then a two hour interview with the OR Nurse Educator, Assistant Nurse Manager, OR Staff Coordinator, and a fellow intern currently in the final week of the program.", "Interview Questions": "Why do you want to work in the OR? How do you handle stressful situations? Positive patient experience, negative patient experience, how do you handle each? How do you handle personal and work conflicts? The general nursing interview questions, with a few OR specific."}, {"date": "10 Jul 2016", "title": "Radiation Safety Officer and Director of Nuclear Medicine Physics Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at The University of Vermont Medical Center (Burlington, VT) in Mar 2016", "Interview Descriptions": "I was interviewed by all the physics staff, by the chair of radiology, and by the radiology department's administrative director.\r\n\r\nAfter being offered the position verbally and by email, 3 days later it was rescinded by HR. Their reason was that I was \"too aggressive in negotiating for a higher salary\".", "Interview Questions": "What was my management style."}, {"date": "17 Sept 2015", "title": "Licensed Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The University of Vermont Medical Center (Burlington, VT)", "Interview Descriptions": "Started off with a phone interview with a Human Resources Recruiter and was asked some basic interview questions. I heard back a week later and was asked to come in for an in person interview on the unit of my choice. After the interview I heard back 2 weeks later and accepted the position.", "Interview Questions": "Basic interview questions."}, {"date": "20 Jun 2015", "title": "Practice Support Specialist-Dermatology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The University of Vermont Medical Center", "Interview Descriptions": "I applied online for the position and received a call a week or so later from the supervisor of the clinic. She three short screening questions then asked when I could come in for an interview that week. I came into the clinic a few days later and met with the supervisor of the clinic. First she asked me to tell me a little bit about myself. She followed that question with questions about my past customer service experience, my strength and weakness, why I wanted this position and where I thought I would be in the next five years. Then I was showed around the two clinics and introduce to many of the PSS staff by the operation support specialist and the interview was over. This interview occurred early in the morning and I received a call offering me the position that afternoon.", "Interview Questions": "What is your past customer service experiece?"}, {"date": "14 May 2015", "title": "Patient Financial Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The University of Vermont Medical Center (Burlington, VT) in May 2015", "Interview Descriptions": "Prompt, descriptive, informational and interactive. Asked questions pertaining to team work, accountability, responsibility and prior experiences. Asked how one resolves conflict, discussed benefits, team morale activities and job description. \r\nVery detailed and knew this is what I wanted after interview had begun.", "Interview Questions": "why do you want to work here?"}, {"date": "31 Aug 2017", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The University of Vermont Medical Center (Burlington, VT) in Feb 2015", "Interview Descriptions": "I had the interview in the office of the Supervisor, and then was taken on a tour around the entire office, being introduced to various people. I might have been hired on the spot, but cannot remember.", "Interview Questions": "How I would handle a conflict between a co-worker and myself. "}, {"date": "27 Feb 2018", "title": "Food Service Worker II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The University of Vermont Medical Center (Burlington, VT) in Aug 2014", "Interview Descriptions": "First you apply through there website and wait for call to set up an interview. Meet up with the supervisor and they do some basic question, really easy going, and follow up some customer service question and probably some emergency situation question. And once you are done with all that they will either send you an email or call you to tell you weather you are in or not.", "Interview Questions": "What do you think is the most important in this department?"}, {"date": "21 Jun 2016", "title": "LNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The University of Vermont Medical Center (Burlington, VT) in Oct 2012", "Interview Descriptions": "3 to 1 interview, lots of questions regarding stressful situations, and past experiences. They were more intrigued about how I would handle situations, rather than what experiences I had in the past. They also wanted to know what my availability would be for floating, and/or per diem work.", "Interview Questions": "What would you do in a situation where you had multiple nurses requesting your help?"}], [{"date": "27 Sept 2012", "title": "Applications Analyst Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The University of Vermont Medical Center (Burlington, VT) in Jun 2012", "Interview Descriptions": "Phone interview by recruiter. Read from a sheet of standard interview questions about team experiences that didn't apply to my former job.  Difficult to convey who I was and what I did. A real conversation would have been more meaningful for both them and me. Left no room for that discussion. Recruiter in HR didn't understand what the job is or does. \r\n\r\nWhy do you want to work here?\r\nCan you give me an example of when you were on a team and how you got others to go along when they didn't want to? (We didn't have teams)\r\nMultiple other team oriented questions. \r\nWhat are you most proud of?\r\nEtc.", "Interview Questions": "Google \"standard interview questions\" and you'll know what to expect. "}, {"date": "3 Dec 2014", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at The University of Vermont Medical Center in Dec 2011", "Interview Descriptions": "Interview process was intense for IS.  They have you meet over the phone, in person with a manager, then meet with the entire team to which you're applying.  Be sure to be prepared to answer off the cuff questions, unrelated to the job you're seeking.  They like to throw you off the path you would expect when interviewing.", "Interview Questions": "Technical questions regarding system operations I wasn't prepared for."}, {"date": "15 Feb 2010", "title": "Director of Provider Relations Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The University of Vermont Medical Center (Burlington, VT) in Jul 2009", "Interview Descriptions": "Started off poorly, with me waiting for the person at the wrong place. The administrator who arranged the lunch meeting did not clearly set up the meeting point between myself and the interviewer. After we did connect, the lunch meeting with 3 people went well overall. The next step was a panel interview with 2 other people who would have reported to me. One person in particular, I found to be unpleasant as if she had her mind made up. \r\n\r\nI realize that the candidate selected had experience and connections that FAHC needed over other candidates. I'm not sure if that person is still functioning in that capacity or not.", "Interview Questions": "Multiple questions asking for examples of business case and problems and how I handled those situations."}, {"date": "6 May 2013", "title": "Staff Nurse II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The University of Vermont Medical Center (Burlington, VT) in May 2009", "Interview Descriptions": "Online application then an interview with management and the nurse educator.  It's been a while so I'm not sure if current practices have changed.  I remember going to HR first to look at the job title and doing an initial interview.  Then going to the main campus to interview with the manager of the floor I wanted to work on and meet some of the staff.  The I met with the nurse educator.", "Interview Questions": "How can you add to this organization?"}]]