[[{"date": "25 Jun 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Women’s College Hospital (Toronto, ON)", "Interview Descriptions": "Straight forward, asked questions about experience and research projects. Skills relevant to the job. experience with SAS and interviewing participants. panel, 2 interviewers. 20 min. casual/professional. very simple, not too hard.", "Interview Questions": "What is your experience with statistical software?"}, {"date": "26 Jun 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Women’s College Hospital (Toronto, ON) in Jun 2023", "Interview Descriptions": "A pre framed set of questions, mostly the steps involved in literature review, recruitment, time management. Interview was full of technical details involved in a research and also most of the questions were scenario based.", "Interview Questions": "Scenarios where one of the participants are not able to participate in the meeting, what can be done?"}, {"date": "16 Jun 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Women’s College Hospital", "Interview Descriptions": "they were friendly and asked some questions about my experience and education.  there were a hiring manager and supervisor of the project in the interview.  I did not feel any tension during the interview so  I could feel relaxed and explained well.", "Interview Questions": "talk about your education and experience? "}, {"date": "25 Jun 2022", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Women’s College Hospital (Toronto, ON) in May 2022", "Interview Descriptions": "To start off with HR was extremely unprofessional. I was given not even a 2 business day window to prepare or offered alternative days or times for the interview. The panel was nice but the hiring manager implied I was not qualified for the position all the way at the end of interview despite having seen my resume prior to the interview and choosing me themselves so it was a complete waste of time. They also threw in curveball questions that typically the candidate asks the hiring team which was very odd. HR was extremely unresponsiveness when I followed up at the 1-week and 2-week mark and, the hiring managers didn't even respond to a thank-you email. Then finally after 3 weeks told me I didn't receive an offer through an automated no-response email with no feedback either. Extremely poor and unprofessional conduct toward candidates it seems.", "Interview Questions": "What would success look like to you at the 3-month, 6-month and 1-year mark in this position? "}, {"date": "8 Jul 2021", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Women’s College Hospital (Toronto, ON) in Jun 2021", "Interview Descriptions": "Applied and was contacted two weeks after posting was closed. Got an email and was told to pick an interview time (scheduled 1 week later) through their HR system. Received a confirmation and Teams meeting invite right away and could see who would be interviewing. Interviewers were very welcoming and casual and questions were relevant. Interview was scheduled for an hour. Within less than a week, I was contacted by HR for references. HR recruiter was very organized and kept me updated.", "Interview Questions": "Tell me about your education and career background"}, {"date": "24 Mar 2021", "title": "Covid Screener Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Women’s College Hospital", "Interview Descriptions": "A virtual zoom meeting. It was supposed to be a 3-to-1 interview but it ended but being a 1-to-1 as the 2 other WCH employees were busy. The interviewer was very friendly.", "Interview Questions": "How would you deal with a patient who is talking loudly about a health issue in line?"}, {"date": "10 Jan 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Women’s College Hospital (Toronto, ON) in Jan 2021", "Interview Descriptions": "I Applied online on October 2020. Was contacted 2 months later via email on Jan 2021. I had a Microsoft teams interview with research team.  The overall experience was okay, it lasted for 20 mins. Expect standard behavioral questions.", "Interview Questions": "questions related to:\nexample of attention to detail\nexample of independent work \nexamples of data analysis\nhow did you handle a difficult colleague?\n\n"}, {"date": "7 Oct 2020", "title": "Receptionist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Women’s College Hospital", "Interview Descriptions": "If you apply online, they contact you through email, and ask several questions about yourself. They also ask your location and how did you hear about thus job and so on.", "Interview Questions": "They ask you if you have certificates for administrative assistant "}, {"date": "9 Jul 2021", "title": "Admitting Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Women’s College Hospital (Toronto, ON) in Oct 2020", "Interview Descriptions": "I applied and within a couple of days got an interview. The interview was probably around 30 minutes with the director and another woman who I never saw during my time here.", "Interview Questions": "Tell us about a time you had a conflict with a supervisor and what would you do differently? "}, {"date": "24 Jun 2020", "title": "Project Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Women’s College Hospital", "Interview Descriptions": "Overall friendly - did a phone screening, case study/additional assessment, panel interview. HR did not provide any update even though they promised to update all candidates at a particular time. Followed up but no response. Unprofessional.", "Interview Questions": "How you would handle sensitive information."}], [{"date": "25 Aug 2022", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Women’s College Hospital (Toronto, ON) in Jan 2018", "Interview Descriptions": "Had three interviews in total with different department members at different levels. Each interview was held inside the department office. Completed a skills assessment assignment comprised of a editing assignment and a story/press release writing assignment.", "Interview Questions": "Q: Tell us about your previous work experience?\r\nQ: How do you approach and/or deal with conflict?\r\nQ: What are your greatest industry skills and weaknesses?"}, {"date": "18 Apr 2017", "title": "Summer Research Student Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Women’s College Hospital (Toronto, ON) in Mar 2017", "Interview Descriptions": "Very thorough interview, detailed. Be prepared to talk about the specific area of research you are interviewing for, and its impacts in the healthcare landscape. Show interest in broad healthcare issues. Read up on current events in the hospital and in the system. Be prepared to share your organizational and collaboration strategies.", "Interview Questions": "How would you handle competing priorities when a deadline is approaching?"}, {"date": "14 Dec 2017", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Women’s College Hospital (Toronto, ON) in Oct 2016", "Interview Descriptions": "Easy interview process. Took about 30 minutes. The volunteer coordinator asked about 10 questions or so.  Asked very basic questions such as why do you want to volunteer here, what makes you prepared to work in a fast paced environment, tell me about yourself, what position and department are you interested in.", "Interview Questions": "Based on your work/volunteer experience, how did it make you feel prepared to work in a fast pace environment? "}, {"date": "28 Jul 2014", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Women’s College Hospital", "Interview Descriptions": "I applied to a job posting on indeed.ca.  Several days later someone called me to schedule an interview for the following week.  The interview was with two people, a research assistant and a research associate.  The interviewers were very friendly and the questions were pretty standard, no surprises.  It took less than 30 minutes.  They explained that the second interview would be with the doctor leading the research study.", "Interview Questions": "They asked several situational questions: \"What would you do if the doctor asked you to get a full copy of a research report from another doctor you did not have any contact information for?\""}, {"date": "11 Jul 2015", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Women’s College Hospital (Toronto, ON) in Feb 2014", "Interview Descriptions": "Simple and straight forward.  The interview mainly focused on my previous experience, and examples of how I could perform in the current position.  The project was described well and in detail. I went for the first interview with the Research Associate who was short listing to 3 interviewees for the investigator.  Then I went for an interview with the investigator, where the project was discussed in detail, and my ability to perform in the position.  I got the offer 3 days after the 2nd interview, once references were checked.", "Interview Questions": "What would the biggest challenge be for you in this job?"}]]