[[{"date": "9 Jul 2023", "title": "Patient Representative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Asante", "Interview Descriptions": "Interview process is one sided. You create several videos answering prompts through a third party website. The site tells you that you have one try for each question and that only the saved videos are reviewed. This is not the case. All attempts are viewable. Not intuitive, no communication from HR after the interview either.", "Interview Questions": "Standard question bank used. Questions like what is your greatest weakness."}, {"date": "18 Jun 2022", "title": "Physician Assistant, PA-C Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Asante", "Interview Descriptions": "Phone interview with the head of the department, then in person interview with several staff in the department.  Got a feel for some possible future colleagues this way. Then lunch was provided and I was told I would hear back in 1-2 weeks. Didn’t hear back for 3-4.", "Interview Questions": "My experience and background qualifications "}, {"date": "12 Apr 2022", "title": "Legal Counsel Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Asante in Sept 2021", "Interview Descriptions": "After two months of more interviews, recommendations, and red tape than I can quantify,  they told me they’d have a decision within a week and then ghosted me. I met with at least 5 people, up to and including the GC, and not one of them bothered to tell me I hadn’t gotten one of the two positions they said I was a finalist for.", "Interview Questions": "Why do you want to work here?"}, {"date": "9 Apr 2021", "title": "IMCU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Asante (Medford, OR)", "Interview Descriptions": "Panel interview with director and managers of critical care unit. It is a 30 minute interview, they ask a series of questions and will let you know the offer letter.", "Interview Questions": "What is a common misconceptions people have of you?"}, {"date": "28 Apr 2021", "title": "Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Asante (Medford, OR) in Apr 2021", "Interview Descriptions": "Apply through applications, HR will then send you information on what to do next. They will use hirevue for you to do a 1 way interview. If they like your responses they will schedule an actual interview with you.", "Interview Questions": "Why do you want to work for Asante? "}, {"date": "13 Jul 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Asante (Grants Pass, OR) in Jan 2021", "Interview Descriptions": "I felt very comfortable with the interview process where the interviewer briefly described their background and asked several questions regarding past relevant personal and work related experiences. I had the opportunity to ask questions and also was given a timeframe to expect to be contacted by Asante for follow up.", "Interview Questions": "How I would handle personal experiences.........."}, {"date": "6 Apr 2021", "title": "Patient Registration Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Asante (Medford, OR) in Feb 2020", "Interview Descriptions": "Because of covid they send you a set of questions that you self record on a zoom plantform. If yoh do well qith those interview questions they email you and set up yet another zoom interview that is live. You meet with the director of that unit and it last about 30 minutes.", "Interview Questions": "different every time, depending on the interviewers "}, {"date": "2 May 2018", "title": "Nurse Resident Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Asante in Mar 2018", "Interview Descriptions": "I completed the Hirevue video interview for the New Grad Residency Program. This was the first interview in a longer process. Overall, they asked generic questions to get a better sense of who you are as a nurse.", "Interview Questions": "How has your clinical experience prepared you for this position?"}, {"date": "7 Jan 2016", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Asante (Medford, OR) in Jun 2015", "Interview Descriptions": "Strung me along in getting back to me after a lengthy interview process. When I emailed months later after my onsite interview they sent me a message back stating I was still in the running. It took several months later only to get a impersonal standardized reject email from HR.  No phone call or personalized email. This shows you that they don't care about people.", "Interview Questions": "Basic interview questions"}, {"date": "23 Oct 2015", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Asante (Medford, OR) in Aug 2014", "Interview Descriptions": "Very general interview process, typical interview questions. Standard process, phone screen, 1:1 manager interview and finally a panel. Discouraging when a manager tells you there's no room for growth in the initial interview. Very hard to truly understand what the potion entailed as interviewers are very vague.", "Interview Questions": "Standard behavioral questions."}], [{"date": "17 Feb 2016", "title": "Senior Continuous Improvement Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Asante (Medford, OR) in Dec 2013", "Interview Descriptions": "I had a phone interview screening, a second interview over Skype, and a third interview in person at Asante Health System in Medford, OR. The people who interviewed and made the offer to me was not the people I worked with after I started. The hiring VP was forced out and took another position. The department became very toxic after the leadership change.", "Interview Questions": "Tell u about one of the projects you lead."}]]