[[{"date": "1 May 2023", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at UNM Health Sciences Center (Albuquerque, NM) in Mar 2022", "Interview Descriptions": "The interview was a full day, with meeting various departments. I was well-fed and hydrated and everyone was very welcoming. Parking is challenging, but thankfully I was given a pass to park so I didn't have to navigate the construction.", "Interview Questions": "What is your teaching style with students?"}, {"date": "8 Mar 2019", "title": "Research Scientist III Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNM Health Sciences Center (Albuquerque, NM) in Dec 2018", "Interview Descriptions": "Applied shortly before closing date, interviewed two weeks later, interview was overall casual and without situational questions (\"tell me about a time...\"). Application required I submit a sample of computer/statistical coding.", "Interview Questions": "Data management skills, statistical experience, long-term plans"}, {"date": "9 Feb 2021", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at UNM Health Sciences Center (Albuquerque, NM) in Jun 2018", "Interview Descriptions": "I had to network to get my foot in the door and have my application looked at. All previous attempts were unfruitful. Once a connection was made, it was smooth sailing.", "Interview Questions": "How is your day going? "}, {"date": "27 Dec 2021", "title": "IT Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNM Health Sciences Center (UNM, NM) in Jul 2017", "Interview Descriptions": "Phone call and then an in person interview in front of a hiring committee then I waited for several weeks for a call back which I was offered your job", "Interview Questions": "Why do you want this position"}, {"date": "7 May 2017", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNM Health Sciences Center (Albuquerque, NM) in Aug 2015", "Interview Descriptions": "Panel interview with at least three people. You may be called for a follow up interview(s). You will be asked approximately 10 questions. Most are fairly standard job interview questions and sometimes they are phrased badly (not on purpose, just because the hiring manager writes them and no one in HR checks them)", "Interview Questions": "What was a mistake you made in a past job and how did you fix it?"}, {"date": "18 Aug 2014", "title": "Physician Assistant Faculty Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at UNM Health Sciences Center", "Interview Descriptions": "Detailed and opportunity to meet with other faculty. Group interviews, campus tours, questions were as expected. No real challenges to the interview. Hiring process takes a while as UNM Human resources are slow to move on items..", "Interview Questions": "Regarding no prior teaching experience."}, {"date": "5 May 2015", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at UNM Health Sciences Center (Albuquerque, NM) in May 2014", "Interview Descriptions": "Interview by phone initially.  Then in person with several people and was able to tour the department.  Very low stress interview overall.  The entire interview lasted about 3 hours.  Seems that as long as you are enthusiastic about the process, and have the credentials, everyone is willing to give you a chance.  There are always lots of opportunities posted to the website.  Everyone was very friendly.  Had to pay my way there though.", "Interview Questions": "Where do you see yourself in 3 years?"}, {"date": "27 Jan 2014", "title": "Medical Residency Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at UNM Health Sciences Center", "Interview Descriptions": "Applied on website. Interview process was 2 fold: first interview was with staff, second interview was with faculty with whom I would be working.", "Interview Questions": "Nothing out of the ordinary. All the questions are fairly standard and relate directly to the job posting or your qualifications. "}, {"date": "23 Oct 2015", "title": "RN Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at UNM Health Sciences Center (Albuquerque, NM) in May 2011", "Interview Descriptions": "It was an application through the online submission. I was contacted for an interview and had two. One of my interviews was with the supervisor staff and the other was with the floor staff. The first was somewhat intimidating but still they made me to feel as comfortable as possible.", "Interview Questions": "Tell us what you know about our Magnet journey and what you will do to help."}, {"date": "23 Jan 2015", "title": "Manager of Division Support Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at UNM Health Sciences Center in Feb 2011", "Interview Descriptions": "Detailed and opportunity to meet with team. Group interviews, campus tours, questions were as expected. No real challenges to the interview. Hiring process takes a while as UNM Human resources are slow", "Interview Questions": "None - all questions were very basic"}]]