[[{"date": "16 May 2023", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Florida Technical College (Orlando, FL)", "Interview Descriptions": "Super easy, Introduction, Group interview with Dean, director, assistant director, and other program coordinators. Discussed daily activities and tasks supposed to do. Weekends required. 30 mins on the points. Discussed teaching style.", "Interview Questions": "Intro/ Experience and how it would approach retention students."}, {"date": "19 Oct 2022", "title": "Financial Aid Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Florida Technical College", "Interview Descriptions": "This place makes three different interviews per candidate. In my experience, each one lasted over 45 minutes. I consider that it is \"a little bit too much\" for a position that pays less than $18 and doesn't even requires college degree.", "Interview Questions": "Personality, experiences, strengths, expectations, and familiarity with the \"Financial Aid world\"."}, {"date": "29 Aug 2022", "title": "Director of First Impressions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Florida Technical College", "Interview Descriptions": "The interview process for this position is fairly simple and standard. I would just do research about the company and basic interview questions. This position is entry level which is probably why the interview isn’t strenuous.", "Interview Questions": "If you could be an animal what animal would you be?"}, {"date": "27 May 2021", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Florida Technical College", "Interview Descriptions": "Multiple different steps. Talked to 3 different people within one week, before going in for a \" Meet and Greet\". They are in the process of reconstructing one of their departments so couldn't give me direct answers on what certain requirement were", "Interview Questions": "Q: What is your experience with B2B?"}, {"date": "13 Aug 2020", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Florida Technical College in Jun 2020", "Interview Descriptions": "FTC was a great choice I've made in awhile! The minute you walk in the doors you feel like you're at home. There is so much positivity and everyone is willing to help you. The transition into this field has been pleasant, and the administration has been very thorough on their process.", "Interview Questions": "Tell me about yourself? "}, {"date": "22 May 2018", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Florida Technical College (Kissimmee, FL) in Feb 2018", "Interview Descriptions": "Submitted my resume and was contacted by HR for a screening interview, which was very professional and personable. There was then a follow-up contact to schedule a face-to-face interview. I arrived for the interview and was greeted professionally and given an application to complete. The hiring manager came out to greet me as well and was very warm with excellent energy. The interview itself was thorough, though I was at ease and very comfortable.", "Interview Questions": "Could I tell them about a time I made a mistake at work?"}, {"date": "14 Mar 2018", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Florida Technical College (Jacksonville, FL) in Aug 2017", "Interview Descriptions": "Meet with director and all other members of the admissions team individually. Provide you with a tour and talk to you that way. They will hire you within days if you do a great job. Interview process is informal for the most part.", "Interview Questions": "not many except to see if you have hold a good conversation"}, {"date": "15 Aug 2017", "title": "Teacher Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Florida Technical College (Deltona, FL) in Sept 2015", "Interview Descriptions": "First, there was a phone screening process. I was the invited to an interview by email. It was an in person interview. I waited in the lobby and then the person in charge met me there and took me an office space with cubicles. We sat in a large table with a panel of four professors. Only two of them asked me questions.", "Interview Questions": "What do you bring to the table?"}, {"date": "12 Apr 2016", "title": "Admissions Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Florida Technical College (Deland, FL) in Jan 2014", "Interview Descriptions": "it was a group interview with 8 people. with a series of questions and information about the job and what they are looking for. We were then asked about our skills and experiences.", "Interview Questions": "Why they should give me the position."}, {"date": "3 Oct 2017", "title": "Admissions Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Florida Technical College in Apr 2013", "Interview Descriptions": "Applied by sending resume and then filling out paper application at location. Called back 2 weeks later. Interview was done in a group setting with two other individuals aside from Director.", "Interview Questions": "What are some qualifications that I possess that can be used in the position. "}], [{"date": "15 Dec 2016", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Florida Technical College (Kissimmee, FL) in Aug 2012", "Interview Descriptions": "Standard interview followed by a test teach. They bring in a panel of other instructors and have you give a demonstration of your teaching skills. Afterward they vote on it based on how well they liked your performance. There were set times more than one applicant there at a time. It would definitely put some of them on the spot.", "Interview Questions": "What you would do to help a struggling student and keep them chiming back?"}, {"date": "11 Mar 2014", "title": "Teacher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Florida Technical College (Deland, FL) in Oct 2010", "Interview Descriptions": "Interviewed with the Director of school, then was interviewed by Dean of students, hired and started teaching the next Monday, no training or orientation.", "Interview Questions": "Why do you want to teach for a living."}, {"date": "10 Dec 2012", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Florida Technical College (Orlando, FL) in Jun 2010", "Interview Descriptions": "there are 3 interviews. one in with the dean and lead. the second is with a few professors where you present what you are going to teach. the final is with the dean again so you can work out pay", "Interview Questions": "what do you do about unruly students? are you a good manager of classrooms. "}]]