[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great work environment for educators and students", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Nov 2021", "job_title": "Instructor Cosmetology in Seattle, WA", "duration": "N/A", "pros": "Amazing company to work for. Excellent organization and family owned. Enjoy fellow coworkers and coming to work is a joy. Management is superb and are open to growth for every employee.", "cons": "Would like to make more per annual salary. It's a tough salary for a single person. One needs a side job to supplement the cost of living."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "10 years + Best Place Ever!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "26 Mar 2021", "job_title": "Educator in Everett, WA", "duration": "N/A", "pros": "I have been with this company for 10+ years and the leadership is anything short of amazing. During the COVID Crisis this past year, Evergreen did not lay off a single employee while our industry furlough their workforce. The Family that owns this company truly treats us like family. Their commitment to us is incredible and that is why people here stay. I am proud to represent this company and believe in work that we do.", "cons": "Every company has it's challenges but this company is top notch. Yes, there are challenges but they listen to us and improve."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "10 Years and still going!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "22 Aug 2017", "job_title": "Campus Director in Everett, WA", "duration": "N/A", "pros": "I have been working here for the last 10 years and can honestly say that I am looking forward to many more!   This company is not perfect, just like every other company.    We have our challenges, but we work through them.  I started off at the front desk, then worked my way to become an educator and now am a campus director.   The team that surrounds me wants to get better, and believe that we deserve a great place to work ... and we work towards become better and creating a great environment.  We have been voted Top 100 Companies to Work For by Seattle Business Magazine for the last four years.   We can still get better. \r\n\r\nReading through the reviews on Glassdoor reminds me that we make the environment that we work in.    I'm proud to say that the other reviews on here are true;  Evergreen is a great place to work, but the organization does demand that you take your work seriously and am committed to taking care of the students (our customers).", "cons": "Feedback can be to direct to help us to grow. With that being said if you are more on the sensitive side this may be an adjustment you need to get use to."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Love my team!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "2 Jun 2017", "job_title": "Director in Everett, WA", "duration": "N/A", "pros": "I love how the leadership team takes a direct interest in our development. There is a strong focus on employee growth both   professionally and personally. Professionally, there is monthly one-on-one coaching for us to get better at our jobs.  It's great to have your supervisor take a sincere interest in your success. Personally, there is a five-year personal development plan for each of us.  They also have a Health and Wellness package where there is a monthly allowance for gym memberships, kickboxing, yoga, etc. It's family owned and feels that way.  I feel very blessed to have been here for over 10 years.", "cons": "You have to believe in the purpose of your work and mission.  Working in education not easy; students don't appreciate you until after you graduate.  When they come back and share with you their success, it's totally worth it.   I am thankful for my team and knowing that I am part of a greater purpose."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Back to the basics: great culture, great people!", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Aug 2016", "job_title": "Program Coordinator in Everett, WA", "duration": "N/A", "pros": "Evergreen Beauty College cultivates a strong family and positive environment for staff, educators, students (prospective, current, & graduates), and clients. There are many great creative events, networking and community service opportunities available to get involved with annually. \r\n\r\nYour professional/personal development is important to Management. The EBC staff and educators are an exceptional team of individuals who complement and help one another. \r\n\r\nTask and responsibilities have structure but there is room for creativity - the ever changing industry gives limitless opportunities to be creative, efficient, productive, etc.", "cons": "Administrative processes and procedures are not all streamlined and can become confusing. \r\n\r\nMany competing tasks and responsibilities can become overwhelming if one is not organized. \r\n\r\nSuperiors are not always accessible for staff members due to their demanding role/schedule."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to teach!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Jan 2018", "job_title": "Educator in Everett, WA", "duration": "N/A", "pros": "I have taught here for 3 year and love it.  I could not ask for a more supportive team.  Teaching isn't easy and if I had started at another school, I don't know if I would have grown to be the educator I am today.   The company is really focus on training, and helping you grow.  It's a family owned company, and the Trieu Family really cares about us as staff.  It's easy to work for these people because they have your back.", "cons": "No company is perfect;  we have challenges just like other companies, but what makes it great is people are committed to getting better.   However, if you are looking for a job, this probably isn't the right fit.  Teaching is hard work.  Students don't really appreciate their teachers until after they graduate.  You really have to believe that the work you do is meaningful, otherwise its too hard."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Family is everything and everyone is family", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Feb 2018", "job_title": "Guest Service Coordinator in Renton, WA", "duration": "N/A", "pros": "The Trieu family is so amazing. They hire people with the same passion and drive, especially campus directors, that each of them possess, and have made it their mission to chance every life for the better that walks through the door, whether it’s a student or a staff member. They’re always looking for ways to improve themselves, the school, and the way they run things by asking for help and feedback. You’re “trieuly” part of the family when you work for them. Everyone in the family works hard to get to know you and they treat you with so much love and respect. Evergreen has by far been my favorite place to work with the most amazing coworkers that I’m sure it will be the best job I ever had!", "cons": "They try to be very flexible with your schedule, but sometimes you need to work long days. I also wish there were more locations, but I know they’re working hard to to open campuses and I can’t wait until one is close to home!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Very Grateful!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Apr 2017", "job_title": "Instructor in Renton, WA", "duration": "N/A", "pros": "Very passionate team of people/owners. All leadership group are super pumped up to grow themselves and they are eager to help others who are dedicated, hard working and have desire to grow and improve their skills.", "cons": "It depends what YOUR expectations are from YOURSELF and how devoted you are to your own goals and growth. There are always things to learn, to adapt, to get \"touchy\" with the way how others run their business. I'm very thankful overall for all they provided for helping me to grow, to learn, to experience and to move on."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Evergreen has truly helped me GROW!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 Apr 2018", "job_title": "Administrative Assistant in Everett, WA", "duration": "N/A", "pros": "I started Evergreen as a esthetician student (oh gosh, maybe 6 years ago?) I just graduated high school and wanted to learn about skin care. My first reaction to Evergreen as a student was, WOW! If I wasn't pursuing esthetics, this is the dream team to work for. I ended up LOVING the family and the overall work environment that I applied to start working as their Guest Coordinator. It was a good stepping stone for me because I learned how to answer phones and book appointments, which would help me later in the spa industry. \r\n\r\nAs I continued my duties, I also learned a lot of great team building exercises which helped me with my fear of breaking the ice and having those \"hard\" conversations with students and staff. The owners must have really liked me enough that they created a one of a kind position to help them out as an Administrative Assistant! I was completely honored!\r\n\r\nHere are some more of the Pros I have learned overtime:\r\n\r\n1) The owners are considered my second family. I never had to feel like I couldn't talk to them about things that were stressing me out professionally or couldn't figure out how to handle a situation. Examples include communicating with the team or dealing with other companies working with us on projects. \r\n\r\n2. One of many great talents they have is teaching you to open your mind a bit and ask certain questions to yourself. There was plenty of times where I would be stressed about a situation and they would ask me 1-3 questions to think about and that allowed me to answer them myself! The students are not the only ones learning there ;)\r\n\r\n3. The staff meetings were a great start to my day! They keep you in the know about what is going on for the week, as well as sharing personal events that really builds the friendship within the team. Everyone has the same amount of duties within that staff meeting so you feel like everyone is working together and no position is more important than the other.\r\n\r\n4. I really faced a lot of my fears including the Big One. Presenting an hour-long award ceremony in front of the WHOLE school. I was very scared because speaking in front of a good amount of people was not my specialty. The entire staff was fully on board with helping me conquer the day, I used all the communication skills I learned there and I succeeded! It was such a relief knowing how much support I had.\r\n\r\n5.  They strive to give back! As a student and a staff member, I was amazed how much care and work was put into the Back to School and Christmas events for the community. They were so much fun as well as very uplifting.", "cons": "I cannot think of any Cons whatsoever about this company, but I know knowing them, they would want to know any feedback so they can improve.\r\n\r\nThis isn't much of a disadvantage but more of a piece of advice for the job seeker. If there is one thing I can say about the Administrative Assistant position, is be on top of your duties and know that the position isn't one to slack on. You are there to support the Owners and represent them.  I felt some pressure in this position since it was so new to me, but planning out your week and month is very helpful. There is always something to be doing at all times. You will ALWAYS be learning something great and something different everyday."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Purpose, Great People Makes a Great Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "11 Mar 2018", "job_title": "Admissions Counselor in Yakima, WA", "duration": "N/A", "pros": "I've been working here for almost 6 years now and can't believe how much I have grown professionally and personally. My family tells me that they have never seen me grow so much in my life until I joined the Evergreen family. The culture I can't really describe, but once you walk into the doors, you immedetialy feel the family that owns the company and the community they have built. It is great to get a hug in the morning as well as when you leave.  The company Christmas Parties each year are always memorable and the leadership makes you feel very special and appreciated for our hard work.\r\n\r\nIt is really special that as an employee, we don't get lost in the mix of things. I still remember when I started working at EBC, their onboarding program focused so much on the culture from the way we talk to one another, the types of questions we ask all the way to how we introduce one another. The company is very intentional and has a strong opinion about how we interact with one another and much more relaxed with less structure of how we do our jobs. This is very opposite of what I am used it. I love my 1:1s I get each month with my director as we talk about personal and professional items. It is a requirement for this company and why I love my job.  Thanks for letting me help you start some of your new campuses.\r\n\r\nEvergreen Beauty College is truly a company that focuses on their employees, and in return it attracts some great people and that is what makes our culture. Thank you to the Trieu family and all my directors for making me love something I never knew I could love so much, want to work so hard and lose track of time for what we get to do every day!", "cons": "I remember the first year was really tough and I can see it in all of the new employees. When you come and join the EBC system, it is so different than other work places where you feel that there is structure about some things and not about other areas as I described above. IN the end, if you stick around long enough to see it, you realize that is what feeds the culture of entrepreneurship and testing of our own ideas. Because of this, the first year is really difficult, I cried many times, but if you got some thick skin and get comfortable being uncomfortable, you will see what I mean. I wish there was a better way to get integrated in the system here so it isn't as painful, but I think that might be part of why the people that are still here are able to do what they do."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Evergreen is a Family", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "16 Sept 2016", "job_title": "Educator in Everett, WA", "duration": "N/A", "pros": "Family atmosphere, employers who genuinely care about you and your own journey.\r\nEvergreen really is a family. They take care of their staff and their students. \r\nI loved working for Evergreen because I had fun everyday. In most jobs you always have that one shift or coworker that you just can't stand, or you dread going to work after a hard day, but I never experienced that when I was with EBC.", "cons": "There are days that are harder than others, because this is a beauty school. But you always have support to succeed."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "\"A positive attitude brings positive results\"", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Aug 2016", "job_title": "Educator in Everett, WA", "duration": "N/A", "pros": "The staff is like family.  The atmosphere is what you make it! Hard work doesn't go unnoticed. The curriculum is made with purpose. Working for Evergreen forced me step out of my comfort zone and grow as an Educator.", "cons": "The hours were very long and demanding at times."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A wonderful company!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 Feb 2018", "job_title": "Instructor in Renton, WA", "duration": "N/A", "pros": "Great place to work.  They really focus on teamwork and communication.    The leadership really cares.", "cons": "If you are working the full day shift, it is 10 hours which can be pretty long."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Financial Counselor", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "5 Dec 2018", "job_title": "Anonymous Employee in Renton, WA", "duration": "N/A", "pros": "Great Family environment. You are able to participate in a lot of community events. They are very flexible with things like schedule.", "cons": "Often times you will have to take on more than what is strictly in your job title. Dealing with a wide ranged of revolving student body can lead to problems with attitudes and overall morale of the school."}]]