[[{"date": "9 Oct 2022", "title": "International Student Advisor / DSO Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Texas at Tyler", "Interview Descriptions": "It was an initial phone call. Because I missed the phone call, there was a follow up email to set up a zoom interview. Zoom meeting with a committee of people that work in the office and outside of the office. Then phone call of acceptance.", "Interview Questions": "What does diversity mean to you?"}, {"date": "26 Jan 2020", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Texas at Tyler", "Interview Descriptions": "Phone interview 1st. Then a Skype interview for the 2nd interview. Make sure interviewer is honest with you.  Ask about turnover for some departments have high turnover but they won't tell you that.", "Interview Questions": "Tell me about yourself. "}, {"date": "28 Jan 2023", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Texas at Tyler in Jan 2020", "Interview Descriptions": "The visit to campus was very well planned and everyone was inviting. It was a nice visit with faculty, staff and specifically students. They were accommodating to my needs. Expectations were on par with other similar job interviews.", "Interview Questions": "My expectations for the position."}, {"date": "15 Sept 2020", "title": "Welcome Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Texas at Tyler in Apr 2019", "Interview Descriptions": "Kind of stressful, there were multiple interviewers but it was good practice for real-world jobs. The panel was very nice although it was nervewracking. It was a very professional interview.", "Interview Questions": "Tell me about yourself and they asked working examples."}, {"date": "22 May 2018", "title": "Front Desk Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Texas at Tyler (Tyler, TX)", "Interview Descriptions": "Very straightforward. Met with 2 faculty members. Pretty standard behavioral questions. The atmosphere was very relaxed. I was a little bit worried going in, but they assured me it wasn't going to be too tough and to just let my personality shine. I cracked a few jokes here and there too", "Interview Questions": "Tell us one time you've had to go over and beyond for a request"}, {"date": "28 Oct 2018", "title": "Undergraduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of Texas at Tyler (Houston, TX) in Jan 2018", "Interview Descriptions": "Talked to local faculty about looking for a position. They were able to find a position for me after asking some behavior questions and academic questions. I was expecting the position to be filled by someone else, but after a week's wait got the position.", "Interview Questions": "How would you handle late assignment submission?"}, {"date": "15 Aug 2019", "title": "Concession Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Texas at Tyler (Tyler, TX) in Feb 2017", "Interview Descriptions": "Very informal conversation with Concession Manager. I was referred by a friend who works in concessions and I scheduled a interview with the manager. He showed me around, we had a quick conversation like an interview, and he showed me what the roles would be. It went smooth and easy.", "Interview Questions": "What's your goal here at UT Tyler?"}, {"date": "16 Mar 2016", "title": "Student IT Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Texas at Tyler", "Interview Descriptions": "Applied on the web. Was contacted by email to schedule an interview. Interview was straightforward. Most of the questions were about previous experience or related work to the position. No complicated questions. A few questions about how to handle an issue over the phone. The main idea was to make sure you know how to work in a call center environment solving computer issues.", "Interview Questions": "What previous experience do you have that relates to this position?"}, {"date": "4 Jan 2017", "title": "Building Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Texas at Tyler (Tyler, TX) in Feb 2016", "Interview Descriptions": "Interview process was fairly simple. It takes just one interview. It is a face-to-face interview with am associate director of the Herrington Patriot Center at the University of Texas at Tyler. The interview lasted around twenty minutes. It included simple questions, and it didn't require any special preparation.", "Interview Questions": "What are your strengths and weaknesses? Why do you think you deserve to be hired? What differs you from other applicants?"}, {"date": "5 May 2017", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at University of Texas at Tyler in Dec 2015", "Interview Descriptions": "Phone screening and in-person interview with a panel. I was not technically qualified for the job, but had applied anyway and was approached by someone on the hiring committee. I was already an employee of the university.", "Interview Questions": "They asked about a project I was proud of and a project I could've improved on."}], [{"date": "12 Aug 2015", "title": "International Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Texas at Tyler (Tyler, TX)", "Interview Descriptions": "During the hiring process my application was acknowledged by automated email.After a few weeks, I was then informed that I was not selected for the position. I appreciated being informed of the decision and not left wondering, unlike other university positions.", "Interview Questions": "N/A"}, {"date": "5 Aug 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Texas at Tyler", "Interview Descriptions": "Basic questions about skills and what your work ethic is like. Quick response. They'll let you know immediately whether you get it or not. Mostly base it on class schedule and availability.", "Interview Questions": "How do you handle stress"}, {"date": "14 Sept 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Texas at Tyler (Tyler, TX) in Jan 2014", "Interview Descriptions": "I had a phone interview with a faculty member at the School of Nursing. I was asked about my experience. The job responsibilities, time commitment, and salary were described.  I accepted the position on the phone and was required to submit paperwork to process my position.", "Interview Questions": "Why do you want to be a teaching assistant?"}, {"date": "9 Jul 2015", "title": "Garduate Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Texas at Tyler (Tyler, TX) in Sept 2013", "Interview Descriptions": "The interview process was easy. although many people applied for the position. The interview went easy.The Interviewer had a very friendly experience and had a good smile on his face all the time.", "Interview Questions": "Just a couple of questions regarding my past experiences etc. just a few questions like tell about yourself"}, {"date": "21 Feb 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Texas at Tyler (Tyler, TX) in Apr 2013", "Interview Descriptions": "There was a panel to interview the applicant.  There are standard questions that every position's panel will ask.  They usually will take turns asking questions, and they generally like for you to elaborate your answers.  I've always found it helpful to give examples.", "Interview Questions": "Where do you see yourself in 10 years?"}]]