[[{"date": "2 Jun 2022", "title": "Part Time Library Page Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Fairleigh Dickinson University", "Interview Descriptions": "Very easy interview \r\nNot difficult question \r\nEasy job offer \r\nEasy to get people are nice it’s good a place. \r\nIt’s in Madison nj\r\nIt’s huge library.  Interview people are very easy they make you comfortable . Show you process.", "Interview Questions": "What is your strength in job"}, {"date": "7 May 2022", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Fairleigh Dickinson University", "Interview Descriptions": "Went through the general motions of an interview, with relatively easy questions. Came in and discussed schedules and such. After the interview, performed a knowledge test about the equipment. Then heard back a few days later.", "Interview Questions": "What does initiative mean to you"}, {"date": "22 Jun 2021", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Fairleigh Dickinson University", "Interview Descriptions": "Interviewer was very nice, asked more than typical \"Tell me about yourself\", really wanted to get specific information from questions, was told I would hear back in a couple weeks either way", "Interview Questions": "Would you anticipate this being a job you would stick with for 3+ years?"}, {"date": "22 Feb 2019", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Fairleigh Dickinson University", "Interview Descriptions": "first we have to drop our resume at office then you weill get a call for personal interview. they are really nice people. they will make you feel comfortable and ask few basaic questions like do you enjoy studying at this school or not..and will ask about your past work experience", "Interview Questions": "what you have done before?\r\nwhat is your major ?\r\nare you comfortable in communicating with students?\r\n"}, {"date": "18 Mar 2021", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Fairleigh Dickinson University (Teaneck, NJ) in Dec 2018", "Interview Descriptions": "It was very mostly about getting to know your type of questions. Where are you from, what is your major, have you had past experience working as an administrator.  the  questions were asked by the current GA and later was interviewed by the manager.", "Interview Questions": "Where are you from, what is your major, have you had past experience working as an administrator."}, {"date": "17 Oct 2022", "title": "Undergraduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Fairleigh Dickinson University in May 2018", "Interview Descriptions": "There wasn't really an interview. I took a class with the professor and did well in his course and he was looking for a TA so I accepted. For other professors they may make you take a practice final exam to see how you'll fair as a TA or look at some of your courses and the work you've done in them.", "Interview Questions": "I am unable to say."}, {"date": "24 Mar 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Fairleigh Dickinson University (Teaneck, NJ) in Jan 2018", "Interview Descriptions": "I got to know from one of my faculty during class. I was really excited to know about the opportunity.  The process took 3 days and was called for a formal introduction interview. Next day got response and called for another interview.", "Interview Questions": "Python, Java, Database"}, {"date": "9 Nov 2017", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Fairleigh Dickinson University", "Interview Descriptions": "Electronic application. Phone call interview with faculty.  There was 4 week wait in response (rather long because the probably invited and rejected their own first choice; or they didn't take a low offer). On campus interview and presentations. Response 2 weeks later. The search committee failed to find a candidate.", "Interview Questions": "Why FDU? Teaching and research statements. They said that the position was mainly teaching, but their reasoning for not hiring was was lack of future research . The research committee was very disorganized, full of personal ego. They wanted a perfect candidate ( good luck with that). Every time a faculty asked me me a question they would be looking at one particular faculty as if she was holding a gun to their face. The faculty was full o arrogance, pointed out some minor mistakes in presentation. I would never want to work with such groups of people even if they offered the position on a plate."}, {"date": "10 Sept 2017", "title": "Bookkeeper Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Fairleigh Dickinson University", "Interview Descriptions": "Enhance customer’s experience at library through customer assistance  Helped the Associate librarian with routine activities. Contributed to the archive process of approximately 2,000 using inventory management skills.  Help other employees if they need the any help.", "Interview Questions": "How will you be helpful for the organization?"}, {"date": "19 Aug 2018", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Fairleigh Dickinson University (Hackensack, NJ) in Aug 2017", "Interview Descriptions": "only one interview with the professor. It takes hardly 15-20 min interview. Also depends on your GPA and communication skills. It was a quite easy interview and the process was very fast.", "Interview Questions": "which kind of experience do you have in teaching assistant? Why do you want to join in this position?  what is the best and worst experience in your careers?"}], [{"date": "6 Jun 2017", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fairleigh Dickinson University (Jersey City, NJ) in Apr 2017", "Interview Descriptions": "It was a month after I applied. Relaxed. Good questions. Seemed to like what they saw in my interview. Nice search committee. Very organized process and they were very realxed", "Interview Questions": "Why I wanted to teach at FDU "}, {"date": "27 Nov 2021", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Fairleigh Dickinson University (Teaneck, NJ) in Apr 2017", "Interview Descriptions": "Everything was very quick. My college roommate worked there and recommended that I got for an interview. I showed up with my resume, and they just asked when I could start.", "Interview Questions": "Existing employee referred me- instant hire."}, {"date": "4 Feb 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Fairleigh Dickinson University (Teaneck, NJ) in Jan 2017", "Interview Descriptions": "first, you have met the administrative department and submit your resume then they will inform the professor and you have to go and met him and discuss the procedure to do the job if he is satisfied, you will get the job.", "Interview Questions": "will you be available and efficient in the xx field?"}, {"date": "12 May 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Fairleigh Dickinson University (Teaneck, NJ)", "Interview Descriptions": "I was recommended to meet with the Admissions Office by a friend. I met up with the supervisor and was simply told to fill out paperwork. I was hired on the spot, no questions asked.", "Interview Questions": "N/A"}, {"date": "20 May 2016", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Fairleigh Dickinson University (Teaneck, NJ) in May 2016", "Interview Descriptions": "I have an appointment for an interview and am looking forward to it. It is with a panel of faculty and the Director.  I have never actually interviewed at Farleigh but have had good feedback from those that have. Most often it is pretty routine and standard giving  your history and experience and why you think you are a good candidate for the job", "Interview Questions": "How do you handle a difficult student?"}, {"date": "21 Jan 2018", "title": "AP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Fairleigh Dickinson University (Jersey City, NJ) in Jan 2016", "Interview Descriptions": "Applied online through electronic application. Had a Phone call interview with several people at once. No response for 3 weeks. The process was longer than expected. However, everyone was cordial and respectful during the interview and asked questions that were important to my fit with the job and with the university.", "Interview Questions": "Why do you want to work here? "}, {"date": "15 Mar 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Fairleigh Dickinson University (Hackensack, NJ) in Aug 2015", "Interview Descriptions": "Found out there was a position open for a GA at an office and went to speak to the person in charge of the office. Set an interview for a few days later.", "Interview Questions": "Usual question about work experience. "}, {"date": "3 Dec 2015", "title": "International Admissions Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fairleigh Dickinson University (Teaneck, NJ) in Aug 2015", "Interview Descriptions": "I was contacted by phone to set up an in person interview after applying online. I met the group of counselors in person and conducted a group interview where they each asked me questions.", "Interview Questions": "Why do you want to work at FDU?"}, {"date": "8 Aug 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Fairleigh Dickinson University (Florham Park, NJ) in Jul 2015", "Interview Descriptions": "Very casual, easy going relaxed atmosphere very informative and created a great picture of the school. I loved the campus when I stepped foot on it. Basic questions on skills and schooling. It was informal because it was a grad assistant position there was no need to wear a suit and tie loved the atmosphere of the department", "Interview Questions": "Educational background?"}, {"date": "29 Jun 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Fairleigh Dickinson University (Teaneck, NJ) in Apr 2015", "Interview Descriptions": "Fair application process - involved a form to be filled out in addition to an essay about why you wanted to work there. Supervisor invited me for an interview, was notified within two weeks that I had gotten the job. Was given enough time to notify her whether I would accept the offer", "Interview Questions": "Why do you want to work here?"}], [{"date": "12 Jun 2015", "title": "Receptioist/Lab Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Fairleigh Dickinson University (Madison, NJ) in Aug 2014", "Interview Descriptions": "Applied in person and was called in a week later for a interview.The interview was fairly easy. My interview was politely and made me feel comfortable. She was mainly concerned about my past working experience and what I could bring to the position if hired. After the interview process I was contacted by my employer with a job offer that I acepted", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "21 Feb 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Fairleigh Dickinson University", "Interview Descriptions": "The process took way too long. There would be no news for a month, then a flurry of activity which made it difficult because I was juggling other offers. Didn't get to meet many department faculty before being hired", "Interview Questions": "Why do you want to work here as opposed to another nearby school with similar position"}, {"date": "20 Oct 2013", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Fairleigh Dickinson University", "Interview Descriptions": "I was working part time in another department and position was posted. I was contacted by the assistant controller by phone and had an interview. My boss at the time also called the assistant controller and highly recommended me for the position.", "Interview Questions": "I was perceived as over qualified, too experienced (old?) and had to field many questions related to whether this position was appropriate for someone like myself"}, {"date": "16 Apr 2014", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Fairleigh Dickinson University (Madison, NJ) in May 2013", "Interview Descriptions": "Applied through the website, but since I was recommended by the person who I wanted to be hired by, I was called fairly quickly to come in to interview. I was interviewed together with my prospective boss and the Dean. Interview was about 20 minutes and then they told me that they definitely want me and they will contact me very soon. 2 days later they called and accepted offer.", "Interview Questions": "A time where you had to overcome an obstacle"}, {"date": "8 Oct 2013", "title": "Public Safety Officer At the Florham Campus, FDU Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Fairleigh Dickinson University (Madison, NJ) in Jun 2009", "Interview Descriptions": "Prior police or correctional experience is a plus during the interview.  Knowledge of CPR/AED and First Aid background is a selection process for a chance for an interview.", "Interview Questions": "Mostly judgment questions."}, {"date": "1 Sept 2012", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Fairleigh Dickinson University (Madison, NJ) in Sept 2008", "Interview Descriptions": "Required filling out work-study application at Financial Aid Office.  Then checking available jobs at Career Development.  If there are free spots available at the various offices, work study students will usually obtain them on a first come, first serve basis.", "Interview Questions": "What was the greatest difficulty you had with your prior employer?"}]]