[[{"date": "12 Jun 2023", "title": "Oral Medicine Resident Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA)", "Interview Descriptions": "went very smoothly. they answered all questions and introduced the faculty and people and other residents there. they have a new boss there and did not say why i was denied.", "Interview Questions": "why did you apply to UCSF?"}, {"date": "1 Apr 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA)", "Interview Descriptions": "First round interview very short. Must answer questions in less than a minute. Discouraging. Do not understand how a recruiter can get to know someone in 3 minutes to move forward. Some classmates said they were moved to second round interview but never heard back from management.", "Interview Questions": "Tell me a time you made a mistake and what did you learn?"}, {"date": "10 Mar 2023", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "The interview process was very smooth. The interviewers were very friendly but transparent about the process and what to expect once accepted as an intern. It showed that they were actively listening to all my answers to their questions.", "Interview Questions": "How do you deal with time pressure?"}, {"date": "10 Jan 2023", "title": "Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Breakfast with chief resident in the morning. 2 in person interviews with members of committee. Hour with program director. Lunch with current residents followed by tour of hospital. Has optional social to attend", "Interview Questions": "Why are you applying to our program?"}, {"date": "23 Nov 2022", "title": "Security Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA)", "Interview Descriptions": "The interview was over the phone with the department manager and took about an hour. I have to admit it was one of the most pleasant ones I had. Even though it was a positive one, I did not hear back anything.", "Interview Questions": "They asked mainly generic questions and any healthcare experience."}, {"date": "27 Oct 2022", "title": "Chaplain Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Super friendly and supportive. UCSF has a great reputation, and I can see why. Their communication was clear and prompt. The interviewer's warmth and caring came across clearly. Nice folks!", "Interview Questions": "Would you want to work with us long-term?"}, {"date": "12 Aug 2022", "title": "Physician Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Multiple interviews with different staff members. Some were good cop some were bad cop. I got to meet many people.\n\nLunch and travel were provided which was nice.\n\nI wore a suit as did everyone else.", "Interview Questions": "Why do you want to work here"}, {"date": "28 Dec 2022", "title": "HUSC III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Aug 2022", "Interview Descriptions": "It is quite lengthy, and can be difficult for some perspective employees. The process usually starts with a phone screen, followed by an in person panel interview. After the panel interview, candidates may be asked to complete a pre-hiring assessment and job references.", "Interview Questions": "N/A"}, {"date": "13 Apr 2022", "title": "Patient Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals in Mar 2022", "Interview Descriptions": "You will receive an email or a call from the supervisor for the specific position you're applying to. You will then have a video interview with another Patient Coordinator, the supervisor and the practice manager. If that goes well there's a final interview with one of the providers. They then need a minimum of 5 references, they use a site that has you send email and/or text requests to the 5+ references of your choice, they prefer professional over personal and require you to have at least 3 managers. You then will submit a background check. And that is as far as I have gone. Often times you're interviewing for a position that is already promised to another employee within the department or a recommended canidate but the managers are required to have a certain number of applicants and interviews, they will have you go through the process knowing they more than likely will not hire you. The 3rd party temp agency's managers (Covelo/Avispa) do not have any way to help you get a job within the UCSF system, the managers that choose you to temp for their department may tell the contract companies there is a chance for hire and when you arrive the managers often will say no, there are no open positions, you're here to fill in for everyone's staggered vacation time. It's very discouraging and tedious, mundane, repetitive work that feels very thankless, knowing that UCSF pays $30/hour for the role you're currently getting paid $19/hour because you're a contractor. AND the biggest catch, you're MORE EXPERIENCED BY MILES than the career UCSF employees that can barely say goodmorning because they're so miserable with their thankless position at a \"top\" hospital, maybe a little disappointed they sold their soul and happiness for a chance at \"amazing\" benefits.", "Interview Questions": "Describe yourself. Why this position? What about the role appealed to you? What past job experiences make this role a good fit for you? Name a time where you had a difficult colleague to work with, how did you handle it? Do you have any questions about the position? Where do you see yourself in five years? "}, {"date": "14 Jan 2022", "title": "Practice Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Went through 3rd party recruiter. Two step interview. First one was screening interview through phone talking about the job and resume and then 30-45min zoom video interview.  Process was quick and finish by 2 weeks.", "Interview Questions": "typical question. \r\nstrength vs weakness"}], [{"date": "3 Jan 2022", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Interview in person, was easy And we discuss my healthcare background and potential patient experience scenarios. They measured attitude to handle different cold and different patient care and health care scenarios", "Interview Questions": "What previous experience did you have in healthcare"}, {"date": "12 Nov 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "- This was a panel interview\r\n- People present were the hiring manager and current employees from department\r\n- The types of interview  questions asked were both clinical and behavioral questions", "Interview Questions": "How to handle a patient who was angry "}, {"date": "10 Dec 2021", "title": "Speech Pathology Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Oct 2021", "Interview Descriptions": "Interview was coordinated by my university. Lead SLP reached out to me via email and rescheduled an interview alongside another potential intern. Zoom interview by interprofessional team (ST, OT, PT). All interviewers have a copy of your CV. Interview process fairly straightforward during pandemic.", "Interview Questions": "What made you want to be a speech therapist? \nWhat are your 5 greatest strengths?"}, {"date": "16 Sept 2021", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals in Sept 2021", "Interview Descriptions": "I had to meet with almost everyone on the team and each interviewer was very welcoming and friendly! All the interviews felt more like a conversation than a panel interview.", "Interview Questions": "What do you know about this position?"}, {"date": "18 Sept 2021", "title": "Clinical Nurse Educator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Aug 2021", "Interview Descriptions": "Four series of panel interview. The initial interviews with management, physician group and current nurse educators went well-lots of engagement and discussion around upcoming projects and collaboration. The peer / staff interview was challenging. No structure during the interview. Staff are very dissatisfied. Not a lot of current staff commitment to process improvement project or supporting changes within the unit. Each interview lasted around 1 hour.", "Interview Questions": "What ways do you think you can promote inclusion in the workplace?"}, {"date": "29 Oct 2021", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals in Aug 2021", "Interview Descriptions": "The interview was about 40 minutes long, with 3 panelist, all managers of the unit I was interviewing for.  They asked mostly behavioral questions and then two clinical questions. The hardest question for me was asking how I implemented joint commission standards.", "Interview Questions": "What would you do if a patient was reporting nausea and pain"}, {"date": "19 Jul 2021", "title": "Associate Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Four 30 minute panel interviews. Every candidate is asked the same questions so that the process is equitable for all. It’s a somewhat rigorous process but worth it in the end.", "Interview Questions": "How does social justice play a role in your work?"}, {"date": "17 May 2021", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Disorganized, unclear in overall process and timeline. No response initially and no way to check application status. Office was a bit disorganized with paperwork requirements. Turned me off to the whole BCH system", "Interview Questions": "Why do you want to work here "}, {"date": "30 Mar 2021", "title": "Recruiter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Phone screen then in person panel interview. Met with 5+ team members from the Talent Acquisition team on site. Interview lasted approximately one hour. Declined moving forward because of salary.", "Interview Questions": "Why are you interested in this opportunity?"}, {"date": "9 Jan 2021", "title": "Practice Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA)", "Interview Descriptions": "Phone call by hiring manager and the followed by an interview panel couple days later.  About 5 people on the panel and very easy questions. Questions that were asked based on previous experience and scenarios", "Interview Questions": "Why do you want to work here?\nWhat background do you have in healthcare?\nHow do you deal with situations? "}], [{"date": "30 Dec 2020", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Mar 2020", "Interview Descriptions": "The interview team was very friendly and communicative throughout the process.  Overall, I felt that the role would have been met with support from leadership and supporting staff. UCSF has great benefits and reputation.", "Interview Questions": "Why are you interested in this position?"}, {"date": "18 Dec 2019", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA)", "Interview Descriptions": "Two phone screens and two onsite interviews. The process took three months. They were very inconsistent with communication. I would have to follow up twice after each interview to ever get a response. Didn't seem that this team valued candidate experience or a candidates time at all.", "Interview Questions": "How would you handle an employee who was leaving work early and not accurately recording their hours."}, {"date": "4 Nov 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA)", "Interview Descriptions": "super nice staff & just one round of interviews. everything came naturally because they wanted to hear about who I was and why i wanted to intern there, like any other position would. overall really happy with the process, very relaxed", "Interview Questions": "why do you care about reproductive health "}, {"date": "3 Nov 2019", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Smooth process went through a recruiter;  she was really sweet and very informative throughout the whole thing. Had a phone call interview and then two face to face. Process took about a week and half.", "Interview Questions": "What made you want to work at UCSF?"}, {"date": "4 May 2021", "title": "Practice Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals in Jul 2019", "Interview Descriptions": "Applied online thru their website. Got a call to schedule interview after two days. Had a phone interview first. Then had an in person interview with Director and Supervisor. Had final interview with provider I would directly be working with. Got an offer for position. Process all within a month of applying.", "Interview Questions": "Question regarding the company values, PRIDE, and to elaborate on one in specific"}, {"date": "18 Jun 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Typical Q&A type interview, manager and supervisor present. Both were friendly and down to earth.  Prepare by reviewing interview skills and be prepared to talk about your experiences and what you'd be bringing to the table.", "Interview Questions": "N/A"}, {"date": "23 Aug 2021", "title": "Practice Coordinator III Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals in Jun 2019", "Interview Descriptions": "Make sure have one year experience medical or admin area. Having bachelors degree helpful. Be dressed professionally. Make sure be on time 15 min early should be okay. Sending thank you letter after interview is a must.", "Interview Questions": "Strength? Multiple task, easily new learn things and team player"}, {"date": "24 May 2019", "title": "Registered Respiratory Therapist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Phone/teleconference interview 1st which asked all the basic screening of personality questions followed by an in person interview the following week.\r\nThe in-person interview was mostly clinical experience based questions and asked very specific questions about knowledge of the respiratory system as well as skills necessary to complete the job.", "Interview Questions": "Describe intrinsic PEEP and where do you find it? What does it mean? "}, {"date": "1 May 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "I did an online interview with the nurse manager and assistant nurse manager on the floor. We had arranged for a time before hand for the interview. Altogether very smooth.", "Interview Questions": "What was an example of a mistake I made and how did I fix it "}, {"date": "26 Mar 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Brief and simple interview with behavioral questions. Started as a phone screen. Then, an in-person interview at the campus with management and team. Short and brief. Want to find the best fit for their team. Asks for references.", "Interview Questions": "Tell me about yourself? Where do you see yourself in 5 years?"}], [{"date": "12 Mar 2019", "title": "Administrative Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Once you apply online, they do a Skype panel interview with you and current fellows (first and second years), which took about 20-25 minutes. \r\n\r\nIf selected, they invite you to on-site interviews. They invite you and other candidates to dine with past/current fellows and the fellowship coordinator. Then, the next day is a marathon. It consists of a) presentations by leadership & tour of the hospital, b) case-interview type question, and c) panel-interview with 10-15 people from management & leadership.", "Interview Questions": "One case-interview question of your choosing\r\n\r\nDuring the onsite panel interview with management and leadership, they asked questions like:\r\n-How did ACA affect UCSF Health system?\r\n-What is the CEO thinking about right now? \r\n-When was a most recent time you received negative criticism?\r\n-How do you show humility?"}, {"date": "1 Nov 2019", "title": "RDMS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals in Mar 2019", "Interview Descriptions": "Phone interview followed by a panel of 5 interviewees, then departmental interview l, and scanning in person. Most difficult process I've endured but they want to make sure they weed out those who aren't serious.", "Interview Questions": "Questions were job related specific to title like what machines, why are you chosing ucsf, tell us a difficult situation you encountered and how did you resolve it."}, {"date": "1 Jun 2019", "title": "Administration Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Mar 2019", "Interview Descriptions": "I had a great interview, connected with the panel.  A few days later I was asked to complete a pre-hiring assessment and job references. This happened two months ago. No word since the completion of my job references", "Interview Questions": "what was the most complex project I worked on? How do you handle a difficult manager?"}, {"date": "15 Feb 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Had a one-on-one interview with hiring manager in her office. Hiring manager described the duties of the job and we both discussed what I will contribute to the job, what is expected from me, and my strengths.", "Interview Questions": "What are your strengths"}, {"date": "14 Feb 2019", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Phone interview with basic tell me about yourself questions. Invited to a panel interview with more in depth questions regarding skills, scenarios and future goals. They enjoyed more personal examples rather than stating attributes", "Interview Questions": "Why come to UC"}, {"date": "12 Mar 2019", "title": "Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Feb 2019", "Interview Descriptions": "Really disorganized, interviewer didn't want to be on phone. Missed initial interview time and then spoke negatively about the workplace.  I don't want to work here now. Definitely reflected poorly not only on UCSF but also his boss.", "Interview Questions": "Only about skills, interests, and goals"}, {"date": "18 Jul 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Jan 2019", "Interview Descriptions": "It's not always quick and easy to get hired. The job interview process can be lengthy. Being interviewed once and getting a job offer is typically a thing of the past. Today, many companies have an involved interview process starting with screening interviews, which often take place on the phone, followed by in-person interviews, second interviews, and even third interviews.\r\n\r\nIn addition to a hiring manager, you make meet with managers, employees, and other staff. How hiring is handled depends on the employer and the systems they have in place for screening and evaluating potential new hires. Here's an overview of each step in the interview process, along with advice on the best way to handle each type of interview as you progress up the interview ladder towards a job offer.", "Interview Questions": "It's not always quick and easy to get hired. The job interview process can be lengthy. Being interviewed once and getting a job offer is typically a thing of the past. Today, many companies have an involved interview process starting with screening interviews, which often take place on the phone, followed by in-person interviews, second interviews, and even third interviews.\r\n\r\nIn addition to a hiring manager, you make meet with managers, employees, and other staff. How hiring is handled depends on the employer and the systems they have in place for screening and evaluating potential new hires. Here's an overview of each step in the interview process, along with advice on the best way to handle each type of interview as you progress up the interview ladder towards a job offer.?"}, {"date": "29 Jan 2019", "title": "Pro Fee Coder Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Dec 2018", "Interview Descriptions": "Applied online, and was brought in for a panel interview  within a few days.  I was interviewed by 3 managers and the department director. \r\n\r\nImmediately after interview 5 references were requested 2 of them have to be your managers and you have only 24hrs to enter them into the system.  Had I known they weren't seriously considering me I wouldn't have bothered my references, it was a total waste of time.", "Interview Questions": "How much I expected to make"}, {"date": "4 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Nov 2018", "Interview Descriptions": "The interview process consisted of one short phone screen with the unit manager, who personally scheduled my in-person interview (pre-pandemic). My interview in person consisted of a 5 person panel, and contained mostly behavioral questions.", "Interview Questions": "To name two: \r\nTell us about a time when you made a mistake. How did you handle it?\r\nTell us about a time you experienced a conflict at work. "}, {"date": "1 Oct 2018", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "2 rounds of interview, both behavioral with a little bit of technical. Asked me about why marketing and why marketing at UCSF. Asked what I knew about UCSF. The interviewers were very kind and worked with me on my questions. The asked me on SEO problem.", "Interview Questions": "Tell me about yourself"}], [{"date": "2 Oct 2018", "title": "Privacy Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA)", "Interview Descriptions": "Applied via temp agency, agency called me about 2 months later, then I had an in person interview two times with UCSF on site (over 2.5 weeks), and got job offer via email.", "Interview Questions": "If you had a patient's document get faxed to the incorrect doctor, what would you do?"}, {"date": "26 Sept 2018", "title": "Assistant Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "1 month+  after I submitted my app I was contacted via email by someone on the Research Project, title was never shared. Basic interview questions were asked during the phone interview, I didn't get another interview or follow up email.", "Interview Questions": "Asked questions about my interest in research, previous responsibilities in research, what I wanted to get out of this job, and \"tell me about yourself\"."}, {"date": "13 Sept 2018", "title": "Lab Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA)", "Interview Descriptions": "I applied through craigslist. Was emailed back by the PI of the lab to schedule a video interview. That was about 45min. Then invited for an on-site interview and tour of the lab", "Interview Questions": "Do you have experience working with mouse colonies?"}, {"date": "26 Aug 2018", "title": "Registered Dietitian Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Scheduling the interview was relatively easy and they were pretty responsive. When it came to adding references, HR only gives you 24 hours to add five references who will fill out an online form so ask them ahead of time!", "Interview Questions": "Clinical case study questions"}, {"date": "24 Aug 2018", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Panel of 5-6 nurses, competitive interview with another candidate. Answered same questions back to back. Was difficult to not compare with other candidate's answers. They had our resumes printed out and a scoring sheet.", "Interview Questions": "Describe three characteristics valuable to work with your preceptor, which one do you need most work on?"}, {"date": "28 May 2018", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "30 min phone call.  An introduction about their team and the responsibility of that position. Then ask almost everything on your resume, like education, previous projects (very detailed) and your skills.", "Interview Questions": "Your previous projects."}, {"date": "16 May 2018", "title": "Clinical Research Coordinator II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "As a referral, I came in for an in person interview. The PI lectured on his research topic, and after just listening to them talk  I was hired.", "Interview Questions": "Are you interested in this job? "}, {"date": "18 Oct 2019", "title": "HLT II In Microbiology Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals in Apr 2018", "Interview Descriptions": "There was a preliminary phone interview where they asked you general questions about your interest in this position,  background information, prior relevant experience, etc. They got back to me through email.", "Interview Questions": "Do you have prior clinical experience?"}, {"date": "19 Jan 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Had two interviews with departmental staff, first with the Manager of department and then another second one with 10 Admin staff employees. A Group Panel interview. Felt a bit intense but achievable.", "Interview Questions": "Working in a large department, how do you deal with unpleasant co-workers and how do you handle negative attitudes?"}, {"date": "8 Feb 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Jan 2018", "Interview Descriptions": "Interviewed a manager and two assistant managers.  They had a pre-typed list of questions to ask.  Most of the questions were behavioral \"describe a situation with a difficult patient\" type questions, questions about describing your previous job and responsibities, and about 2-3 questions regarding simple clinical \"what would you do\" type questions.", "Interview Questions": "Walk me through a typical day in your previous ICU job."}], [{"date": "5 Jun 2018", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Dec 2017", "Interview Descriptions": "Sent an exploratory email expressing interest. The reply included further inquiry into previous experiences and resume bullets. Overall the interview process was not terrible, but it seemed like good timing when an available position was open.", "Interview Questions": "Why here specifically? Why UCSF out of any research institute?"}, {"date": "31 Oct 2017", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA)", "Interview Descriptions": "I was referred in by a physician who was the PI for a study. The whole team is extremely nice and the on-boarding was thorough.  Your clinical knowledge doesn't need to be up to speed because you will be trained by the team.", "Interview Questions": "How did you find out about this role?"}, {"date": "26 Oct 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals in Sept 2017", "Interview Descriptions": "It took almost a month after I applied online before they called me for a phone interview.  Interviewed with the unit director then  a panel interview. Experience mostly positive. All behavioral questions and role play at the end. What is weird is I thought I will get an offer at least somehow that was the impression I got. But after a week Manager emailed me that she couldn't make an offer due to skills and experience.", "Interview Questions": "What is your proudest moment in your career?"}, {"date": "26 Sept 2017", "title": "Administrative Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Aug 2017", "Interview Descriptions": "Recruiter reached out to me and had a phone interview. Went on a panel interview onsite. Not thorough from recruiter to the individuals conducting the interview. There was never a follow up from anyone. Very surprising of UCSF to have a poor recruiting process.", "Interview Questions": "Why do you want to work at UCSF?"}, {"date": "19 Jun 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals in May 2017", "Interview Descriptions": "The interview process was pretty straight forward; however, each step takes quite a bit of time. First, I received a screening email from a recruiter, the nurse manager called to setup interview, skillsurvey reference check from five references, job offer", "Interview Questions": "Why do you want to work at UCSF, how did you handle a difficult situation and what was the outcome."}, {"date": "18 Oct 2017", "title": "Radiologic Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in May 2017", "Interview Descriptions": "The interview process began with a phone screening with a supervisor.  I was then asked to come to the hospital to interview. The interview itself was extensive, and lengthy. Mostly dealing with questions that have to do with your personality type interacting with other team members, supervisors, and patients. Also there were questions about how you handled very difficult situations during your times of employment in the past. After the interview you're asked to job shadow for an hour or so to get the feel of the job a bit and be able to talk to some of the working techs and see how they feel about it.", "Interview Questions": "Tell me about a situation where you are in a compromising position and you didn't tell your supervisor…"}, {"date": "16 Mar 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA)", "Interview Descriptions": "It began with an over the phone interview. I had two follow up in-person interviews, and I had been called to continue the final interview would have been with the hiring manager.", "Interview Questions": "Give an example of working with a team? How do you prioritize tasks? Give an example of a adverse situation at work and how you handled it? "}, {"date": "14 Aug 2017", "title": "Patient Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Feb 2017", "Interview Descriptions": "The interview process took about 2.5 months from time of applying to the actual job offer. Phone interview first, followed by interview with immediate supervisor, and then a final interview with the manager from the clinical side.", "Interview Questions": "What makes you stand out from other candidates? Describe a difficult situation that you have faced and what steps did you take to resolve? "}, {"date": "11 Nov 2016", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Began with two phone interviews then two in-person interviews. Whole process took about 3 weeks. Great overall experience; I felt informed and respected throughout the whole process. An additional plus, for me, was the somewhat casual interviewing style. I did not feel intimidated and each interaction was warm and welcoming.", "Interview Questions": "What would your coworkers describe as your biggest strength, biggest challenge?"}, {"date": "1 Nov 2016", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Three rounds of interviews, starting with a phone interview, followed by a panel interview, and finally faculty interview. Process took a long time from the date of application until the final interview, approximately two months. Interviews escalated in difficulty from the phone interview until the faculty interview. Interview questions focused mainly on prioritization and organization/management. Not many personality based questions or \"getting to know you\" questions.", "Interview Questions": "How would you manage two conflicting priorities?"}], [{"date": "19 Feb 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Sept 2016", "Interview Descriptions": "Brief interview conducted by HR regarding submitted documents followed by arranged, in person interview conducted in unit/clinical setting of interested by the hiring manager. Overall, the process is fairly informal but does require some improvisation and introspection.", "Interview Questions": "Discuss a time when you witnessed an unsafe practice and what did you do?"}, {"date": "21 Sept 2016", "title": "Per Diem Ambulatory Surgery Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Sept 2016", "Interview Descriptions": "three person panel interview, read behavioral type interview questions off a sheet and circled on the sheet according to my responses.  they wanted a scenario and an example from practice; somewhat cold process, felt i couldn't connect with them, as they just read behavioral questions off a sheet and circled/wrote comments based on my answers.  Also did a role play at the end, where they presented a scenario and then i had to pretend i was the nurse and one of the interviewers was the patient.", "Interview Questions": "were you ever faced with a conflict with a coworker and how did you deal with it?"}, {"date": "2 Jun 2016", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Opaque - seems there is a lack of communication between those involved in interviewing/hiring process.  Unclear what next steps are, when decisions have been made.  Never clearly rejected candidate but remained very vague - not helpful.", "Interview Questions": "How do you handle conflicts with coworkers or patients?"}, {"date": "25 Aug 2018", "title": "Junior Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in May 2016", "Interview Descriptions": "1 hour chat w/principle investigator. If she/he likes you, then you don't have to wait for the bureaucracy of the UCSF HR department. Though you will still need to apply formally through it.", "Interview Questions": "What are you looking for?"}, {"date": "11 Aug 2017", "title": "Office Administrative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Mar 2016", "Interview Descriptions": "Interview process was average.  I was given a personality and IQ test that you must pass.  Background and drug screen are also given.  After you pass everything, You must then pass the panel interview.  If you pass all these, then a start date is given for your orientation and the how to's on how and where to get your badges, etc.", "Interview Questions": "Why do you want to work here?"}, {"date": "18 Jan 2020", "title": "Admin Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Mar 2016", "Interview Descriptions": "Started as a temp, hired on full-time process took about 7 days. Met with the team, hiring manager, and program manager. Was working primarily with insurance authorizations and scheduling. The staffing agency provided me with EPIC training and was able to start right away", "Interview Questions": "Past Professional experience? How it relates to healthcare? Why do you want to work in healthcare?"}, {"date": "4 Aug 2017", "title": "Analyst IV Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Jan 2016", "Interview Descriptions": "Submitted cover letter and resume on-line.\r\nWithin one week, phone interview\r\n10 days letter, on site, round robin interview with 7 interviewers, and 2 persons on the phone. That was difficult -- the phone part and incorporating those interviewers into the process\r\n2nd in-person interview with one of the phone interviews from the group interview\r\nFinal interview with PI and Dept Adminstrator\r\nProcess took 6 weeks", "Interview Questions": "Describe how your consulting experience will benefit us in this role in program management\r\n\r\nDescribe how you work and or get buy-in from people who you do not supervise"}, {"date": "31 Aug 2016", "title": "Hospital Assistant III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Dec 2015", "Interview Descriptions": "They did a phone screening first, Then if they like you it will be a second interview personal with the nurse manager and the last is another interview with the lead and procedure manager with the tour at the workplace.", "Interview Questions": "How do you handle stress?"}, {"date": "7 Jun 2018", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Dec 2015", "Interview Descriptions": "One in person interview about 2 hours long. Met with the entire team. It was a good process that was made easy by great communication. Heard back quickly after in person interview.", "Interview Questions": "Tell me about yourself."}, {"date": "21 Oct 2018", "title": "Clinical Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Oct 2015", "Interview Descriptions": "It was a long interview day with some commuting between sites. There was a pre-interview dinner. They gave lots of information about the program and there was lunch with the current fellows.", "Interview Questions": "What do you see yourself 10 years from now?"}], [{"date": "13 Nov 2015", "title": "CRC Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Jose, CA) in Oct 2015", "Interview Descriptions": "I was a Skype/Phone interview. There were two people in the panel asking question. The interview took about one hour. The staff was friendly and explained the position in detail. The questions were mostly HR type.", "Interview Questions": "What are some strategies that you will apply for better patient recruitment?"}, {"date": "29 Dec 2015", "title": "Programmer/Analyst II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Oct 2015", "Interview Descriptions": "I had a phone screen with the hiring manager, then was invited in for 4, half hour interviews with various people in the department. The first in-house interview was through the phone, and the remaining 3 were in-person. It took about 3 weeks after that to get my decision (given through e-mail).", "Interview Questions": "Tell about a time when you experienced conflict with a coworker or boss."}, {"date": "8 Sept 2015", "title": "Clinical Nurse II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Panel interview including management and current staff. Applied online. Received an invitation for interview within one week. Phone interview was great and manager was very pleasant. Panel was professional and are serious about potential coworkers.", "Interview Questions": "What are your goals in 5 years?"}, {"date": "30 Aug 2016", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Sept 2015", "Interview Descriptions": "I had three rounds of interviews - the first was an initial phone screen with my supervisor, the second was a phone call with the team that I would be working with most closely (they had asked me to come in but I was out of town), and then I had an in-person interview with the team.  I was surprised by how quickly the hiring process moved.", "Interview Questions": "They asked my why I was interested in working at UCSF and why I was interested in the position."}, {"date": "21 Sept 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Sept 2015", "Interview Descriptions": "I applied online and received a call a few weeks to a month later. Did a phone screening interview and was offered to come in for a 1-1 interview. I am currently waiting to do my 1-1 interview.", "Interview Questions": "why do you want to work for UCSF"}, {"date": "21 Sept 2015", "title": "Staff Pharmacist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals in Sept 2015", "Interview Descriptions": "Phone interview was pleasant. Took about a couple weeks go get invited for in person interview. In person consisted of a panel of knowledgable managers.  Took about 1 month after panel to receive call back", "Interview Questions": "What are important qualities to describe a good team member?"}, {"date": "2 Oct 2015", "title": "Patient Navigator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Sept 2015", "Interview Descriptions": "Special note -- it took approximately 6 weeks from time of on-line application to being contacted for a telephone interview. Telephone Interview with the head of the department.  Casual and friendly approach.  He asked typical interview questions then allowed time for me to ask questions. I was told I should expect to hear back within two weeks of interview whether I would be invited to meet the team and then have a face-face interview.  I have not yet heard whether I passed initial screening interview.", "Interview Questions": "Why do you feel called to serve our patient population?"}, {"date": "19 Nov 2015", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Sept 2015", "Interview Descriptions": "I applied through UCSF career website. It took about three weeks for an initial phone interview. After a week, I was selected for an on-site interview with the professor (pediatric liver disease) and another CRC. I was the first person. During the interview, people were really friendly. They didn't ask any hard questions. However,  the hiring process is very slow. I waited about 6 weeks for their decision.", "Interview Questions": "What's your care goal?\r\nDid you have experience working with children?\r\nTell me about yourself"}, {"date": "21 Jul 2015", "title": "Human Resources Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Had a phone screen first, set up an in-person interview with the HR team. Had to follow-up on status of application on my own and still don't know if I'm still a candidate - Long process.", "Interview Questions": "How would you deal with a difficult collegue?"}, {"date": "29 Jun 2015", "title": "Hospital Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "3+ months with a phone, supervisor, and lunch with the staff. It was beyond intimidating. I wish it was not a long process, they checked my references similar to the analyst position and I did not get it. I wish I could have spared my references time, but it is not like that.", "Interview Questions": "Tell me about yourself."}], [{"date": "1 Oct 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Jul 2015", "Interview Descriptions": "Met with two supervisors, and they both asked me standard interview and behavorial questions. About a week later, i met with the manager who asked me similar questions. Now i am awaiting a response it has been 1-2 months.", "Interview Questions": "Tell me about yourself"}, {"date": "8 Dec 2015", "title": "Typical and Traditional Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals in Jul 2015", "Interview Descriptions": "The interview was 15 minutes long with two managers in a room at a site a good distance from place of employement. There were a couple typical technical troubleshooting questions and some situational cases.", "Interview Questions": "Can you tell me a time you over came a challenge......."}, {"date": "11 Apr 2015", "title": "Analyst II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Jan 2015", "Interview Descriptions": "Applied online. Received an email by the hiring manager about 2 weeks later to set up a phone interview/screening for the follow week. Did well on the phone and was offered an in-person interview the same day by email for the following week. Went to the interview and met with the manager and it went very well. I was told at the end of the interview that they would like me to come back and meet with others in the department soon and that they would contact HR to do reference checks. I barely got out of the parking lot before I got an email from HR for references (a good sign I thought). A few days later I got an email with a schedule to meet the others, which was scheduled about two weeks after my first in-person interview. Went through the second day of interviewing with 4 other people and was told that they would be in contact with me soon. \r\n\r\nWaited for 2 weeks and didn't hear anything so I sent an email to follow up. I was told that a decision had not been made yet and that they would be in contact with me soon. After 4 more weeks I still had not heard anything back and had given up on the position at that point. Its too bad because I had a lot of relevant experience and the ability to help them make much needed changes. The people were really nice during the interviews and I didn't feel like they were trying to trip me up on any questions. They seemed really interested in getting to know me more than just asking standard interview questions, which of course there were a few. I really got the impression that I was going to get the job. I spent $650 in travel expenses and 4 days traveling to and from San Francisco so the least that could have done was email me with a follow up and not left me in limbo for so long. I also wish that if they were not serious about offering me the position that they would have not wasted my reference's time by asking for references before making an offer. I only want to ask my references (all 5 required by UCSF) to spend time on helping me when an offer has been made or is in the works. If this were a high level position I would have understood that practice more so than for this position. \r\n\r\nI have been on a couple interviews with UCSF now and they really like to know what your salary requirements are and don't back down without an answer. I really find this odd but I guess it the norm in California because it has come up in every interview I have been. I don't think this is a question that should be asked during an interview with a company that posts their salary ranges. I wouldn't have applied if I wasn't willing to be paid inside that range. I recommend knowing the salary range offered and don't give your previous salary information. I am strongly against organizations basing your pay off of your previous job. You should be paid for your experience and what you can bring to that position. I recommend knowing the UCSF salary range and making the min-to-midpoint of the UCSF salary range as your salary range. Expect to only be offered 10-20 percent over the minimum salary.", "Interview Questions": "Was asked about weakness, problem with a manager, problem with a co-worker and how I overcame all of those. "}, {"date": "5 Jan 2015", "title": "Clinical Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Standard. Initial phone interview then panel interview. HR then contacts you for references. The process takes a long time from interview to hire. I waited almost 3 months but, definitely worth it in the end. HR does a good job of keeping you informed of next steps", "Interview Questions": "Mostly situation based questions. How to deal with conflict with doctors, coworkers, supervisor, etc."}, {"date": "11 Nov 2014", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Really Bad Management.  Too hierarchal.  Compensation was difficult to negotiate.  Pay was low and was not negotiable.  Supervisors had no social skills.  Retail job has better environment and social savvy.  Got better doing that for a few months, which helped my future professional career.  Without a bridge like that I would be stuck with egghead mentality and not an executive path.", "Interview Questions": "What is your salary range."}, {"date": "21 Nov 2015", "title": "Systems Administrator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Nov 2014", "Interview Descriptions": "Phone screening interview by the senior team lead followed by an on-site one, usially with a panel of about 4 team members . The final decision usually comes within 48  hours after the last interview. And don't forget there is a background check that could last about 2 weeks. Most of the questions were typical system administrator related.", "Interview Questions": "Why do i want to work for a medical center?"}, {"date": "27 Jun 2014", "title": "Healthcare Navigator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "I had 2 interviews and all the interviewees were very nice. The position I applied for is fairly new and interesting. Waiting on a response whether I got the job or not.", "Interview Questions": "There were no difficult questions."}, {"date": "18 Jun 2014", "title": "Engineer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Went on 2 interviews. The process was typically straightforward. The position was eventually closed due to funding issues. I really liked the department and was disappointed that the position was closed.", "Interview Questions": "What is your greatest weakness. Why are you leaving your current position."}, {"date": "19 Aug 2014", "title": "Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Jun 2014", "Interview Descriptions": "They asked the stupidest questions, for example they ask you things like \"what was your biggest mistake,\" as though you're going to tell the truth or as though it's relevant to the position. They also ask questions that are literally unanswerable because they do not tell you the extent of your authority.", "Interview Questions": "What's your biggest mistake"}, {"date": "27 Jun 2014", "title": "Privacy Analyst IV Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in May 2014", "Interview Descriptions": "I was contacted by phone shortly after applying online and asked to come in to interview in person.  The interview was re-scheduled due to a time conflict with the hiring manager.  The interview itself was formulaic and the two hiring managers proceeded to read off a series of 10-15 questions and write down my responses. Overall I felt the interview went really well, however I was told that UCSF's hiring process required them to go through all resumes before I would hear back.  I followed-up two weeks later and was told they were still going through resumes.  I followed up again an additional two weeks later and never heard a response.", "Interview Questions": "Nothing unusual that you wouldn't typically expect.  Questions were rote and included \"greatest strengths\" and \"describe a time when ...\""}], [{"date": "10 Jun 2015", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in May 2014", "Interview Descriptions": "come in and chat. they asked questions about past experience and my resume. What i was doing before this and how it could help me in a different role. They asked about my education and what i want to do with it", "Interview Questions": "What is your 5 year plan"}, {"date": "22 Apr 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "The process took a while, but HR was very helpful. The interview was great, I was asked numerous questions about my qualifications and experience.", "Interview Questions": "why should we hire you?"}, {"date": "13 Jan 2014", "title": "Hospital Assistant III Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Applied through UCSF Medical Center Human Resources Website. After creating account, uploading resume, and applying to various positions that were found on the site I was contacted 3-4 weeks later for an interview. Interview was standard one-on-one with hiring manager with a few questions to get a feel about who you are. Took a tour of the clinic afterwards. Found out I was hired through phone a week later.", "Interview Questions": "With your educational background and attributes, how does that apply to the position and what can you provide for our clinic?"}, {"date": "17 Jun 2013", "title": "Manager, Non-Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through other source. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals", "Interview Descriptions": "Crazy process.  Responded to a posting on LinkedIn within 2 days of it being posted.  It literally read like my current job description and felt like a completely natural fit.  I was very excited and waited to hear.  And waited and waited and waited.  Finally more than a month later, I got a call from the recruiter to set-up a phone interview.  We set up a phone interview for a few days later but she didn't call until 30 minutes after our scheduled time.  We rescheduled and had the interview.  She read through the bullets of the job description and turned them into questions.  Interesting approach.  At the end, she informed me I was very late in the process and that there were already two people in the reference stage, but she would try to get me in to the Director, but we had to move very fast.  This puzzled me because I had applied, at this point, almost 6 weeks earlier immediately after it was posted on the recruitment site.  But no matter, I told her I would be quickly available for further interviews and would wait to hear from her.\r\n\r\nAt any rate, I was thrilled to be moving on in the process!  Many days went by again and I heard nothing.  Finally, I sent an email to ask about the status.  I received a response that an offer had gone to one of the other two I mentioned above and they had accepted.  I was incredibly disappointed and sad that I missed out on such a perfect opportunity.\r\n\r\nA few weeks later, I found a old work colleague was working in the same office.  I decided to reach out and see if maybe any other opportunities would be coming up and get the inside track.  I told of my experience and learned some interesting facts about the job I applied for.  Yes, there had been two people considered for the position.  Both were internal candidates and neither got it because it was deleted and the responsibilities were distributed among others.  Oh, and this happened a full month before I even interviewed, right about the time it was posted on LinkedIn!\r\n\r\nSo, in short, there was never a job available!  I cannot even begin to imagine why it was posted on LinkedIn and why I was lead through a process that was never going anywhere.  Seems kind of cruel indeed!", "Interview Questions": "What matrices do you use? "}, {"date": "30 Jun 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals in Feb 2013", "Interview Descriptions": "Interview process was pretty uncomplicated.  Interview itself was as expected. Once I was offered the job, I started a few weeks later with the only hiccup being that Massachusetts takes too long to process background checks (Not UCSF's fault)  Throughout the whole process, HR kept me informed.", "Interview Questions": "Interview questions were pretty standard.  Generally followed a \"tell us about a time when you...\" kind of format.  A lot of interpersonal interaction type questions"}, {"date": "22 Sept 2013", "title": "Histotech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals in Oct 2012", "Interview Descriptions": "the supervisor is very nice, she is relaively new and is a breath of fresh air. 'Maria' is kind to her staff and hires only the best...although she was forced to promote an unqualified, non-certified tech...", "Interview Questions": "Nothing really...the supervisor is very professional and got me to talk about who I really am..."}, {"date": "30 Aug 2016", "title": "Department Clinical Research Administrative Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (Sacramento, CA) in Sept 2012", "Interview Descriptions": "The interview was a very standard panel style question and answer session.  The 3 interviewers had a list of the same questions but asked one at a time and switched off from one interviewer to the next.  The questions were standard situational interview questions to force a response tied to an actual experience not a hypothetical scenario.  Past behavior is often an accurate indicator or predictor of future behavior.", "Interview Questions": "Tell us about a time you had to make a difficult decision."}, {"date": "30 Aug 2015", "title": "Analyst VI Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Sept 2012", "Interview Descriptions": "They called me and then I came into the Parnassus site.  The contact was originally through word of mouth - I was recommended by current employee.  The interview was 1:1 with the manager and then the director (2nd interview - returned to same site).  I was also given a short tour.", "Interview Questions": "Situational questions regarding issues that I would typically run into on the job - how to handle stress points when work is challenging and the needs are high.  "}, {"date": "18 Jul 2015", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Feb 2012", "Interview Descriptions": "Panel interview. First phone interview started after the phone notification for the appointment. There were 6 management personnel took turn asked about my knowledge of accounting process. Some other questions include the behavioral related, some situation questions to test my response.", "Interview Questions": "what is the process for completing bank reconciliation?"}, {"date": "9 Sept 2015", "title": "Hospital Assistant III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals in Nov 2011", "Interview Descriptions": "Interview was pretty easy but it really depends on which department you apply for. You must have some medical knowledge and learn how to deal with patients if in a patient setting.", "Interview Questions": "They give you a difficult situation and how do you handle it?"}], [{"date": "1 Nov 2014", "title": "Student Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Oct 2011", "Interview Descriptions": "I contacted approximately 40 research scientists at UCSF Medical Center, and 3 people responded back to me. I had 3 years of molecular biology research experience (benchwork and field work), but I found competition to be very steep for someone without a degree. The first two scientists I interviewed with were extremely intimidating, and made it clear that all they cared about was publishing papers. I wanted more of a work-life balance, and didn't feel comfortable working for people with such a one-track mind in the workplace. The third scientist I interviewed with was highly accomplished, but seemed to be a well-rounded person. They spoke about their team, the \"vibe\" around the lab, their research goals, etc. I made it very clear that I was interested in a position, and wanted to follow up with this scientist as soon as possible.\n\nOverall the process was very intimidating.", "Interview Questions": "What kind of research experience do you have?"}, {"date": "31 Mar 2014", "title": "Clinical Trials Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals in Sept 2011", "Interview Descriptions": "Applied online, contacted 1 week later by the hiring manager. Had a 1-1 in person interview and took a tour through the clinic. Received a call the next day that I was hired", "Interview Questions": "How do you deal with conflict regarding coworkers?"}, {"date": "25 Sept 2011", "title": "Administrative Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Jun 2011", "Interview Descriptions": "I applied online and was called by a recruiter shortly after I submitted my application. I completed a short phone screening with the recruiter to clarify my background and set up a interview with the hiring manager. I completed an interview with managers I would be working with as well another analyst. Questions asked were the typical behavior questions (ex. How do you determine priorities in scheduling your time? Give examples.) The process was quick, as they were looking to hire immediately. The company is going through lots of restructuring so although the position was stable the work was going to change. The manager was to call to let me know if I needed to come in for second round interviews. The managers did not let me know I was no longer as they said that would. I received a call from HR a week after I should have had the second round interviews to make sure I knew I was no longer a candidate.", "Interview Questions": "Tell me about your weaknesses."}, {"date": "12 Feb 2011", "title": "Manager, Non-Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 months. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Feb 2011", "Interview Descriptions": "The process started with me first talking over the phone with a partner of theirs. Once approved they then set me up with a panel of 6 interviews, 3 of them couldn't even make it to the building and had to be done via the phone. Once then, they asked me to come back and meet with more people several weeks later. They knew that I had a deadline and provided no feedback or contact even though I tried emailing and calling both HR and the Hiring Manager.", "Interview Questions": "Please describe your management style"}, {"date": "21 Dec 2010", "title": "Psychologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Dec 2010", "Interview Descriptions": "I had a phone interview with the head of the psychology department. He asked me basic questions about my careers goals, graduate school training, internship and postdoctoral training. After passing this hurdle I was asked to come in for an in-person interview. I met with 4 individuals 1:1; 2 psychologists, a psychiatrist, and the clinic director who was not a clinician. The questions asked were similar to those asked over the phone, and of course they wanted to know why I was interested in the position. All were very friendly except for the clinic director who I felt was trying to give me a hard time, by asking repetitive and irrelevant questions.", "Interview Questions": "How would your best friend describe you in 3 words? how would you describe yourself?"}, {"date": "21 Jun 2010", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Feb 2010", "Interview Descriptions": "It was a first round interview", "Interview Questions": "This job is quite different from your previous job.  How do you see yourself in it?"}, {"date": "8 Sept 2009", "title": "Administrative Assistant  Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Aug 2009", "Interview Descriptions": "I was called for a phone interview and we agreed to speak at 2 p.m. that day.  The woman interviewing me said they chose 10 people for a phone interview from 400 applications and would narrow it down to 3 finalists.  She asked \"What kind of environment do you thrive in?\"  I said \"I thrive everywhere I go\" which did not satisfy her.  She then asked, \"What kind of people do you work well with\" and I said that I don't have pre-determined ideas about who I can work with or who I can't...that I take people as they are.  She said that she just wants to make sure the person they hire will work well with the various personalities there.  So I said that is a hard thing to judge in a phone interview.  So she then asked what is my work philosophy. I said I wasn't sure I understood what she meant by that.  She repeated the question and so I told her about a poem I read recently about work, about hands, heart and mind all working in unity....and that I put my heart into every job I do.  She asked if I had questions and I asked what she was looking for in the phone interview that would lead her to choose the finalists and she said she that just by talking to people, she could get a \"feel\" for who were the best candidates (totally subjective I thought).  So she wrapped things up and I said well am I going to be one of the finalists? She said she didn't know, that she had to talk to the others first and I should wait. I asked her what she thought my chances were and she was noncommittal and offered no reassurance which made it obvious that I would not hear from her again.", "Interview Questions": "What is your work philosophy"}, {"date": "6 May 2009", "title": "Manager, Non-Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Feb 2009", "Interview Descriptions": "Initial phone and e-mail contact.\r\nInterview with Director and 2 other managers separately \r\nAnother interview was canceled by the manager.\r\nBackground and extensive reference check \r\nVery lengthy process before offer \r\nSlow HR dept.", "Interview Questions": "Questions regarding personal time I took off between past jobs"}, {"date": "15 Nov 2009", "title": "Hospital Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UCSF Medical Center and UCSF Benioff Children’s Hospitals (San Francisco, CA) in Mar 2007", "Interview Descriptions": "I applied online. I also sent my resume in to the hiring managers. I received a call from the hiring supervisor; he spoke with me over the phone and asked me to go in for an interview. After he told me about the position and what they're hoping to find, we agreed on terms of employment. I was interbiwed by two other people. The hiring manager and the head of the department. I was employed. They had to do a background check. I came to be trained for two days and thereafter I started my regular employment.", "Interview Questions": "The interview questions were very appropriate."}]]