[[{"date": "24 Mar 2023", "title": "Community Rehabilitation Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Skip of New York", "Interview Descriptions": "At office, in person. Not a long process for someone referred by a parent. Don't really remember the process, but it was not a difficult one. I got my employee ID the same day I think.", "Interview Questions": "At office, in person. Not a long process for someone referred by a parent. Don't really remember the process, but it was not a difficult one. I got my employee ID the same day I think."}, {"date": "29 Oct 2019", "title": "HCBS Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Skip of New York", "Interview Descriptions": "interview process was fairly straightforward and easy. I was given a brief description of the role and what it entails. After the interview process there is a written portion which again was easygoing. The whole process took about 40 minutes, and was offered the job on the spot.", "Interview Questions": "what are my strength and weakness, along with why I was interested in the position."}, {"date": "14 Feb 2019", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Skip of New York", "Interview Descriptions": "Very professional with great questions.  They did not feel unwanted.  I felt very comfortable and at ease with the interviewer.  I did not feel nervous and that made the interview more lucid.  I felt comfortable with delivering my answers.", "Interview Questions": "Why do you think you are a good fit for this role?"}, {"date": "17 Aug 2017", "title": "Medicaid Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Skip of New York (New York, NY) in Aug 2017", "Interview Descriptions": "There were two parts to the interview, an oral interview and then a written interview. The written portion had about four steps to it and I found one of the steps quite difficult as I have very little experience in this field.", "Interview Questions": "Have you ever seen a coworker do something unethical? How did you respond?"}, {"date": "20 Apr 2017", "title": "Community Habilitation Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Skip of New York", "Interview Descriptions": "I was overdressed sitting across from my interviewer, who was wearing a flannel and jeans. I felt minimal pressure during this casual, friendly interview process. However, it was still important to be prepared and qualified.", "Interview Questions": "How would a previous supervisor describe you in one word?"}, {"date": "29 Aug 2016", "title": "Intake Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Skip of New York in May 2016", "Interview Descriptions": "I was asked to come in 3 weeks after applying, but I requested a phone interview because I was out of state. They begrudgingly complied- but mixed up the day and time because they do not use email or electronic calendars (the first of the red flags).  I eventually had phone interview with executive director and program director, it went extremely well and I was very excited about the role. When I met with them in person, the interview was very unstructured. They had very few legitimate questions to ask and I felt like they did 95% of the talking. Afterwards, they had me complete an intake and do a computer task. The task was so basic and I quickly realized that I was beyond qualified for this position.  During the interview, the role and salary they spoke about offering me was VERY different from the role and salary they actually offered me. The biggest turnoff from the whole experience was the negative way in which the executive director spoke about her employees. I would never want to work for someone who did not value and support her staff.", "Interview Questions": "The presented a case for a patient and had me complete an entire written intake form"}, {"date": "30 Apr 2016", "title": "QA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Skip of New York", "Interview Descriptions": "Called in to meet with two supervisors. Pretty basic questions. Then given a 'quiz' to fill out by recognizing the important information. Once you were done you hand it in and go home and wait to be called. Overall interview was ok.", "Interview Questions": "How do you work with consumers."}, {"date": "8 Aug 2015", "title": "Service Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Skip of New York", "Interview Descriptions": "2 to 4 people may be interviewing, you greet someone, get handed paperwork to fill out and then start interview process 15-20 minutes later. After official interview more paper work to fill out.", "Interview Questions": "when is a time when you dealt with a difficult supervisor"}, {"date": "16 Nov 2015", "title": "Community Habilitation Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Skip of New York (New York, NY) in Aug 2015", "Interview Descriptions": "Recieved a referral from a family, came into NYC office for a short (1 hour approximately) 1:1 interview with one of hiring personel.  Had to bring specified documents and resume and asked routine questions.  Offered position at end of interview and began orientation one immediately following.", "Interview Questions": "What experience do you have working with children with disabilities? Why do you want to work for SKIP of NY?  What experiences and qualities do you have that you think will help you with this position? What one word would a friend or colleague use to describe you?"}, {"date": "10 Jun 2016", "title": "Case Manager/Service Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Skip of New York (New York, NY) in Jun 2015", "Interview Descriptions": "you come in fill out an application. you wait forever for them to come and get you to interview you after filling out the application. there are two supervisors that interview you for the position.", "Interview Questions": "why do you want to be a case manager"}], [{"date": "19 Jun 2017", "title": "Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Skip of New York (New York, NY) in Apr 2015", "Interview Descriptions": "Applied online and they got back to me about 3 weeks/4 weeks later to come in for an interview.  Can in and met my direct supervisor for about 45 minutes.  This followed by a computer test (had to draft an email) etc- very easy if you regularly use computers at home.  Then they asked me to come in for a presentation in front of the director and about 3 other staff members.  They gave me the topic and to give a 20 minute presentation.  I prepared a ppt and a handouts which I emailed them and they photocopied them for me.", "Interview Questions": "Tell us about your training experience"}, {"date": "12 Apr 2017", "title": "Teaching Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Skip of New York (New York, NY) in Jan 2015", "Interview Descriptions": "Badly Organized\r\nHaphazard scheduling\r\nInterviewers not prepared. They seem to be doing it as a chore But were not bad intentioned \r\nThey can use some basics in how to interview people, Their focus was to impress by asking seemingly tough questions", "Interview Questions": "Why I am looking for a job"}, {"date": "2 Oct 2014", "title": "Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Skip of New York", "Interview Descriptions": "You will interview with at least 2 SKIP supervisors and/or directors. You'll have a chance to hear about the job description and ask questions. Then asked a series of questions about prior experience and describing scenarios. You'll also need to rate different skills such as organization etc.", "Interview Questions": "Be ready to give examples of your previous experiences ex: Describe a time when you were not given clear instructions on how to proceed, what did you do?"}, {"date": "18 Dec 2014", "title": "HCBS Coordinator Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Skip of New York in Oct 2014", "Interview Descriptions": "Interviewer used questions like \"why do you want to work for skip\" \"what would you bring to the company\" \"what would you do if this happened\". First was the 1:1 interview, next was the written component. Bring references and all information on previous employers to initial interview.", "Interview Questions": "There was a written component to the interview"}, {"date": "22 Apr 2016", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Skip of New York (Rochester, NY) in Feb 2014", "Interview Descriptions": "Interviewed by two supervisors who asked wonderful and pertinent questions. Ladies were professional and very nice.  Business casual was the dress code.  The room we interviewed in was somewhat private.", "Interview Questions": "When was a time you felt as though a coworker was doing something bad and what did you do about it?"}, {"date": "3 Oct 2013", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Skip of New York", "Interview Descriptions": "1 interview and it seems most people get hired", "Interview Questions": "what do you know about SKIP"}, {"date": "20 Jun 2017", "title": "IT ASSISTANT Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Skip of New York (New York, NY) in Sept 2013", "Interview Descriptions": "It wasn't hard, they asked the basic questions like tell me about yourself. What are your strengths and weakness. Why do you want to work for SKIP? The overall interview process was not difficult.", "Interview Questions": "Tell me about yourself and why you would be a good candidate for this job "}, {"date": "25 Sept 2015", "title": "Community Habilitation Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Skip of New York (New York, NY) in May 2013", "Interview Descriptions": "I appllied throught the website idealist. Fairly easy process, was called back within the week for an interview.The questions are really reasonable too, they don't try to stump you or make you nervous.", "Interview Questions": "Do you have any experience with working with anyone with a mental disability?"}, {"date": "6 Jun 2015", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Skip of New York (New York, NY) in Mar 2013", "Interview Descriptions": "You speak to HR who you may think is one way. Very nice sweet explains the position and asks u a few questions. Answer them and maybe they will take you around the office. They tell you what the company does and how they handle their cases. In my opinion though they are not so good getting the children with disabilities the things they need.", "Interview Questions": "How would you benefit us by you working here?"}, {"date": "18 Sept 2015", "title": "Community Habilitation Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Skip of New York (New York, NY) in Mar 2011", "Interview Descriptions": "Everything goes through recruiter and you sit with them and discuss questions and scenarios and why you are good for the job . Then go through orientation process next .", "Interview Questions": "Why are you the person for this job?"}], [{"date": "31 Jul 2012", "title": "Service Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Skip of New York (New York, NY) in Apr 2009", "Interview Descriptions": "Called me, had one interview, was hired in a week.", "Interview Questions": "I cannot remember. The interview, as I remember was a breeze."}]]