[[{"date": "14 Dec 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Georgia Gwinnett College", "Interview Descriptions": "The process was very friendly and very efficient. Interviewed with a few people first interview, then the hiring manager, then one of the Hr people. It was a full comprehensive interview and there were not any questions that one would not typically expect of an interview", "Interview Questions": "How would you describe yourself in a profession setting?"}, {"date": "12 Aug 2022", "title": "IT Helpdesk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Georgia Gwinnett College", "Interview Descriptions": "Quick and easy. All the managers were accommodating and nice. Got to see the entire office space and employees. Office space is really open and employees are all peers of the school.", "Interview Questions": "Describe a time you had to work in a team setting"}, {"date": "6 Oct 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Georgia Gwinnett College", "Interview Descriptions": "lovely interview process, I got the job. worked with amazing coworkers. One interview with the hiring manager and another one with the potential coworkers. Great job for students who need the extra cash for college expenses.", "Interview Questions": "why do you want this job?"}, {"date": "16 Mar 2021", "title": "Student Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Georgia Gwinnett College", "Interview Descriptions": "They are very easy going and easy to talk to. GGC values their diversity, so they are very open to people from all different backgrounds.  Throughout the interview they were making sure that I was very comfortable and they also let me ask them questions that I had. They also reply fast to their emails if I were to have any important question and the process was very quick. Amazing individuals!", "Interview Questions": "What are your goals and aspirations? "}, {"date": "22 Aug 2019", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Georgia Gwinnett College (Lawrenceville, GA)", "Interview Descriptions": "The process was not managed well at all. It's said that as a young campus, they are still trying to solidify their processes and culture, but to me it seems that there is just plain incompetency and/or no concern for candidates on their part.\r\nA brief pre-screen with the hiring manager. This was followed by an online video interview with some of the hiring committee. Was invited for an on-campus interview with the full committee.\r\nWas very positive about the interviews, especially as the hiring manager said off-hand during the online interview that they should bring me to campus. However, they didn't pay for any of the campus trip from out of town. Further, despite being told that the on-campus interview was scheduled for when the entire committee could be present, only a portion of the committee (the same people from the online portion) were present. To add insult to injury, no new questions were asked of me - the exact same questions were repeated by the same exact people. I have to say, a very high lack of professionalism during the whole process, made worse by the fact that I had to foot the bill for the campus visit.\r\nIt took a month and a half after the 2nd interview to hear anything.", "Interview Questions": "Nothing all that interesting, typical, boiler HR behavioral questions."}, {"date": "2 Apr 2019", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Georgia Gwinnett College", "Interview Descriptions": "Visited the campus twice for interviews, taking time off from my job each time. Interviewed with 6 different people. Called hiring manager after about a week had gone by, was told that the HR people would let me know. Never heard anything further.", "Interview Questions": "Normal questions"}, {"date": "4 Feb 2019", "title": "Customer Care Agent Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Georgia Gwinnett College (Lawrenceville, GA) in Jan 2019", "Interview Descriptions": "I applied online and received an invitation for an interview via email. They scheduled the interview for about 3 weeks after I received the email which was a ridiculously long wait. It was the worst interview I have ever been to. They asked questions that had nothing to do with the job I was applying for. They seemed to be management based even though I was not applying to be in charge of anybody. They also couldn’t answer any questions about pay or benefits. They said it could take another 1-3 months to hear anything from HR if they wanted to hire me. I was not happy with the idea of waiting that long for a job where I didn’t even know if it would pay me what I needed.", "Interview Questions": "What is your management philosopy?"}, {"date": "28 Aug 2019", "title": "Help Desk Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Georgia Gwinnett College (Lawrenceville, GA) in Jun 2017", "Interview Descriptions": "The interview was very straight forward. The boss and the supervisor will ask you a few questions about computer hardware and software. the next part will be a lot of tech question that requires a thinking process.", "Interview Questions": "how do you get into file1 on a server"}, {"date": "1 Mar 2017", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Georgia Gwinnett College", "Interview Descriptions": "I interviewed with about five faculty from different academic departments. They asked me to present my research to them. I did so, and I was hired immediately. It was more of a roundtable discussion than it was an interview.", "Interview Questions": "They didn't ask me any questions that I can remember other than what were my teaching missions and methods of teaching."}, {"date": "10 Jan 2017", "title": "Advancement Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Georgia Gwinnett College (Lawrenceville, GA)", "Interview Descriptions": "3 separate interviews:\r\n1.) Phone with hiring manager (30 min)\r\n2.) In person with hiring manager and another member of staff (1 hr)\r\n3.) In person with the entire staff (2+ hrs)\r\n\r\nI felt fairly confident during the process and was surprised when I never hear back from HR or the hiring manager. The culture of the college is clearly not solidified yet and I think there's a lot of disorganization with processes like hiring.", "Interview Questions": "What is your hidden talent?"}], [{"date": "5 Mar 2016", "title": "Applications Developer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Georgia Gwinnett College", "Interview Descriptions": "Met with the other developers and director. Was asked to tell them about a project I have worked on in the past. In second interview the VP sat in and asked some questions.", "Interview Questions": "Tell me about a project you've worked on recently."}, {"date": "14 Apr 2016", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Georgia Gwinnett College in Dec 2015", "Interview Descriptions": "Received email for phone interview 2 weeks after applying online.\r\nPhone interview was a group phone interview with the hiring committee (6 faculty).\r\nReceived email asking for in person interview 2 months after phone interview.\r\nIn person interview involved teaching guest lecture, tour of campus and facilities, and group interview for 1 hour with hiring committee.\r\nOverall the interview went well.\r\nI received a phone call 1.5 months after my in person interview offering me the position.", "Interview Questions": "What courses would I like to teach?\r\nWhat is my teaching philosophy?\r\nOther standard teaching interview questions."}, {"date": "22 May 2017", "title": "Peer Supplemental Instruction Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Georgia Gwinnett College (Lawrenceville, GA) in Dec 2015", "Interview Descriptions": "Fairly simple - if you are honestly interested in teaching/tutoring people, then you can have a quick and truthful discussion with the professors you'll be working with/under. It's more of a sit-down-and-have-a-discussion rather than straight questions and answers. There is no right or wrong answer, they just want to see if you are competent and creative enough to help your fellow students with biology.", "Interview Questions": "How would you handle situations where students are not understanding the concepts?"}, {"date": "6 Mar 2015", "title": "Technical Trainer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Georgia Gwinnett College (Lawrenceville, GA) in Sept 2014", "Interview Descriptions": "Received a call from HR, and was asked if I had a few minutes for a couple of screening questions.  These were not screening questions.  These were actual interview questions.  I was completely caught off guard, but apparently did alright.  I was called for an actual interview. Since I was out of town, the next interview was by Skype. It was a panel type interview, and everyone was so nice.  It was very enjoyable for an interview.  I was advised that it would be several weeks before hearing the outcome.  However, I never received any notification.  That was disappointing.  Even a letter advising you are not selected is better than hearing nothing at all.", "Interview Questions": "Tell us about yourself."}, {"date": "11 Dec 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Georgia Gwinnett College (Lawrenceville, GA) in Jun 2014", "Interview Descriptions": "Submitted resume online with a cover letter.  Met for a face to face interview.  I dressed in a suit and commented to the interviewer you should always dress one step higher than the position you are applying for.  This impressed the interviewer and got me hired.", "Interview Questions": "What makes you feel you are qualified for this position?"}, {"date": "21 May 2014", "title": "Assistant Professor Education Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Georgia Gwinnett College", "Interview Descriptions": "I was invited does for on campus interview with a panel. They were very poor with follow up communication. I received no response from my follow up email. Very unprofessional.  It speaks volumes about the culture of the organization..Overall I was not very impressed.", "Interview Questions": "What is your teaching philosophy? "}, {"date": "28 Jul 2015", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Georgia Gwinnett College in Mar 2014", "Interview Descriptions": "I had a great experience interviewing with Human Resources. I received a call to set up a phone interview and a few days after that phone interview I was called for an in-person interview. They were all very professional and friendly.  Their communication was great being they were such a small staff.", "Interview Questions": "What can you bring to this institution that is unique?"}, {"date": "25 Oct 2013", "title": "Professional Writing Tutor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Georgia Gwinnett College", "Interview Descriptions": "Interviewed with Dean and was offered position on the spot.", "Interview Questions": "Why did you leave teaching?"}, {"date": "17 Jun 2015", "title": "Marketing/Communications Position Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Georgia Gwinnett College (New York, NY) in Sept 2013", "Interview Descriptions": "The phone screen wasn't bad. I talked to a person in HR that liked my resume and wanted to pass it on to the supervisor of the dept I was interviewing for. I had an in-person interview with three ladies and one guy and they all looked and sounded like they could care less about me when I entered the room.", "Interview Questions": "Why do you want to work for GGC?"}, {"date": "11 Dec 2017", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Georgia Gwinnett College (Lawrenceville, GA) in Aug 2013", "Interview Descriptions": "It was a fairly standard interview for the adjunct position. I've been an adjunct at several universities, and it was more or less in line with other interviews. As you're being considered for a temporary position, the interview is focused more on whether your CV is correct and whether you can meet the time and subject matter commitments required of the position.", "Interview Questions": "Are you able to observe the posted schedule of classes?"}], [{"date": "4 Nov 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Georgia Gwinnett College (Lawrenceville, GA) in Jun 2012", "Interview Descriptions": "Very hard interview. They asked tough questions. They introduced me to management and showed me a tour of Georgia Gwinnett College. It took about a hour. Make sure to do your research before meeting them, it shows professionalism. Also dressing professionally is a must, even if it is a Student Assistant position.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "1 Aug 2015", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Georgia Gwinnett College in Feb 2011", "Interview Descriptions": "Multiple interviews, phone interview and an in-person interview with \"hiring committee,\"\r\ninterview with the dean\r\nteaching demo in front of the hiring committee and any other professors who wished to attend\r\ntwo week new faculty orientation\r\nthe hiring committee is composed of about 6 full time professors- they are overworked\r\n* knowing someone in the specific department helps as there are many people who apply", "Interview Questions": "how would you motivate beginning college students?\r\nwhat are your research interests?\r\nhow do you work with multiculutral students? \r\nwhat is a time you went out of your way to help a student in your class?"}, {"date": "8 Aug 2012", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Georgia Gwinnett College (Lawrenceville, GA) in May 2010", "Interview Descriptions": "Usually they try to meet with you at an employment center at the upcoming math conference. They are excellent with communicating and keeping you updated about the developments. Maintain a very friendly environment and are very forthcoming in terms of both positives and negatives of working at GGC.", "Interview Questions": "N/A"}]]