[[{"date": "21 May 2023", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at HonorHealth (Scottsdale, AZ)", "Interview Descriptions": "Easy going, talked like it was normal conversation. Friendly management. Very easy to get involved in the interview. One of the easiest processes for me. Easy part was the onboarding process", "Interview Questions": "Do you work well with others in a low management work environment??"}, {"date": "1 Feb 2023", "title": "In Home Caregiver Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at HonorHealth", "Interview Descriptions": "Fast and to the point went well very kind staff, with a great pay. Broke down jo description well and was able to labe interview knowing exactl what yhe job entailed of.", "Interview Questions": "Ho many years experience do you have?"}, {"date": "6 Jan 2023", "title": "Registered Nurse, Emergency Room Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at HonorHealth (Phoenix, AZ) in Dec 2022", "Interview Descriptions": "Interview consisted of critical thinking questions with a panel of staff. Other questions were behavioral and knowledge based. Staff was welcoming, but difficult to engage with due to the number of staff on the panel while each would write following the question that was answered.", "Interview Questions": "Q: You have four patients and must prioritize them: A, B, B, & D. Describe the framework you used to make this decision. How would delegation effect your ability to prioritize?"}, {"date": "12 Nov 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at HonorHealth", "Interview Descriptions": "Spoke to a recruiter after passing online tests then interviewed via phone with a director. Basic interview questions reviewing prior work experience and future goals. Nothing unexpected or new from prior experience.", "Interview Questions": "Previous units worked, why I chose honor health."}, {"date": "18 Oct 2022", "title": "Research Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at HonorHealth", "Interview Descriptions": "Interview process was very smooth. It was two other nurses. Very informative interview and very personable staff. They were very familiar with my background and training and seemed genuinely interested in my answers to their questions.", "Interview Questions": "Why do you want to work at honor health?"}, {"date": "13 Oct 2022", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HonorHealth", "Interview Descriptions": "Large hiring event interview process - took a few weeks to hear from them, attended and was able to talk with someone fairly quickly. Pretty basic interview questions for PCT.", "Interview Questions": "What was a stressful situation that you handled well?"}, {"date": "20 Oct 2022", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at HonorHealth (Scottsdale, AZ) in Oct 2022", "Interview Descriptions": "The interview process consisted of an initial interview with the unit hiring manager and then a secondary interview with the unit supervisor. It was relaxed and common interview questions were asked, with some situational questions introduced as well.", "Interview Questions": "Tell me about yourself. Why do you want to work for HonorHealth? What do you look for in an employer? Where do you see yourself in 5 years? Tell me about a time that you experienced a conflict with a colleague."}, {"date": "10 Oct 2022", "title": "Digital Marketing Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at HonorHealth (Littleton, CO) in Sept 2022", "Interview Descriptions": "Recruiter, direct manager, and marketing team. Some for the folks were nice and funny, others looked as if they were constipated and on the interview against their will. Just try not to laugh. Pay range was excellent. Benefits look good too.", "Interview Questions": "Why would you like to work here?"}, {"date": "28 Jul 2022", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HonorHealth", "Interview Descriptions": "There was a 3 step interview process.\n\nI first met with the organization's recruiter. After that interview I then met the manager. The last step of the interview process was interviewing with my supervisor.", "Interview Questions": "They asked about my skills and how I could apply them to this role."}, {"date": "11 Jul 2022", "title": "Admitting Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HonorHealth", "Interview Descriptions": "The recruiter was so easy to talk to and took the time to explain the position and department and company culture to me. I was was nervous before speaking with her.", "Interview Questions": "What interested you in this position. "}], [{"date": "27 May 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at HonorHealth", "Interview Descriptions": "Immediately was interviewed yet waited for 1 month to be denied.  These people are disgusting and horrible people who have no conscience.  They string people along.  It’s highly offensive and I  truly think they hate Mexicans and Gay people", "Interview Questions": "Why change career after 20 years?"}, {"date": "27 May 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HonorHealth", "Interview Descriptions": "The recruiter was really nice and easy-going. She asked me some screening questions and then asked me about my previous job.  She made me feel comfortable as a new-grad nurse.", "Interview Questions": "Why are you interested in working at Honor Health?"}, {"date": "26 May 2022", "title": "RN New Grad Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at HonorHealth in May 2022", "Interview Descriptions": "I applied and a recruiter reached out to me the next day to schedule a phone screen to discuss the hours, wages, benefits. I was also emailed assessments (pharm, med-surg, personality, behavior, attitude) to complete prior. After the phone screen, I was scheduled for a phone interview with the unit director where I was asked behavioral/situational questions. She was very nice and I was able to learn more about the work culture and job expectations.", "Interview Questions": "Can you tell me about yourself?"}, {"date": "19 Apr 2022", "title": "Oncology Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at HonorHealth", "Interview Descriptions": "The interview was very straightforward. The group asked about my experience with cancer patients and my confidence in specific skills.  The department leaders were welcoming and excited to meet their candidates.", "Interview Questions": "What do you think is most important when interacting with this patient population?"}, {"date": "14 Apr 2022", "title": "Ultrasound Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HonorHealth (Phoenix, AZ) in Apr 2022", "Interview Descriptions": "I had a seemingly organized and pleasant interview process.  I had submitted multiple applications for similar positions and was called back within a few days was emailed back to schedule a phone interview. The phone interview was with a recruiter that went over qualifications and job expectations.  Later that day I found out I passed the first round and moved onto the in-person interview with the department hiring manager. That was scheduled a week out and confirmed via email. I then did the in-person interview which was more informal than I thought it would be. My qualifications and boards and education were reviewed, and the department flow was explained. I was asked to demonstrate my scanning ability and showed around the department as well, and got to meet another employee. Within a few hours I was actually formerly offered the position, but originally was told I wouldn't hear anything back until the following week. I was so excited and surprised at the same time. The original recruiter called with the good news and sent an offer letter via email. Next will come the on-boarding and training, which I'm sure is a little bit different for every department.", "Interview Questions": "What made you choose sonography as a career choice? "}, {"date": "20 Mar 2022", "title": "PCT Patient Care Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HonorHealth", "Interview Descriptions": "Interview was  with the recruiter.  After the first e-mail, the phone call happened.  After the first elimination, there was a phone interview.  I was asked why I wanted this job and how I would deal with a negative situation.  After the next elimination came the testing part.  We had to solve as many questions as we could solve in 10 minutes.  But at the end of the interview, it was said that the position was given up and that they would not hired anyone.", "Interview Questions": "30 questions in 10 minutes, they were kind of math and mental arithmetic questions."}, {"date": "29 Dec 2021", "title": "PCT Patient Care Tech Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at HonorHealth (Phoenix, AZ) in Dec 2021", "Interview Descriptions": "The interview “process” is a disorganized joke. They host a career fair every Monday because they are desperate for employees, then take weeks to get back to you regarding start dates that are way past the date discussed at the interview. This is extremely disrespectful of employees time, especially when most applying to PCT jobs are nursing students. They want you to miss an entire week of class to do their “new employee orientation” which is absurd.", "Interview Questions": "What was one experience where you went above and beyond for a patient?"}, {"date": "4 Mar 2022", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HonorHealth (Phoenix, AZ) in Nov 2021", "Interview Descriptions": "Easy process just took many weeks to get back to me with an offer and all approvals. People seemed nice. Worried about vacant position and asked questions recruiter couldn’t answer directly", "Interview Questions": "Are you vaccinated to work"}], [{"date": "22 Dec 2021", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at HonorHealth (Scottsdale, AZ) in Nov 2021", "Interview Descriptions": "The interview process was lengthy. The lab manager sat for close to an hour complaining about nurses and bragged how she hung up the phone on doctors when they were \"acting arrogant.\"", "Interview Questions": "Nothing that pertained to the job"}, {"date": "15 Oct 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at HonorHealth", "Interview Descriptions": "Had a virtual fist interview recording answers to questions. Did not speak to an actual person to get my own questions answered. Felt impersonal, I am starting from within the community and know someone who was an outsider who had an actual phone interview. Do not know how they decide who get what type of interview.", "Interview Questions": "Introduce and tell about yourself why you want position"}, {"date": "26 Sept 2021", "title": "Registration Admitting Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at HonorHealth", "Interview Descriptions": "i am still in interview process, just received my video that i need to do but need a little guidance on the interview process. So i can be prepared for this interview and ready when it is time to do the interview, this will beneficial for someone who is trying to start off their career in the right direction.", "Interview Questions": "N/A"}, {"date": "10 Aug 2021", "title": "Diet Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at HonorHealth", "Interview Descriptions": "It was great. They asked questions about the job position and what I’ve done in the past. Overall very easy .  Really suggest applying and suggest try and get in the job to help people out see", "Interview Questions": "What will I bring tote company? "}, {"date": "24 Oct 2022", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at HonorHealth in Aug 2021", "Interview Descriptions": "Over the telephone after receiving a online notice for phone interview. Short less then 20 minutes, I have gone through 3 supervisors while in this position though; so your mileage may vary. This was for a float pool position where I never have met my supervisors.", "Interview Questions": "What are your weaknesses when working in a team? How would you handle a patient questioning care?"}, {"date": "23 Jul 2021", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at HonorHealth", "Interview Descriptions": "Human Resources agent phone call screening, fill out experience and expertise questionnaire, manager interview, references questionnaire, benefits negotiation , drug test approval, background check approval, offer letter with benefits signed.", "Interview Questions": "Why do you want to work for Honorhealth?"}, {"date": "12 Jun 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at HonorHealth", "Interview Descriptions": "Interview was short, less than 20 minutes. Hiring manager was late to the interview, but it was a positive experience and manager provided a lot of good insight during the short time we spoke.", "Interview Questions": "Tell me about a time when you had a difficult or challenging experience with a patient and how did you handle it. Is there anything that you would change?"}, {"date": "15 Jul 2022", "title": "EHS Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at HonorHealth (Phoenix, AZ) in Jun 2021", "Interview Descriptions": "Recruiter call, Manager Call, Manager and Team call ( virtual) there was a total of about 4 interviewers on the call. Had a great call with both recruiter and Manager, felt confrontational with their \"team\" as asking clarification of a question came off as me either insulting their intelligence or that I didn't know how to answer their question. Radio silence following the interview even with multiple follow-up emails. Very unprofessional organization to not even be able to update a candidate that they \"are very interested in\".", "Interview Questions": "What is your process for investigating injuries?"}, {"date": "4 Jul 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HonorHealth (Scottsdale, AZ) in May 2021", "Interview Descriptions": "Contacted via email by the recruiter several days after submitting an application online. Completed online assessment of clinical skills & pharmacology (kind of like NCLEX questions). Also completed behavioral/situational assessment. Completed recorded phone interview and was called to schedule a second interview shortly after.", "Interview Questions": "Tell me about a time when you had problems with a co-worker? \nTell me about a time when you had a difficult patient? \nWhat would you do in xyz clinical situation? \nWhere do you see yourself in 5 years? \n"}, {"date": "28 Apr 2021", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HonorHealth", "Interview Descriptions": "Once selected, a recruiter from HonorHealth will contact you directly to set up a phone interview.  If you meet the criteria for the position and successfully pass the phone interview, the second interview with be scheduled with the floor director.", "Interview Questions": "Name a time when you went above and beyond."}], [{"date": "30 Mar 2022", "title": "Registration and Scheduling Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HonorHealth (Chandler, AZ) in Mar 2021", "Interview Descriptions": "Online interview was professional and easy. Initially spoke with a Recruiter who determined if I was a good fit for the position that I applied.  Next step was to interview with the current Supervisor and manager via Video and Phone.", "Interview Questions": "Why are you interested in working for Honor Health?"}, {"date": "3 Feb 2021", "title": "RN New Grad Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at HonorHealth", "Interview Descriptions": "Recruiter contacts you by email then phone, and second interview is with the unit director. Simple questions & fast 10-30 minutes each interview. Decision is made within 48 hours after your second interview.", "Interview Questions": "Why did you choose honor health? "}, {"date": "2 Feb 2021", "title": "Research Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HonorHealth", "Interview Descriptions": "Applied on Indeed, heard back from a hiring manager within a couple of days. Had a preliminary interview to just go over basic stuff like schedule and availability. Had a second interview with the lab manager.", "Interview Questions": "They asked if I was familiar with following standard operating procedures and how my friends would describe my personality."}, {"date": "3 Apr 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HonorHealth in Feb 2021", "Interview Descriptions": "It was friendly and informative. We was asked by the Huey manager some behavior questions and what will you do kinda of questions during the interview.  At the end we was told that you will hear back about the hiring decision , which took about couple of days to know.", "Interview Questions": "What you will do with unsatisfying patient?"}, {"date": "7 Mar 2021", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HonorHealth (Phoenix, AZ) in Feb 2021", "Interview Descriptions": "Phone Interview  with the recruiter - because of COVID, the follow -up official interview with the Department Manager was over the phone / Zoom meeting, and everyone was very informative, kind and made the process less stressful.", "Interview Questions": "How do you handle conflict? "}, {"date": "14 Jan 2022", "title": "Patient Registration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at HonorHealth (Tucson, AZ) in Jan 2021", "Interview Descriptions": "Video Interview and Phone. Initial video interview with immediate Supervisor, then phone interview with Manager. Asked typical questions, professional discussion and non-stressful enviornment. Friendly responses with quick follow up via email after.", "Interview Questions": "Tell me about yourself please"}, {"date": "11 Jan 2021", "title": "Clinical Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HonorHealth (Phoenix, AZ) in Dec 2020", "Interview Descriptions": "I interviewed here at HonorHealth a few weeks ago and honestly thought The interview process all the way through was great all the way through.The recruiter was super nice and knowledgeable. The manager of the department was friendly, personable, organized and a pleasure to talk to. Interview questions were very simple and standard. It isn’t just about qualifications, it’s about people and relationships that will work effectively. Great company to work for. Great benefits and excellent pay.", "Interview Questions": "Why do you want to work at honor health?"}, {"date": "19 Feb 2022", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at HonorHealth (Phoenix, AZ) in Nov 2020", "Interview Descriptions": "Due to Covid, I did a phone interview.   I was asked scenario based questions.  Asked questions about how I would deal with uncooperative persons and what my response would be.", "Interview Questions": "What is your  experience working in a hospital environment"}], [{"date": "17 Nov 2020", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HonorHealth (Phoenix, AZ) in Nov 2020", "Interview Descriptions": "Amazing interview process the entire way through. Recruiters are very helpful, knowledgeable, and want to help you find a great fit. I'm so grateful for my HR person and what she did to help me land a job there!", "Interview Questions": "What can you bring to the team? How do you manage stress?"}, {"date": "29 Sept 2020", "title": "Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HonorHealth", "Interview Descriptions": "Applied on company website. A day or two later received an email to schedule a phone interview. After interview recruiter said if I didn't hear back by a certain date to follow up .", "Interview Questions": "Tell me about yourself professionally?\r\n\r\nDo you have any experience with stakeholder?\r\n\r\nAsked to tell about a recent campaign and the challenges faced."}, {"date": "7 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HonorHealth in Sept 2020", "Interview Descriptions": "Received an email to set up an initial Phone interview. Took the 15 min interview, received a  call back, and interviewed with the floor manager. Took only 5 days from first interview to  date of hire.", "Interview Questions": "Why did you choose honor health?"}, {"date": "12 Oct 2020", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HonorHealth (Phoenix, AZ) in Sept 2020", "Interview Descriptions": "First, I had a phone interview with a recruiter, where we went over the position details and set up the next interview. Then another phone interview with the unit manager.", "Interview Questions": "Why did you choose nursing?"}, {"date": "14 Sept 2020", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HonorHealth in Aug 2020", "Interview Descriptions": "Easy and enjoyable. You schedule your initial interview through a link and then select a day and time that work with your schedule. The HR team was very nice and informative. From there you get a series of tests for personality and critical thinking.", "Interview Questions": "Basic questions regarding previous care experience. I was also asked what is an example of  time I led  team and was the outcome successful, as well as what steps I implemented to make the task and team successful. "}, {"date": "18 Aug 2020", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HonorHealth (Phoenix, AZ) in Aug 2020", "Interview Descriptions": "easy.  straight forward questions.  friendly.  Was not very long.  It was a 2 interview process.  1st was describing the company and salary, benefits.  2nd was with a manager. The whole interview was about 15 minutes.", "Interview Questions": "tell me about a time you disagreed with manager"}, {"date": "10 Jan 2023", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HonorHealth in Apr 2020", "Interview Descriptions": "they will start with either a phone call with the recruiter or a video call with them from there once everything rolls over, its again the interview but this time it will be with either the supervisor or one of the managers or if you plan to work in a clinical setting, it could be all three managers, depending if you go into specialty", "Interview Questions": "i do not recall most of them other than whats one of your accomplishments from your last job? and also name a situation where you had to critically think about"}, {"date": "5 Jun 2020", "title": "Senior ServiceNow Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at HonorHealth in Apr 2020", "Interview Descriptions": "Initial call from HR, phone interview with hiring manager and team member. It was a 30 minute interview with the hiring manager asking behavioral questions and the team member asking technical questions back and forth.", "Interview Questions": "Tell us about your background with ServiceNow?\r\nWhat’s the difference between a business rule vs a client script.\r\nDescribe a time you used glideajax.\r\nDescribe a data policy vs a UI policy."}, {"date": "13 Mar 2020", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at HonorHealth", "Interview Descriptions": "The actual interview was one on one with the floor director.  HR called a week prior negotiating salary and explaining hours and applicable differentials. Interview itself lasted around one hour.  I got the HR call about 1.5 months after submiting the online application", "Interview Questions": "Greatest S/W"}], [{"date": "7 Feb 2020", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at HonorHealth (Scottsdale, AZ) in Feb 2020", "Interview Descriptions": "A recruiter reached out to me to set up a phone call and have me complete some online assessments. She then scheduled me for an onsite interview with the unit director and day shift supervisor.  Everyone was very friendly and made me feel comfortable asking questions.", "Interview Questions": "Why do you want to work here?"}, {"date": "19 Jan 2021", "title": "Customer Navigator I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HonorHealth (Phoenix, AZ) in Jan 2020", "Interview Descriptions": "The process was clear and smooth. My recruiter was very helpful and kept me updated. I filled out the application, got a text message from the recruiter, set up an interview, completed the interview and was offered a job the same day. The full process took no more then a week.", "Interview Questions": "Tell me about your current position. "}, {"date": "13 Aug 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at HonorHealth (Phoenix, AZ) in Jan 2020", "Interview Descriptions": "Got in touch with recruiter, had a phone interview with general questions and then was scheduled with an interview with manager. It was a very pleasant interview mostly personally based questions.", "Interview Questions": "How do you go above and beyond for your patients?"}, {"date": "23 Nov 2019", "title": "Health Information Tech Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HonorHealth (Phoenix, AZ)", "Interview Descriptions": "I applied online and received an email the next day about doing a recorded interview by video or phone. A call comes to you and asks you basic automated questions  along with giving you choices of what salary would I accept. I received an email from the recruiter who was concerned about my salary.  I told him what I needed and he gave me their top hiring range which was too much of a cut for me so I didn't pursue it.", "Interview Questions": "What is your related experience? Which of their core values do you think is most important? Why would I be a good fit?"}, {"date": "25 Jun 2021", "title": "Research Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HonorHealth in Nov 2019", "Interview Descriptions": "The interview was straightforward and quick. I was notified by HR that my resume was selected by the hiring manager and they were interested in scheduling an interview. I was asked a few questions about my experience and was given a salary range based on those points which I greatly appreciated as it gave me an idea of what the salary would be before potentially wasting mine or someone else's time. I interviewed within a few days and was given an offer the following week. Orientation falls on specific dates typically every 2 weeks so keep that in mind when transitioning from another job if you decide to accept. The process was very pleasant for me.", "Interview Questions": "Tell me something about yourself I would not be able to get from your resume. "}, {"date": "25 Oct 2019", "title": "RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at HonorHealth", "Interview Descriptions": "They did a phone quick interview and then they completed an in person panel interview. They were personal and situational based questions.  They wanted to know how you did in high intense situations as well as a team work environment", "Interview Questions": "Describe a situation in which you did not agree with your co-worker, how did you handle it?"}, {"date": "26 Mar 2021", "title": "RTR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at HonorHealth (Phoenix, AZ) in Oct 2019", "Interview Descriptions": "I walked in and already had the job. My interviewer warned me about certain team members and advised me to just ignore them. That's when I should have turned right around.", "Interview Questions": "\"Are you able to alone?\""}, {"date": "13 Jul 2021", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HonorHealth in Sept 2019", "Interview Descriptions": "Applied and within two days had a phone interview as well as a few different assessment exams. Then scheduled a  face to face interview and was hired the next day.", "Interview Questions": "Tell me a time you went above and beyond"}, {"date": "1 Jul 2019", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at HonorHealth", "Interview Descriptions": "I have submitted 22 applications for positions as patient care technicians with this company, and despite meeting all the requirements posted have been interviewed for only two, neither of which have been successful. Trying to reach out to the recruiter is ineffective as they ignore your texts and voicemails for help and advice for people who just want to work for the company.", "Interview Questions": "N/A"}], [{"date": "28 Jul 2019", "title": "Laboratory Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at HonorHealth (Scottsdale, AZ) in Jul 2019", "Interview Descriptions": "Typical interview process and questions. What are my strengths and weakness ? What were your accomplishments at your previous employers ? Getting to the initial interview is a bit daunting compared to other organizations - very thorough vetting process.", "Interview Questions": "What are my strengths and weakness ? What were your accomplishments at your previous employers ?"}, {"date": "29 Jul 2019", "title": "Foundation Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at HonorHealth (Scottsdale, AZ) in Jul 2019", "Interview Descriptions": "I made it past the initial phone interview and was contacted to schedule a time the following week for an in person interview. I confirmed the date/time provided worked for my schedule and received an email the following day letting me know they already made an offer and apologize for getting my hopes up. I was extremely disappointment with this email and process.", "Interview Questions": "Why do you want to work at HonorHealth?"}, {"date": "1 Aug 2019", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HonorHealth (Phoenix, AZ) in Jun 2019", "Interview Descriptions": "Online application was followed within several days by a request to schedule a phone interview consisting of a brief discussion of prior job experience and skills as well as a breakdown of salary and benefits. In person interview was about one hour in length and required more detailed description of previous experience and lengthy personality questions.", "Interview Questions": "How did you handle a previous experience where you had to discipline employees you managed? "}, {"date": "16 May 2019", "title": "Patient Sitter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HonorHealth", "Interview Descriptions": "Submitted application and was asked to complete a phone interview. I was only asked if I’d be willing willing to work 12 hour shifts  at their multiple hospitals  and why I wanted to work there. I answered yes. Never received a follow up.", "Interview Questions": "Are you willing to work 12 hours shifts?"}, {"date": "10 May 2019", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at HonorHealth (Scottsdale, AZ)", "Interview Descriptions": "Email send to schedule interview via online calendar with the recruiter. Ghosted day of phone interview. Send follow up note and next day get a note that more qualified candidates applied.", "Interview Questions": "Recruiter was a no show."}, {"date": "25 Mar 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at HonorHealth (Scottsdale, AZ) in May 2019", "Interview Descriptions": "Two-parts: an online screening with a talent recruiter going over the basics of the company/hiring process and an in-person interview with the director of my unit. All the usual questions - mostly personal, but some about clinical experiences. I was a new grad.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "7 Apr 2019", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at HonorHealth", "Interview Descriptions": "Had a phone interview with the Hiring Manager and then recieved a second interview. Phone interview lasted about 20 minutes.\r\nIn person interview  with the Director and was given a tour of the floor.", "Interview Questions": "What can we do to ensure patient safety?"}, {"date": "15 Jun 2019", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at HonorHealth (Scottsdale, AZ) in Apr 2019", "Interview Descriptions": "Very organized process was easy had everything that the job required including certification, experience and flexibility.  HR was very friendly recruiters were friendly.  Great company benefits.  Pre employment screening was quick and easy.  They provided immunizations needed for the job", "Interview Questions": "What is your availability "}, {"date": "2 Apr 2019", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at HonorHealth (Deer Valley, AZ) in Mar 2019", "Interview Descriptions": "l got a call from HH about a week after applying online. Took about two weeks to get an in person interview. Interview lasted about 20 minutes and was very straight forward. Behavioral question based. Once you are interviewed, I received a call back the same day.", "Interview Questions": "Tell me about yourself?"}, {"date": "20 Dec 2018", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HonorHealth (Scottsdale, AZ)", "Interview Descriptions": "Brief phone conversation with recruiter, then in person interview with the hiring manager, followed by in person panel interview with team. Only 1 or 2 difficult interview questions. Did not hear anything for over a week, then followed up with recruiter who then called back with offer.", "Interview Questions": "What do you like best about working in a process driven environment? "}], [{"date": "25 Nov 2018", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HonorHealth (Phoenix, AZ)", "Interview Descriptions": "Straightforward, standard questions. Myself and two other people were involved in the interview. It was the department manager and an RN assigned to that department. They were both very nice.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "13 Nov 2018", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at HonorHealth in Nov 2018", "Interview Descriptions": "3 interview process with admin, supervisor, and consultant. Answered questions about experience and how to handle errors or problems with co workers. Then review the job requirements and set up the next interview.", "Interview Questions": "Experience, how you handle certain situations, and work ethic"}, {"date": "4 Feb 2019", "title": "Human Resources Contracts and Communication Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HonorHealth (Scottsdale, AZ) in Oct 2018", "Interview Descriptions": "Was contacted by phone quicker than expected and the whole process was very easy to understand and transparent. The interview questions were basic yet very helpful in communicating yourself and expectations", "Interview Questions": "Why do you want to work at HonorHealth?"}, {"date": "11 Mar 2022", "title": "Billing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HonorHealth (Phoenix, AZ) in Aug 2018", "Interview Descriptions": "Very comfortable process and quick turnaround. Recruiter was very professional. Conversation flowed, not just one sided. Showed me around and explained responsibilities. Very professional and on time. Great company to work for.", "Interview Questions": "How do you handle conflict? Why this job? "}, {"date": "24 Sept 2018", "title": "Talent Acquisition Sourcer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at HonorHealth (Scottsdale, AZ) in Jul 2018", "Interview Descriptions": "Very fair. Completed: assessment,  phone screen, initial in-person interview, & panel interview. Got verbal offer 2 weeks after 1st interview, written offer a week later, on-boarding took about 10 days", "Interview Questions": "Why do you want to work for HonorHealth?"}, {"date": "20 Jul 2018", "title": "Network Appeals Clinical Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at HonorHealth (Scottsdale, AZ) in Jul 2018", "Interview Descriptions": "I had an over the phone interview with a group of people. I had some cell phone issues that resulted in some bad reception but otherwise the call went pretty well. I heard back from the recruiter a week or two later to ask if I could come in for an on-site interview. When I moved to town a few weeks later I met for an interview on-site. The recruiter gave me the address for the interview but no suite number. I had to walk around the building and finally call the recruiter for the suite number as the name wasn’t listed in the directory. The recruiter didn’t know the suite number and guessed. It was wrong. I took a guess on my own and asked around and found it with a few minutes to spare (thankfully I arrived at the building 20 min early). I thought the interview went extremely well, however, at the end of it, they got up and said “ok bye”. No “we’ll call you”, or “someone will be in touch”. They knew I had received another job offer and were interested in interviewing me quickly. I emailed the recruiter to see about the position and 3 days later, no response. I checked online and it says “not selected”. Very unprofessional all around.", "Interview Questions": "What motivates you?"}, {"date": "4 Jul 2019", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HonorHealth in Jun 2018", "Interview Descriptions": "I applied and was contacted within 24 hours.  The first interview was set up right away and the second was about a week out.  I received an offer less than an hour after the interview!", "Interview Questions": "What is one process improvement you have been involved int?"}, {"date": "2 Aug 2019", "title": "Food Server Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HonorHealth (Phoenix, AZ) in Jun 2018", "Interview Descriptions": "Applied for the job online, couple of days later had a phone interview then face to face a week later. Didn’t get a call until a week later. I was offer the job. This process is 2 weeks long.", "Interview Questions": "How do you show integrity?"}, {"date": "2 May 2018", "title": "Care Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at HonorHealth (Scottsdale, AZ) in Apr 2018", "Interview Descriptions": "I was selected to come in for an interview. I arranged my time schedules in order to make it happen. Afterwards, I got the call to return for a second interview which they scheduled on their own time and I had to make ends work with my work/class/child care schedule.  I arrived ten minutes early. As time passed, I was waiting for ten minutes after my scheduled interview which was fine and I could wait a few more minutes. Again, I waited and waited..still nothing so I decided to ask the receptionist nicely if I am still scheduled and she said yes. So, I sat back down and waited patiently for a few more minutes.  Thirty-eight minutes later!!! I was finally approached and they said \"they're sorry\" \"can you wait much more longer?\". I told them \"yes\" knowing that  I arranged everything time wise in order to make this interview work. Forty-five minutes later!!! I was able to sit down with Dr. Tiffany Nelson who is the \"MD, Chief Strategy Officer\" and she came off rude, rushed and offensive. The interviewed was rushed within five minutes worth. Isn't that sad? I didn't have time to talk more about my experience, resources and knowledge. If you're going to make others wait that long and cut them on a time limit, you should at least inform them about the wait and possibly being prepared for in & out interview process. Respect the people you interview with as well as their time. I was disappointed. I was excited about this position and company but I am glad I was able to see who they report to. I've worked with plenty of Medical Directors in the past, at least they showed expressions and recognition even the uptight ones.", "Interview Questions": "What do you know about this company?"}, {"date": "18 Sept 2018", "title": "Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HonorHealth (Phoenix, AZ) in Apr 2018", "Interview Descriptions": "It was a panel of 4 people, It was a good interview process and they were nice and the interview went well.  The hiring and interview process was easy, phone interview first and then face panel interview.", "Interview Questions": "Why I want to work with their company."}], [{"date": "26 Apr 2018", "title": "Interventional Radiology RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at HonorHealth (Peoria, AZ) in Apr 2018", "Interview Descriptions": "Easy process. I applied less than a year prior so I didn’t need to repeat the behavioral prophecy assessment which was nice or the mini NCLEX test as I would like  to call it. I received a phone interview request 2 days after I applied. Then, I was asked to schedule an in-person interview. 3 days later I had the interview which went great! I received a little tour of he department and introduced to the staff. Was given a lot of information from the manager about the duties of the job and what they entailed. Manager was extremely thorough and nice. I was told they would call by Friday (had the interview Monday), which they did and I got the job per phone call.", "Interview Questions": "Have you been in a situation that required assessing the safety for you and/ or your co-worker?"}, {"date": "12 Oct 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at HonorHealth (Scottsdale, AZ) in Oct 2017", "Interview Descriptions": "Phone interview with recruiter to discuss hours and pay. In person interview with office manager and lead medical assistant. Interview was pretty easy.  Both parties I interviewed with were easy going", "Interview Questions": "Describe a time you had to deal with a difficult patient"}, {"date": "19 Dec 2017", "title": "Diet Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at HonorHealth (Scottsdale, AZ) in Sept 2017", "Interview Descriptions": "Very comfortable.  No trick questions just relevant questions to the job requirements.  I don't have all day to answer these questions i have to look for a job.  You should only make us do this once in a while.", "Interview Questions": "Experience and work ethic"}, {"date": "23 Jun 2017", "title": "Business Systems Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HonorHealth (Scottsdale, AZ) in Jun 2017", "Interview Descriptions": "1. Applied online\r\n2. Completed personality assessment\r\n3. in person interview\r\n4. 2nd in person interview (this was technical and I got to meet the team).\r\n\r\nThe technical interview was not what I was expecting. I wasn't given a laptop or a pen and paper. Some of the questions were focused for a developer (I know some BAs who don't even utilize SQL or any databases). I have worked with SQL and Excel for 7+ years that a lot of my knowledge is muscle memory and being able to easily type up and execute data. This way of interviewing is just a setup for failure.", "Interview Questions": "1. Provide a flowchart of either making a sandwich or making a cup of coffee\r\n2. Explain DISTINCT BY, GROUP BY (there were more) SQL statements.\r\n3. Provide the formulas for VLOOKUP, HLOOKUP"}, {"date": "11 May 2017", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at HonorHealth (Scottsdale, AZ) in Apr 2017", "Interview Descriptions": "They have recruiters that screen and conduct behavioral based interviews.  The recruiters then select and pass candidates to the hiring manager for interviews.  Additional levels of interviews are conducted for finalists including peer, direct report and leadership.   The interview process works well enough, but if it's a highly technical position, the recruiters may not realize your value if it's outside their scope.  Be sure to sell your skills in layman's terms.  You're trying to prove general and broad skills to the first level of screening.", "Interview Questions": "Describe a situation in which you had to work with others on a task that was outside your area and required you to compromise."}, {"date": "10 Dec 2018", "title": "Pre Admission Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at HonorHealth (Tucson, AZ) in Apr 2017", "Interview Descriptions": "Went really smooth everyone really nice great training, enviroment great, people nice, workplace nice, interview easy .  Cons didn't really seem to have any seems like a great place to work and learn new experiences", "Interview Questions": "How do I feel about training, what hours what pay expected, experience and skills any long term goals, a lot of detailed questions but for good reason"}, {"date": "17 Feb 2017", "title": "RN New Grad Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HonorHealth (Scottsdale, AZ) in Feb 2017", "Interview Descriptions": "I applied for the position online, received a call from a talent acquisition manager, to set up the time to have a pre-screen phone interview with a recruiter, as well to set up a time for an in person interview.  The pre-screen interview was about a 20 minute phone call and went over pay details and when and where to meet the interviewing manager, in addition to finding out how you perceive the values of the company.  The formal interview consisted of a unit tour, about 45 minutes of a more casual setting, with questions being answered, it was very stress free.  The orientation process was explained and questions were answered.", "Interview Questions": "Tell me about a time where you went above and beyond to provide excellent customer service?"}, {"date": "15 Jan 2017", "title": "Accounts Receivable Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at HonorHealth (New York, NY)", "Interview Descriptions": "It was set up like a panel interview. Everyone was nice and broke the ice with humor. It was pretty laid back and they did a good job making it feel like I was talking to friends rather than potential bosses", "Interview Questions": "Tell me about a time you had the opportunity to make a real change in your work place"}, {"date": "4 Jan 2017", "title": "Executive Director PCT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at HonorHealth (New York, NY)", "Interview Descriptions": "2 phone interviews with HR, in person with nursing supervisor followed by a 2 week training course, which was very helpful and worth while :) You will also have a drug test, HEPA mask fit, flu shot, TB screen and physical before work can begin. Lots of CEs provided on going", "Interview Questions": "What is you past medical experience, what are your goals, biggest strength and weakness, where do you see yourself in 5 years, and patient ethics questions. "}, {"date": "1 Feb 2017", "title": "New Grad RN Med/Surg Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at HonorHealth (Scottsdale, AZ) in Jan 2017", "Interview Descriptions": "The interview was really quick, about 15-20 minutes. I got a mini tour of the floor that I applied for while I walked up with the interviewer. During the interview, I was asked a few behavioral questions and then come clinical questions.", "Interview Questions": "Questions were about conflict with a coworker, how to keep patient safe, and a few other things. In terms of clinical scenarios, the interviewer described two different patients and had to determine what was happening and the interventions I needed to give. "}], [{"date": "18 Jul 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HonorHealth (Phoenix, AZ) in Dec 2016", "Interview Descriptions": "Phone interview to go over experience and then what the job would intel. Received a call for face to face with hiring manager.  Manager discuss job responsibilities and ask if I would come back to meet with staff. Returned a few weeks later to meet with staff of nurses that would be working with to make sure everyone was on board with me as their administrative secretary.", "Interview Questions": "How do you handle different personalities?"}, {"date": "28 Mar 2017", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HonorHealth in Nov 2016", "Interview Descriptions": "Easy going. Phone and in person interview. Asked basic interview questions. Everyone was very nice. They made it very personable and it wasn't all that nerve wracking. They get back to you in a timely manner. The interviews and the hiring process took about 1 to 2 weeks total.", "Interview Questions": "When was a time that you gave great patient care ?"}, {"date": "20 Aug 2018", "title": "Volunteer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at HonorHealth (Scottsdale, AZ) in Aug 2016", "Interview Descriptions": "Overall very easy. They just want to make sure you are able to care for each patient and you are a descent human. They usually start you off as a front desk helper and move you around the hospital as you gain experience.", "Interview Questions": "How does empathy help contribute to the patients well being in the hospital?"}, {"date": "26 Apr 2017", "title": "Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HonorHealth (Scottsdale, AZ) in Jul 2016", "Interview Descriptions": "Interview process consisted of an in person interview with clinical director and supervisor, phone interview with human resources hiring representative, and a panel interview with coordinator, nurse, and scrub tech.", "Interview Questions": "When was a time when someone did you wrong and how did you handle it?"}, {"date": "21 Jun 2016", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at HonorHealth (Phoenix, AZ) in Jun 2016", "Interview Descriptions": "Received an email from a recruiter to set up a phone interview and in-person interview a week and a half after applying.  The phone interview gave me information regarding the salary and benefits.  The interview process was with the department manager and took an hour.  I received an email the following week that they hired internally.  It was a great experience.  Everyone was very friendly and professional.", "Interview Questions": "What are your top 3 strengths?"}, {"date": "9 Jun 2016", "title": "Sharepoint Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at HonorHealth in Jun 2016", "Interview Descriptions": "HR required me to submit referenes using a rigid online system that sends emails and reports the response to HR before any interview or offer of employment. In fact HR stated they would not even proceed without having the references and their responses. If his was required for every job I applied for my references would never want to reply or be included in my job search by the time I actually got any valid offers for employment.", "Interview Questions": "provide references before any offer and if not provided we will not move forward with considering you for the job."}, {"date": "23 Jun 2017", "title": "Talent Acquisition Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at HonorHealth (Phoenix, AZ) in Jun 2016", "Interview Descriptions": "I started as a consultant. But interviewing others on the team was just like mine. I went in and had an initial interview, had to complete a behavioral assessment and was given the offer a week later. It would have been sooner if the director hadn't gone on vacation but I guess they have a life too. :)", "Interview Questions": "What is the hardest position you sourced for?"}], [{"date": "19 Jun 2016", "title": "SUPERVISOR CALL CENTER Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HonorHealth (Phoenix, AZ) in Jun 2016", "Interview Descriptions": "Required references to be done prior to interview or consideration. This process imposes on the process. Should be a requirement only when being considered. If you are not being considered you should not be requiring a second interview.", "Interview Questions": "Questions were brief and not really behavioral questions.  A bit behind the times. Managers should be asking questions related to the position as well as situational questions,"}, {"date": "3 May 2016", "title": "Clinical Informaticist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at HonorHealth (Phoenix, AZ)", "Interview Descriptions": "Applied online.  2 weeks after, got an email from the recruiting assistant asking availability for an in-person interview and a simple call with the recruiter (informational call, not an actual review).  Interview with department manager.  Very casual and easy-going type interview.  No \"tell me about a time\" questions.  More similar to a discussion about work experience, asking question back and forth.", "Interview Questions": "Tell me about your job history"}, {"date": "30 Aug 2020", "title": "HIM Clerk Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HonorHealth (Phoenix, AZ) in Jan 2016", "Interview Descriptions": "The interview process was smooth. The appropriate questions were asked. Based upon panel seemed like a good place to work. The faculty was clean. Staff members that I encountered were polite and always had smiles which gave off an inviting and warm vibes.", "Interview Questions": "What makes you right for this position?"}, {"date": "7 Dec 2015", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at HonorHealth (Scottsdale, AZ) in Dec 2015", "Interview Descriptions": "Applied online, within 2 weeks was contacted, set up for a phone interview and the following day a face to face interview. Ask general interview questions to see if you fit with the team. Make sure you ask questions too, it shows you care and want the position. My interviewer was very helpful in answering my questions.", "Interview Questions": "Why should we hire you?"}, {"date": "2 Jan 2016", "title": "Diet Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HonorHealth (Scottsdale, AZ) in Nov 2015", "Interview Descriptions": "I applied online from the hospital's website. I was contacted within 2 weeks by an HR recruiter who set up a phone interview with another HR recruiter which was followed by in person interview with hiring manager. The in person interview was very friendly - she asked standard questions but spent a lot of time just talking to me.", "Interview Questions": "How do you handle a customer / patient who is upset and taking their frustration out on you?"}, {"date": "7 Aug 2019", "title": "Imaging Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at HonorHealth (Phoenix, AZ) in Sept 2015", "Interview Descriptions": "Multiple tier interviews, with department supervisor to other techs. Some technical questions some general questions. Introduced to various campuses supervisors. Then whole final interview with HR. Selective to recruit talented people. Enjoyed the process.", "Interview Questions": "What is your strength?"}, {"date": "21 Sept 2015", "title": "Laboratory Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at HonorHealth in Aug 2015", "Interview Descriptions": "Interview okay. I thought that I left off with proper communication of hiring process or hiring timeline.  Lack of communication from recruiter and hiring mangers. Disappointed. It was a panel interview with organized questions. They were very approachable.", "Interview Questions": "Personality Questions"}, {"date": "27 Aug 2015", "title": "IT Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 5 weeks. I interviewed at HonorHealth (Phoenix, AZ) in Jul 2015", "Interview Descriptions": "Very detailed and lengthy process prior to interviewing with actual people.  Although there was a rush to complete the interview documentation, it took weeks to receive a response.  When the time came for an interview with the actual hiring staff, those interviewing did not seem to have the time to give the interviewee a chance to excel.", "Interview Questions": "They seemed to want specific solutions to their problems which was difficult without all of the organizational and situational background information one would have as an employee."}, {"date": "9 Jun 2015", "title": "Supply Chain Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at HonorHealth (Scottsdale, AZ)", "Interview Descriptions": "HR screenings went well, relevancy and professionalism maintained. Panel interview was unorganized and lacked substance. One panel member was late to the interview; while another seemed unhappy to be there.", "Interview Questions": "How do you deal with ambiguity?"}, {"date": "9 Aug 2015", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HonorHealth (Scottsdale, AZ) in Jun 2015", "Interview Descriptions": "The process was very straight forward. Interviewer sat and asked standard questions. No real leeway to offer more about myself and my credentials. It was rather dry and boring. No emotion such as a smile or chuckle from interviewer. I left with a sense that the job would also be boring!", "Interview Questions": "Explain to me a situation where a co-worker was not carrying their workload and what you did?"}], [{"date": "16 Jul 2015", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HonorHealth in Jun 2015", "Interview Descriptions": "From time of application to getting a call from a recruiter the process took 2 weeks. The recruiter was in charge of pre-interview screening questions before an in-person interview would occur. Unfortunately, I did not meet the requirements for this specific job, however, the recruiter was very helpful in finding other opportunities within the company.", "Interview Questions": "They asked about my strongest and weakest skills."}, {"date": "7 Dec 2016", "title": "Clinical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at HonorHealth (Scottsdale, AZ) in May 2015", "Interview Descriptions": "First step is a phone interview that is your standard set of interview questions. This is usually followed by interview with HR interview with your standard interview questions. This is followed up with a department interview that is a little more off the cuff and focuses on how you will interact with the department.", "Interview Questions": "How do you handle conflict with others? Describe a time where you had an issue with a patient and how you resolved it."}, {"date": "8 Aug 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at HonorHealth (Phoenix, AZ) in May 2015", "Interview Descriptions": "The interview process was extremely smooth and organized.  Well planned out interviews with charge nurse and hiring manager.   Interview couldn't have gone smoother.  Both the hiring nurse and the manager I interviewed with gave a great assessment of the role, the challenges, and the responsibilities I would have as a nurse at Honor Health.", "Interview Questions": "What healthcare experience do you have?"}, {"date": "8 Aug 2015", "title": "Pharmacy Technician II -Medication Reconiciliation Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at HonorHealth (Scottsdale, AZ) in May 2015", "Interview Descriptions": "The process was very simple and extremely quick. I applied online on a Thursday and recieved a call to schedule a phone interview and 1:1 interview for the following Friday and Monday. The phone interview was your standard interview questions and the 1:1 was more to see if my personality would fit the team. I was sent an offer the following Wednesday. The only slow process is the require Email References to complete a reference survey.", "Interview Questions": "How well do you handle conflict and stressful situations?"}, {"date": "16 Sept 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at HonorHealth in Apr 2015", "Interview Descriptions": "Applied online, then a recruiter calls to set up a phone interview with a lead recruiter, then sets up an interview with the unit manager. Had to wait a couple weeks to interview with manager, but then got the job right after the interview.", "Interview Questions": "How do you handle stress?"}, {"date": "14 Jul 2015", "title": "Clinic Supervisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at HonorHealth (Mesa, AZ) in Apr 2015", "Interview Descriptions": "Meeting with Clinic Supervisor and possibly a Manager who oversees several clinics in person.  Normally at the clinic you are looking to work at.  May include meeting the office staff in a brief office tour.  Normal interview is 60 minutes.  Normally interviewer will ask standard set of  questions, possibly up to as many as 25.  The results are noted in in a scale.  Results will be entered into an employee screening and hiring system.  No favorable or unfavorable response will be given at the time of the interview.  Remember, it's not what you know, it is who you know.", "Interview Questions": "Standards... tell me about a time when.. you had to deal with conflict resolution, had a fellow employee being unethical, worked as a team...  Be ready for a lot of how did you feel questions."}, {"date": "12 Mar 2015", "title": "RN Ortho/Surgery Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HonorHealth (Phoenix, AZ) in Mar 2015", "Interview Descriptions": "After a phone interview, the face-to-face was scheduled.  The interviewer flowed between many topics in what felt like a casual manner.  She did wait until near the end to discuss the very high patient:staff ratios during the evenings.  I learned a lot about many of the specialists on the floor, two recent EBP projects, details on the remodeled floor, the backgrounds of current RNs, why the opening occurred, why she and the manager require bedside reports, confidentiality exceptions since their are always two patients in each room, and more.  I was asked to stand next to my chair and demonstrate proper lifting procedures and how I would handle several urgent patient requests to ambulate when another staff member was not present.  \r\n\r\nI appreciated the details I learned about the unit, by the end of the interview I felt like I understood many aspects of the unit.  She also took a great deal of time to educate me and to provide feedback on my responses.  She pointed out several additional positive attributes in addition to the obvious ones I was presenting.  I became nervous several times, but she assured she would rather take time now to ensure I understood the position and was comfortable.  I was offered an opportunity to shadow.  .  In my follow-up thank you, I indicated I was not certain I was an optimal fit (after further thought and some blogging I was uncomfortable with 6-8 step-down patients with high narcotic use), but thanked her for such an easy and through experience.", "Interview Questions": "Tell me about your most challenging clinical experience, what made it difficult for you?"}, {"date": "16 May 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at HonorHealth (Phoenix, AZ) in Feb 2015", "Interview Descriptions": "I was called on the phone. Asked about chest pain and got the job after 10 minutes. It was amazing. Most other people had to sit in a panel and answer a million questions.", "Interview Questions": "What would you do if someone came in with chest pain?"}, {"date": "19 Apr 2016", "title": "Network Operations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at HonorHealth (Phoenix, AZ) in Jan 2015", "Interview Descriptions": "Easy but HR had me jump through hoops to not even offer job. They wanted an extensive references list with my references responding to their emails that ended up being pointless. Bitter that they made me waste all that time.", "Interview Questions": "Casual interview process. Extremely informal."}, {"date": "9 Oct 2017", "title": "Food Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at HonorHealth (New York, NY) in Jan 2015", "Interview Descriptions": "It was fast and i liked it. They talked, i listened. I asked about the job and what it is i would doing. They told me, i just wanted to know how much they would pay. They let me know but i don't know if i was satisfied our not", "Interview Questions": "            There were no interview questions\r\n"}], [{"date": "6 Mar 2016", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HonorHealth (Phoenix, AZ) in Nov 2014", "Interview Descriptions": "First is a telephone HR screening interview.  Basic questions, why are you looking for a job, why do you want to work for honorhealth, where did you work before, why are you leaving your current job, what are your strengths and weaknesses, etc.  Basic, generic interview questions.  Very little about anything technical.  Definitely more personality based questions than anything.", "Interview Questions": "What are your core values?"}, {"date": "24 Nov 2016", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at HonorHealth (Scottsdale, AZ) in Oct 2014", "Interview Descriptions": "Started with a phone interview and had a second in person interview. Both were a nice experience! Phone interview and in person interview had some of the same questions. I had two 1:1 interviews with two different locations interested in me. My manager from the first interview (Shea) LOVED my experience with sports and liked my organization skills (I had all my forms, including a resume, present with me). The phone interview is more general and the 1:1 is more personal,", "Interview Questions": "How do you work with a difficult patient? Have you ever worked with a team? Tell me about a time you have felt with a difficult person. Do you know our goal as a hospital?"}, {"date": "24 Mar 2017", "title": "Homeheath Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HonorHealth (Scottsdale, AZ) in Jun 2014", "Interview Descriptions": "I was given many questions that are pretty routine for the whole facility.  I was sent an email telling me of the interview date and time.  I had applied online so my application and resume were already submitted.  I had a one on one with a manager.  Everything went very well throughout the interview, however, at the very end the supervisor asked me where I lived.  I lived 42 miles away at the time, her face went sour and the interview was ended.  I believe I was not considered for the position because gas mileage was a paid benefit and I lived far.", "Interview Questions": "Name a time you were in a conflict with a supervisor.  What were the circumstances and how was it resolved?"}, {"date": "19 Jul 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at HonorHealth (Scottsdale, AZ) in Nov 2013", "Interview Descriptions": "When I walked into the interview the nurse manager was very kind. She made the entire experience very relaxed and I felt very comfortable. After the interview they showed me around the floor and told me I would get a call by the end of the week for the official job offering.", "Interview Questions": "What heart rhythm can cause a stroke?"}, {"date": "28 Oct 2017", "title": "Front Line Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HonorHealth (Glendale, AZ) in Aug 2013", "Interview Descriptions": "Easy. Simple. They were trying to fill a seat not really interested in my skills.  It's funny I didn't think they asked probing questions. It was very surface and vague.  Now I know the manager really don't have a clue of the roles of the office. So they couldn't ask probing questions. So they hired whoever they \"like\" not who is the best for the job. Don't be surprised if your co workers are lazy and clueless about the job because management just need to fill the spot.", "Interview Questions": "What do you see yourself doing in 10 years"}, {"date": "27 Feb 2016", "title": "Billing Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at HonorHealth (Scottsdale, AZ) in Jun 2012", "Interview Descriptions": "met with hr on the phone, had interview with hr  the next day. after the interview with human resourses I went to another building and interviewed with a supervisor. We met in the conference room, he had a lot of questions about team work, working with teams, or what is you saw a team member doing something wrong or against policy etc...", "Interview Questions": "experience, life questions"}, {"date": "22 Sept 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at HonorHealth (Scottsdale, AZ) in Apr 2011", "Interview Descriptions": "I was already and employee and applied internally. Prior to me being an employee, I had an initial phone interview and then an interview in person for a different position. When I obtained my RN, it was a simple process. I applied internally to any possible positions for a new graduate becoming available. The recruiter called me and set the interview up. The process was very fast, and I transitioned nicely into my new role. Department managers are very cooperative.", "Interview Questions": "I was asked about my future plans as a nurse and where I would see myself in 5 years. I was also asked about my strengths and weaknesses."}]]