[[{"date": "6 Sept 2022", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The San Francisco Foundation", "Interview Descriptions": "Great and very straightforward! The interview was a smooth process; my supervisors were great. I went through two rounds. One with the supervisors and another with the full team.  The questions were similar in both the interviews.", "Interview Questions": "Q; Have you facilitated a network of housing advocates"}, {"date": "25 Feb 2022", "title": "Assistant Controller Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2 months. I interviewed at The San Francisco Foundation (San Francisco, CA)", "Interview Descriptions": "The process took a very long time. They also seemed very disorganized as each meeting had its set of issues. Twice the zoom or teams links didn’t work, so I ended up providing mine. For my  panel interview they forgot to invite me, so I was receiving calls asking where I was. These were all red flags for me, but I rolled with it. Ultimately I got through the entire process of what seemed like 5+ rounds, with each round getting positive feedback. At the end I get  a generic response that I was ultimately not a good fit without offering any feedback when politely asked. \n\nThe one awkward moment was the panel touting their commitment to diversity and equity. But then they took a pause and said admittedly it’s not reflected in the panel as they were all white middle aged folks. It was both a funny and sad moment.", "Interview Questions": "Why are you interested in working at SFF?"}, {"date": "15 Jul 2021", "title": "Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The San Francisco Foundation", "Interview Descriptions": "Detailed. Appreciated the emphasis on DEI and their team's willingness to answer questions. I was able to talk to the recruiter and the supervisors multiple times, and interviewed with people across the org. They were communicative about the org's values, and very transparent about process and salary from the start.", "Interview Questions": "What is a time when you've had to manage difficult staff?"}, {"date": "21 Jan 2021", "title": "Grants Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The San Francisco Foundation (San Francisco, CA)", "Interview Descriptions": "Multiple Rounds!!! Included one on one with direct boss head of dept, cross departmental panel interview w/ direct peers & other managers plus final round interview with C Suite Exec.", "Interview Questions": "What are your strengths and weaknesses. Standard and one to always be prepared for...  be mindful how you answer in regards to weaknesses. "}, {"date": "30 Aug 2018", "title": "Director of IT Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The San Francisco Foundation (San Francisco, CA) in Aug 2018", "Interview Descriptions": "I had a 30 minute phone call then onsite interview with the COO, unfortunately the existing technical staff member wasn't available. She was extremely polite, explained the position well and we chad a good overall conversation about their needs. The HR Director called me a week or so later to explain they had selected another candidate. The communication was good, no complaints about the process.", "Interview Questions": "please explain your experience dealing with IT budgets and expenditure"}], []]