[[{"date": "15 Jun 2022", "title": "Front Desk Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Midwestern State in May 2022", "Interview Descriptions": "Went in to talk about the job and I got asked a few questions. Next day I got an email asking me if is am still interested in the position.", "Interview Questions": "How well do you work under pressure?"}, {"date": "2 May 2023", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Midwestern State (Wichita Falls, TX) in Jan 2019", "Interview Descriptions": "It was very smooth. Interviewed by a panel asking a list of questions. Then practical exercises to see how well certain situations will be managed. Overall was fun and not intimidating.", "Interview Questions": "Name a time you had conflict in a group and how did you resolve that?"}, {"date": "3 Oct 2017", "title": "Honors Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Midwestern State (Wichita Falls, TX) in Jul 2017", "Interview Descriptions": "I applied through the Texas Workforce Commission and met with the Honors Program Assistant Director for a 20-30 minute face-to-face interview at the Honors Office a few days later. A couple weeks after that, HR called me with a decision.", "Interview Questions": "How do you balance work-related tasks that have deadlines with building relationships with students, especially through walk-in visits?"}, {"date": "9 Jun 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Midwestern State (Wichita Falls, TX) in Aug 2015", "Interview Descriptions": "I was studying my masters and during that time period i proved my self by giving good standing results and by that time period i was selected as a graduate assistant for department. It was not hard interview but mainly about the academic performance and involvement into the departmental activiies", "Interview Questions": "your goals?"}, {"date": "4 Feb 2014", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Midwestern State (Wichita Falls, TX)", "Interview Descriptions": "HR even when they do NOT appear to have much idea of what librarians do creates a template that library uses to filter in and out possible hires that have minimum requirements.  Then we look at those having minimum requirements.  Usually a group of 3-4 librarians including library director decides which ones are \"worth\" talking to on the phone and this is followed up with a in person interview.  The phone interview is as important as in person.  If person comes accross as indifferent or flat they probably will not be asked to come in for an in person interview.", "Interview Questions": "Because of the importance of technology tech services hires have more detailed questions as to what the individual actually knows how to do.  It probably is NOT a good idea to try to face a lack of knowledge because we do not have time to play games."}, {"date": "7 Sept 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Midwestern State (Wichita Falls, TX) in Oct 2012", "Interview Descriptions": "Very smooth. Interview was largely pleasant, although I'm not sure how much one of my supervisors really prepared for it. However, the other was anything but unprepared. I appreciated that they included the assistant I would be sharing an office with -- that told me they valued her input regarding a final decision. (Date was actually 2010, but I didn't have the option to choose that year in the drop-down.) We met informally in the conference room. To be clear, I was vetted by HR before being offered an interview, and briefly spoke with them on the phone before being asked to come talk with my potential supervisors.", "Interview Questions": "The hardest question to answer was why I was looking for a clerical position when I'm qualified to work in communications. It was a tough query but certainly fair."}, {"date": "22 May 2013", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Midwestern State (Wichita Falls, TX) in May 2012", "Interview Descriptions": "the interview was good. I got the job I was so sad when I had to leave. Miss my co-workers", "Interview Questions": "the question were not hard at all"}, {"date": "13 Mar 2014", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Midwestern State (Delray Beach, FL) in May 2012", "Interview Descriptions": "Interviewed on Skype with the Director and staff members.", "Interview Questions": "How to handle being a career college football coach and now entering into a different career path."}, {"date": "1 Nov 2012", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Midwestern State (Wichita Falls, TX) in Apr 2012", "Interview Descriptions": "After being accepted as a Computer Science Masters degree candidate, I received and email from the assistant to the Dean of the Graduate School announcing an opening for a Graduate Assistant.  I filled out the application and emailed it back.  She emailed back and asked for a phone interview.  At the end of the phone interview, she asked when I could visit the campus for a face-to-face interview.  All went well, and she offered me the job.", "Interview Questions": "There was no difficult or unexpected question.  "}, {"date": "21 Nov 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Midwestern State (Wichita Falls, TX) in May 2011", "Interview Descriptions": "Great iNterview.  Very chill but matter of fact at the same time.  Was given a personality test;  mostly\"what would you do in this situation\" you're of questions. Questions about my computer/software competencies as I would be required to work on the computer from time to time.  Great iNterview over all", "Interview Questions": "How well do you work with others?"}]]