[[{"date": "5 Jan 2021", "title": "Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bethesda Hospital East", "Interview Descriptions": "Great process, very friendly, straight forward. I felt comfortable the whole time and am looking forward to going back for another interview. It took a total of about 30 minutes.", "Interview Questions": "What are your strengths? What are your weaknesses?"}, {"date": "8 Mar 2022", "title": "Food & Nutrition Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bethesda Hospital East (Boynton Beach, FL) in Feb 2020", "Interview Descriptions": "IT TERRIBLE, POOR MANAGEMENT, HORRIBLE PEOPLE ONLY GOSSIP, PEOPLE ARE HORRIBLE TO WORK WITH DO NOT COME, they dont care for your schedule and will treat you like youre nothing , they do not train you and give you about 60 people to serve the whole day on your own .", "Interview Questions": "will you be here whenever we ask you to come"}, {"date": "3 Nov 2020", "title": "Unit Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bethesda Hospital East (Boynton Beach, FL) in Sept 2019", "Interview Descriptions": "You go in and sit down with one of the recruiters who will then ask you a few questions. They will introduce you to their department head for the job that you applied for and the interview process begins.", "Interview Questions": "Are you able to work or adapt to a fast pace environment"}, {"date": "22 Aug 2018", "title": "IS Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bethesda Hospital East", "Interview Descriptions": "Short and to the point. It was done via Skype. They stated the salary upfront right away. It was an average interview. Other than that there really isn't anything else to say.", "Interview Questions": "Tell me about yourself"}, {"date": "29 Aug 2018", "title": "Systems Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bethesda Hospital East in Aug 2018", "Interview Descriptions": "Was interviewed by a Leslie. She was nasty, she would cut u short, this was the worse interview I ever had. Here there was a lot of turn over. I would not have taken the job if offered. I don’t know if I will be offered but if so would say no.", "Interview Questions": "Tell me about your self"}, {"date": "17 Sept 2017", "title": "Registered Nurse II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "The process took 5 weeks. I interviewed at Bethesda Hospital East (Lakeland, FL)", "Interview Descriptions": "Interview by phone then appointment in person, offer made, EKG Inet test.  Another meeting to give you employees manual, Urine Drug Test and vision test, vaccines if you needed. Make sure all you profesional recommendations answer their phones, that can be a deal break.", "Interview Questions": "Why you want to work for this hospital? Which are you future professional plans? What you will do in a stressful situation?"}, {"date": "5 Feb 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bethesda Hospital East (Boynton Beach, FL) in Mar 2017", "Interview Descriptions": "Interview with Hr then Hiring manager. interview was fairly easy. want to know why you want to work at hospital, difficult situations and about yourself. Then you have interview with hiring manager. It was comfortable. not scary at all.", "Interview Questions": "Why you want to work here?"}, {"date": "7 Jul 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bethesda Hospital East (Boynton Beach, FL) in Feb 2015", "Interview Descriptions": "the process was easy I met with the program administrator and she reviewed my resume. asked me questions from it. asked my skills and personality etc. they then made me take a little test to test my medical terminology. after a week I got a call and an offer was extended. then I went in to get a background check and flu shot went to orientation and started working.", "Interview Questions": "What would you do if you find yourself with a difficult, upset patient?"}, {"date": "9 Jan 2015", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bethesda Hospital East", "Interview Descriptions": "It was very brief and better than most. It was two interviews done on the same day and both were pretty quick. They called me within one week and made it very convenient for my schedule, and the hiring process as well as the paper work was quick", "Interview Questions": "Your worst qualities"}, {"date": "18 Aug 2018", "title": "Health Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bethesda Hospital East in Apr 2014", "Interview Descriptions": "Asked only a couple of questions such as scenarios what would you do? Asked what I did at my previous job,and what we are my future goals here the hospital.if I was in school", "Interview Questions": "What would you do if you were overwhelmed with work?"}], [{"date": "26 Apr 2015", "title": "Health Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Bethesda Hospital East (Boynton Beach, FL) in Jan 2013", "Interview Descriptions": "First interview consisted of taking a test to make sure that i was fit for the position. Upon passing the test, i was then interviewed for the position by a complete questionaire. A third interview was followed once all the required steps were fullfilled and met. Then,  i was offered a position.", "Interview Questions": "What would make me an ideal candidate for the position?"}]]