[[{"date": "9 May 2023", "title": "Academic Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at CAL POLY (San Luis Obispo, CA)", "Interview Descriptions": "Was over zoom and short, they reviewed my resume and cover letter as to why I wanted the job and making sure I wanted to continue with the process knowing the hours and pay", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "11 Apr 2023", "title": "Client Service Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CAL POLY (San Luis Obispo, CA)", "Interview Descriptions": "Pretty basic questions. Applied online with resume and coverletter. Only one round of interview and got the offer after two days via email. Only question that stood out was asking to describe a technical process in non-technical terms.", "Interview Questions": "Can you describe a technical concept or process using non-technical terms?"}, {"date": "10 Jun 2023", "title": "On-Site Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at CAL POLY (San Luis Obispo, CA) in Apr 2023", "Interview Descriptions": "I had 2 interviews. First interview was with the search committee. It lasted 45 minutes. They asked about my experience, education and asked some situational questions. The 2nd interview had two parts. The first part was 45 minutes with the search committee again where they asked me some more situational questions. The second part was with member of the team who asked a variety of experience based and situational questions.", "Interview Questions": "Which Disney princess would be the best spy?"}, {"date": "2 Mar 2023", "title": "Dishwasher Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CAL POLY", "Interview Descriptions": "Pretty much apply and you either do or don't get it. No real interview just have proper documents. I got my offer about 5 days after applied in my emails just asking me if I was still interested in the position.", "Interview Questions": "Not applicable. No interview questions."}, {"date": "9 Feb 2023", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at CAL POLY", "Interview Descriptions": "Variety of non-tech and tech questions. Overall relatively simple and directly based off of the Job description. No major curve balls. I would not fear the interview And just prepare based on the job description.", "Interview Questions": "Reason for wanting this job position."}, {"date": "1 Feb 2023", "title": "Graduate Student Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at CAL POLY", "Interview Descriptions": "Easy Quick and Fast. Better then I expected, should be fine with minimum prep. It’s a college do they know how hard it’s can be to get a job right after", "Interview Questions": "What did you do in College?"}, {"date": "8 Jan 2023", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CAL POLY", "Interview Descriptions": "I received an email stating that the selction committee was going to interview me. This was my first interview. There were four people who asked me a number of general questions.", "Interview Questions": "The questions were general in nature. Opinion on diversity, what would I do if I had a disagreemnt with a coworker and so on."}, {"date": "8 Jan 2023", "title": "EAP Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at CAL POLY", "Interview Descriptions": "Two step interview process via Zoom with a three member panel. Everyone was welcoming and professional. I received a callback quicker than I thought I would and I appreciated this.", "Interview Questions": "How would you conduct outreach to our constituents?"}, {"date": "4 Jan 2023", "title": "Career Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at CAL POLY", "Interview Descriptions": "First round was a phone interview. Second round was an in-person interview on campus that lasted half a day. Included a panel interview, a presentation, a tour of campus, a meeting with the director, and coffee off campus with a variety of career center staff.", "Interview Questions": "I was asked to review a sample resume for a fictional student and provide feedback."}, {"date": "4 Nov 2022", "title": "Working Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CAL POLY", "Interview Descriptions": "A normal college application process, but without any essays which is very nice! The application potentially the easiest college application that I had to do! Highly recommend at least applying!", "Interview Questions": "Tell me about community service involvement"}], [{"date": "3 Feb 2023", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CAL POLY in Sept 2022", "Interview Descriptions": "Behavioral interview. Answered 6-7 questions for a hiring committee of 3. Committee took notes and asked some follow up questions. All questions were based around how I handled situations in the past. I had to provide an Excel sample.", "Interview Questions": "What is your understanding of diversity and how does it affect this role?"}, {"date": "23 Jan 2023", "title": "Food Server Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at CAL POLY (San Luis Obispo, CA) in May 2022", "Interview Descriptions": "Not very hard, ask you about your personal skills. How you work well in a team, what you value about cal poly and why you would want to work with the food servers here at cal poly.", "Interview Questions": "Why do you want to work at Cal Poly Campus Market"}, {"date": "21 Apr 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CAL POLY", "Interview Descriptions": "Just chatting with professor about  what my interests are in education and why I want to do research in particular with him. It was very mellow and not very stressful at all. I", "Interview Questions": "Why do you want to do research with me."}, {"date": "22 Mar 2022", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CAL POLY", "Interview Descriptions": "Quick zoom interview with department chair. There were no surprises. The chair asked about background, experience, and why I was interested in teaching. Later in the process, I was asked about my teaching philosophy.", "Interview Questions": "Why do you want to work here?"}, {"date": "24 May 2022", "title": "Access Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at CAL POLY in Feb 2022", "Interview Descriptions": "Took about 4 weeks to be contacted via email for an initial 30 minute interview via zoom. Contacted that day via email for a 1 hour second interview 4 days later. After the second interview had to complete a timed written \"assignment\" within a few days. Took 2 full weeks to hear back after the second interview.", "Interview Questions": "What do you do when you disagree with a supervisor?"}, {"date": "4 Nov 2021", "title": "Administrative Support Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at CAL POLY", "Interview Descriptions": "Very professional and straight forward. The HR department was very helpful in answering questions regarding the entire process and gave helpful insight on how to best prepare oneself for the interviews.", "Interview Questions": "What was a challenge I recently faced. "}, {"date": "8 Oct 2021", "title": "Janitorial Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CAL POLY", "Interview Descriptions": "I got interviewed for my job! It was a great experience overall. Big big mops here, really. Floors: not so big. Maybe you could swing by sometimes and mop the floors, just check it out. I hear they are really open to that aroudn here", "Interview Questions": "Can you mop fast bro?"}, {"date": "4 Oct 2021", "title": "Career Services Ambasador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at CAL POLY", "Interview Descriptions": "One 30-minute interview with a supervisor on Zoom consisted of the entire interview process. Behavioral questions went over a resume and cover letter, discussed expectations and responsibilities. He gave me time to explain my cover letter and the reasons why I thought I was a good fit for the role.", "Interview Questions": "Have you had any experience critiquing resumes and cover letters?"}, {"date": "8 Sept 2021", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CAL POLY", "Interview Descriptions": "Easy overall! It was simply 2 interviews with who would eventually be lead supervisors. They Just wanted to know a bit about my background, experience, it was more conversational than anything.", "Interview Questions": "Previous leadership experience and if I had worked on websites or social media campaigns"}, {"date": "16 Aug 2021", "title": "Director Role Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at CAL POLY", "Interview Descriptions": "While not advancing to final interview stage, the initial phone interview with an HR rep was very personable, professional and informative including specifics on job expectations, organizational overview, estimated compensation ranges, etc.", "Interview Questions": "How your prior experience makes you a great fit for this role?"}], [{"date": "4 Mar 2022", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at CAL POLY in Aug 2021", "Interview Descriptions": "The application form, once selected by faculty, was sent and hiring occurred within a week. Recommend building relationships with faculty in undergrad if you are staying as a graduate student and are interested in teaching.", "Interview Questions": "Q: Have you taught before?"}, {"date": "9 Jun 2021", "title": "Purchasing Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at CAL POLY", "Interview Descriptions": "Interview with about four groups of people within a few hours.  These groups include the supervisor and their peers, the Procurement Director, other procurement specialists, and also a personality assessment manager.", "Interview Questions": "Create a PowerPoint presentation based on a prompt"}, {"date": "18 Feb 2023", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at CAL POLY (Washington, DC) in Jun 2021", "Interview Descriptions": "It was a Zoom interview with faculty on the hiring committee. Most questions were based on a teaching demo video that I was required to submit in the previous stage of the application process. Extremely professional and I enjoyed the opportunity.", "Interview Questions": "Why do you want to teach at the university?"}, {"date": "20 Jan 2021", "title": "Lab Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CAL POLY", "Interview Descriptions": "Interview was short, basically had to prove that I knew and understood what we did in the class. It's great interview experience and I would highly recommend it. For grading positions, the interview is slightly different.", "Interview Questions": "Do you think you're qualified for the job?"}, {"date": "10 Dec 2020", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CAL POLY", "Interview Descriptions": "Very laidback interview process. I was interviewed by the assistant director of my department and the person I would be working directly under. The interview mostly consisted of explaining the job responsibilities, asking me to talk about why I want the job, and if I had any questions. Only took 10 minutes.", "Interview Questions": "Why do you want to work as a student assistant in [department name]?"}, {"date": "1 Oct 2020", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at CAL POLY", "Interview Descriptions": "Applied online, only need a resume, one interview in-person with the Dean, and the associate dean. Very relaxed and not concerned about technical abilities, the interview was primarily to see your personality and see if you would get a long with the people in the office.", "Interview Questions": "Why do you want this job?"}, {"date": "8 Nov 2022", "title": "Electrical Engineering Full Time Lecturer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at CAL POLY in Mar 2020", "Interview Descriptions": "Online panel of interviewers, 45 minutes interview, they had the option to many spots, I chose one on early morning, unfortunately the interviewer was so pissed off, one had her birds singing during the interview process, another one was late, a third one had his coffee, it was obvious that those people wanted to fill out paperwork not really hiring, it was the worst interview I ever had.", "Interview Questions": "Why are you interested in this position"}, {"date": "5 Nov 2021", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at CAL POLY in Jan 2020", "Interview Descriptions": "Met with Professor to discuss course goals, new material and lesson plans. Helped to plan future courses and department goals. Enjoyed engaging with students and other faculty inside and outside of the classroom while serving as a teaching assistant.", "Interview Questions": "1. Why are you interested in education?"}, {"date": "5 Dec 2019", "title": "Custodian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CAL POLY", "Interview Descriptions": "Three person panel made up of the manager, lead, and another person. Everyone introduces themselves and the question process starts. The three take turns asking question and everyone takes notes. Questions are pretty basic.", "Interview Questions": "Do you know what PPE stands for?"}, {"date": "17 Nov 2019", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CAL POLY", "Interview Descriptions": "I applied online and then received a phone call to schedule an in person interview. I was invited into an office where I answered questions for about 30 minutes. The interview overall was a simple discussion about who I was and how I handled different situations that may come up. The person interviewing me was nice and made me feel comfortable enough to just have a discussion about the position.", "Interview Questions": "What are your strengths and weaknesses."}], [{"date": "18 Oct 2019", "title": "Full Stack Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CAL POLY", "Interview Descriptions": "I was given a project to implement some component for their main website, worked on it for a week and present to the manager. He liked it so I got the offer", "Interview Questions": "Implement some javascript component for their website"}, {"date": "7 Nov 2019", "title": "Client Solutions Development Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at CAL POLY (Los Angeles, CA) in Oct 2019", "Interview Descriptions": "The first interview is a phone screening. The questions are very straight forward. They asked one technical question: How would you explain the stock market to a 10 year old? They also asked behavioral questions and what other jobs I was applying for.", "Interview Questions": "What other jobs are you applying for?"}, {"date": "11 Oct 2019", "title": "Full Stack Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at CAL POLY (San Luis Obispo, CA) in Sept 2019", "Interview Descriptions": "Efficient process with interviewers that are welcoming and transparent.  I interviewed for the ITS team in CalPoly and had one of the better experiences.  This was a two-step process, the initial interview was done via Zoom with a committee of four team members, and the next step was a full-day on-site with the committee, then the managers, and director.  \r\n\r\nThe technical questions asked were based on actual projects and so no crazy white-boarding session that doesn't help determine how effective you'd be on the job - very practical and there's a good focus on how the engineer processes a project and interacts with the team.", "Interview Questions": "Discuss how you build a meeting room reservation system."}, {"date": "27 Aug 2019", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at CAL POLY", "Interview Descriptions": "short and sweet. stay diligent and follow up with the interviewer. another thing that would help would be to volunteer beforehand so you know at least a little bit how the farm functions", "Interview Questions": "do you have ag experience"}, {"date": "17 Aug 2019", "title": "Shop Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at CAL POLY (San Luis Obispo, CA)", "Interview Descriptions": "Conversational interview asking for previous experience and opinions on the role of a shop technician with a mock scenario of a student asking for assistance from you (the technician).", "Interview Questions": "Why do you want to be a shop technician?"}, {"date": "24 Aug 2022", "title": "Digital Archives Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at CAL POLY (San Luis Obispo, CA) in Jun 2019", "Interview Descriptions": "Straightforward. Interview questions involved time management, interests, organization, and future goals associated with the library. Introduced me to everyone in the area and my future coworkers. Right away I could tell this was going to be a good place to work. ", "Interview Questions": "How do you stay organized?"}, {"date": "31 Jan 2020", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at CAL POLY (San Luis Obispo, CA) in Jun 2019", "Interview Descriptions": "There was a panel of 3 people that each had a few questions. Of course, some questions were generic and some were specific to the resume. The interview itself wasn't that long nor short and they definitely tried to make you feel comfortable throughout the process.", "Interview Questions": "What experiences have made you an ideal candidate for this job?"}, {"date": "27 Oct 2020", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CAL POLY (Cal Poly SLO, CA) in Jun 2019", "Interview Descriptions": "I was interviewed by three staffs. They asked some basic interview questions, like tell me about yourself, what experiences do you have. Then they went over the job description and daily tasks you will do if hired.", "Interview Questions": "What are your strengths and weaknesses. "}, {"date": "24 Jun 2021", "title": "Admission Recruiter Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at CAL POLY (San Luis Obispo, CA) in Apr 2019", "Interview Descriptions": "The interview process was straight forward. Application, phone interview, in person interview. The questions focused on the academic standards of the university and testing your ability to tie in your previous experience into the role you applied for.", "Interview Questions": "What do you know about Cal Poly? \nWhy do you feel your the best person for the job? \nHow has your previous experience prepared you for this role? "}, {"date": "7 Mar 2019", "title": "General Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at CAL POLY", "Interview Descriptions": "Interview with Advisor and outgoing GM\r\nI met with them beforehand to ask questions about the job and I also talked to them afterwards to follow up. It was very easy and a comfortable situation", "Interview Questions": "N/A"}], [{"date": "6 Feb 2019", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at CAL POLY", "Interview Descriptions": "I was given an interview after have my application first screened. All interviewees were required to then work on a small project related to the job. Some of my coworkers were required to do something similar and provide a portfolio.", "Interview Questions": "Why do you want to work in the library?"}, {"date": "15 Feb 2019", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at CAL POLY (San Luis Obispo, CA) in May 2018", "Interview Descriptions": "phone interview consist of 10 technical questions last about 30 minutes. On-site interview last for 3 days. First day do a demo lecture for 50 minutes. Second day did a formal interview with search committee. Also, attend social events to interact with students, faculty and staff in the department. A formal interview with College Dean. Third day did a research presentations forum followed with Q&A session.", "Interview Questions": "how can you contribute to our department?"}, {"date": "11 Jun 2018", "title": "Digital Media Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CAL POLY (San Luis Obispo, CA) in Mar 2018", "Interview Descriptions": "Interviewed online with three people  from Cal Polu using the software Zoom meeting. The meeting was pretty straight forward. It was only made a bit awkward because there were three people on their side of the screen. Becuase I have a wide screen it was difficult to make eye contact. at least it felt wakward to me. I don't know how it was perceived on theri end.", "Interview Questions": "Describe a situation where you used social media to expand business."}, {"date": "24 Sept 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at CAL POLY (San Luis Obispo, CA) in Aug 2017", "Interview Descriptions": "First applied through email (sent resume), then got a phone interview in which they tell me if I got the job in a few days. Questions were fairly simple, they just wanted to know more about me and if I would fit in with the rest of the employees.", "Interview Questions": "What is your experience in customer service?"}, {"date": "27 Mar 2017", "title": "Event Staff Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at CAL POLY", "Interview Descriptions": "Pretty straightforward. Just a phone call after emailing in regarding interest. Phone call lasted less than ten minutes.Don't know what else to say about this interview process as it was so simple and easy or straightforward process.", "Interview Questions": "Why would you like to work for us?"}, {"date": "27 Dec 2016", "title": "Student Solutions Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at CAL POLY (San Luis Obispo, CA) in Dec 2016", "Interview Descriptions": "Application filed. Called back for interview within three weeks of application. 90 minute job interview with a panel of four where we went through a slate of 15 questions, several of them with multiple parts. All were geared around my experience and education and how those factors were applicable to bullet points in the job description.", "Interview Questions": "Since part of this job pertains to customer service excellence, give an example of a situation where the customer/client was unhappy but through your efforts, their experience improved? Looking back on this example, what would you have done differently?"}, {"date": "17 Nov 2016", "title": "Project Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at CAL POLY", "Interview Descriptions": "It was a good experience and had a great time during the process. Wish I was more available for a different time and date, but the office and myself were extremely busy. I learned a lot from this experience mostly just stay calm and find some common ground to speak on and loosen the tension in the room.", "Interview Questions": "What would you do if you turned on your car and nothing happened?"}, {"date": "14 Aug 2016", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at CAL POLY (San Luis Obispo, CA) in Jun 2016", "Interview Descriptions": "By Committee and seem to be truly interested in making sure that first employee is competent but the subjective do they like you and will you be a team player are looked at.", "Interview Questions": "Why do you want the position."}, {"date": "17 May 2016", "title": "Academic Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at CAL POLY (San Luis Obispo, CA) in May 2016", "Interview Descriptions": "First, there was a 30-45min phone interview with a panel of 4 people. I was called back to come to the campus, however, was scheduled 3 weeks after the phone interview. The interview was 1/2 a day and had a one on one with the hiring manager, questions with the panel, questions with the staff, a presentation, more questions and then a lunch. It was a long day but they made you feel very comfortable (very conversational) and had a lot of opportunity to ask questions and get to know the staff. They really seemed to take the time to really get to know you and see if you would be a good fit for their team. They seemed like a very close group that worked well together. huge emphasis on \"team\"-- which is great. I was asked (based on my background) questions about how I could implement a certain program with all the issues surrounding it...I will admit I was taken back a little because I wasn't expecting a question like this....in order to really answer I would have to know more about how their advising works/the school and why there is so much \"negative\" surrounding this particular program... I was a little upset I couldn't provide a straight...\"this is how we are going to do it answer\"....", "Interview Questions": "Behavioral...tell me about a time when?.... how to you prepare for workshops? If you had more time in your presentation, what would you have done differently? What do you think an appropriate referral is? Tell me about yourself? What do you know about Cal Poly? and Cal Poly's culture? What do you know about Advising here at Cal Poly? Advising philosophy? How do you keep a good rapport with students? NCAA experience? --"}, {"date": "22 Jan 2018", "title": "Facilities Student Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CAL POLY (San Luis Obispo, CA) in Mar 2016", "Interview Descriptions": "Interview process was standard. They asked your basic interview questions. It was very easy. They basically just wanted to make sure that you could be responsible for the front desk, that your schedule would work out, and that you could work for an extended amount of time. I believe it was 3 quarters.", "Interview Questions": "Q: Why should we hire you?\r\nQ: what do you know about Cal Poly facilities"}], [{"date": "24 Jan 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at CAL POLY", "Interview Descriptions": "The interview process was very fast. It was one interview with your potential boss. He/she asks several questions about different situation and problem solving skills. Some questions are pretty straight forward and others are more conceptual. Come ready to answer questions about your technical skills, leadership skills, and problem solving skills.", "Interview Questions": "How would you handle a situation in which you do not get along with your boss?"}, {"date": "7 Mar 2016", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at CAL POLY (Los Angeles, CA) in Dec 2015", "Interview Descriptions": "general phone interview with four search committee members / explained research agenda / asked teaching & research & relevant professional experience / explained details about the recent publications/ it took me around 30 minutes\r\n\r\nIt is a teaching university, so they were more interested in my teaching experience than my research work or research skills.\r\n\r\nQ&A time after the interview.\r\nPrepare for relevant questions", "Interview Questions": "Tell me about yourself / research agenda"}, {"date": "24 Oct 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CAL POLY", "Interview Descriptions": "It was really relaxed and simple. They just want to see if you can look professional enough and hold a conversation. There wasn't anything difficult or stressful about it. Usually they just need a little extra help with managing offices. You come into the office and will meet whoever you will be working under. They will probably have your resume printed out just to ask some simple questions to get a better understanding of what you've done in the past.", "Interview Questions": "Do you like working in an office enviroment?"}, {"date": "1 Oct 2015", "title": "Coordinator of Student Development Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at CAL POLY", "Interview Descriptions": "LONG. \r\nApplication posted in December. \r\nPhone interview in the beginning of February. \r\nGroup video chat about the role in late February. \r\nConference Interview at NASPA/ACPA in the end of March. \r\nOn-Campus interview in the end of April. \r\nReferences checked beginning of May. Supervisor told me they only asked 3 questions and one of them was \"Has this candidate ever expressed any hostile tendencies?\" \r\nInformal offer provided mid may. Offer letter not provided until 3 months into the job.", "Interview Questions": "Situation & behavioral based interview questions. "}, {"date": "21 Oct 2015", "title": "Campus Dining Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at CAL POLY in Oct 2015", "Interview Descriptions": "The interview process is very brief. Share your previous hospitality and food service experience. Be genuine. Do not forget to smile and be honest. Even though it is a campus dining position, remain professional.", "Interview Questions": "How do you work with other?"}, {"date": "14 Sept 2015", "title": "Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at CAL POLY", "Interview Descriptions": "The college of science and mathematics requires you to fill a paper giving your major and non-major GPA, what you intend to do over the summer, and why you want to do summer research. There is no serious interview process.", "Interview Questions": "What do you intend on doing this Summer?"}, {"date": "13 Jun 2016", "title": "Caterer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at CAL POLY (San Luis Obispo, CA) in Sept 2015", "Interview Descriptions": "Very brief and chill. It was one-on-one with me and the catering supervisor. It was mostly a discussion of job requirements, what days are the busiest, and if my schedule allowed me to work on weekends and during breaks.", "Interview Questions": "How many hours can you work?"}, {"date": "25 Feb 2016", "title": "Instructional Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at CAL POLY (San Luis Obispo, CA) in Aug 2015", "Interview Descriptions": "Just an interview with the professor you grade for. Usually just questions about how well you understand the material. Most of the time is spent just explaining your role and how they teach, any differences in the way they grade and such. Fairly easy. No need to prepare for such interview.", "Interview Questions": "What grade did you receive?"}, {"date": "16 Dec 2015", "title": "Employee and Labor Relations Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at CAL POLY (Pomona, CA) in Jun 2015", "Interview Descriptions": "Fairly easy, panel of interviewers for intern position. They ask basic questions like what types of task do you like the most/least. One interview and a follow up interview to see if i was a good fit for a department.", "Interview Questions": "What are your favorite/least favorite tasks. What would you do if your manager was out for the day."}, {"date": "23 Jun 2016", "title": "Student Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at CAL POLY (San Luis Obispo, CA) in Mar 2015", "Interview Descriptions": "The interview was very causal. I talked to my professor he asked me a little about my past work experience and what the job would entail and how many hours would be required. I asked if there could be two people hired so the project wouldn't take up as much time and he agreed.", "Interview Questions": "Will you have enough time to commit to this project?"}], [{"date": "14 Jan 2015", "title": "Director of Recruiting Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at CAL POLY", "Interview Descriptions": "The process just to find out how my initial interviews went was a joke. It took six people over two months just to make a decision on whether or not to proceed. Perhaps the people that are there now in a management capacity have been there too long??? Not sure but I know this, they can't compete for top talent with the hiring process they have today. (and to blame it on the California State University System is comical)", "Interview Questions": "None, the interview questions were canned and read from a script."}, {"date": "2 Nov 2015", "title": "ITS Service Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at CAL POLY (San Luis Obispo, CA) in Dec 2014", "Interview Descriptions": "Simple interview with supervisor to see if you have potential and if he likes you. You don't really need too much tech background. They mostly likely will higher you the younger you are. For example, they are not looking to hire 3rd or 4th years. I would recommend any student to work here because of the amount of time to do your homework.", "Interview Questions": "What technical skills do you have?"}, {"date": "1 Oct 2014", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at CAL POLY", "Interview Descriptions": "There was a very simple hiring process. I was recommended for the position by another student and met with the interviewer once, where it was decided that I was a good fit for the job. The most important qualifications were responsibility, availability, and respect.", "Interview Questions": "N/A"}, {"date": "24 Sept 2014", "title": "Data Entry Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at CAL POLY", "Interview Descriptions": "It was straightforward. Questions concerning knowledge of the job required. The questions were typical interview questions and none that caught me off guard. Overall, pretty simple and quick. Unfortunately, I did not get the job, but it was a pleasant experience.", "Interview Questions": "N/A"}, {"date": "5 May 2016", "title": "Housing and Events Planning Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at CAL POLY (Cal Poly SLO, CA) in Sept 2014", "Interview Descriptions": "Interview process was efficient. I applied online and received a follow u email. We scheduled a phone interview, followed by a second interview which was a two panel interview. I was notified of a job offer the following week over the phone, after accepting the position I reported to the housing department to complete paperwork. Nice process and positive experience", "Interview Questions": "Past work experience in customer service"}, {"date": "11 Aug 2015", "title": "Admissions Operations Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at CAL POLY (San Luis Obispo, CA) in Sept 2014", "Interview Descriptions": "Casual, with basic questions involving self-motivation, effort in the workplace, and ability to cohesively engage in the workplace environment. Also included questions about extracurricular activities and organization and past experience with database and Microsoft Office applications", "Interview Questions": "Describe a time you had to perform a task under strict deadline that was given upon short notice. How did you succeed?"}, {"date": "14 Dec 2016", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at CAL POLY (Cal Poly SLO, CA) in Sept 2014", "Interview Descriptions": "You reply to an email that mentions an opening. Whoever responds first and meets qualifications gets the job. Once the hours for the classes are decided you are contacted again and asked which time works best.", "Interview Questions": "Which hours work for me"}, {"date": "5 Sept 2014", "title": "Administrative Support Coordinator II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at CAL POLY in Jul 2014", "Interview Descriptions": "Received a call for an interview about 6 weeks after I applied but a week after review date. Interviewed with a panel of 4 people. I was asked 12 questions total including if I had any questions for the panel. The panel had to follow a script and could only ask follow up questions on the answers I gave. I was given a second interview 2 weeks after the first round. 2nd interviews were with the same panel. I did not hear back for weeks after the 2nd round even after attempting contact with the department.", "Interview Questions": "How do you prioritize your work? What is your experience with technology? Scenario question that involved what I would do in a situation with a deadline and students needing help at the same time. "}, {"date": "24 Feb 2016", "title": "Receiving Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at CAL POLY (San Luis Obispo, CA) in Jun 2014", "Interview Descriptions": "The interview process was very casual. I basically walked up to the warehouse and told them I wanted to work and they interviewed me on the spot. Basic interview questions were asked, and I was given the job within 10 minutes. If you are a student and can answer some basic questions you will get the job.", "Interview Questions": "Q: Are you a safe driver"}, {"date": "31 May 2016", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at CAL POLY (San Luis Obispo, CA) in May 2014", "Interview Descriptions": "I received an email about the availability of the position.  The job description and application form were attached in the email.  I submitted the application and received a call within one week asking for an interview.  I met with the Program Coordinator and one other employee for the interview.  They were both very friendly and I felt very welcome there.  It was an exceptionally warm day but I still dressed up with a blazer jacket, and the Coordinator noticed and complimented my professionalism--advice: no matter the weather, dress up and look professional!", "Interview Questions": "They asked a few scenario questions, like \"What would you do if an employee has not turned in his/her paperwork for several weeks?\""}], [{"date": "3 Jan 2016", "title": "Student Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at CAL POLY (San Luis Obispo, CA) in Apr 2014", "Interview Descriptions": "I had a group interview with three other candidates in front of a panel. The questions were not too difficult and the environment was very welcoming. I was alerted via email that I received an interview after submitting a resume to our advising center. It was a very timely process, they alerted us in a very prompt manner. Overall it was a very positive experience.", "Interview Questions": "What is your experience? Why do you want this position?"}, {"date": "24 Jul 2015", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at CAL POLY (San Luis Obispo, CA) in Apr 2014", "Interview Descriptions": "Very casual interview. I knew the supervisor from an organization I was already a part of, so the interview was mostly just chatting and getting to know how my fit was in the company culture.", "Interview Questions": "Tell me about yourself"}, {"date": "24 Mar 2014", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CAL POLY", "Interview Descriptions": "E-mailed a professor directly. Asked if I had ever graded before, which I hadn't but since I am an upperclassman, I've had experience within the department. Had a 1:1 interview and started work about a week later. Whole process took approximately 1 week.", "Interview Questions": "What extracurriculars was I involved in. "}, {"date": "15 May 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at CAL POLY (San Luis Obispo, CA) in Jan 2014", "Interview Descriptions": "\"Hi Professor [Redacted], do you need a student assistant this quarter.\"\r\n\"Hello [Redacted], yes, a grader would be great!\"\r\n\"Okay, what do you need me to do.\"\r\n\"[Redacted] will send you an email when you are added to the payroll.\"\r\n\"Cool. Have a nice day.\"", "Interview Questions": "Can you grade these in three hours?"}, {"date": "23 May 2017", "title": "Lead Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at CAL POLY (San Luis Obispo, CA) in Jan 2014", "Interview Descriptions": "The interview process was fairly expected and carried out smoothly. I was asked about my administrative experience, WPM, excel competency and a variety of other things. I was asked about my best qualities and to expand on those. Additionally, I was asked about how I handled a difficult situation  in the work place and how that drove me to be a better role model and leader among my team.", "Interview Questions": "Tell us about your best qualities and why you think these are important to you."}, {"date": "23 Sept 2013", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at CAL POLY", "Interview Descriptions": "My interview was done over the phone, I spoke to three faculty members for about 15 minutes.  They asked me general questions like what my teaching philosophy is, what my long term goals are as an academic, and to describe to them how an average class of mine would go.  They also asked if I used any in-class technologies like clickers, masteringphysics, or simulations.", "Interview Questions": "How do I deal with trouble makers, what's an example of a difficult situation in a classroom that I've handled, or a situation that I wish had gone better."}, {"date": "23 Oct 2017", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CAL POLY in Aug 2013", "Interview Descriptions": "Committee of three interviewers.   Emphasis was on behavioral questions. They took turn asking questions. Jotted notes as I spoke. Casual feel matched the vision/mission of the department. Approximately 45 minutes long.", "Interview Questions": "They provided a busy scenario and asked me how I would respond to the situation and prioritize the needs."}, {"date": "26 Feb 2014", "title": "Admissions Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at CAL POLY (San Luis Obispo, CA) in Nov 2012", "Interview Descriptions": "Submit application online.  Contacted for interview 6 weeks later.  4-person panel interview.  1 round.", "Interview Questions": "2 minute admissions presentation on Cal Poly."}, {"date": "14 Oct 2012", "title": "Frontline Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at CAL POLY (San Luis Obispo, CA) in Jul 2012", "Interview Descriptions": "HR contacted me after I submitted my resume through Mustang Jobs. They scheduled a time to talk to me and called on time. The representative was very nice and asked me a bit about myself and was extremely supportive throughout the whole phone interview.", "Interview Questions": "Tell me about a time when you had to work with someone who was disagreeing with you"}, {"date": "25 Dec 2012", "title": "Web Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at CAL POLY (San Luis Obispo, CA) in Apr 2012", "Interview Descriptions": "Simple, 1 on 3 interview process from current employees", "Interview Questions": "What does Design mean to you?"}], [{"date": "27 Jun 2011", "title": "Grants Development Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at CAL POLY (San Luis Obispo, CA) in Jun 2011", "Interview Descriptions": "Fast response to my application online; great communication with the director of the division - from first phone call to the actual interview.  It was a group panel with the entire group interviewing (six people) - which is great to determine if the applicant is a good fit with the rest of the group.  The group seemed to have a great working relationship with each other.", "Interview Questions": "What was my experience with new technology"}, {"date": "3 Jun 2011", "title": "Student IT Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 1 day. I interviewed at CAL POLY (San Luis Obispo, CA) in Jun 2011", "Interview Descriptions": "There was a five step process. First they asked questions, second gave a tour at the location, third asked to circle important blocks from a flow diagram, fourth diagram on a computer, and fifth more question. I assumed that it will be a simple interview, but it was more technical. I will recommend to research information about  the requirements prior to the interview.", "Interview Questions": "If you are allow to brag about yourself, how will you like us to remember you?"}, {"date": "30 Aug 2014", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at CAL POLY in Sept 2010", "Interview Descriptions": "Interview process was quick and fast moving. I quickly received a call to come into the office and interview. The interview was very casual, just more about learn my personality since I had not had any experience yet in the field. No tests or hard questions at all, and it only lasted around 10 to 15 minutes.  At the end of it I got an offer to work.", "Interview Questions": "Why did you apply here? "}, {"date": "14 Jul 2010", "title": "Emergency Clerical Pool Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at CAL POLY (San Luis Obispo, CA) in Jun 2010", "Interview Descriptions": "The actual time between being called for a phone interview and panel interview was less than a week.  My application had been in the Cal Poly system since March and it is a continuous application that you may be called for temporary positions.  This position (in the housing department) will be hiring for full time in fall, this was just a summer appointment.  the first phone interview was quite short and with the person who's position I would be covering while she was out.  The actual interview was with a panel of three who would be co-workers and supervisors.  The interview was informal and no-stress and jovial.  There were a total of 10 job specific questions asked by the panel after the introductory period of the interview.\r\n\r\nI felt the aesthetics of the office were very nice and new.  The people I met during the interview process were very nice and friendly  and I could immediately see myself working with a group like them.  The work culture seemed to be more relaxed than a corporate office but still effective in getting work done in a timely manner.", "Interview Questions": "Detail a situation where important information needed to be conveyed to an audience and it was your duty to convey that information.  What do you do, how do you do it, what process do you take to properly convey the message.   Give a specific example from your work history."}, {"date": "31 Jul 2010", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at CAL POLY (San Luis Obispo, CA) in Mar 2009", "Interview Descriptions": "I met with the Support Admin for the Biology department. It was a very brief interview; she went over my resume with me and asked about my class schedule. I was hired the next day. The atmosphere is very laid back. I dropped off my resume the same day as my interview so I was wearing jeans and a sweatshirt. I am no longer working there because of budget cuts. Being a student assistant was one of the best jobs I could have had while being a college student. They were SUPER flexible with my hours and would allow me to take time off if I needed more study time.", "Interview Questions": "What type of office experience do you have?"}, {"date": "3 Dec 2010", "title": "SWS Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at CAL POLY (San Luis Obispo, CA) in Mar 2009", "Interview Descriptions": "It was a very fast process! The interviewer is the head of the program and she asked very pertinent questions. If you are worried about the requirements after interviewing, the job is not for you. It takes a lot of hard work and dedication to run a workshop.", "Interview Questions": "Describe a time when you have struggled to overcome an obstacle. How do you do it?"}]]