[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Just Started, So Far, So Good, So Awesome !!! AHOO AHOO AHOO", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Dec 2015", "job_title": "DSP in Lawrence, KS", "duration": "N/A", "pros": "I love working with the consumers 1-on-1, it builds trust. All the staff that I have worked with so far have been really helpful and they gave clear as day instructions on how things run and how to manage time efficiently, I'm glad that CLO hired me I could not ask for a better job. Everyone is friendly and what seems to be the best thing at least from what I've seen in the past and have experienced for myself in getting to know everyone, is that the staff REALLY DO, care about the consumers, which is the most wonderful thing I've seen so far, and I hope to see more of those moments. I think its our job to walk in with a smile and do our best to try and make the lives of the people we are working with a bit easier if we possibly can. I mean that's what we're there for is to try and help them in any way we can. I can honestly say that I very much look forward to learning new things with this company and keeping the lives of our consumers as happy as can be.", "cons": "I haven't found any yet, everything has been pretty freaking AWESOME !!!!! Three Cheers For CLO TECH N9NE'S, TECHNICIAN STYLE, AHOO AHOO AHOO !!!! STRANGE IS THE ONLY WAY !!!"}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "*", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Apr 2023", "job_title": "Caretaker in Overland Park, KS", "duration": "N/A", "pros": "The pro is this job supported adults with disabilites.", "cons": "No cons at this time."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Good Company", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Nov 2021", "job_title": "Program Support Specialist in Kalamazoo, MI", "duration": "N/A", "pros": "Love the people and the staff", "cons": "Can get boring, when everyone is sleeping or at programs."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "A sweat shop with horrible politics", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Jul 2016", "job_title": " in Lenexa, KS", "duration": "N/A", "pros": "The individuals that CLO serves are all amazing. You form bonds with them that become very hard to break which is why I stayed as long as I did. They all love learning new life skills, and you can feel their appreciation for you when they smile.", "cons": "Upper management is terrible and greedy. They will work you to the point of having your nerves shot. You can ask for support and specifically state what you need, and upper management still sits back and does nothing. Lower management does all the work (lower management being Team Leads and FTCs). Home Coaches are always using PAID time to do their personal agendas such as going to school or going to get their hair done. Don't bother them, they will get mad. Upper management will do anything to shut you up, then get mad when you aren't talking. Everyone is underpaid. The list can go on, so just stay clear of this place. They need new Upper Management that actually cares about the individuals and the employees."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Go to cottonwood instead", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "19 May 2015", "job_title": "Teaching Counsel in Lawrence, KS", "duration": "N/A", "pros": "-lots of freedom and independence \n-some of your consumers will be the best people you will ever meet\n-you never have to bring your own meals, unless you want to. \n-sometimes you get to do some really cool activities on the job\n-weekly paychecks", "cons": "-rate of pay is extremely low considering the work that is expected of you \n-management does not hide the fact that that they value money much more than they value their employees or their consumers \n-there are more often than not consumers that are not only verbally abusive, but also physically\n-I have been hit, but, pinched, scratched, punched, verbally abused, and have had someone spit on my face. \n-I have permanent scars on my arms from consumer abuse\n-some consumers will be the worst people you will ever meet\nThis job would not seem so bad if they payed you for the work you do. The rate of pay to start should easily be $15 an hour, not $9.50. There is no shift differential for the weekends, so there isn't any incentive to work weekends. CLO is often so short staffed the you will be asked to work upwards of 5 days a week, and your shifts will almost always be a 12 hour shift. I have never worked anywhere  where I was made to feel so obligated to work so much overtime. You have to put in requests for days off at least a month in advance, but the chances are slim that you will ever get your requested days off. You are much better off never working for CLO. Cottonwood is a much better employer, and care provider to consumers."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great place to work and make a difference", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Dec 2014", "job_title": "Direct Care Professional in Lawrence, KS", "duration": "N/A", "pros": "This agency has made a very impressive effort to truly integrate people with developmental disabilities in the community. It's a very gtratifying job as you really make a difference in the lives of severely disabled people. What makes it great is the teaching component - this is not babysitting - you are actually teaching life skills. I worked for eight straight years at CLO as a teaching counselor/direct care professional and although the starting pay was not high, was given plenty of opportunities for career advancement. I really enjoyed seeing small improvements almost on a daily basis in the skill set of the folks I was teaching. Like with any other job, if you stick around and be professional, good things will happen.  If you develop a good relationship with a client (which is inevitable if you are a caring person) you can join their EFT program which has incredible benefits (financial and otherwise). I've had experiences with other such agencies and the difference in training, services, care, etc. is dramatic. Also, there are numerous benefits, incl. reduced gym membership, dental ins., really good paid time off system, etc. I think, what's really imprortant is to keep in mind that you are not working with machines or products -  this is a job that requires you to help people...very fragile and yet wonderful people. I would recommend this job, but only to people who actually are serious about what they do in life and actually care for the less fortunate.", "cons": "The starting pay rate for direct care professionals needs to increase"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Challenging job but extremely rewarding!", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Nov 2015", "job_title": " in Lawrence, KS", "duration": "N/A", "pros": "This is an organization where you know everyone's heart is in the right place, and even on your worst day you know you have done something truly meaningful in the lives of individuals who's lives have been greatly enhanced by your work. The folks we serve here are unique and interesting, and the experience is humbling to say the least. Your supervisors here are willing to listen to you and take your ideas and they are always willing to step in and help or offer more training. All the home coaches and team leaders have to provide the same direct care as you do and are really experts at it.", "cons": "The pay is low, but normal for the industry unfortunately. $9.50 to $10 an hour to start, so a little more that you get paid at Cottonwood IF you can be super flexible and work multiple homes. Pay is the same at Trinity in home care, Sheltered Living in Topeka, and other places. Pay should be way higher in my opinion, and they don't offer health care (they do have dental and life insurance and paid time off). Communication sometimes sucks, it's hard to get upper management to call back in a timely manner, and sometimes my schedule changes and I haven't been talked to about it and all kinds of other changes happen suddenly."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": "N/A", "review_title": "House Managers", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Oct 2017", "job_title": "House Manager in Overland Park, KS", "duration": "N/A", "pros": "*Good working schedule 7am-7pm Wednesday-Saturdays, off but on 24/7 call Sunday-Tuesday\r\n*Some great staff to work with and make some very good friends\r\n*Excellent vacation benefits with up to 4-5 weeks off per year\r\n*Support is getting better \r\n*Able to manage home to your preference and to the wishes of the clients so lots of freedom", "cons": "*Communication is lacking but getting better\r\n*High turn over rate for staff and never enough staff to fill all openings\r\n*On call 24/7 unless on vacation and need to stay within an hour of the home\r\n*Administration is disconnected from the staff\r\n*Support it there but if you aren't someone that is able to fend for themselves it can be hard at times\r\n*Managers get half time pay after 40 hours of work so makes it feel like your time is less valuable after that but required to be on call 24/7\r\n*You can feel like an island if you don't reach out on your own a lot"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Super low pay for a hellish job", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Apr 2015", "job_title": "Care Giver in Lawrence, KS", "duration": "N/A", "pros": "You get a deeper understanding for the needs of people with severe developmental physical and mental disabilities. It can feel emotionally rewarding at times. But not often, due to what you have to deal with. Depending on the clients.", "cons": "I stuck it out with the company for about two years. The pay is TERRIBLE for the work you do. $8/hour to pick up human feces off the ground. They hire people willing to work for $8 and then wonder why people are abused in the organization. They preach treating clients with compassion (which I surely did) but then they turn around and treat the employees like garbage. Hypocrisy to the fullest."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "everyone want to be your boss", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Jan 2015", "job_title": "Anonymous Employee in Lenexa, KS", "duration": "N/A", "pros": "you don't have to bring your own breakfast, or lunch\r\nclients that i worked with are cool \r\ndon't have to dive your own vehicle \r\nyou work 3 days a week \r\ngain cna experience", "cons": "house managers don't help when your short staffed \r\nhave to handle medication when your not a cma or higher \r\nemployees take advantage of not having to drive there own cars and use the clients cars for own use \r\nnever clear on new rules made by management  cause old employees will do what ever it is they want \r\npay sucks for everything that you have to do \r\nto get health insurance through them is not worth it  and very expensive especially with the low pay we receive"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Great mission, horrible management!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 Aug 2015", "job_title": "Teaching Counselor in Lawrence, KS", "duration": "N/A", "pros": "Incredible job to work with people with disabilities.  Extremely rewarding to make a difference in someone's life.  You really can't put a value on it!", "cons": "The homes are all understaffed and overworked.  I am constantly being asked to work overtime because they have no staff.  My coach is new and won't last longer than a couple of months, the last three haven't made it.  The site director is afraid to do my job!  How can you pay people so little money and expect them to be worked like dogs.  The home I work in needs repair and is filthy."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Great place to work.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "9 Dec 2014", "job_title": "Administrative Assistant in Lawrence, KS", "duration": "N/A", "pros": "Family atmosphere, everyone is very friendly. Managers/supervisors are very supportive in any situation. I've been injured on the job, off work for 3 mo. due to health issues and lost my Father while working here and I can't explain the out pouring of support and care that was shown me. Amazing colleagues that are very passionate about their jobs and the organization. Everyone's focus is on providing the best quality of life for our consumers. Opportunity for advancement.", "cons": "I don't really think of this as a con, but you have to be very adaptable in this company. When providing for someone's everyday needs you never know what might arise."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "the upper management cares more about their paycheck than the disabled", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Aug 2014", "job_title": "FTM in Lenexa, KS", "duration": "N/A", "pros": "I loved the individuals that we lived with and cared for.   The other teaching couples were great too.", "cons": "Lots of training and most of it doesn't help do your actual job.   The upper management is clueless about what really goes on or how to care for these individuals.  they care more about their paycheck than the disabled people they are supposed to care for.  Many individuals have health issues that can be easily prevented or treated that go ignored."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "A job I wish I hadn't taken.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Nov 2012", "job_title": "Family Teacher in Lenexa, KS", "duration": "N/A", "pros": "CLO is very good to it's clients.  They are treated well and, for the most part, are happy.\r\nFamily Teachers do not have to pay rent or utilities (electric and gas) so that does help to offset the salary of $6.55 per hour and work week of 55 hours.", "cons": "As a Family Teacher, you and your spouse are told you will work 55 hours a week a piece, together, which is 4 day of 12 hours each plus meetings and doctors appointments and paperwork time outside of that.  My husband and I were supposed to work Sun-Wed from 7am to 7 pm.  The reality?  We worked Sun-Wed, at least 7-7, we also worked at LEAST half a day Thursday, often all day, and were often called in to work Friday or Saturday.  \r\nWe were told that we would have good support and classes in order to get our certification, which comes with a financial bonus, and yet every time we signed up for the mandatory class in order to become certified (a class taught BY CLO) we were told that we couldn't take it because there was no one to cover our shift OR we could take the all day class on Fridays, all Fridays, for two months and that they MIGHT have babysitting for our daughter (at the time 3 years old) or she could just be in class with us.\r\nCLO also claims to be very family friendly and that you are welcome to have your children with you while you work.  And yet if we spent any time dealing or helping our 3 year old while working, even if the clients were all busy or happy, we could get in trouble.  I also got pregnant while working and almost immediately after announcing the pregnancy things got strained at CLO.\r\nI had very bad morning sickness, throwing up enough to need to see the doctor, and I had to get a doctor's note in order to be let off duty, for 2 days, from doing heavy lifting of clients.  Not long before my due date, my husband and I were accused by our supervisor of Neglect of clients and mismanagement of funds.  ANE (Abuse, Neglect, Exploitation) officer reviewed everything and found no such issues. \r\nTwo weeks later, we were suspended from duty and told that we were being moved to an \"On-Call\" position where we would fill in for vacation and sick leave for other couples.  Since our position included a place to live, we were moved to a vacant location.  We were given one week to pack up our house.  This was two weeks before my due date.\r\nThe week I was due, we were informed that once I came off Maternity Leave (we had been with the company one and a half years by now) my husband would be working Sun-Wed and I would be working Wed-Sat.  We would have no days off together.  And we \"might\" be able to take the children with us to SOME of the houses but if not, well, that's why they made sure we wouldn't both be working at the same time.  You know, except for Wednesday.\r\nWe quit while I was still on Maternity.  CLO has a reputation, among those who have worked there, for chasing out couples when they are expecting.  I know personally of three cases of employees being fired or forced out either while pregnant or shortly after giving birth."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Okay for a temporary job", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 Apr 2019", "job_title": "DSP in Lawrence, KS", "duration": "N/A", "pros": "You have a set work schedule that does not change and are able to pick up extra shifts outside of that set schedule.", "cons": "Working 12 hour shifts is exhausting. There is a significant lack of communication about critical information which leads to unnecessary issues at work. There is a lack of appreciation for DSPs even though they deal with a lot of negative things while at work."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Just Say No to CLO", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Jan 2019", "job_title": "DSP in Lenexa, KS", "duration": "N/A", "pros": "The individuals are wonderful and deserve to have a good life.", "cons": "There are too many to list. You will be treated like dirt. Worse than dirt. The management team is awful, I'm surprised they can tie their own shoes in the morning.  These people are uneducated--seriously, none of the management team have degrees in anything, and they have zero skills to manage other people. They are evil people who love to sit around their desks at the office congratulating themselves on all the \"good\" they do while staff are out there working their butts off with not enough staff and too many things to do. They literally never talk to staff (family teachers and DSPs) unless it's to tell them they are in trouble, which is basically all the time.  You will not be unscathed, even if you think you are following the rules. The management team will do ANYTHING to not be blamed for a problem, even when it is solely their fault. They will throw you under the bus, big time. They leave you alone constantly to fend for yourself, then get mad when you don't do it how they want you to. They never help, they talk down to everyone, they treat everyone like they are stupid. They offer no support to their staff. The environment is completely toxic, which is so sad because the people who suffer most are the people with special needs they serve. The turnover is outrageous, so do yourself a favor and don't bother applying."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "It's a Lifestyle Not a Job", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Aug 2017", "job_title": "Family Teacher in Overland Park, KS", "duration": "N/A", "pros": "Working with those who need you. Able to work while taking care of your children. Very family friendly.", "cons": "No time off, plan on working 24/7 and in the chance that you don't, you don't. It really is a lifestyle."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Good Place with alot of potential", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Mar 2011", "job_title": "Teaching Counsel in Lenexa, KS", "duration": "N/A", "pros": "Very flexible schedule \r\nVery friendly staff / management\r\nGreat for students", "cons": "High turnover rate\r\nLimited level of advancement \r\nNot so great pay"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great people, bad turn over", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Feb 2015", "job_title": "Anonymous Employee in Lawrence, KS", "duration": "N/A", "pros": "The population of people that CLO serves is incredible!", "cons": "Lots of burn out, staff turn over, unpredictable hours"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Love the people but not the company", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "28 Oct 2015", "job_title": " in Lawrence, KS", "duration": "N/A", "pros": "Love working with the Men in women @ CLO", "cons": "Bad Management. Overworked and VERY underpaid!"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Disappointing", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "28 Jan 2014", "job_title": "Teaching Counsel in Kansas City, MO", "duration": "N/A", "pros": "Interaction with clients\r\nFeeling of making a difference\r\nHousing/Bills paid", "cons": "Company uses cameras at night to monitor clients with severe mental and physical disabilities\r\nManagement is inconsistent and incompetent \r\nClients living environments are dirty (smell of urine constantly), and falling apart"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Horrible", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Jan 2012", "job_title": "Weekend Caregiver in Lawrence, KS", "duration": "N/A", "pros": "Boatloads of hours if you can maintain your sanity in the environment", "cons": "Working for a \"Non-Profit\" that has created itself to exploit the disadvantaged, and create a salary for themselves."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "The hardest work you'll do for the lowest pay", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Apr 2020", "job_title": "DSP in Overland Park, KS", "duration": "N/A", "pros": "The clients, easy to pick up overtime", "cons": "Pay, insurance, no appreciation, can be very physical"}]]