[[{"date": "1 Oct 2020", "title": "Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Prospect College (Washington, DC) in Aug 2020", "Interview Descriptions": "An absolute mess!  You get asked to perform a simple math problem on Excel and then get interviewed by a couple of ladies who haven't really looked at your resume. Completely unprofessional.  They don't want to pay fair market value (not even close)", "Interview Questions": "Who are you?  Why are you here?  Oh, would you like to work for $20 an hour and we'll call you a Director?"}, {"date": "12 Jul 2019", "title": "Marketing Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Prospect College (Washington, DC) in Jul 2019", "Interview Descriptions": "Went in and had resume' reviewed. Was told to come back and go through a 1 week training to see how well I could perform and then a hiring decision would be made. I was told that the training would be paid and come in from 10 am to 4pm. Came in and at 12pm was told that that this was the second part o the interview they are interviewing 5 applicants and will call with a decision on Friday after I literally worked and called prospective clients. I asked the Owner's wife (co-partner) why didn't she be honest with me up front. They had me in a room making  call after call like a telemarketer  and I was going to be doing a regular admissions cold calling position apparently which I have no interest in. I would not have done any of that for two hours free, scheduling three of their prospective students.  She agreed to pay me which was $12 short of what I was agreed to be paid for salary and the she said..well the decision has not been made yet let me go and get your materials and then you can finish the calls and I can decide on rather I'll hire you. I made one call and then realized she was just trying to make we work longer to recoop that $20 she paid. And, I told her I wasn't interested in the position anyway because it is not the position I applied for.  Modern day slavery.!!!!!!", "Interview Questions": "Tell/Show me how you'd convince a student to enroll into our program. "}, {"date": "20 May 2019", "title": "Assistant Campus Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prospect College", "Interview Descriptions": "It was intimate with just the campus leads, asking me detailed questions on my leadership skills.  I was asked to interview because of my work background.  It seemed short but liked how they got to the point.  The campus director is lovely.", "Interview Questions": "Tell me how you would manage the programs here"}, {"date": "7 Aug 2018", "title": "Student Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Prospect College in Aug 2018", "Interview Descriptions": "I like everyone else submitted an application through Indeed and was e-mailed the following day about coming in for an interview. Limited information was included (never told who I would be meeting with or for how long) in the e-mail concerning my interview time and date. Got there and could sense I was not expected. Met with a women who asked me questions about what do I currently and had I ever thought about admissions. Explained to her that my interest was student services. She then communicated  to me that she did not have a lot of male students and the majority of female students feel comfortable talking to the same gender. Took an excel test that I misread the directions on (use the right formulas, but number totals were wrong) and was told I would be called back for a “working interview” so that I can meet the CEO.", "Interview Questions": "Have you ever thought about admissions?"}, {"date": "16 May 2018", "title": "Social Media Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Prospect College (Washington, DC) in Oct 2017", "Interview Descriptions": "A mess, no one knew what they were doing and the CEO was rude, short, and acted like he didn't even have the time of day for me. He made several racist and derogatory comments about his staff and students as well. It was a bizarre and very disturbing experience overall.", "Interview Questions": "How do I feel about working with low-income minorities?"}, {"date": "29 Oct 2017", "title": "Senior Admissions Counselor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Prospect College (Washington, DC) in Sept 2017", "Interview Descriptions": "This place is a joke. They only wanted to hire me for a week to fix something. Had no intention to hire me at all. A huge waste of my time.", "Interview Questions": "They really didn't ask anything difficult."}, {"date": "8 Feb 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Prospect College (Washington, DC) in Sept 2017", "Interview Descriptions": "Had been scheduled for an in person interview, had to fill out application and interviewed by CEO to begin with then he invited the president of the school to join, they asked general questions and some specific ones. On that day, they gave me an offer.", "Interview Questions": "Why do you want this job?  "}, {"date": "8 Aug 2017", "title": "Student Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Prospect College in Aug 2017", "Interview Descriptions": "I walked in and the receptionist sent me to another room to fill out the application and take a Basic Excel Test. I did not do well on the test because I misread an area that impacted the entire test. Once I finished, a guy comes to get me from the waiting area. He did not introduce himself and he asked me about the test. He showed me my error and I explained the miscommunication. He then had me add numbers and made me feel stupid about it even after I explained it was a small miscommunication. He then went on to ask why I was at other jobs for short amounts of time. He didn't talk about the position and how my qualification matched. He then left and said he had to find someone else to interview me. I waited about 10 minutes and a woman appeared and finished the interview. She asked some of the same questions the guy asked and then finished the interview. Overall, it was very disorganized and I wish they better planned the interview. Also, the guy did not have to be disrespectful when it came to explaining the questions.", "Interview Questions": "Q: Where do you see yourself in 5 years?"}, {"date": "13 Jul 2017", "title": "Registrar/Student Services Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Prospect College in Jul 2017", "Interview Descriptions": "Went in to interview for registrar position. Initially took 5 minute excel test and was made to wait 25 minutes as they forgot I was scheduled for interview. When finally met with interviewer was told position already filled and offered me front desk assistant position at considerable pay decrease. Was told that I only qualified for hourly pay at $9/hr even though I have bachelors degree with 2 years experience. Interviewer also made derogatory remarks about students social status and education level. Also told by interviewer that I was lying about how long I would stay at position because she claims federal top secret security clearances only take one month to obtain. Was asked if I could wait for two hours in reception area for CEO to come and interview me as well.", "Interview Questions": "How do you feel about working with lower income African American students?"}, {"date": "19 Jul 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prospect College (Washington, DC) in Jun 2017", "Interview Descriptions": "I took an excel test initially. Waited 20 mins while they decided who would interview me. When someone finally came out, I was only asked 3 questions. This is before I was told'you look like a nanny I saw around the African embassy'. I have a B.A and at least 2 years experience.  \r\n\r\nIt is sad and pathetic that these are the type of people that are charged with the responsibility of educating 'lower income African Americans'.", "Interview Questions": "Where did you study?"}], [{"date": "2 May 2017", "title": "School Staff Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Prospect College (Washington, DC)", "Interview Descriptions": "I applied online using Indeed. I was called in for an interview the next day, where I was given an excel test. After that, I met with the President of the company, and she asked me why I was interested in the position. She offered me a job at the end of the meeting and I started the next week.", "Interview Questions": "Why do you want this position?"}, {"date": "16 May 2017", "title": "Academic Advisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Prospect College (Washington, DC) in Feb 2017", "Interview Descriptions": "Applied via Indeed, was emailed the next day for in person interview;  it started with Excel  test, followed by conversation with CEO (Director) who was  not clear about this position duties or expectations.", "Interview Questions": "What are your salary expectations? "}, {"date": "7 Jun 2018", "title": "Career Services Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Prospect College (Washington, DC) in Oct 2016", "Interview Descriptions": "The whole process took about a day and a half. I applied, I got an interview, went it, they changed the position that they wanted me to apply for while I was interviewing, I left, I went to McDonald's, and I was offered the job while eating a McMuffin.", "Interview Questions": "How do you feel about working with difficult African-American people?"}]]