[[{"date": "12 Nov 2022", "title": "Residential Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Thresholds (Chicago, IL) in Nov 2022", "Interview Descriptions": "My phone interview went very well. It was a casual conversation about my experiences, expertises, education, and how I will fit in. My phone meeting went so well that I was offered a better position within Thresholds and now awaiting my phone call of approval for 2 said work sites with either the Veterans or Women help one the newly opened sites on West Roosevelt Rd Chicago westside.", "Interview Questions": "Why did you choose Thresholds?"}, {"date": "2 Jun 2022", "title": "Nurse Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thresholds", "Interview Descriptions": "Organized, very open and transparent expectations and descriptions of job. Discussed turn over rates, training expectations, next steps if job was offered. History of the company and the program that was hiring.", "Interview Questions": "What do you think about mental health?"}, {"date": "31 Mar 2022", "title": "Outreach Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at Thresholds", "Interview Descriptions": "If you are truly passionate about mental health  you will be able to shine. Questions centered around if you could realistically handle the day to day workload which is a lot", "Interview Questions": "How would you handle xyz problem if it came to be?"}, {"date": "27 May 2023", "title": "Assertive Community Treatment Team Member Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Thresholds (Chicago, IL) in Mar 2022", "Interview Descriptions": "Application was easy and contacted right away from the headquarters. I was not impressed with the location for the office, and it seems run down. The interview with the Program Director at Southwest was short, disinterested and rude.", "Interview Questions": "Working on call and weekends?"}, {"date": "6 Feb 2022", "title": "Walking Picker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Thresholds", "Interview Descriptions": "Phone call to in person interview. Background chck was Easy. And quick. great experience overall. very friendly company.  Easy process. Recommending to affiliates. Great shifts and hours.  Everything is explained. They are open to you asking questions.", "Interview Questions": "Tell us about yourself.\r\nWhere do you see yourself in 5 years\r\nWhat's one of your best attributes\r\n"}, {"date": "17 Nov 2021", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Thresholds", "Interview Descriptions": "Fun to have an in person interview and then a shadow day for your position. To see how a staff day goes is a valuable experience in the interviewing process.", "Interview Questions": "What experience do you have working with the mentally disabled? "}, {"date": "22 Sept 2021", "title": "Chief Financial Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Thresholds (Chicago, IL) in Sept 2021", "Interview Descriptions": "One hour Zoom interview with four of the Senior members of the Accounting department. It was a meeting with all of us at one time. The each had a perspective on what they needed done in the department.", "Interview Questions": "Let's go through your resume, section by section, from the beginning."}, {"date": "22 May 2023", "title": "Office Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Thresholds (Chicago, IL) in May 2021", "Interview Descriptions": "Program director contacted me fairly quickly after applying. Did a virtual call and then met in the office in person, asked fairly basic questions about the responsibilities and also learned more about the company.", "Interview Questions": "Why do you want to work for a non-profit like Thresholds? Did I have any connection to their mission?"}, {"date": "24 Nov 2020", "title": "Marketing Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Thresholds", "Interview Descriptions": "made it sound like a dream job failed to mention its commission based door to door sales wasted my time and their time had to spend 2 hours going door to door for my interview no thank you.", "Interview Questions": "why am interested in marketing"}, {"date": "3 Nov 2020", "title": "Senior Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Thresholds", "Interview Descriptions": "Good choice of questions  and managed to answer very well.Smooth interview  process.\nKnowledgeable interviewers and very good atmosphere. Good choice of questions  and managed to answer very well.Smooth interview  process.\nKnowledgeable interviewers and very good atmosphere.", "Interview Questions": "Complicated but was easily manageable "}], [{"date": "10 Feb 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thresholds (Chicago, IL) in Nov 2020", "Interview Descriptions": "I was contacted by a recruiter after submitting my resume. I was informed the hiring manager would reach out to me to set-up an interview. I did not hear from anyone and after waiting a week, I reached out to the recruiter again. She finally got the hiring manager to reach out to me to set-up an interview. It was clear I was not a good fit for this position. I followed-up with a brief \"thank you for your time\" email to my interviewers and never heard from them again. Disappointing, but I think they are a very valuable, worthy organization and this process should not reflect their noble mission.", "Interview Questions": "Tell us about you.\r\nWhy do you want to work here? etc."}, {"date": "6 Oct 2020", "title": "Residential Support Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Thresholds (Chicago, IL) in Oct 2020", "Interview Descriptions": "The interview process was great. I met some wonderful people. They were very informative about the position. I really enjoy the interview and it lasted about an hour. I had lots of questions.", "Interview Questions": "Describe a challenging or difficult time at work and how you handled the situation?"}, {"date": "17 Sept 2020", "title": "Service Integration Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Thresholds (Chicago, IL) in Jul 2020", "Interview Descriptions": "Very friendly, knowledgeable, organized, and helpful interview. Very personable on the phone and were timely on calling and finishing the call. Followed up quickly and were friendly and cooperative during the entire onboarding process.", "Interview Questions": "How does this position fit into your career aspirations? How can we help? \nWhat do you look for in a supervisor? "}, {"date": "11 Jun 2020", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Thresholds (Chicago, IL) in Jun 2020", "Interview Descriptions": "The hiring process was fairly easy. The interviews took place over the phone. The interviewer was extremely pleasant and informative. The interview was short but the process included speaking with three different individuals before completing the hiring process.", "Interview Questions": "How familiar are you with our organization?"}, {"date": "22 Oct 2019", "title": "Community Support Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Thresholds (Chicago, IL) in Oct 2019", "Interview Descriptions": "Recruiter emailed me, on a Tuesday, interviewed on that following week, on a Wednesday. It’s Monday the following week, I’m waiting for a call. The interviewer stated she would call me.", "Interview Questions": "Why should they hire you "}, {"date": "29 Jul 2019", "title": "Employment Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Thresholds", "Interview Descriptions": "Long process, weeks between contacts and sometimes had to contact them myself. It was primarily done via email. I had a first interview with someone I assumed would be my primary supervisor and then a second interview/job shadow. There was also a third interview, had I been selected.", "Interview Questions": "Specific questions about my experience and interest in the job"}, {"date": "30 Apr 2018", "title": "Cst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Thresholds (Chicago, IL) in Apr 2018", "Interview Descriptions": "The process went well, the interview was comfortable, engaging and gave me a realistic expectation for what to expect from the job.  I found the staff to resonate similar beliefs to myself (e.g., more liberal side).  \r\n\r\nI was told during the interview that I will most likely be given the job, which was nice to hear, as sometimes it's hard to know if you did well or not.", "Interview Questions": "Where do you see yourself in 10 years? "}, {"date": "7 Mar 2018", "title": "Research Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Thresholds (Chicago, IL) in Mar 2018", "Interview Descriptions": "Had a phone interview that lasted roughly 15 minutes. The interviewer provided background information about Thresholds, more information about the specific job, and asked about work experience and education. At the end, interviewer informed me that she would be passing information along to the next hiring manager and would receive a call if they were interested in meeting with me.", "Interview Questions": "How do you handle stress?"}, {"date": "18 Nov 2017", "title": "Community Support Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Thresholds in Nov 2017", "Interview Descriptions": "The interview was great. More of a friendly conversation. The interviewer was wonderful. She seemed very caring and passionate about the company. She explained the job in depth and asked about my experiences with clients.", "Interview Questions": "Describe a time where you felt proud of when working with a client "}, {"date": "15 Aug 2017", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Thresholds (Woodstock, IL)", "Interview Descriptions": "Application online and the interview in person with Supervisor.  The supervisor asked me questions as to why I would be a good case manager, did I have experience with working in mental health and teaching.", "Interview Questions": "What is your experience working with people who have mental health issues?"}], [{"date": "8 Feb 2018", "title": "Supported Employment Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Thresholds (Chicago, IL) in Aug 2017", "Interview Descriptions": "The interview process was easy.  Your a asked to partake in a group interview.  You will be selected based on your answers.  You are asked to participate in a job shadowing experience to make sure you understand the job description.  Next, they present you with an job offer.  It will be very low.  But, some candidates will take the job offer due to inexperience or out of desperation.", "Interview Questions": "You will be asked behavioral interview questions such as; Give an example of a goal you reached and tell me how you achieved it."}, {"date": "18 May 2017", "title": "CSS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thresholds (Chicago, IL)", "Interview Descriptions": "One on one interview with program manager. The interviewer was on time, relatable and respectful. The interview lasted approximately one hour.  It was more of a friendly conversation  than a rigid interview.", "Interview Questions": "Tell me about an experience you had with a tough client?"}, {"date": "4 Oct 2017", "title": "Master's Level Crisis Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Thresholds (Chicago, IL) in Jan 2017", "Interview Descriptions": "Team Leader contacts you and brings you to Hospital ER for an interview conducted in a very informal, relaxed manner.  Essentially, if you have the background, you will be offered the job.  No skill employed during interview process.  No use of behavioral interviewing techniques or any attempt to weed out undesirables.", "Interview Questions": "Tell me a little about yourself?"}, {"date": "2 Dec 2016", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thresholds (New York, NY)", "Interview Descriptions": "The first interview was pretty average. No curveballs. If they like you, they will ask you to do a second interview where you will basically shadow someone for half of a day. Relax and be yourself.", "Interview Questions": "Describe a time where you had to deal with a stressful client. "}, {"date": "9 May 2018", "title": "Employment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Thresholds (Chicago, IL) in Aug 2016", "Interview Descriptions": "Interview process was smooth. Background and reference check is what takes the longest.  They take a while processing all your information and will not move forward with you until they have received all of your references.", "Interview Questions": "What are your skills? How do you feel about helping other people? How is your driving record? Why should we hire you?"}, {"date": "23 Jul 2016", "title": "Crisis Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Thresholds (Chicago, IL) in Jul 2016", "Interview Descriptions": "I applied online and was contacted by a supervisor ~2 weeks later. Fairly typical interview process, met with supervisor and was asked about why I was drawn to the position, reviewed my resume, talked about the job. Upon applying online I received a number of phone calls from various other departments at Thresholds looking to fill positions that I did not apply for, but was nice to be considered.", "Interview Questions": "Past experiences, skills, etc."}, {"date": "11 Jul 2016", "title": "Community Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thresholds (Chicago, IL) in Jul 2016", "Interview Descriptions": "The interview was laid back. They wanted to know about me and my experiences. Nothing to difficult to answer. I was interviewed by two people and they were very friendly and considerate about the questions they asked based on my experiences. I felt that even though I do not have experience with mental health, they formed questions in ways to see that I would be able to succeed in this position without that experience.", "Interview Questions": "How would I approach a client who is resisting or not wanting our services?"}, {"date": "23 Jun 2016", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thresholds (Chicago, IL)", "Interview Descriptions": "Good interview. Straight to the point. Supervisor wants to know about you as a person in addition to your professional experience. Phone screening and then in person interview with the program director. The director then asked me back to do shadowing with the team lead to get a feel of the position. Got to meet the team and ask questions. Overall, s really positive experience.", "Interview Questions": "Helps to know about mental health practices, laws and procedures. Interview questions pretty standard otherwise, why do you want to work here what can you offer etc."}, {"date": "15 Jul 2016", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Thresholds (Chicago, IL) in Jun 2016", "Interview Descriptions": "Called back really quick after submitting resume. Got a quick email from team lead inviting me to a interview. Lasted about an hour or so. Was told I would hear back in a week or so. Took longer time for second interview. The second interview involved shadowing a current employee", "Interview Questions": "Different what if situation. A client using substance and has no plans to stop use harm reduction approach.\r\n\r\nWhy do you want to work for this company?"}, {"date": "8 Jul 2017", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Thresholds (Chicago, IL) in Apr 2016", "Interview Descriptions": "The interview was relatively easy. It was a panel interview consisting of three individuals. They encouraged me to ask more questions than they asked me. They got back to me within a week or a week and a half via phone call.", "Interview Questions": "experience"}], [{"date": "30 Aug 2017", "title": "CSS Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thresholds (Woodstock, IL) in Jan 2016", "Interview Descriptions": "It was a long and thorough process. I ended up interviewing for a different position than I applied for based on my experience. I met with several different levels of leadership and has a team interview. The hardest part was waiting on the background check and references to come back in a timely manner.", "Interview Questions": "How do you see your past experience working with children applying to this position working with adults?"}, {"date": "24 Oct 2015", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Thresholds", "Interview Descriptions": "I attended a group interview first. Basic interview questions. Nothing too out of the ordinary or difficult. \r\nThen a shadowing interview. This was relaxed and informal- more of a chance to see what the job entails and make sure you are comfortable with the work.", "Interview Questions": "What is something you do to relieve stress?"}, {"date": "24 Sept 2015", "title": "Community Support Specialist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Thresholds (Chicago, IL)", "Interview Descriptions": "Initially, a phone screening/interview scheduling was done. I met with the program director and team leaders, which is pretty standard (I later applied to different programs). They spend time sharing about the program with you, as well as getting to know why you're interested in the program and you experience. Each program director I interviewed with really tried to get to know me as a person, and did ask challenging questions. Interviews are some of the most laid back/casual that I've ever had.", "Interview Questions": "All programs wanted to know why I wanted to work at that program. The other major questions presented were situational: what would you do if..., etc. "}, {"date": "19 May 2015", "title": "Community Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Thresholds (Chicago, IL) in May 2015", "Interview Descriptions": "After applying online, I received an email requesting that I come in for an interview.  We scheduled a time via email.  The interview was very pleasant, informative and comfortable.  I was told that I would hear back in 2 weeks.  It's been a little over a week.  I hope I get the job.", "Interview Questions": "Why do you want to work at Threshold?"}, {"date": "30 Jul 2019", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Thresholds (Chicago, IL) in Apr 2015", "Interview Descriptions": "Informal, chaotic and unsettling. I was confused as to who was the supervisor and they kept surprising me with ad hoc additions. Staff and members were pulled in to interview me at random and it seemed they were going to hire me regardless of how I answered the questions.", "Interview Questions": "Do you have a car and will you drive members with severe mental illness where they want to go?"}, {"date": "31 Jul 2015", "title": "Community Support Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Thresholds (Chicago, IL) in Mar 2015", "Interview Descriptions": "The interview was about an hour long conversation between the hiring manager, a team leader, and myself. They had several questions prepared but also tailored additional questions to my experiences and responses. After my first interview, the hiring manager called me back the same day and asked if I would like to come in again, this time to shadow.", "Interview Questions": "They asked about what interested me in the position and what my experience was in the mental health profession. They also wanted to know how I might react to specific situations (ie: if a member was planning on using drugs)."}, {"date": "10 Jan 2015", "title": "Variable Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Thresholds", "Interview Descriptions": "I just attended their job fair.  It was professional and not overly bureaucratic with a lot of paperwork.  Everyone was warm and friendly they made the applicants feel very welcomed.  I'm expecting a call back next week.", "Interview Questions": "The questions were as you would expect, but the tone was so straight-forward and without the kind of trickery that interviewers often feel is needed to have the upper hand.  My interviewer seemed genuinely interested in seeing if I would fit with the agency."}, {"date": "13 Dec 2014", "title": "Community Support Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Thresholds (Chicago, IL) in Dec 2014", "Interview Descriptions": "Wonderful people. It was honestly the best interview experience I have ever had. They were very honest, and I felt that I could be very open about who I am and what I want to do and what I can bring to the table.", "Interview Questions": "No tough questions- but they want honesty from you. They want to know who you are, not how you've been prepped to interview. Be yourself here, and they'll love that."}, {"date": "9 Nov 2014", "title": "Housing Locator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Thresholds in Oct 2014", "Interview Descriptions": "Phone interview that was very thorough and friendly.  Interviewer completely explained the role and program the Housing Locator would be involved in.  The position would be for a new program for people with mental health issues who had been denied independent living opportunities, but were being attempted to be rectified.", "Interview Questions": "Did I know anything about tax credit housing??"}, {"date": "16 Feb 2014", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Thresholds", "Interview Descriptions": "The hiring process was great.  I think the interview process was 2 interviews, a phone interview and a face to face interview.  The hiring manager was very neutral and professional.   I felt they really cared about what I could bring to the company.  I applied through the employee referral process.", "Interview Questions": "I don't recall anything being overly difficult.  "}], [{"date": "9 Mar 2014", "title": "Community Support Specialist III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Thresholds (Chicago, IL) in Feb 2014", "Interview Descriptions": "Applied then had a call from the office manager about my interests and background information. We scheduled an interview right there on the phone. Interview was less than a week later. Went to office, filled out application, brought 2 copies of resume. It was a group interview. Typical questions about type of care, what orientation you have with clients, history working with clients, ways you have worked in the past. Then when interview was over about 4-5 days later the supervisor called to call and get some more information (kind of like second interview) supervisor did not feel like they had enough information to make a decision. Supervisor said they would let me know shortly. 2-3 days later I was called and offered the job. I accepted.", "Interview Questions": "N/A"}, {"date": "16 Feb 2014", "title": "Community Support Specialist III Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Thresholds (Chicago, IL) in Jan 2014", "Interview Descriptions": "I applied online and was contacted for an interview about a week later. The interview was held at the Thresholds office in Chicago. The interview was a small group interview that last about an hour or a little longer. The interviewers were pleasant and asked typical interview questions. They asked about work experience, obstacles with clients or supervisors and self-care. Since it was a group interview it can be difficult to not replicate an answer since most people had similar professional backgrounds.", "Interview Questions": "Give an example of when you went above and beyond for a client."}, {"date": "5 Jan 2014", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Thresholds (Chicago, IL)", "Interview Descriptions": "The interview consists of two parts: face to face and in the community.\r\nHiring managers are neutral and professional.\r\nThey are very interested in your work history and what you can bring into this company.", "Interview Questions": "No, hiring manager asked from applicants work experience."}, {"date": "2 Apr 2015", "title": "Community Support Specialist III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Thresholds (Chicago, IL) in Jan 2014", "Interview Descriptions": "Phone screening with talent management (human resources) to see which of their many programs would most fit my work experience and preference. One interview with team leader and program director. Second interview with entire team. Then program director checked references and made an offer. The interviews were pretty standard, didn't throw out a lot of curve balls. They tend to hire college graduates and hire people with very little to no experience as the CSS workers so it's more focused on how you deal with stress and how you have learned from internships and other experiences.", "Interview Questions": "What is your preferred therapeutic approach?"}, {"date": "27 Dec 2013", "title": "Community Support Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Thresholds in Dec 2013", "Interview Descriptions": "Initial phone call to verify understanding of the parameters of the position.  First interview with Program Director and Team Leader, standard interview questions read from a list.  Second \"interview\" was a \"ride along\" with the Team Leader to do community visits.  When I received the call for a \"ride along\", I thought I was on the short list and ready to receive an offer.  I was told they would follow up in \"a week or two\". That was over three weeks ago and I have not heard anything back, not even a rejection letter or email.", "Interview Questions": "There weren't really any surprises and none of the questions seemed difficult or challenging. I felt prepared and believed I did well. There were no interview-like questions during the \"ride along\" - just two community visits and general chatting about the usual workday."}, {"date": "3 Oct 2013", "title": "Temporary Position Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Thresholds", "Interview Descriptions": "They were very slow to get back, office located in an isolated area.", "Interview Questions": "Why do you want to work in HR? "}, {"date": "26 Feb 2016", "title": "Staff Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Thresholds (Chicago, IL) in Aug 2013", "Interview Descriptions": "only 1 round of interview, with manager. \r\nno phone interview\r\nquick responding\r\nnice interviewer\r\neasy questions\r\nlaid back environment\r\ncozy, and good time\r\nask each simple question.\r\ncontroller came in and ask 2 more final questions\r\nthey review my transcripts\r\nlots of smiling, \r\nunderstandable", "Interview Questions": "what is your first job?\r\nWhat are your strength and weakness?"}, {"date": "9 Nov 2014", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Thresholds in Aug 2011", "Interview Descriptions": "There are two parts of interview, first part is general review of the resume and basic questions about past work experience and education, and how can that related to the position.\r\n\r\nSecond part is to be in community, being observed the applicant's interaction with clients and member and health providers and team member to see if they fit and is comfortable providing service and good communication skills.", "Interview Questions": "not really, it is more about getting to know more about the applicants and if they are up for challenge with the job and have good problem solving skills."}, {"date": "18 Feb 2014", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Thresholds in Jun 2010", "Interview Descriptions": "Straight forward. Apply online and wait to be interviewed if selected. If selected, you go for the interview. For the community support position, you should have your interview with a program director and one of the team managers. Be prepared with questions for both. Remember to review the website and prepare for the position as you would any other job.", "Interview Questions": "Interview questions were straight forward. Prepare for the interview as you would any other job. Just ask yourself if this is what you really want to do because you will not earn a lot of money. "}]]