[[{"date": "9 Feb 2023", "title": "Procuremnt Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hebrew Immigrant Aid Society (New York, NY) in Feb 2023", "Interview Descriptions": "I was contacted after my initial application. The hiring process was explained and a phone interview conducted as a beginning. Then after things disappeared like a mist in the air. No response at all.", "Interview Questions": "1. Walk me through your CV 2. Introduce yourself"}, {"date": "2 Nov 2022", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Hebrew Immigrant Aid Society", "Interview Descriptions": "Responsive and supportive recruitment team. Clear and transparent processes and steps that are on all job descriptions. A really rewarding process so far. Its obvious that people who work there care about the mission and values of the organization, and that's saying something.", "Interview Questions": "What makes you want to join HIAS?"}, {"date": "10 Jun 2022", "title": "Linking and Learning Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hebrew Immigrant Aid Society (Nairobi) in Feb 2022", "Interview Descriptions": "Not very organized. They told me at the interview that they had purposely withheld some information that would have been pertinent to how I drafted my proposal. They never got back to me even though I had gotten to interview stage. This was HIAS Nairobi, Kenya. Much better can be done.", "Interview Questions": "Are you able to work with the different under represented communities that we support?\n"}, {"date": "8 Jan 2022", "title": "Protection Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hebrew Immigrant Aid Society", "Interview Descriptions": "The interview process commenced with a written exam testing on job knowledge, then upon passing that, one is invited to an oral interview. The oral interview mainly comprises of competency-based questions and few others on job knowledge.", "Interview Questions": "Please tell us about your experience on working with LGBTIQ persons and refugees. \n\nDefine who a refugee is. \n\nWhat national and international laws protect the rights of refugees? "}, {"date": "21 Dec 2021", "title": "GBV Caseworker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hebrew Immigrant Aid Society (Nairobi) in Nov 2021", "Interview Descriptions": "The interview was on zoom. It was a panel of 4 including HR Assistant. They were friendly and I thought the interview had gone well. But I got a rejection via email 2 weeks later. \nThe confusing part was that the vacancy was still posted as open on their website even after the rejection.", "Interview Questions": "Please describe a survivor-centered approach to gender-based violence"}, {"date": "25 Sept 2021", "title": "Resettlement Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hebrew Immigrant Aid Society", "Interview Descriptions": "It was a very good interview. They were kind and really seemed interesting in getting to know me as a person. The interview was very focused on the position and on the situation in Peru", "Interview Questions": "Please describe your previous experience working for refugees "}, {"date": "23 Aug 2021", "title": "Protection Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hebrew Immigrant Aid Society", "Interview Descriptions": "After application, I got invited for a written interview that lasted for one hour and then shortly thereafter i did an Oral interview before a panel of 2 members. Generally, the questions were based around the position being offered. the panel was friendly and quite engaging.", "Interview Questions": "Grounds for recognition of refugee in kenya."}, {"date": "3 Jun 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Hebrew Immigrant Aid Society", "Interview Descriptions": "I had a phone screen with talent acquisition,  a  video interview with the hiring manager, and a video interview with a panel of HIAS employees. The process was extremely transparent, and each piece was communicated thoroughly. The talent acquisition team is extremely communicative, thoughtful, and kind. The whole hiring process was enjoyable. I highly recommend HIAS as a place to apply.", "Interview Questions": "All the interviews were formatted in conversations and were extremely natural and thoughtful."}, {"date": "18 May 2021", "title": "Supervising Attorney Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hebrew Immigrant Aid Society", "Interview Descriptions": "Professional polite with all of the staff that would supervise me and that I would supervise.   The interviewers asked good questions and it was conversational.  I was impressed that they asked me to write answers to a hypothetical legal problem.", "Interview Questions": "What is your supervising style"}, {"date": "21 Sept 2020", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hebrew Immigrant Aid Society (Quito) in Sept 2020", "Interview Descriptions": "A week after receiving a call for a background check, I was contacted again to schedule an interview. They mainly wanted to know how did my experience and knowledge align with the position I was applying to, and to what degree I was familiarized with the main concepts and techniques in the field. I was told someone from HR would contact me soon. It was an overall nice interview.", "Interview Questions": "Why are you interested in this position?"}], [{"date": "26 Aug 2020", "title": "Special Initiatives Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hebrew Immigrant Aid Society", "Interview Descriptions": "Had a 30-minute phone interview so the hiring manager could get to know me better and speak further about the position. Very easy interview and received salary and benefits information at the beginning of the interview.", "Interview Questions": "Asked about experience and interest in the organization "}, {"date": "3 Mar 2017", "title": "Policy Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hebrew Immigrant Aid Society (New York, NY)", "Interview Descriptions": "Very frustrating experience.  In the middle of fall, I drove down for an in person interview that I thought went okay, at least. (Very friendly and conversational tone, questions about my experience, etc. but nothing difficult).  They told me I should hear within a month.\r\n\r\nAnd then...nothing. \r\n\r\nAfter 2 months, it was around New Years, so I sent them a very polite email to wish them a Happy New Year and to let them know that I was still interested in the position.  Its been 3 months since the email and I still haven't heard a word from them.\r\n\r\nIt's frustrating, but understandable when organizations don't respond to cover letter letters/resumes. But to bring someone in for an interview and then to not even bother with the courtesy of telling them they didn't get the job? That's just rude.", "Interview Questions": "What's your advocacy experience?"}, {"date": "21 Apr 2016", "title": "Program Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1+ week. I interviewed at Hebrew Immigrant Aid Society in Mar 2016", "Interview Descriptions": "I applied online and very quickly received a reply from HR, who wanted to talk very soon. After the phone screening they immediately set up an in person with the hiring manager, all involved clearly wanting the process to move with expediency. The interview was more like a conversation, which I enjoyed and from which I received encouraging feedback. I was bluntly (and seemingly honestly) told a specific time when I'd hear back and when that time came, nothing. I followed up inquiring about a revised timeline, and nothing. I understand that people are busy, but at the end of the day it's exceedingly rude to \"ghost\" when candidates are invested in the process and the organization. I think they do great work and those I spoke with were very pleasant, but I'd hesitate to get involved in any other capacity or spread the word about the organization given the trajectory of the interview process and how nobody could be bothered to simply follow up.", "Interview Questions": "Could you speak to your experience working with people"}, {"date": "18 Mar 2016", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hebrew Immigrant Aid Society (Silver Spring, MD) in Feb 2016", "Interview Descriptions": "Three interviews all by phone. The focus was on my technical understanding more than any thing else. All calls were lively and questions pointed. I was not expecting the third interview as it was not mentioned as a next step. I felt they were not exactly sure what they we looking for.", "Interview Questions": "All technical to the post"}]]