[[{"date": "10 Nov 2022", "title": "Social Worker (MSW) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Texas Health Huguley Hospital (Burleson, TX) in Sept 2022", "Interview Descriptions": "It took a couple of weeks for the recruiter to get back to me. The interview questions were easy, they discussed their EMR system, what their needs were, hours, etc. They discussed the salary for the PRN position. Not sure why I wasn't selected as I exceed their requirements. I notice the lack of diversity at the hospital, so I'm not sure if this was the reason why I was not selected, which I hope is not the case.", "Interview Questions": "Why are you looking to work here? What is your experience with their population? Asked about current job roles"}, {"date": "2 Apr 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Texas Health Huguley Hospital (Fort Worth, TX) in Apr 2021", "Interview Descriptions": "Job fair interview. Then two panel peer review. Was easy peasy! Everyone was really nice, and I'm looking forward to working there for a while! The interview process is very easy, and I encourage others to apply.", "Interview Questions": "Where did I see myself in 5 years?"}, {"date": "8 Oct 2020", "title": "Nurse Residency Program Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Texas Health Huguley Hospital (Burleson, TX) in Oct 2020", "Interview Descriptions": "Started with a phone screening call asking questions about your interest and expectations  then a interview with unit managers for the area you applied for  and then a final interview with the hiring team and managers.", "Interview Questions": "Why do you want to work for huguley"}, {"date": "10 Dec 2018", "title": "Anonymous Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Texas Health Huguley Hospital (Fort Worth, TX) in Oct 2018", "Interview Descriptions": "I had a phone screening scheduled and the person didn't show up. After almost 30 minutes of waiting, I emailed them to see what happened. Apparently they got caught up in a meeting or something which I understood because things happen. We rescheduled and all was well. Fast forward to the rescheduled interview and the person called me about 10 minutes late. You'd think they'd put more effort into being on time after missing the first call all together, but I guess not. They didn't even apologize for the tardiness. That should have been my first warning this wouldn't be the greatest experience. They asked me where I worked, what was my education, etc. Are you not looking at the resume I took the time to send in and also duplicate into your online form?  They reached the salary question and, shocker, they had a low salary range with no room for negotiation. Not sure why salary wasn't brought up first to avoid wasting anyone's time if you weren't on the same page. They talk about being a faith based organization, but I felt no sort of warmness or respect during the process. The lady seemed bored and was just reading off some script. They probably wanted to hire internally or through a referral so I likely had no real chance anyway. One thing mentioned during the application process was that they \"reward\" employees for referrals. Wouldn't waste time interviewing here unless you were referred by an internal employee.", "Interview Questions": "Where do you work?"}, {"date": "24 Sept 2018", "title": "Physical Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Texas Health Huguley Hospital (Burleson, TX)", "Interview Descriptions": "A brief phone interview preceded a formal onsite interview. The phone interview was to review job details and explain interview and on boarding process. On site interview was laid back and with physical therapy director and manager.", "Interview Questions": "Tell about a time you had a conflict with another employee? "}, {"date": "16 Mar 2017", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Texas Health Huguley Hospital (Fort Worth, TX) in Feb 2017", "Interview Descriptions": "Standard interview with question you'd expect to be asked. Interview process was not intimidating, pretty much looked like a dialog and took about 15 minutes. Since I did not have much experience with interviews I was offered feedback on how I did so i could improve myself with future interview.", "Interview Questions": "What is your dream job?"}, {"date": "9 Jul 2016", "title": "MSW Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Texas Health Huguley Hospital", "Interview Descriptions": "pretty easy, was asked a few questions by both managers and offered a job right afterwards. They are pretty desperate for employees so honestly as long as you have a decent background you can be hired.", "Interview Questions": "what is you're current schedule? what is you're availability?"}, {"date": "6 Apr 2016", "title": "Dietitian Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Texas Health Huguley Hospital (Burleson, TX) in Mar 2012", "Interview Descriptions": "I reached out to the director of Dietary by mailing a cover letter/resume directly. She called within a few days for an interview. After introducing herself, she passed me off to another manager who basically gave me a kitchen tour. Nobody seemed very interested, and sure enough I received a call the following week that they hired someone else. It seemed like she had already decided before I even showed up for the interview.", "Interview Questions": "What have you been doing since your last job?"}, {"date": "11 Jun 2016", "title": "Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Texas Health Huguley Hospital (Burleson, TX) in Jan 2012", "Interview Descriptions": "First I had to fill out a questionnaire. Then I nterviewed with the pharmacist in charge, then the pharmacy supervisor. Then I did the drug test.\r\nThe staff showed me around.", "Interview Questions": "Why do you want to work for Huguley?"}, {"date": "26 Feb 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Texas Health Huguley Hospital (Burleson, TX) in Nov 2009", "Interview Descriptions": "I was hired on the spot during my very first interview.", "Interview Questions": "N/A"}]]