[[{"date": "17 Mar 2022", "title": "Duty Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at USO", "Interview Descriptions": "Four step process. \r\nPreliminary interview with a recruiter. \r\nThen an interview with a regional staff member. \r\nProject based on your role. \r\nThen a final interview with direct supervisor and area director.", "Interview Questions": "Tell me a time when you failed and how did you overcome that? "}, {"date": "7 Jan 2022", "title": "Event Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at USO (Chicago, IL) in Jan 2022", "Interview Descriptions": "Had a phone interview that went well, I was booked for the next interview while on the phone with the recruiter. The second interview was a little different - 30 minutes to speak with the manager and director of the department. Interview went fine, no true hiccups, but the one thing that I felt was unusual was them asking for 3 solid references before this portion. I had to submit them prior to my interview, and I hustled to get the 3 and ended up with 4. Didn't really impress the team, which is what it is.", "Interview Questions": "Do you have any questions for us?"}, {"date": "2 Dec 2021", "title": "USO Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at USO", "Interview Descriptions": "lengthy took a while to call back for a interview. Interview was done over zoom. I waited 5 months from applying to a interview with the USO. By that time I was already in another position.", "Interview Questions": "Why do you want to work for the USO"}, {"date": "14 Jul 2021", "title": "Regional Development Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at USO", "Interview Descriptions": "Fairly easy and standard interview questions. Interviewers were accommodating even when I had technical problems during the interview.  \r\n\r\nQuick responses from HR throughout the whole interview process. Whole process (1 phone screen and 2 interviews) took about 2 1/2 weeks.", "Interview Questions": "Why do you want to work at the USO?"}, {"date": "3 Aug 2021", "title": "Center Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at USO (Naples) in Jun 2021", "Interview Descriptions": "I interviewed for a Center Manager position within a day's notice per the request of the person in charge of hiring. This was over a month ago and I have not heard back (not even a rejection). The interview was via Microsoft Teams and was a standard interview.", "Interview Questions": "How to handle teams of people, how I relate to the mission, etc. "}, {"date": "17 Aug 2022", "title": "Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at USO in Apr 2021", "Interview Descriptions": "Thorough, friendly, professional. Phones interview with HR then interview with prospective coworker. Then interview at the office with director. I was greeted with an offer of coffee or water. Interview was friendly but professional. I felt at ease.", "Interview Questions": "Previous finance experience in professional capacity?"}, {"date": "16 Feb 2021", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at USO", "Interview Descriptions": "Three  rounds of interviews. They all happened over the phone. All interviews were at least thirty minutes to an hour long each. Interviewed with at least three different staff members", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "9 Feb 2021", "title": "Volunteer Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at USO", "Interview Descriptions": "National Onboarding. Meeting locally with director for interview. It took only 1 week after the interview that I received an official job offer. I was able to pick my first day to start.", "Interview Questions": "Military experience, USO values and mission"}, {"date": "8 Feb 2021", "title": "Duty Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at USO", "Interview Descriptions": "Preliminary interview with a recruiter, then you go on to an interview with someone in your region, after that you get a project, and then you have a final interview with your soon to be center manager.", "Interview Questions": "Tell me a time when your had a conflict with a coworker or manager and how you addressed it? "}, {"date": "13 Mar 2021", "title": "Center Operations Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at USO (New York, NY) in Feb 2021", "Interview Descriptions": "Interview process was over a month.  Didn't receive an offer.  Its okay because they lied about the position and duties involved, specifically work hours.  They don't hire based on qualifications.", "Interview Questions": "Tell me something about yourself that is not on your resume."}], [{"date": "3 Feb 2021", "title": "Scout Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at USO", "Interview Descriptions": "They contact you via email to set up a phone call. HR then does a phone screening. HR will contact you if you've been selected to move forward and then a zoom call will be conducted with the hiring manager. After that there is the possibility of a third zoom meeting with a more senior leader in the company.", "Interview Questions": "Have you ever had to assist someone in finding resources they needed help locating? If so, explain a time when you had to do that. "}, {"date": "14 Mar 2020", "title": "Mobile Operations & Program Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at USO in Feb 2020", "Interview Descriptions": "Executed 4 interviews. First interview was with Sr. Regional HR manager. Second was conducted by the Director of Mobile Operations. Third was conducted by onsite team members. Fourth was a final interview conducted by the Director. Overall well executed and professionally ran interview process.", "Interview Questions": "Why did I select the USO and where did I see myself in the future with the organization. "}, {"date": "28 Feb 2020", "title": "Duty Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at USO in Nov 2019", "Interview Descriptions": "I applied to an overseas location and heard back within a few days from someone in HR. My initial conversation with this person was like a preliminary interview that lasted around 30 minutes and went well. Shortly thereafter I had an interview with someone based in the region I had applied to (via Skype) and this person was incredibly off-putting - told me I had the wrong phone number on my resume (maybe she had the wrong resume in front of her?) and implied that I lacked the basic understanding of the job when I was drawing from the job description that I had printed out right in front of me. I believe this one was around 30 minutes as well. I thought it had gone disastrously but reached out to the guy in HR who told me I had done well. A few weeks later I had another video interview for the specific position with the two people who I would be reporting to. I thought it went very well. I had to reach out to the guy in HR yet again (who was consistently helpful and kind throughout this process) only to be told that the offer was extended to someone else.", "Interview Questions": "What is your understanding of the job?"}, {"date": "17 Apr 2019", "title": "Operations Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at USO in Feb 2019", "Interview Descriptions": "It was phone interview. It was pretty easy and relaxed. The lady asked basic questions. \r\nThe interview lasted a long time, about an hour long. I thought this was a good sign. However, never received a call back or email.", "Interview Questions": "behavioral interview"}, {"date": "9 Aug 2022", "title": "Field Programs Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at USO (Quantico, VA) in Feb 2019", "Interview Descriptions": "Recruiter took the longest.  Once passed them its smooth sailing and quickly.  There was a total of 3 interviews, a screening with the recruiter, one with the manager and the last with the area manager. The whole process took 3 months.", "Interview Questions": "What was a time when something didn’t go your way at work, how did you move forward from it."}, {"date": "23 Jan 2019", "title": "Center Operations Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at USO in Jan 2019", "Interview Descriptions": "I applied online, and received an email from HR asking for a phone interview the next day, this was after a current employee emailed HR giving me a good reference. After HR interview was sent onto the Hiring Manager(s) where I did a video interview since I was long distance at the time. I was told it would be one person, ended up being two. Pretty informal, they seemed to have a different idea of what was said to me about them and the position with my initial HR interview. Interview went very short, only 35 minutes, they seemed very disengaged and wanted to end it. When I received the news that I did not receive the position, I asked for feedback and HR said they had none, thought I did great.", "Interview Questions": "Basic questions of why the USO? How do I plan on recognizing volunteers, or other responsibilities posted in the job posting."}, {"date": "30 Oct 2018", "title": "Entertainment Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at USO (Arlington, VA) in Sept 2018", "Interview Descriptions": "Was contacted a few days after I applied for a phone screen with the hiring manager.  I was very excited because it was a position where I was looking to head in my career by working in the industry of entertainment, but it also was great because I would be giving back to our service members. The phone screen went well, hiring manager was brash in one response stating I wouldn't be working just with \"music\" and I emphasized I knew that and was still interested anyways. I was then scheduled for an in-person interview with the entire department and sent the benefits package info. To me, that communicated that I was probably a top tier choice for the position to have me meeting VPs and the Director for just the second stage of the interview. I prepared for the interview by doing research on the USO history and operations within entertainment. I come from a generational military family and currently work with the military at my employer, so I knew to defiantly emphasize that during my interview.\r\n\r\nI had. a web interview for the first part because the SVP worked remotely. I then met with the rest of the team I would be presumably working with. It felt like a breeze! I wasn't asked any hard hitting questions, more just about myself and how I stay organized, etc. Since the hiring manager was out most of the process, I was told by the HR Assistant that I could hear back in a day or two when the hiring manager returned. I did my due diligence and sent all my thank you's post interview. A few days had passed and I still had not heard anything, so I emailed the hiring manager and got the generic rejection email.  Sadly, I did not receive an offer. I believe it had to do with my salary expectations, as I stated my range, and never received feedback from the hiring manager if that was reasonable to the USO being a non-profit and all. I think that was the most frustrating part looking back and probably gave me my answer all along (The hiring manager was also trying to pry in to my previous salary history during our phone screen, which isn't that illegal? I was not wanting to give her ammunition to use against me so I was very vague, but then the USO later made me input my salary history through their application system anyways) If my salary was more than they were willing to offer I wish they had not worked my hopes up and sent me the benefits package along with meeting the ENTIRE TEAM I would be supporting in the second stage. Just say sorry, that is not something we can work with, I would have understood. \r\n\r\nI rated this interview experience negatively mostly due to the hiring manager and how the entire process went, and not with the individuals I met in person for my interview.", "Interview Questions": "How do you stay up to date and connected with pop culture and music?"}, {"date": "11 Jul 2018", "title": "Pathfind Scout Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at USO in Jul 2018", "Interview Descriptions": "I had a phone interview on 7/11/18. Interviewer shot down almost every response I gave to her questions. Her negative attitude toward me could be heard over the phone by her demeaning tone. When I tried to provide myself an opportunity to SHINE, her response was usually \"That doesn't matter\". For example, when I tried to explain my educational goals and passion for learning.  Interviewer replied by saying, \"That doesn't matter, this job doesn't require a degree\". \"The job only requires you to provide resources and follow-up.\" I guess she was implying I'm over qualified by holding a Bachelors, while pursing a Masters? (I believe understanding educational processes is highly important in supporting transitioning military personnel who want to continue their education after military service)\r\nInterviewer was only interested in my last two jobs. I told her I'd like to add my experiences working on a military base. Interviewer replied, \"That doesn't matter\". I followed-up by explaining  it does matter because I have experience working with military families, the specific clients which USO serves! Her reply  was simply \"Hm, okay\". \r\nInterviewer  asked me how much money I'm looking to make.  After I replied, her response was\"You're not going to make that here, XZY at very the most\". \r\nI also tried to explain that both my parents are military vets, however she did not care that I have personal life experience with military resources and member services. USO claims they support military families and their mission to serve. However, based off this phone interview, I'm no longer interested in working for USO.\r\n\r\nClearly stated on the USO website for conducting interview \"Share personal experiences to illustrate your critical skills and achievements.\"\r\n\"Describe experiences and career/LIFE periods reflected in your resume.\"\r\n\"Focus on the positives of all your past experiences and remain optimistic.\"\r\n\r\nDespite her insults, I chose to take the high road and not hang-up on the Interviewer, I was very close to doing so. I've never been disrespected during an interview.  I tried to contact HR dept via phone and email, no response.\r\n\r\nUPDATE: I received a phone call from Interviewer's boss on 7/11/18. He only called because my husband contacted USO through their website.  My husband knew I was hurt and upset. Boss stated HR and company went to ball game today, the reason for no response.  I told him, I was very confused as to why Interviewer emailed on Monday 7/9/18 saying she was \"impressed\" with my resume and requested to speak with me only to tear me down during the phone interview.  In regards to her repeatedly saying “That doesn't matter\" throughout the interview, Boss asked me if she was being \"dismissive\" rather than “demeaning\". Regardless, No one should be told \"That doesn't matter\" in ANY context.  Candidates are given this opportunity to sell themselves. Whatever comes out of a candidates mouth MATTERS to them. Period!  ALL the Interviewer had to do was type out my responses and forwarded them, no need for her judgments. Boss asked me what should be done. I stated Interviewer  needs more training so this NEVER happens to anyone else. I never had an Interviewer make me feel so little. I was truly hurt by this experience.  I wish I never agreed to the phone interview with USO.  I made it clear to the Boss, my experience and passions DO matter.", "Interview Questions": "How did you hear about the position?"}, {"date": "24 Aug 2020", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at USO (Washington, DC) in Jul 2018", "Interview Descriptions": "This took over two and a half months from the first interview through the final offer.  There were various phone interviews followed by a few hours of panel interviews.", "Interview Questions": "Relation to the U.S. military "}], [{"date": "29 May 2018", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at USO", "Interview Descriptions": "Years ago the interview process at this particular USO location was a breeze. Actually enjoyable. Some basic questions were asked and in depth information about the USO was discussed. This has changed, and the interview process is now demeaning and seems pointless.", "Interview Questions": "Why do you want to volunteer here?"}, {"date": "12 Sept 2017", "title": "Corporate Development Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at USO (Arlington, VA)", "Interview Descriptions": "I was recruited to apply for this position via LinkedIn Messenger. I as asked by a USO recruiter if myself or anyone I knew would be interested in applying so I said that I was interested. We scheduled a phone screen for the following week which was a standard resume review, general overview of the position and information on the interview process, lasting about a half hour. On this call I was told that they were looking to hire pretty quickly because they had filled the position recently with a \"bad fit\" and needed to fill the position ASAP. After this I did not hear back from the recruiter regarding next steps for a month. After a month had passed I assumed they found another candidate but I received an email from the recruiter saying that the hiring manager had been out of town for the last month and asked if I was still interested. I hesitantly (because this seemed fishy to me) but still excitedly said yes. We then scheduled a phone interview with the hiring manager. Again, this was a pretty standard first interview followed with a request to set up an in person meeting to meet with 6 people including the HM. \r\n\r\nIn person I first met with the hiring manager for one hour, then a panel of four team members for an hour and then with the VP for one hour. Questions asked were very specific and difficult. From there I was asked back for the final portion of the interview the following week. This included a presentation and another question and answer panel with three employees including the HM and the VP again. I was asked to pitch a corporate sponsor who I would like to target with the panel acting as the company I was pitching. This included researching a company that I saw as a good fit and putting together a case study/presentation for the team. My total time spent on creating this pitch was about 12 hours.\r\n\r\nI left the interview feeling good even though again, the follow up questions  very specific and difficult. A couple days after the interview I followed up with the recruiter who sent me back a very generic email saying that the hiring manager decided to go with a different candidate. I was shocked and disappointed that after having spent three months, 7 interview hours and time on creating the case study, all I received was what seemed like an automated rejection email. My suggestion to the USO would be, if you have a candidate who you know is passionate and has taken the time to interview with you all the way through the final interview phase, that you take the time to have the hiring manager, or even the recruiter, call the candidate to let them know that they didn't get the position, thus giving them an opportunity to ask questions and learn how they can improve in the future.", "Interview Questions": "What are some companies that you would like to target and why?\r\nWhat will you accomplish in your first 90 days?\r\nWhy would you like to go into cause related marketing over individual giving?\r\nGive an example of a corporate sponsor you have recruited?\r\nHow do you recognize the USO?\r\nWhy did you chose to pitch a company that would give us an in-kind donation versus straight cash?\r\nWhy USO?\r\nDo you think we have good brand recognition?\r\n\r\n"}, {"date": "21 Mar 2017", "title": "Temporary Center Operations Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at USO (Arlington, VA) in Mar 2017", "Interview Descriptions": "I applied online through the USO website.  Hours later I received and email from their hiring manager.  We set up a date and time for a telephone interview.", "Interview Questions": "Q: Why do you want to work with our Organization?"}, {"date": "11 Nov 2016", "title": "Grants Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at USO", "Interview Descriptions": "After submitting a resume and cover letter, I was asked to complete and submit an online video interview responding to a set of questions, as opposed to a more typical phone screen. This is the only time that any employer has asked me for an initial video interview and I found it to be unusual and off-putting.", "Interview Questions": "They were standard questions that any grants professional should be prepared for, including different tools used to research prospects and the process used throughout the grant submission cycle. "}, {"date": "8 May 2016", "title": "Volunteer Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at USO", "Interview Descriptions": "The interview was with three current employees asking questions about myself and my hobbies. The questions they asked were geared towards how to deal with difficult situations. The interview process also discussed the hours for a new center that they were opening near by. However those hours were very inconvenient for me and I believe they picked up on that. Ultimately when I left the interview I knew it was not the right job for me.", "Interview Questions": "How to handle difficult customers?"}, {"date": "13 May 2017", "title": "Program Management Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at USO (Arlington, VA) in May 2016", "Interview Descriptions": "the interview process was rather quick for me but seemed organized. I had a phone interview with HR and then was brought in to meet with the director and program managers.  i was brought back one last time to meet the VP before getting an offer via phone from HR", "Interview Questions": "they asked about my connection to the military"}, {"date": "10 Apr 2016", "title": "Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at USO (Baltimore, MD)", "Interview Descriptions": "This interview was pretty standard. Just a phone interview. When asked why I was interested in a part time position, I explained that I was also going to graduate school. The interviewer didn't seem to like that because she said over and over that she didn't think that it would work with me also going to school. She at one point even tried to get me to agree to withdraw from school if I were offered the position. I finally said to her that I didn't think we needed to keep talking because I could tell that it wasn't going to be a good fit. I certainly wasn't going to quit grad school for a $13 an hour part time job. She called me back a few days later, but I still told her that I didn't think that it would be a good fit.", "Interview Questions": "What do you know about our organization?"}, {"date": "19 Jan 2017", "title": "Scout Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at USO in Feb 2016", "Interview Descriptions": "Submitted Resume and cover letter to Employment Program manager for review. If considered a formal interview was scheduled with candidate and employment manager and site supervisor. Last about 30-40mins. Asked behavioral question and knowledge of Veteran and Active Duty Military process. If you move forward, final interview with higher management. To me it seemed a formality. Answered additional questions and was ultimately given offer for review.", "Interview Questions": "What experiences do you bring to the table?"}, {"date": "23 Apr 2016", "title": "Scout Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at USO in Jan 2016", "Interview Descriptions": "I applied via indeed, received a call from the corporate recruiter, interview 2 weeks later. Second interview verbally offered the position during the second interview. I believe this is going to be a very rewarding work environment.", "Interview Questions": "Name a time in the last 6 months where you wish you could get a redo or a moment you are not so proud of."}, {"date": "26 May 2016", "title": "Center Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 8 weeks. I interviewed at USO in Jan 2016", "Interview Descriptions": "Very thorough process! Over a 2 month period I talked with people in various departments at the Headquarters. I also toured the local area and spoke with staff and volunteers. Everyone was thorough, friendly and passionate.", "Interview Questions": "Why do you want to work with the USO? What draws you to our mission?"}], [{"date": "26 Jun 2017", "title": "Deployed Duty Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at USO (Washington, DC) in Jan 2016", "Interview Descriptions": "The interviewer was very friendly but didn't ask any questions about me or my work history/qualifications. He mostly spoke about the USO mission and the details of the job. The interview was over the phone and lasted about 30 minutes. Although I really wanted to take the job I was very surprised/insulted when the offered me 25,000 less than what I am currently making.", "Interview Questions": "Why do you want to work for the USO?"}, {"date": "26 Feb 2015", "title": "Grant Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at USO (Arlington, VA) in Dec 2014", "Interview Descriptions": "After completing the application, I was called by HR to schedule an in-person interview. Before the interview, I had to complete a pre-recorded video interview. The video interview asked standard HR questions (strengths/weaknesses, etc.) and was pretty awkward, but nothing terrible. For the in-person interview, I met with an HR Recruiter and the supervisor for the position. After the interview, I was called about two days later to schedule a second round of interviews. In this second round, I met with three different people, each of whom the position works closely with. The questions were all pretty basic interview questions. By the end of the process, I had met with 5 different people in the organization, which was great, as it gave me a well-rounded perspective of things. I had a positive view of the organization coming out of the interview experience.", "Interview Questions": "The questions were mostly about my experience. They had a lot of questions about grant research and my writing process. "}, {"date": "16 Oct 2017", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at USO (Tokyo) in Nov 2014", "Interview Descriptions": "The interview process was a pleasure. Very professional they discussed their expectations and how often you will be able to volunteer with all their many opportunities. The staff went over the daily tasks of being a volunteer at the USO.", "Interview Questions": "Have you ever volunteered before."}, {"date": "25 Nov 2014", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at USO (Arlington, VA) in Nov 2014", "Interview Descriptions": "Standard process. Submit resume, writing sample. Telephone interview by head of Human Resources with the standard questions, then, if selected, a team face to face interview. the team consisted of a Vice President, the COO and the Human Resources person that conducted a phone interview. Each asked one question, then moved to the next person. The COO did ask more questions.", "Interview Questions": "The questions were standard for any company. They did ask for clarification on a entry on my resume."}, {"date": "27 Dec 2015", "title": "Volunteer Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at USO (Okinawa) in Mar 2014", "Interview Descriptions": "Very awkward interview environment, the Area Dirctor was out of the office so the interview was recorded for her. Strange questions about my military service with very little focus on the job requirements .", "Interview Questions": "They asked for an example of conflict resolution from my service in the military (which was more than 5 years prior, I had years of other experience to draw from)"}, {"date": "26 Jul 2013", "title": "Programs Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at USO", "Interview Descriptions": "Quickly shuffled through the process once my application was submitted.  Initial interview/screening with HQ HR personnel then in-person interview with field Director.  Lots of great questions, both functional and ideological to get a sense of the \"why\" I wanted the job rather than, \"can you do this job?\" and \"can I spend 40 hrs/week with you\"?  After the interview I received a call within 24 hours to be offered the job.", "Interview Questions": "Why should I hire you?"}, {"date": "17 Aug 2013", "title": "Programs Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at USO (Arlington, VA) in Apr 2013", "Interview Descriptions": "Very thorough.  Pleasant.  More about me than the details of my resume.", "Interview Questions": "N/A"}, {"date": "5 Sept 2016", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at USO (Arlington, VA) in Feb 2013", "Interview Descriptions": "The first interview was on the phone with someone from HR, took abut 30-45 minutes.  The second interview was a panel interview with hiring manager and 2 others from the department.  Final interview was with department VP and hiring manager.", "Interview Questions": "the basics- difficult work situation, yada, yada, "}, {"date": "25 Dec 2015", "title": "Duty Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "The process took 2+ months. I interviewed at USO (Arlington, VA) in Oct 2011", "Interview Descriptions": "The process to get hired took many weeks and consisted of several phone interviews. In some cases, they flew applicants to Arlington VA for face to face interviews. They also made us take an online aptitude test where the math parts got a little too difficult for my own comfort level. Once hired, they provided all of the new employees with a week of orientation in Arlington right outside Washington DC. It was incredibly fun for all of us.", "Interview Questions": "Tell us about your previous volunteer experience."}, {"date": "19 Jun 2013", "title": "Duty Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at USO (Kuwait) in May 2011", "Interview Descriptions": "Initial interview with HR Assistant, then interview with Hiring Manager, interview with Center Manager at station location, Final in-person interview with Hiring Manager in Arlington, VA.", "Interview Questions": "What programs would you propose for our Center to put on?"}], [{"date": "25 Jul 2010", "title": "Center Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at USO (Alexandria, VA) in Jun 2009", "Interview Descriptions": "a few inexperienced people asking basic questions then very senior people asking conversational questions while they size you up.", "Interview Questions": "why do you want this job?"}]]