[[{"date": "20 Aug 2022", "title": "IT Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Central Oklahoma", "Interview Descriptions": "Mostly it was general tech questions and questions related to networking, audio/video, scripting, and Powershell.  For preparation please prepare all the base level questions and prepare a troubleshooting method and that is all!", "Interview Questions": "N/A"}, {"date": "6 Oct 2022", "title": "Summer Student Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Central Oklahoma (Edmond, OK) in Apr 2022", "Interview Descriptions": "My interview was very simple and took about twenty minutes. They tried not to put too much pressure on me. Tip: they were very impressed that I had questions prepared.", "Interview Questions": "Do you have any questions for us?"}, {"date": "4 Feb 2021", "title": "Benefits Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Central Oklahoma (Edmond, OK) in Jan 2020", "Interview Descriptions": "The interview process was simple. It was a face-to-face interview with the Director and Recruitment Specialist. They asked about my experience and how I could be a good fit for this role. Later the interview was followed by Excel Assessment.", "Interview Questions": "What do you know about benefits?\n"}, {"date": "23 Oct 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Central Oklahoma", "Interview Descriptions": "It was easy and they asked about my future plans in the technical career. How you tackle the situation in an adverse environment.  My project was about Survey Dataset where we had so much to do in Data Mining so the interviewer asked about how to create an intuition about that data which you  have?", "Interview Questions": "About yourself"}, {"date": "10 Sept 2020", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Central Oklahoma (Edmond, OK) in Jul 2019", "Interview Descriptions": "Required to prepare a presentation for department on new program.  Required a large amount of research and making assumptions on information that was not shared due to protecting a program not yet launched.  It was the strangest interview I have ever participated in.  The interviewers were as forthcoming as possible, thorough and very personable.  However, there was no feedback on my presentation or proposals and not even a phone call.  Just a standard rejection letter some time later.  That was very disappointing.  It felt like too much work for zero feedback.", "Interview Questions": "How I might interact with the needs of students in light of the needs of the department."}, {"date": "25 Mar 2023", "title": "Communications Adjunct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Central Oklahoma in Feb 2019", "Interview Descriptions": "I easily made contact with the chair of the dept via email. Sent her my resume and then she called to schedule an initial phone interview and then an in -person interview.", "Interview Questions": "Why do you want to teach?"}, {"date": "15 Aug 2020", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of Central Oklahoma (Edmond, OK) in Feb 2018", "Interview Descriptions": "Multiple round interview. It was nice but very traditional in the type of interview.  I got to meet everyone in the office so I think it's a good sign if they start to show you around to others in the office that you are going to get the job!", "Interview Questions": "Q: What is your greatest weakness"}, {"date": "4 Sept 2019", "title": "MIS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Central Oklahoma (Oklahoma City, OK) in Jan 2018", "Interview Descriptions": "A first interview is typically the first step in the hiring process. Also known as a first-round interview, a first interview is a way for the employer to find only the most qualified applicants for the job. Many first interviews are far less thorough than second or third interviews.", "Interview Questions": "Tell me about yourself?"}, {"date": "4 Dec 2017", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Central Oklahoma", "Interview Descriptions": "Interview process was nothing out of the ordinary. I was already working on campus, which was a plus. Review committee was friendly and answered all questions I had without hesitation.", "Interview Questions": "There really weren't any questions I felt were difficult to answer."}, {"date": "25 Jul 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Central Oklahoma (Edmond, OK) in Aug 2017", "Interview Descriptions": "quick and simple, not too much was asked. I already knew the people who were interviewing me.  They were very fair in there selection however.  I appreciate the professionalism that was displayed from the university.  There were very helpful as well later on when I needed help in order to do something.", "Interview Questions": "How is your global competency?"}], [{"date": "10 Mar 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Central Oklahoma (Edmond, OK)", "Interview Descriptions": "It was an efficient process. Standard higher education application form filled out online. You select the job posting and apply with your standing application form. The interview went well. I shared my expertise in the field", "Interview Questions": "Why did you apply for this positions?"}, {"date": "15 Jan 2018", "title": "Program Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Central Oklahoma (Oklahoma City, OK) in Jan 2017", "Interview Descriptions": "I submitted my resume online; had to take an online personality and IQ test; was selected for an interview;  asked a list of standard questions with Ex. Dir. and another University representative.", "Interview Questions": "Explain your understanding of how a board of directors operates and your relationship and role as staff."}, {"date": "13 Jul 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Central Oklahoma (Edmond, OK)", "Interview Descriptions": "I applied online. The online form provides a place to upload required documents -- resume, references, transcript, and cover letter. I applied roughly three weeks before I got a call back.  Interview was a panel of three people who asked a standard series of questions and answers about the job, availability, expectations, and salary. It lasted roughly 30 minutes. One week later, I got a call about the job.", "Interview Questions": "Why do you want this job?"}, {"date": "29 Feb 2016", "title": "Human Resources Generalist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Central Oklahoma in Aug 2015", "Interview Descriptions": "Long wait between job closing and call for interview. \r\nCompleted BERKE shortly after applying but prior to any request to interview. \r\nTwo rounds. Both rounds were panel style. First round focused on drilling down for the skills required for the job description. Second round focused on situations (STAR) and decision making.", "Interview Questions": "How would you advise a supervisor who is managing an employee with high absenteeism and tardiness?"}, {"date": "18 Nov 2016", "title": "Computer Science Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Central Oklahoma (Edmond, OK) in Mar 2015", "Interview Descriptions": "Interview was very professional. They asked specifically about concept knowledge and also about specific technical knowledge. No coding part of interview. Made job hours clear although at the time responsibilities were not very clear. Though this position is specifically created to familiarize students with development it became obvious in the interview that they do not work closely with the computer science department about curriculum or relevant technology.", "Interview Questions": "Are you familiar with the Banner system."}, {"date": "13 Sept 2016", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Central Oklahoma (Edmond, OK) in Jan 2015", "Interview Descriptions": "They would ask customer service based questions and how well do I handle specific situations dealing with people and the public. While it was engaging, there were some hard hitting questions that had me impressed to see if I can handle extreme situations...If it would have to come down to it.", "Interview Questions": "What was the last book that you last read?"}, {"date": "18 Jun 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Central Oklahoma (Edmond, OK) in Sept 2014", "Interview Descriptions": "The interview was very relaxed, but still formal. It was one of the most pleasant interviews I've had to date. The interviewers seemed genuinely interested in my thoughts on related subjects instead of just throwing question after question at me. It was more of a conversation than an interview, which I felt helped them learn more about me and why I would be good for the position rather than them learning how well I can answer questions.", "Interview Questions": "What makes you qualified for this position?"}, {"date": "18 Feb 2014", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Central Oklahoma", "Interview Descriptions": "apply online, get contacted by director of the center. go through an interview process just answering questions about yourself. your backlground and discussion of what your experience is. how you can benefit the community and idiscussion of if you are able to tutor students in lower level courses", "Interview Questions": "there wasnt any difficult question. "}, {"date": "29 Oct 2013", "title": "Student Activities Coordinator Student Counseling Center Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Central Oklahoma (Edmond, OK) in Aug 2013", "Interview Descriptions": "Pretty basic, slightly unorganized. I was called several weeks after applying, they asked me to come and interview the next day. I went in and was asked the basic questions about why I wanted the job, why they should hire me, etc.", "Interview Questions": "I was asked how I dealt with a disagreement with a superior and with someone close to me. "}, {"date": "15 Jan 2014", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Central Oklahoma (Edmond, OK) in May 2013", "Interview Descriptions": "I was on a group interview with a panel and they asked me 10 questions. There were 3 of them and each asked me one question and then another asked me a question in order. Then I got a phone call to speak to a Vice President one-on-one but they were not trying to prevent me from getting the job. They seemed to want to get to know me as a person.", "Interview Questions": "They were all questions I had heard on other interviews while applying for the same job. I recommend going on other interviews for the position you are applying in other companies before you do one for UCO. Mine was simple and straight-forward, but that will SURELY vary on the position you are applying. All of the questions were fair, somewhat easy, and useful for them to pick the proper candidate. "}], [{"date": "12 Jun 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Central Oklahoma (Edmond, OK) in Aug 2012", "Interview Descriptions": "I interviewed with a group of people (panel)  I would be working for.  The interview was quite in depth for the position I was interviewing for. I was quite surprised, considering I was only applying for an administrative assistant positon. However, as I've come to understand, the reason for that is we all work together on so many things. It was important for this to be a unanimous decision.", "Interview Questions": "What experience/knowledge did I have of databases? I wasn't sure what angle they might be coming from. That is a wide open question. How would I deal with an angry student?"}, {"date": "22 May 2014", "title": "Research Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Central Oklahoma in Apr 2012", "Interview Descriptions": "one 15 minute interview; very easy; very few questions; the process leading to an interview did not take long; had to wait on new employee training which held up the process to starting the job", "Interview Questions": "N/A"}, {"date": "20 Feb 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Central Oklahoma (Edmond, OK) in Mar 2011", "Interview Descriptions": "The interview process is easy and all the people working for the university are kind and friendly.", "Interview Questions": "N/A"}, {"date": "10 Feb 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Central Oklahoma in Aug 2010", "Interview Descriptions": "Phone interview then in-person interview.", "Interview Questions": "What does your prioritization process look like?"}]]