[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great experience!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Apr 2018", "job_title": "Intern in London, England", "duration": "N/A", "pros": "Working for a great company and learning a great deal.", "cons": "No support after your one year internship."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Student and intern", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Jun 2015", "job_title": "Communications Intern in London, England", "duration": "N/A", "pros": "While many people in the program are recent graduates or a few years out of school; you can join the program at any age at the start of your career (people in my intake ranged from 21- 30 years old)\r\n\r\nI could go blue in the face talking about the benefits of the program: traveling, living in London (international city, one of the best for businesses), working at an international (corporate) organization, the connections you'll get, the classes you'll take… The experience is really unrivaled to other programs. Everyone I know that is a MB graduate would HIGHLY recommend it and have no regrets about their decision to go.\r\n\r\nAdvice: When considering the program, the value shouldn't be about how much you'd be paid monthly or the cost of the program because it's an investment into yourself and the value you'll be after you have this experience. Life is about taking risks, and this is one you definitely want to take (actually I don’t know if I’d consider it a risk considering I am SO happy with my decision to go and would consider it the best year of my life so far)", "cons": "Since you don’t get paid much (granted you also don’t have to pay for housing- which would be a lot based on the excellent location we had) – you will probably find your income the most frustrating thing about the program. Luckily, everyone else is also in the same boat, and everyone makes it work in their own way. \r\n\r\nEveryone has their own vices and willingness to give things up (i.e. I brought one suitcase compared to 2; I barely bought new clothes, etc)... You just need to go into it knowing you won’t be making the average salary but the experience is worth EVERY penny (and every penny you don’t make!).\r\n\r\nI travelled to 12 countries while I was there, so giving up the coffee before work or eating ramen for a month was SO worth it for each trip \r\n\r\nYour teams are also extremely understanding of your situation (want to travel/also broke during HH)\r\n\r\nThe only other thing that some people found challenging was living with roommates from other countries (you get to pick your roommates halfway through the program). I was usually never home (working, classes, travelling, etc) so I didn’t find this as challenging as others."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Reward Specialist in Investment Bank", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Feb 2017", "job_title": "International Projects Director in Blackpool, England", "duration": "N/A", "pros": "It is a very good opportunity for me to change my career from Social Science background to business background. The one year internship experience gave me a brand-new insight of what i want to achieve in my life. Staff from Mountbatten are very helpful and try to take the best care of us in regarding to study and leisure life.", "cons": "A higher level working experience will be preferred wanted. The internship position is more suitable for fresh graduates. People who have already had some experience in their earlier career would feel a bit undervalued in working environment."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "A hectic but rewarding experience", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Mar 2016", "job_title": "Associate in London, England", "duration": "N/A", "pros": "Amazing life experience, meet incredible new people. Interesting Masters degree with good tangible outcomes for discussing in job interviews.", "cons": "Administration - they need to get there organization skills better. They will constantly CC you into the wrong emails, send documents in error etc. \r\nBe ultra specific about what you want when it comes to the interview stage. \r\nThe PGC should be abandoned. \r\nYou need some savings before you come on the program or you are going to have a very stressful year indeed."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "An unforgettable experience!", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "21 Sept 2017", "job_title": "Consultant in London, England", "duration": "N/A", "pros": "-Working in NYC\r\n-Access to a huge pool of alumni\r\n-Excellent management under Richard Sexton\r\n-Access to a wide range of extra curricular activities such as sports games, theatre trips and industry events\r\n-You meet like-minded people", "cons": "-Some of the admin issues could be ironed out as this would make things run a bit smoother - i.e. getting results back from academic assessments"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Awesome Opportunity", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "13 Jun 2018", "job_title": "Business Analyst in London, England", "duration": "N/A", "pros": "Good opportunity to work in London in the financial industry\r\nWell structured classes (I completed the MA programme)", "cons": "Need to have a little bit saved to enjoy the year (traveling, activities in London, etc.)\r\nLots of work to balance full time job with the MA, but worth it"}], [], [], []]