[[{"date": "7 Jul 2022", "title": "RBT - Registered Behavior Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at LittleStar ABA Therapy", "Interview Descriptions": "I had the pleasure of meeting and being interviewed by Mark Hammer. He was very kind, professional and knowledgeable. Mark made the interview process feel a lot less stressful and offered many opportunities for questions. Based on my interview with Mark and the way he promoted Little Star has made me want to pursue this career opportunity further.", "Interview Questions": "Give an example of a time your patience was tested. "}, {"date": "23 May 2022", "title": "DBT Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at LittleStar ABA Therapy (Bloomington, IN) in Mar 2022", "Interview Descriptions": "After connecting with them on their direct website, I sent a personal statement and resume, then we set up a time for a remote call. It went well, but they did not email me concerning the position for over a month and after I emailed them 3 times.", "Interview Questions": "What's your experience with children who have autism?"}, {"date": "6 Feb 2022", "title": "Autism Therapy Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at LittleStar ABA Therapy in Nov 2021", "Interview Descriptions": "The interview process was quick and easy. The interviewer was easy to talk to and made it very stress free.  Felt very much like a casual conversation to get to know someone's personality, goals, and talents better.", "Interview Questions": "What is a quality you desire in a job or employer?"}, {"date": "2 Jun 2021", "title": "RBT Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at LittleStar ABA Therapy (Stratford, NJ) in May 2021", "Interview Descriptions": "asked questions wanted questions asked about company and job wrote every single thing down that was said on a form, then they showed you around and that's basically all that happened.", "Interview Questions": "Do you have any experience with kids with autism?"}, {"date": "17 Nov 2020", "title": "Direct Support Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at LittleStar ABA Therapy", "Interview Descriptions": "started with a phone interview then it was a skype interview.  It was very lowkey and all of the questions seemed like they were being read off a list. They basically just want to know why you want this job, what your connection to autism is, and how you think this job will help your future career goals", "Interview Questions": "What is your connection to autism"}, {"date": "29 Apr 2021", "title": "RBT - Registered Behavior Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at LittleStar ABA Therapy (Carmel, IN) in Jul 2020", "Interview Descriptions": "This was a simple series of phone interviews due to COVID. They were very helpful when I asked questions and Manded for information! They made it professional still while being over the phone and not in person!", "Interview Questions": "How do you go about a difficult situation with a client? "}, {"date": "8 May 2018", "title": "Registered Behavior Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at LittleStar ABA Therapy (Evansville, IN) in May 2018", "Interview Descriptions": "I have only gone through the phone interview process, which took about 20 minutes. It was with the administrative assistant just to answer qualifying questions. Super low key and no pressure.", "Interview Questions": "How would you respond to a behavior?"}, {"date": "4 Jan 2019", "title": "Registered Behavior Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at LittleStar ABA Therapy (Clarksville, IN) in May 2018", "Interview Descriptions": "It was very laidback and lasted only about 20 minutes. They had me watch a series of videos before I came in and gave me a list of questions about the videos to have answers prepared for the interview.", "Interview Questions": "They ask if you have had any experience working with people that have learning disabilities. "}, {"date": "20 Sept 2018", "title": "RBT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at LittleStar ABA Therapy (Carmel, IN) in Feb 2018", "Interview Descriptions": "I was impressed with the promptness of the interview. Once I applied, I heard within 2-3 business days and had the interview quickly after.  I felt that the interviewer was kind and was interested in knowing my skills.", "Interview Questions": "Describe a discrete trial"}, {"date": "11 Apr 2019", "title": "RBT Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at LittleStar ABA Therapy (Carmel, IN) in Feb 2018", "Interview Descriptions": "Phone interview, then in person interview \r\nLengthy, 60-90 mins \r\nResponses took a long time \r\nInstructed to watch videos about ABA (on your own time)  and answer questions during the interview", "Interview Questions": "Experience questions \r\nPersonal questions\r\nWhy you want to do ABA "}], [{"date": "16 Oct 2017", "title": "Waiver Services Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at LittleStar ABA Therapy in Oct 2017", "Interview Descriptions": "After reading my resume they thought I'd be more qualified for the ABA Therapist position. I obviously knew that but wanted a change of direction. The interview was on the phone, pretty simple only lasted 20 minutes.", "Interview Questions": "How would you handle behavioral issues?"}, {"date": "8 May 2019", "title": "PMa Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at LittleStar ABA Therapy (Lafayette, IN) in Apr 2016", "Interview Descriptions": "Absolutely wonderful and I felt at ease. Was not overwhelmed or nervous. The Clinical Director made it very comfortable. I would do the process all over again if I had to!", "Interview Questions": "What is a weakness at the workplace?"}, {"date": "24 Oct 2017", "title": "Behavior Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 days. I interviewed at LittleStar ABA Therapy (Carmel, IN) in Mar 2016", "Interview Descriptions": "The interviewing process can be a little intimidating to people who have never done ABA before, like myself. BUT our hiring person is amazing and does such a good job of making sure you feel comfortable. You will go through a \"mock\" therapy session where she will teach you how to do ABA. My interview lasted about an hour!", "Interview Questions": "Tell me about a situation when you have been put on your toes?"}, {"date": "11 May 2016", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at LittleStar ABA Therapy (Carmel, IN) in Aug 2014", "Interview Descriptions": "They had me answer questions about my resume and general questions about my strengths and weaknesses. They then taught me some ABA principals, then demonstrated some discrete trial instructions. They then went through a process where they would show me how to conduct a discrete trial, followed by having me implement the same one. \r\nPrior to the interview they sent me a video and some information to look over. They asked me questions about that in the interview as well.", "Interview Questions": "What are three strengths and three weaknesses that you possess?"}]]