[[{"date": "22 Jun 2023", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Roper St. Francis Healthcare (Charleston, SC)", "Interview Descriptions": "Manager asked scripted questions- what were my strengths, what where my weaknesses, my plans after nursing school, etc. Discussed position/role of nurse extern and reviewed skills within my scope. Gave tour of the unit.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "31 Jan 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Roper St. Francis Healthcare", "Interview Descriptions": "It was a very positive interview process. They seem to really care about me as an individual and were invested in seeing me exceed as a nurse grad. I felt very comfortable during the process", "Interview Questions": "what is something you want us to know about you"}, {"date": "13 Apr 2023", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Roper St. Francis Healthcare (Charleston, SC) in Feb 2023", "Interview Descriptions": "Very Long Process you want a job call your recruiter daily hourly if need be Companies are aware that since the pandemic they must do more to keep employees do not accept offers that you are not willing to work for on a daily basis", "Interview Questions": "Basic Questions Are you willing to pick up the slack"}, {"date": "11 Jan 2022", "title": "Senior Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Roper St. Francis Healthcare", "Interview Descriptions": "First call is with HR. They tended to ask questions that were more geared towards patient care, but I just adjusted them to be more for an accounting role. \r\nSecond call was with Hiring Manager. Went well, really enjoyed what they had said the job would pertain.\r\nThird interview was a peer zoom interview with 3 other employees. Went well, asked how they liked their job, and if it would be a good fit. \r\nThese were virtual due to COVID.", "Interview Questions": "Pretty standard questions. How do you work on a team, how do you work individually."}, {"date": "27 Sept 2021", "title": "ED Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Roper St. Francis Healthcare in Sept 2021", "Interview Descriptions": "One on one interview with unit manager. Very relaxed and personable. They inform you a little about what their specific unit deals with and what to expect and then focus on getting to know you and your 'why'.", "Interview Questions": "Several questions based on past encounters that would make you a good fit for the position "}, {"date": "30 Oct 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Roper St. Francis Healthcare (Charleston, SC) in Sept 2021", "Interview Descriptions": "Peer to peer review,  laid back, comfortable, family friendly. First you get a call have a phone interview then you will get a call to meet manager and team and have a interview with them", "Interview Questions": "Tell me what a time you had to think fast "}, {"date": "10 Jan 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Roper St. Francis Healthcare (Charleston, SC) in Aug 2021", "Interview Descriptions": "HR Phone call, Behavior Based Questions with manager, Behavior based questions with peer. Week long process depending on needs of the unit. I would say their Magnet Hospital is a harder interview process.", "Interview Questions": "Describe a situation that you handled conflict."}, {"date": "10 May 2021", "title": "Physical Therapy Aide Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Roper St. Francis Healthcare", "Interview Descriptions": "Great, very family oriented! Round table discussion with a lot of situation based questions. Very stress free environment with allotted time to answer all questions. Felt very at ease and that the team was very supportive regardless of my answers.", "Interview Questions": "Name a situation where you had to perform in an emergency. "}, {"date": "10 Jan 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Roper St. Francis Healthcare", "Interview Descriptions": "I thought the interviewers were professional and polite. They focused on behavioral questions. I was given an opportunity to speak with higher level admin as well as current employees to inquire about day to day job responsibilities and overall job satisfaction.", "Interview Questions": "Name a time you had a conflict with a co-worker? How did you resolve, what was the outcome?"}, {"date": "7 Dec 2020", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Roper St. Francis Healthcare", "Interview Descriptions": "This is a three step process. You interview with HR, then your manager/boss, and then you will go through a peer interview. After this they will either call to make an offer or not. But it goes pretty quickly.", "Interview Questions": "Name a time you were in a difficult situation with a coworker and how you handled it.  "}], [{"date": "25 Jun 2021", "title": "Practice Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Roper St. Francis Healthcare in Nov 2020", "Interview Descriptions": "Spoke with recruiter, manager, and office manager. Very responsive and organized and answered questions pertaining to the role. Good experience although I did not receive an offer for the role.", "Interview Questions": "Experience with difficult management situations and different personalities, about experience with insurance and billing"}, {"date": "25 Feb 2020", "title": "Call Center Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Roper St. Francis Healthcare (North Charleston, SC) in Feb 2020", "Interview Descriptions": "Be patient it is a process.  It moves fast once the interview process starts. I applied for the job on January 1st. My phone interview was on the third of February.", "Interview Questions": "Tell me about a time when you did not get a long with a coworker"}, {"date": "26 Jan 2020", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Roper St. Francis Healthcare", "Interview Descriptions": "The interview as casual and conversational. I first spoke with a hiring manager in HR and scheduled an in-person interview shortly after. The hiring manager was knowledgable about my general questions.  I was able to meet a few staff member after the interview.", "Interview Questions": "There were standard interview questions thatI have had at every hospital position I have worked for.\r\nTell about a difficult experience and how you handled it.\r\nGive an example of how you went above and beyond for a patient/co-worker etc. "}, {"date": "5 Jul 2019", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Roper St. Francis Healthcare", "Interview Descriptions": "I applied on their website. They were quick to respond to my application. Went through three stages. The recruiter, hiring manager, and then in person interview. Everyone was welcoming and I felt comfortable.", "Interview Questions": "Mostly behavioral questions were asked.\r\nOne question was geared toward ensuring good customer service.\r\nAnother question asked about handling a difficult situation."}, {"date": "13 Jun 2019", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Roper St. Francis Healthcare (Charleston, SC)", "Interview Descriptions": "1. HR. phone interview. 2 Behavioral based questions asked.  2. Interview with clinical manager. 2 behavioral based questions asked. 2 straight answer questions one being what are your short term and long term goals. 3 Peer Interview with 4-8 behavior based questions asked. Answer using STAR method.", "Interview Questions": "Tell me about a time when you had a disagreement with a coworker?"}, {"date": "3 Jun 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Roper St. Francis Healthcare", "Interview Descriptions": "I interviewed with recruiter first, then unit manager, then the peer team. Both the manager and peer team asked several behavioral questions. The process length varies by unit and manager.", "Interview Questions": "Name a time where you were unhappy with your job performance and what did you do about it? "}, {"date": "22 Jul 2019", "title": "Practice Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Roper St. Francis Healthcare (Charleston, SC) in Apr 2019", "Interview Descriptions": "Started very well, first interview was great met with Director, second interview also great, third interview with peers was a bit odd.   I felt as though I wasn't being judged on my skills but rather on how I would fit with other managers", "Interview Questions": "An example of a difficult patient encounter "}, {"date": "18 Jul 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Roper St. Francis Healthcare (Charleston, SC) in Aug 2018", "Interview Descriptions": "I found the interview process to be lengthy.  The number of steps that a candidate has to complete to get an offer is too long.  I believe the process could be shortened considerably.", "Interview Questions": "To describe a situation where I had to adjust my plan of care."}, {"date": "15 Jan 2020", "title": "ICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Roper St. Francis Healthcare (Charleston, SC) in Jul 2018", "Interview Descriptions": "There is a peer interview and an interview with the manager after you have been through the HR phone interview. There are so many steps so they know you are a good fit for them. It is not bad at all and usually a pretty fast process depending on the need of the unit.", "Interview Questions": "What is an example of conflict with a peer at work and how did you handle the situation?"}, {"date": "31 Jul 2018", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Roper St. Francis Healthcare (Charleston, SC) in Jul 2018", "Interview Descriptions": "phone interview, quick and easy. Asked about why I wanted to work there and why I wanted to work in health care. Asked questions about my previous work history and how far along I am in nursing school. Very friendly interviewer.", "Interview Questions": "Describe a time when I had an upset or any customer or patient and how did I handle it?"}], [{"date": "24 Apr 2018", "title": "Emergency Department Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Roper St. Francis Healthcare (Charleston, SC) in Apr 2018", "Interview Descriptions": "Recruiter was very helpful and informative in the process. Multiple phase interview and everyone was willing to do phone interviews to accommodate my inability to meet face to face.", "Interview Questions": "Describe a situation where you and a co-worker had a difference in opinion on how a task should be accomplished and how did you handle the situation?"}, {"date": "10 Jun 2020", "title": "PTA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Roper St. Francis Healthcare (Charleston, SC) in Feb 2018", "Interview Descriptions": "Group peer interviews. One on one interview with your supervisor. Job duties discussed. Hiring process went very smooth after my peer interview. Very professional during this process. Would recommend to anyone.", "Interview Questions": "Working conditions. Only feet 8+ house a day. Must have a passion for helping people."}, {"date": "21 Dec 2017", "title": "Staff RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Roper St. Francis Healthcare (Charleston, SC)", "Interview Descriptions": "Three interviews: 1- HR, 2- Unit Manager, 3- Peers. I had a wonderful experience speaking with HR and the unit and clinical manager. They were fun, warm, professional, up beat, respectful, just all around great. I felt very confident going into the peer interview. The peer interview was the opposite. While not out right rude, the nurses I met with with cold. No one smiled at me, they barely made eye contact, there was no \"small talk\" at all. There were behavioral based questions asked, they would then write down their response to my answers, and moved on to the next. It was a very awkward 20 minutes. Once the last question was asked, one nurse just abruptly left the room to get their manager to lead me out. I kicked myself for weeks thinking I did something majorly wrong, but then heard that another woman I know also applied to the position and had almost the exact same experience with the peer interview that I did.", "Interview Questions": "Describe the biggest challenge you have had to overcome in your life?  Describe a time you had a disagreement with a co-worker and how did you handle it? Etc."}, {"date": "13 Dec 2017", "title": "Receptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Roper St. Francis Healthcare", "Interview Descriptions": "Very on organized it was scheduled at one place and had to go to another for the interview with said that I would get a call back within a week and never received a call or email didn’t find out application status until I logged into the website", "Interview Questions": "Experience at another job "}, {"date": "28 Jun 2018", "title": "Home Health RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Roper St. Francis Healthcare in Aug 2017", "Interview Descriptions": "Both were fairly simple processes; hiring is done from the office and then HR processes your application and contacts you for a phone interview after a formal interview is complete", "Interview Questions": "Behavioral based questions are asked"}, {"date": "3 Jun 2017", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Roper St. Francis Healthcare (Charleston, SC) in May 2017", "Interview Descriptions": "First there is the phone interview by HR recruiter, then you interview with your immediate supervisor- if that interview goes well then the next step is the peer to peer interview", "Interview Questions": "Tell me about a time where you evaluated yourself differently than your supervisor"}, {"date": "3 May 2017", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Roper St. Francis Healthcare (North Charleston, SC)", "Interview Descriptions": "online application was simple. My HR rep was awesome. The interview with the supervisor of the dept. was frustrating to get scheduled but once I got an appointment the interview went very smooth. Supervisor was very down to earth.", "Interview Questions": "all about the experience you have and if you can work any shift and overtime if needed"}, {"date": "12 May 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Roper St. Francis Healthcare in May 2017", "Interview Descriptions": "Took about 7 weeks. Be advised they send you salary and benefit details initially without a job offer. First, there was an interview with HR over the phone. Two days later I had an interview downtown. Lastly was a peer interview. About three days later I was called with an offer!!!", "Interview Questions": "Interview questions were event, action you took, and the results of the situation."}, {"date": "15 Nov 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Roper St. Francis Healthcare in Mar 2017", "Interview Descriptions": "Recruiter interview first asking your work history and pay expectations. Basic personality questions along with scenarios focusing on how you respond to stressful situations. A few questions about past medical experiences.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "25 Jan 2017", "title": "AR Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Roper St. Francis Healthcare", "Interview Descriptions": "you get two interviews one on one then a peer they ask you a bunch a questions but its really based on how you look and if they like you nothing more or less", "Interview Questions": "asked why you want to work for them "}], [{"date": "19 Aug 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Roper St. Francis Healthcare (Charleston, SC) in Jan 2017", "Interview Descriptions": "Two part Interview - one with the manager and a peer interview with another RN and PCT. I liked how they allowed me to ask them questions. Process was very organized", "Interview Questions": "Why do you want to work here?"}, {"date": "21 Aug 2016", "title": "Financial Services Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Roper St. Francis Healthcare (Charleston, SC)", "Interview Descriptions": "Applied online took about two weeks for in person interview then a recruiter called asked me to come to new hospital in mt Pleasant.  Then I was called later that day to go to main hospital at another location. Did a hiring manager and peer review interview was told I had all skills and experience. Two weeks went by nothing heard then received an  email said I was not selected without a reason. Do not waste your time rsfh is known to waste people time when they already know who there going to hire.  Besides I have a masters degree and was only offered 12.50 hourly really rsfh you will never keep good candidates by snowballing people. Stay Away people", "Interview Questions": "What qualifications I bring to the table."}, {"date": "8 Sept 2016", "title": "Interface Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Roper St. Francis Healthcare (Charleston, SC) in Aug 2016", "Interview Descriptions": "A phone interview followed by an onsite in person \"panel\" interview.  I had mentioned I would have to travel 5-6 hours to get there and probably have to spend the night in Charleston or else I would be on the road 10-12 hours... no offer for reimbursement, no consideration for day and time.  Two interviews followed, one \"peer review\" and one \"managerial\". About a 4-5 hour process.", "Interview Questions": "How would you handle a problem .... ( nonspecific ) I can only assume they (she) was looking for an indication of communication \"style\".  A very poorly phrased question and when I asked for more specifically the type of problem, it seemed to illicit a terse response, not an answer."}, {"date": "27 Aug 2017", "title": "Family Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Roper St. Francis Healthcare (Charleston, SC) in Aug 2016", "Interview Descriptions": "First interview was with a regional manager.  The second one was a peer interview.  This included NPs, PAs, and MDs.  Pretty standard situational questions.  Everyone was friendly.", "Interview Questions": "Give an example of a time when you had a conflict with a co-worker.  How did you handle it?"}, {"date": "29 Apr 2016", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Roper St. Francis Healthcare (Charleston, SC) in Apr 2016", "Interview Descriptions": "Applied online and was contacted within a week to schedule a phone interview. Following the phone interview we set up an in person interview with the hiring manager and peer group from the unit. Received a call with a job offer that same day. The HR recruiter was wonderful to work with.", "Interview Questions": "Describe a time where you had to demonstrate leadership and motivate an individual or team. How did you accomplish this?"}, {"date": "14 Jun 2016", "title": "Coding Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Roper St. Francis Healthcare (Charleston, SC) in Mar 2016", "Interview Descriptions": "Received a call from HR and scheduled my phone interview for the same day. Interviewed in person two days later. Was required to do a coding skills assessment. Passed that and was contacted a few days later for a peer interview. Received a job offer the same day as my third interview.", "Interview Questions": "Mostly behavioral questions, regarding my ability to work well with others and handle stressful work environments."}, {"date": "3 Feb 2016", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Roper St. Francis Healthcare (Charleston, SC)", "Interview Descriptions": "First, there was a telephone interview with human resources. Next, a face to face interview with the hiring manager, and then,e an interview with peers. I interviewed with human resources on a Friday, and interviewed the following Tuesday with manager and peers. I received a call Tuesday evening with a job offer.", "Interview Questions": "Why would you be an asset to the team?"}, {"date": "7 May 2018", "title": "Buyer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Roper St. Francis Healthcare (Ladson, SC) in Jan 2016", "Interview Descriptions": "Just your basic STAR interview with no curveballs or tough questions.  If you know your resume highlights you will sail through the process.   You will go through two interviews.  The first with the hiring manager and a second with two team members who have the final say on whether you are hired or not.  The hiring manager only brings back for that second interview people he/she has greenlighted.", "Interview Questions": "Tell me about a time you made a mistake? "}, {"date": "2 Feb 2016", "title": "Practice Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Roper St. Francis Healthcare (Charleston, SC) in Jan 2016", "Interview Descriptions": "Filled out application online.  Called by recruiter couple of days later, then had in person interview few days after that.  Peer interview about a week later.  Very easy and quick process.  No outrageous questions or anything off the wall.  Everyone was very nice and welcoming.", "Interview Questions": "Tell me about a time you when you went above and beyond."}, {"date": "14 Feb 2016", "title": "Call Center Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Roper St. Francis Healthcare in Jan 2016", "Interview Descriptions": "Applied online, got a call about a month later to do a phone interview.  I went in spoke with the hiring manager. I waited about 10 minutes he came in and asked me 3 situation questions.  I asked him questions about the position. He really gave the impression that he wasn't interested.  I have interviewed with him before a while back. He comes off as arrogant. He told me I would hear back in a week, it's been about 2 weeks..nothing yet", "Interview Questions": "What makes you unique?"}], [{"date": "6 Oct 2015", "title": "Call Center Operator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2+ months. I interviewed at Roper St. Francis Healthcare", "Interview Descriptions": "Easy interview . Managers seemed nice and interested in responses. went through phone interview, manager interview , and peer interview. Not selected for position . Not even a email sent to advise me found out through the website site .", "Interview Questions": "N/A"}, {"date": "25 Sept 2015", "title": "MD Receptionist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Roper St. Francis Healthcare (Hanahan, SC) in Sept 2015", "Interview Descriptions": "HR called to schedule phone interview and then at the end she scheduled a face to face interview with the practice manager.  Interview went well and then practice manager schedule a peer to peer interview.  Two days and no offer yet.", "Interview Questions": "Why are you interested in this position?"}, {"date": "18 Jan 2015", "title": "Systems Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Roper St. Francis Healthcare", "Interview Descriptions": "Scheduled an interview on the phone with the HR Recruiter to discuss the position with someone.  Waited for an hour and never received the call.  I contacted HR asking if they wanted to reschedule the interview and haven't heard back as of yet.\r\n\r\nIt was nice they provided the benefits and salary ahead of the interview.", "Interview Questions": "N/A"}, {"date": "28 Feb 2018", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Roper St. Francis Healthcare in Jul 2014", "Interview Descriptions": "Online application as recommended by a former colleague. She was used a my referral. \r\nHR Contacted by mail \r\nPhone Interview by HR to discuss my expectations\r\nthen 1 on 1 interview\r\nOn site Group Interview", "Interview Questions": "general experience related"}, {"date": "10 Sept 2013", "title": "Financial Services Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Roper St. Francis Healthcare", "Interview Descriptions": "Lengthy for a non-critical position. It was your standard \"tell me about a time when...\" \"why should we hire you?\" It consisted of an interview with the hiring manager, then a peer interview, then a job offer, physical, drug test, orientation.", "Interview Questions": "None of the questions were difficult or unexpected. They are all standard interview questions designed to weed out psychopaths. "}, {"date": "31 Jul 2013", "title": "Marketing Strategist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Roper St. Francis Healthcare in Jul 2013", "Interview Descriptions": "A couple months after applying I was contacted by a manager. I came in for a interview followed by a peer interview all within a matter a days. A week later the manager called and formally offered me the job, and about a week after that HR followed up with a salary offer and paperwork.", "Interview Questions": "Nothing unexpected."}, {"date": "10 Apr 2013", "title": "Call Center Operator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Roper St. Francis Healthcare (Mount Pleasant, SC) in Mar 2013", "Interview Descriptions": "The hiring manager is very intimidating and he watches you very closely on your body gestures and maintaining eye contact. I know I wasn't going to get the job due to be very late because I wasn't familiar with the area and was turned around due to map quest directions. I apologized for my tardiness but I had the feeling by the hiring manager he wasn't going to hire me. I did a thank you letter for the hiring manager and the recruiter within the next day. I tried to focus on my experience and qualification for the position. I also mention my tardiness and that I apologized again.", "Interview Questions": "Have you every had confrontation with an employee and what did you do to resolve it?"}, {"date": "11 May 2016", "title": "Teacher Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Roper St. Francis Healthcare (Charleston, SC) in Apr 2012", "Interview Descriptions": "The interview was fairly brief and the questions were comprehensive.  I felt comfortable entrusting this daycare with my children given the types of questions they asked.  They asked me about drug usage, background check information, criminal history, amount of experience taking care of children, and how would I specifically care for the infants in the nursery.", "Interview Questions": "The questions were straight forward."}, {"date": "16 Apr 2012", "title": "Applications Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Roper St. Francis Healthcare (Charleston, SC) in Mar 2012", "Interview Descriptions": "First had a phone interview. Then was invited for an on-site interview. I am not local and had to travel 700 miles for interview. The on-site interview consisted of a 1-1 interview for an hour, then a group/panel interview. Everyone was very kind and seemed like a great place to work for. Interview wen't extremely well, I was told I'd hear back within a couple of days and left with a very confident feeling. A couple days went by, no answer. Couple weeks went by, no answer. I followed up with HR a couple times and finally TWO MONTHS later I found out I did not get the job. Found out because the HR lady (who is extremely kind and helpful) went out of her way to see the interviewer in person and ask if they were going to hire me or not. \r\nI'm not upset that I did not get the job (bummed, yes a little) but I am mad that I traveled so far and spent a LOT of money to be there for this interview, to then be ignored and lied to in the end. Unfortunately because of that, it will be the last time I apply for this hospital.", "Interview Questions": "N/A"}, {"date": "29 Nov 2011", "title": "Coding and Data Quality Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 months. I interviewed at Roper St. Francis Healthcare (Charleston, SC) in Jul 2010", "Interview Descriptions": "Very slow process... When I did finally get the call for an interview it was very unprofessional.  The recruiter sat there with my resume and basically said, \"huh...I don't think you are really qualified, I don't know if the manager will want to speak with you.\"  I was asked to wait outside while she made the phone call to the manager.  I was in shock and started to just leave at that point but decided to see where this was going.  The recruiter called me back in and said she could not reach the manager and just go ahead and go over to meet her.  I was given about 10 minutes to make a trip that normally took 20 and when I left the building I really contemplated not going to meet the manager.  I figured if the interview with HR was this bad, what in the world was the company like.  I went, I ended up taking the job, I ended up leaving the job after about a year.", "Interview Questions": "Why should we hire you?"}], [{"date": "12 Sept 2012", "title": "Nurse RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Roper St. Francis Healthcare (Charleston, SC) in Sept 2009", "Interview Descriptions": "Straightforward process began with HR screening then face to face interview. HR walked me to manager's office. In turn manager showed me around new unit explained details of shift available and job details. Afterward was a comfortable peer interview. The usual behavioral interview questions were asked, all very conversational, nothing really unexpected.", "Interview Questions": "Describe a time you had a miscommunication with a coworker."}]]