[[{"date": "20 Dec 2022", "title": "Library Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Smith College", "Interview Descriptions": "Did a zoom interview than a 4 hour in person interview. Met with several people across the department. They all asked the same exact questions. It went ok, a little claustrophobic. Not sure why they asked for my salary requirements when the salary was set. The HR person made a nasty face when my salary requirement was higher than listed. Then why did you ask? The last group talked badly about the person I would be reporting to (red flag) and how if I was offered the position to negotiate (the word negotiate was thrown out about ten times). The salary was set so not sure why this was brought up so much. Kind of a waste of taking a day off to spend hours there.", "Interview Questions": "Very generic- why do you want this position, etc. One weird question was how I would mail something?"}, {"date": "20 Jun 2023", "title": "COVID care specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Smith College (Northampton, MA) in Aug 2022", "Interview Descriptions": "The interview took place through Zoom. I met with 2 employees. The interviewers were very welcoming and asked questions that were pertinent to the position. I felt prepared for the questions.", "Interview Questions": "Why are you interested in this position? What are your 3 greatest strengths in relation to this position? Tell us about your experience working with college students."}, {"date": "27 Jun 2021", "title": "Graduate Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Smith College", "Interview Descriptions": "2 interviews with the head coach. \n1 phone call with the current GA \n1 phone call with the current captain of the team\n1 interview with head of the program", "Interview Questions": "How your experience will enrich our program? "}, {"date": "17 Jan 2021", "title": "ResLife HCA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Smith College", "Interview Descriptions": "1-1 interview and a group interview. Was fun and easy. Lovely people to work with and talk to. Got the offer in a couple of weeks after interviewing and a good onboarding process", "Interview Questions": "A lot of situational questions and group activities "}, {"date": "4 Dec 2020", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Smith College (Northampton, MA) in Dec 2020", "Interview Descriptions": "Full day zoom interview, one job talk, meeting with students, provost. After 30 min shortlisted interview. Great friendly people. Very helpful. Didn't discuss salary. Good research support. Great students. Nice little town", "Interview Questions": "What is your basic teaching philosophy"}, {"date": "29 Jul 2020", "title": "Catering Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Smith College", "Interview Descriptions": "I sat down with the head of catering and talked through my previous experience. I also reviewed my school schedule and any conflicts I might have throughout the week. Lastly, I got a tour of the kitchen and then started the next week.", "Interview Questions": "What previous catering experience have you had?"}, {"date": "4 Nov 2019", "title": "Department Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Smith College in Sept 2019", "Interview Descriptions": "Had a great phone interview, went on to have a great 3.5 hour interview over the course of one day, meeting the entire staff and department. Although there was one person in the interview who kept giving me weird, glaring looks that made me very uncomfortable. It was a bit of a long day, but this is not uncommon for the 5 Colleges. Never heard anything back at all until over a month later received a generic rejection email. Wasn't even personalized with my name or from the person I had been in contact with. You would think someone who comes in for that long of an interview would be given a more personal email as to why they weren't hired instead of a 'dear applicant...' Not very professional.", "Interview Questions": "Why are you looking for another job?"}, {"date": "13 Sept 2018", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Smith College (No Oaks, MN)", "Interview Descriptions": "It was alright. Low pressure really\r\nThis question seems simple, so many people fail to prepare for it, but it's crucial. Here's the deal: Don't give your complete employment (or personal) history. Instead give a pitch—one that’s concise and compelling and that shows exactly why you’re the right fit for the job. Start off with the 2-3 specific accomplishments or experiences that you most want the interviewer to know about, then wrap up talking about how that prior experience has positioned you for this specific role.", "Interview Questions": "N/A"}, {"date": "25 Jul 2018", "title": "Studnet Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Smith College", "Interview Descriptions": "We use skype to do the interview. The interviewer calls in and asks about some basic information about your background. And then ask you why Smith and ends up with asking you if you have any questions for her.", "Interview Questions": "why smith "}, {"date": "19 Dec 2016", "title": "Staff Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Smith College (Northampton, MA) in Dec 2016", "Interview Descriptions": "I submitted an application on line. I had a brief telephone interview and a face to face interview a week later. It was a positive experience, but I have not heard back after 2 weeks.", "Interview Questions": "How did I handle difficult clients/customers at a former job?"}], [{"date": "27 Nov 2016", "title": "Staff Position Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Smith College (Northampton, MA)", "Interview Descriptions": "Had to go through three interviews, first by phone and two in person. The second one was scheduled for three or four hours (I forget) with lots of different people on campus. Third one was with three more people. It was quite an in-depth process with LOTS of people weighing in.", "Interview Questions": "How do you handle conflict?"}, {"date": "23 Jun 2016", "title": "Research Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 10 months. I interviewed at Smith College", "Interview Descriptions": "I was contacted for an interview for an entry level genetics research technician position in one of the biology faculty member's labs. I had a Skype interview with the PI and her post-doc. The interview went well and I followed up with the typical post-interview \"thank you e-mail\". I didn't hear anything back after two weeks, so I sent a follow up e-mail and left a voicemail. Still nothing. I reached out to HR via e-mail and voicemail. Still nothing. A few weeks later, I called HR and left a message with a secretary who promised to have someone call me back with information (even though I had long since given up on this job). I never received any call back from HR. I'm not even joking, but I finally got the rejection letter from HR eight months after the interview. The rejection letter even began with \"We are sorry that this process has taken so long\". What excuse could they possibly have for taking eight months to reject someone? I had seriously been at my new job for 6 months before this rejection letter appeared in my inbox. The PI could have at the very least let me know sooner that I did not make the final selection. I could have moved on instead of wasting 6 weeks by following up with this college. I would never apply for another job with this school.", "Interview Questions": "Do you know how to perform PCR? "}, {"date": "15 Jul 2016", "title": "Student Financial Services Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Smith College in Feb 2016", "Interview Descriptions": "I applied online and received a response a few days later. The interview was with the office manager and two other staff members. The questions were mostly behavior questions. They started by describing the work environment. It was more like they want the applicants to be ready with what they are going to face. It was a fast pace office.", "Interview Questions": "Tell me about a time you encountered a problem at work."}, {"date": "5 Jun 2015", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Smith College (Northampton, MA)", "Interview Descriptions": "Very standard interview for a part-time on-campus job. Application process asked for a \"poster for an event you would like to see.\" Purely behavioral questions, mostly about working in teams. Interviewer (who has since left Smith) was very nice, though professional. I did the interview and was told I didn't get a position, but then one of the students who they thought was coming back to fill the position didn't and they ended up needing me. They were prompt in notifying me about both decisions.", "Interview Questions": "Q: Describe a conflict you had while working in a group project and how you resolved it."}, {"date": "13 Dec 2017", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Smith College (Northampton, MA) in Apr 2015", "Interview Descriptions": "The job interview process was good. I applied online, and I got an email a few days after. I got an in-person interview a few days after. They asked about my experience, and my ability to tutor quantitative subjects.", "Interview Questions": "Previous experience? "}, {"date": "17 Oct 2014", "title": "Administrative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Smith College", "Interview Descriptions": "Submitted resume, received email the next day to set up a phone interview. Then invited to an in-person interview one week later. The in-person was a  panel interview with staff and faculty for a staff position. The interviewers were kind and seemed interested in what I had to say during the interview. Positive experience.", "Interview Questions": "Tell us of a time you fixed a technical problem or used your technical skills"}, {"date": "21 Mar 2018", "title": "Assistant Director, Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Smith College in Jul 2014", "Interview Descriptions": "In depth interview process. I  met with the right people and they were all very welcoming.  HR was very knowledgeable and very professional.   I understood where I was in the process at all times.  They were responsive and quick to share feedback.  Benefits were explained in a comprehensive manner.", "Interview Questions": "Why Smith College"}, {"date": "7 Oct 2015", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Smith College (Hartford, CT) in Jan 2014", "Interview Descriptions": "an hour of paperwork, computer skills testing, waiting for an interview.  After completing the paperwork, and meeting face to face, a position was not immediately found.  Once a position was found, the pay scale offered was significantly less than was led to believe during the interview.  Tax paperwork was lost/misplaced resulting in a special trip back to the office in order to get paid.", "Interview Questions": "job experience"}, {"date": "16 Jul 2015", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Smith College in Jan 2013", "Interview Descriptions": "The interview included behavioral type of questions mostly. The goal of this interview was to mostly assess an individual's ability to learn quickly, communicate efficiently to both managers and library users and to be able to work calmly in a fast paced environment.", "Interview Questions": "What was the most challenging thing you had to learn during the past 2 years"}, {"date": "24 Aug 2015", "title": "Classroom Support Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Smith College (Northampton, MA) in Apr 2012", "Interview Descriptions": "not bad, pretty typical stuff. I'm not really sure how to fill the 50 word minimum here, as there was nothing specifically out of the ordinary about it. Some questions about how I worked with others and how I solved problems and dealt with stressful situations. It's a student position so it's not very difficult to get hired if you are moderately competent.", "Interview Questions": "What is your tech support experience?"}], [{"date": "9 Dec 2012", "title": "ETS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Smith College (Northampton, MA) in Feb 2010", "Interview Descriptions": "not much to say, very easy on campus job interview", "Interview Questions": "N/A"}]]