[[{"date": "12 Apr 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Aspirus", "Interview Descriptions": "Interviewers were nice and respectful. Helped me not feel anxious when interviewing. Was done over zoom so had a couple technology issues. Was a great process and would interview with them again.", "Interview Questions": "Why do you want to work here"}, {"date": "30 Mar 2023", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Aspirus (Wausau, WI)", "Interview Descriptions": "I was invited to a phone interview screening the day after I applied. I did not hear back after that for about 3 weeks and I assumed that I wasn't selected to move forward. Then, I was invited to a virtual interview with a panel of four people from the department. The next day, I was invited to an in-person interview with the two people this position would be supporting. At the end of the in-person interview, I was told that the process \"could take a while, and to please be patient.\" I checked in with the HR representative ~7 business days later, no response. I checked in again a week after that and was told that PTO was delaying the decision, and to expect to hear something the following week. To this day, two months after I first applied and one month since my in-person interview, I have not heard back.", "Interview Questions": "Why are you interested in this position? Describe how comfortable you are with computer programs such as Microsoft Office products. How do you keep yourself organized? How would you handle a situation where a person you work with came to you and was angry about something?"}, {"date": "28 Nov 2022", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Aspirus in Oct 2022", "Interview Descriptions": "After applying online was contacted shortly thereafter for a video interview with two other individuals from Aspirus. After that they sent me a link to submit my references I had done three. Those references needed to submit their surveys. After about 2 and 1/2 weeks only one of my references responded to the emails and text. I had emailed Aspirus talent representative that I am concerned about my references not finding their emails or whatnot. I had to badger the references for the next couple days. And I only got a total of two references. Aspirus responded at week 3 that I need to find at least one more.", "Interview Questions": "Describe your personality to us."}, {"date": "7 Sept 2022", "title": "Intake Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Aspirus", "Interview Descriptions": "Was pretty smooth, the interviewer were really prepared and engage in the conversations. I felt like they really explained the role and their expectations. I felt the interviewer were really passionate about their job and explains to me throughly of what I need to have to be able to be part of the team.", "Interview Questions": "What are your weakness and strengths."}, {"date": "6 Jul 2022", "title": "Emergency Preparedness Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Aspirus", "Interview Descriptions": "Very conversational and a great experience. Didn’t really feel like an interview at all but that was just my experience. I’ve heard other stories about bad interviews but as long as you are passionate about what you want to do you should be fine.", "Interview Questions": "Why do you want this job "}, {"date": "19 Mar 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Aspirus (Wisconsin Rapids, WI) in Mar 2022", "Interview Descriptions": "Panel interview with basic interview questions. Questions about strengths, weaknesses, leadership, conflict amongst coworkers, future goals, why would you work for this company.  They explained the job role and provided information about benefits ans offered job shadow opportunity.", "Interview Questions": "Panel interview with basic interview questions. Questions about strengths, weaknesses, leadership, conflict amongst coworkers, future goals, why would you work for this company. "}, {"date": "13 Nov 2021", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Aspirus (Wausau, WI)", "Interview Descriptions": "Multiple phone and in person interviews with leadership from around the system, and group interview with the team. Mostly typical interview questions. None of the interviews were notably difficult. There was quite a long time frame to complete them all, several weeks, just due to scheduling with all of them.", "Interview Questions": "Describe a project you ran that didn't go how you expected."}, {"date": "27 Oct 2021", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Aspirus", "Interview Descriptions": "Communicative. Took awhile to get an interview but the actual interview itself was great. Personable and made me feel right at home. Impressive execution! No need to be worried about interviewing with them.", "Interview Questions": "Achievements? Goals? Biggest struggle in past job? "}, {"date": "23 Aug 2021", "title": "Supply Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Aspirus", "Interview Descriptions": "The interview was fast and thorough. I was screened by a temp agency first. Similar questions were asked by both places. The company  was very friendly and offered me a job after the first interview.", "Interview Questions": "What is your experience with excel?"}, {"date": "28 Feb 2021", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Aspirus", "Interview Descriptions": "Zoom camera was meant to move to panel members but was erratic, and distance of camera placement made it very difficult to see panelists. Back to back panels over 2 hour period where I could barely see anyone was challenging.", "Interview Questions": "Why should they pick me"}], [{"date": "19 Jun 2020", "title": "RN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Aspirus", "Interview Descriptions": "Recruiter over the phone and then manager in person with other employees from the dept I was interviewing for. I then shadowed that dept for 4 hours before I was offeredthe position", "Interview Questions": "Why do you want to work here"}, {"date": "14 Jan 2020", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Aspirus", "Interview Descriptions": "Interview was standard questions with HR representative and Supervisor from department.  Also given the opportunity to job shadow. The process seemed to take longer then what it should have.", "Interview Questions": "Why would you be a good fit for this position?"}, {"date": "11 Jun 2019", "title": "Manager - Projects Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Aspirus (Madison, WI) in Apr 2019", "Interview Descriptions": "talent acquisition went through the required motions and asked the basic: why Aspirus?  Why this job? Next dept manager asked the detailed questions regarding project experience, best completion, and worst case scenarios.  also a couple of what if questions", "Interview Questions": "Why do you wan to work here?"}, {"date": "24 Feb 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Aspirus in Jan 2019", "Interview Descriptions": "Panel of several nurses taking turns asking questions which were standard ones. Why do you want to work in this department? What are your long and short term goals? They made it stress free.", "Interview Questions": "Long and short term goals?"}, {"date": "2 Aug 2020", "title": "CMIO Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 months. I interviewed at Aspirus (Wausau, WI) in Nov 2018", "Interview Descriptions": "Screened over video then in person. Long day of back to back interviews. Friendly people. Accurate representation of culture. Had dinner with the team the night before. They work from a consensus model.", "Interview Questions": "What have I done well in the past?"}, {"date": "28 Apr 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Aspirus (Wausau, WI) in Feb 2018", "Interview Descriptions": "Several phone interviews with hiring manager which went very well, very informational in describing the employer values, dept functions and role of the position applied for.  Then followed with a group/panel interview with the dept/team.", "Interview Questions": "How do you think your current and past experiences apply towards the role of this position?"}, {"date": "7 Mar 2017", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Aspirus", "Interview Descriptions": "Phone interview followed by in person. The phone interview was short. The in person interview was broken up. The first was with HR. Then a panel interview with the whole team.", "Interview Questions": "Mostly about employment background. "}, {"date": "15 Aug 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Aspirus (Wausau, WI) in May 2016", "Interview Descriptions": "First you have a generic phone interview with the person from HR. Then you meet with the director of the unit and tour the floor.  A 2 hour job shadow follows and then someone contacts you.", "Interview Questions": "Can you tell me about your previous hospital experiences? "}, {"date": "26 Jan 2016", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Aspirus (Indianapolis, IN) in Jan 2016", "Interview Descriptions": "The interview took place over the phone. The woman was very friendly, made me feel comfortable and spoke highly of her hospital. Asked relevant questions in order to get to know me and understand my skill set. Was very timely in answering specific questions that she didn't know the answer to off the top of her head", "Interview Questions": "Why choice Aspirus"}, {"date": "30 Sept 2015", "title": "Human Resources Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Aspirus", "Interview Descriptions": "I submitted my application and received a call for an interview the very next day. Had to adjust my schedule as it seemed the people interviewing were out of office so scheduled interview for two days later....waited a week after interview and called to follow up...no answer. Kept trying and leaving a message following days after original phone call. Finally gave up, received a call saying they filled the position...through a source I came to find out the person hired was a family member of someone in the HR department...needless to say there was favoritism involved.", "Interview Questions": "What was one thing you did not agree with at a previous job or internship?"}], [{"date": "13 Mar 2013", "title": "CNA Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Aspirus", "Interview Descriptions": "I had a different interview process since I started as a student CNA", "Interview Questions": "N/A"}, {"date": "21 Feb 2012", "title": "Help Desk Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Aspirus (Wausau, WI) in Feb 2012", "Interview Descriptions": "The initial interview was a phone interview with the Director and the Manager.  The second interview was in person with Human Resources.  Immediately following that was an interview with 4 department members including the Director and Manager.  As a finalist, I was required to submit 5 references.  Upon accepted offer, I was required to pass background, drug, TB, and health tests.", "Interview Questions": "Please give me an example of a time when you made a mistake on the job."}, {"date": "13 May 2011", "title": "PT Act Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Aspirus (Wausau, WI) in Apr 2011", "Interview Descriptions": "Office direction very confusing, no one to greet you once you entered the building. Not sure what room was even open for an interview long tour to find a come. Lots of questions on what if you are a object what would you be? Did not pertain to job.", "Interview Questions": "What is you could have dinner with anyone dead or alive?"}]]