[[{"date": "7 Apr 2023", "title": "Deputy Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Atlantic Council of the United States (Washington, DC)", "Interview Descriptions": "Misleading and archaic. Will overpromise and then ghost you immediately if they no longer want you. They will also try to pay you the least possible for the most amount of work.", "Interview Questions": "Average stuff, nothing too special"}, {"date": "27 Jan 2023", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Atlantic Council of the United States", "Interview Descriptions": "This was for a position in Atlantic Council's Adrienne Arsht – Rockefeller Foundation Resilience Center, which seems like a small and tight-knit community in the Atlantic Council. I didn't make it past the first interview, but overall, I had a really positive experience. Unlike most interviews I've experienced, the interview felt like a conversation--not an interrogation or an onslaught of behavioral questions. The interviewers seemed genuinely interested in and curious about my interests, motivation, and experience; were engaged throughout; and asked thoughtful questions. It was a joy to talk with them! They also encouraged me to send any other questions I had for them in a follow-up email and were timely with letting me know I hadn't made it to the next round. A+ interview experience, and while I'm disappointed I didn't get the role, I'll definitely keep Arsht-Rock in mind for the future.", "Interview Questions": "--Introduce yourself and tell us why you are interested in the position. --Tell us about what accomplishment you are most proud of so far in your career. --Tell us about a time you experienced conflict at work and how you resolved it. --What qualities do you look for in a team? --What questions do you have for us? --Also a couple questions about my grad school experience--why I chose the school/degree I did, and what I learned. The interviewer seemed genuinely interested, which felt really nice."}, {"date": "12 Jan 2023", "title": "Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Atlantic Council of the United States", "Interview Descriptions": "Interview, followed by a written test a few weeks later. Selection process reportedly delayed which can happen but then no news for over 6 months, even after sending a follow-up email. Disappointing to treat candidates this way when they take the time for an interview and to sit a test.", "Interview Questions": "Why are you the best person for the position?"}, {"date": "31 Dec 2022", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Atlantic Council of the United States", "Interview Descriptions": "The interview process was fairly straight forward. They asked the usual questions and provided helpful insight about the role. They were relatively prompt in updates about the position as well.", "Interview Questions": "Describe your experience relevant to the role"}, {"date": "20 Jul 2022", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Atlantic Council of the United States", "Interview Descriptions": "Two rounds of video calls, about 15 minutes each. Laid back and informal. Asked about skills, experience, and interests related to the internship. Not difficult if you do some preparing beforehand.", "Interview Questions": "Do you have experience conducting research?"}, {"date": "26 Apr 2022", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Atlantic Council of the United States", "Interview Descriptions": "A very nice and friendly atmosphere. Asked very specific questions regarding the topic. Asked some general interview questions and had time for me to ask any questions. One of the most pleasant interviews I've had.", "Interview Questions": "How do you like to be managed?"}, {"date": "9 May 2022", "title": "PAO Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Atlantic Council of the United States (Washington, DC) in Jan 2022", "Interview Descriptions": "3 Stage process. 1 initial/overview interview, 1 writing test, 1 final interview with the director. \r\n\r\n24 hours for the writing test. \r\n\r\nThe initial interview was a presentation and then general screening questions.", "Interview Questions": "Experience in the issue area was the main theme. Also various hypothetical questions/issues"}, {"date": "3 May 2022", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Atlantic Council of the United States (Washington, DC) in Nov 2021", "Interview Descriptions": "The pre-interview process with the Atlantic Council was cordial, timely, and responsive. I withdrew my application from consideration prior to the video-interview but the interactions up until then were appropriate.", "Interview Questions": "Q: What time works best for you?"}, {"date": "28 Jul 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Atlantic Council of the United States", "Interview Descriptions": "Interview was over video. Interviewer was friendly and described role and the requirements of the internship position. Then asked questions about experience and interests. Heard back via email within timeframe  mentioned.", "Interview Questions": "Do you have experience in event management?"}, {"date": "17 Jul 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Atlantic Council of the United States", "Interview Descriptions": "Standard interview process; talked with the head of the specific policy area i would be interning with; usual questions plus some easy personal questions about your interests outside of the job.", "Interview Questions": "What sort of writing experience do you have?"}], [{"date": "13 Jul 2021", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Atlantic Council of the United States", "Interview Descriptions": "Start out with a written assignment and then two (at the most) interviews with different members of the council related to the posted position. Interviews are thirty minutes long and focused on behavioral questions.", "Interview Questions": "Q: Tell me a time when you learned a new software while sticking to the daily responsibilities required of you"}, {"date": "9 Feb 2021", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Atlantic Council of the United States", "Interview Descriptions": "It was null and not a lot of information was provided before it. During the call, it was not formal nor did it seem inviting. They give you no follow up.", "Interview Questions": "Would you be interested in working on Caribbean issues?"}, {"date": "13 Sept 2022", "title": "Young Global Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Atlantic Council of the United States (Washington, DC) in Jan 2021", "Interview Descriptions": "Standard behavioral interview. Come prepared to discuss your interest in the practice that’s interviewing you. Think of a team building example or two.  You’ll be great! (Trying to get to 3 0 words.", "Interview Questions": "N/A"}, {"date": "15 Dec 2020", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Atlantic Council of the United States", "Interview Descriptions": "First interview focused on the position and why I am interested in specific area. process took a week. Interviewees were very intelligent and asked thoughtful questions.  The first interview was more focused on position based technical questions and the second behavioral to see how I might fit with the company.", "Interview Questions": "How do you work in a fast paced environment. "}, {"date": "26 Aug 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Atlantic Council of the United States", "Interview Descriptions": "I was contacted about a month after I had applied for the position (and before the deadline was closed) for an interview with my supervisors and junior staff members.", "Interview Questions": "If I had to write a blog post about one thing, what would it be? "}, {"date": "14 Aug 2020", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Atlantic Council of the United States", "Interview Descriptions": "After submitting my application, they got back to me within a few week. Friendly interview, primarily curious about my pervious work experience, my knowledge of the organization's initiatives, and my reasons for wanting to work there.  Ultimately, I didn't get the position but they sent me a nice email informing me of the rejection, unlike some organizations which simply ghost you.", "Interview Questions": "Why do you want to work at the Atlantic Council?"}, {"date": "15 Nov 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Atlantic Council of the United States in Aug 2020", "Interview Descriptions": "Interview via Microsoft Teams. The interview was not very long, interviewed with two members of the team. Did not get an introduction of interviewers or the team.  Questions were convoluted and bit disorganized.", "Interview Questions": "General questions, “tell me about yourself” style questions and then more technical questions about the role. "}, {"date": "25 Aug 2020", "title": "Intern Interview Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Atlantic Council of the United States (Washington, DC) in Aug 2020", "Interview Descriptions": "I applied online end of July. Got a request for interview via email after one week. Had my interview and two weeks later got notified that I did not get the position as it was very competitive.", "Interview Questions": "Strengths and weaknesses, why work for the Atlantic council. "}, {"date": "12 Mar 2021", "title": "Fall Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Atlantic Council of the United States in Aug 2020", "Interview Descriptions": "It was conducted online through Zoom. There were two people who interviewed me, both from the group that was hiring. One of the interviewer was nice. He basically asked me about one point on my Resume, and asked if I had experiences preparing for activities. I did my best.", "Interview Questions": "Do you have any experience preparing for activities?"}, {"date": "23 Apr 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Atlantic Council of the United States (Washington, DC) in Aug 2020", "Interview Descriptions": "Very straightforward, a two-week process for a fall 2020 internship. Phone screening with internship manager, writing exercise, and final interview with the team. Once I was accepted, I had a call with the Center director.", "Interview Questions": "Straightforward behavior and situational questions for the screening. Team interview had more regional specific questions (why X region? What do you think about X political development?) as well as a run down of previos experiences. "}], [{"date": "17 Jul 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Atlantic Council of the United States", "Interview Descriptions": "I applied online for the general summer internship. Got an email for an interview three weeks later. They did not have any writing tests. Two rounds of interview conducted by team leader and program assistant respectively. Very easy. But this internship is unpaid.", "Interview Questions": "Ask about past research experiences."}, {"date": "14 Jul 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Atlantic Council of the United States", "Interview Descriptions": "I applied online through their website's application system.  Within two weeks I had a short phone call, approximately 30 minutes.   We discussed my career goals and my resume.", "Interview Questions": "Run me through your resume"}, {"date": "23 Jun 2020", "title": "Africa Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Atlantic Council of the United States", "Interview Descriptions": "It was a very relaxed interview with the director, program and project assistants of the Africa Center. The conversation was mostly about my interests and background, especially the key items on my resume that they wanted me to explain further.", "Interview Questions": "Why are you interested in African affairs?"}, {"date": "8 Mar 2020", "title": "Project Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Atlantic Council of the United States (Washington, DC)", "Interview Descriptions": "Interview process included a phone interview, Skype interview, and an in-person interview at Atlantic Council's D.C. offices. Entire process took 3-4 weeks. Like others have said here, I never heard back from them (and I found out someone was hired), even though they reminded me multiple times that I would receive a definite yes/no decision. They asked in the phone interview portion about how much I expected to earn. Translation: \"are you willing to pay for D.C. living expenses on a meager salary thousands of $ less than your skills and background are worth to fit our budget?\" I do appreciate how open the interviewers were about the working culture and operations at the Atlantic Council, as I spoke with members of the program (very friendly, but overworked), who gave clear insights into how they manage their daily workload. Think I dodged a major bullet.", "Interview Questions": "Why do you want to work at Atlantic Council?"}, {"date": "2 Mar 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Atlantic Council of the United States", "Interview Descriptions": "Process lasted 2-3 weeks. I applied online and received an email about a week later requesting an interview. Interview went well and I received an email the next day that HR would send me an offer letter in the next week.", "Interview Questions": "Describe a time you had to solve a problem collaboratively."}, {"date": "30 Oct 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Atlantic Council of the United States", "Interview Descriptions": "There were two phone interview rounds at different levels of the division, about a week apart, that were scheduled a few weeks after I submitted my application materials. Because the AC is a highly collaborative space, the interview had a lot of weight in the application process.", "Interview Questions": "They asked about general experience, interests, but focused on my skills and experiences in working with teams. There was a lot of emphasis on customer service as well. It was a friendly and straightforward process."}, {"date": "30 Sept 2019", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Atlantic Council of the United States (Washington, DC)", "Interview Descriptions": "There were three rounds of interview process - an initial phone screen plus two in-person meetings with the deputy director and the program director. The interviewers were nice people, and they responded to emails within a few hours.", "Interview Questions": "Why did you choose to apply to this position? "}, {"date": "24 May 2019", "title": "Senior Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Atlantic Council of the United States", "Interview Descriptions": "Respectful, friendly,  no 'gotchas'. I interviewed with a potential peer, then the team manager, then the director of the Center. I did not meet senior managers although I believe that is the common practice.", "Interview Questions": "What do you want to do at the company"}, {"date": "12 Apr 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Atlantic Council of the United States", "Interview Descriptions": "It was a phone call and the screener asked about my background. My school, my hobbies, extra curriculars, interest in policy. It was a very straight forward interview. No tricks or gotcha questons.", "Interview Questions": "Why Atlantic Council?\r\n"}, {"date": "4 Dec 2018", "title": "Editorial Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Atlantic Council of the United States", "Interview Descriptions": "Online application through the Atlantic Council website, need a writing sample, CV, and motivation letter, then 1-round on-site interview. Waited two weeks to hear back, and got an offer.", "Interview Questions": "What accomplishment are you most proud of?"}], [{"date": "24 Feb 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Atlantic Council of the United States (Washington, DC) in Dec 2018", "Interview Descriptions": "Interview with the Scowcroft Center. Questions were straightforward and the interview was fairly short, like 15-20 minutes including my questions. They were a bit disorganized and weren't terribly communicative during the process.", "Interview Questions": "What are the major geopolitical challenges facing the United States today?"}, {"date": "23 Oct 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Atlantic Council of the United States", "Interview Descriptions": "I had a 60 minutes phone interview with the program director and his assistance. I have been asked several policy questions and was asked to provide examples of projects I have worked on in the past.", "Interview Questions": "Tell us about your personal experience with media outreach"}, {"date": "15 May 2018", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at Atlantic Council of the United States (Baltimore, MD) in May 2018", "Interview Descriptions": "Interview was very casual. They spent a lot of time introducing themselves. However I feel that they really care about whether your past experience EXACTLY fit the topic of the program. It doesn't really matter whether you do well in the interview or not, or if you have demonstrated strong abilities through other activities or not.", "Interview Questions": "Past experience."}, {"date": "26 Apr 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Atlantic Council of the United States", "Interview Descriptions": "Interview process was simple. Just two phone interviews with behavioral questions and some current events questions as well. It depends on the department you are joining. Overall it was a great place to intern, despite being unpaid.", "Interview Questions": "What do you hope to gain from this internship?"}, {"date": "22 Apr 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Atlantic Council of the United States in Apr 2018", "Interview Descriptions": "A few phone interviews, no tricky or surprising questions. They want to know if you're a good fit but they're not looking to trip you up. Will ask if you are up to date with current news issues, so make sure you actually are reading the news to some extent at least.", "Interview Questions": "What news outlets do you look at? \n\nWhy do you want this job?"}, {"date": "11 Dec 2018", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Atlantic Council of the United States in Mar 2018", "Interview Descriptions": "The process consisted of two calls - one with assistants, and then with manager of center. all very conversational and some topic based questions relevant to the team I would be working on.", "Interview Questions": "why do you want to work on this team? what experience do you have doing research?"}, {"date": "20 Nov 2017", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Atlantic Council of the United States", "Interview Descriptions": "I had a phone interview that lasted around 30 minutes and was pretty standard. The questions largely revolved around my past experience and there weren't really any questions that were too difficult.", "Interview Questions": "How do you think your past experience has prepared you for this position?"}, {"date": "12 Nov 2017", "title": "International Affairs Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Atlantic Council of the United States (Seattle, WA) in Sept 2017", "Interview Descriptions": "- 30 minute phone interview\r\n- The interviewer said that I would hear back within two days but it took 3 weeks and the email I received was not even from the person who interviewed me", "Interview Questions": "What is one current news story that you have been following and why is it important?"}, {"date": "8 Sept 2017", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Atlantic Council of the United States in Aug 2017", "Interview Descriptions": "The interview was via phone (about 30 min) and asked me generic questions. A week later they contacted and told me that they decided to go with a different candidate.", "Interview Questions": "Tell me about your experience in prior internships and work? What are some transferable skill sets? What I'm looking to get out of the experience? What are your career goals?"}, {"date": "16 May 2017", "title": "External Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Atlantic Council of the United States (Washington, DC)", "Interview Descriptions": "Went in for an interview in DC. I spoke with three different people from the Office of External Relations.  They asked me what sort of previous experience did I have with logistics/donor relations/events. They also asked me about various items on my resume.", "Interview Questions": "Resume related questions"}], [{"date": "9 Dec 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1+ week. I interviewed at Atlantic Council of the United States", "Interview Descriptions": "I applied online and was contacted via. Email w/in a week that they would like me to do an interview. It was left to me to choose if that would be over phone or skype or in person. I choose to go in person as I live in the D.C. area. The interview went really well, of course it helps to know a bit about the company, and your specific center.", "Interview Questions": "what are your strengths and weaknesses?"}, {"date": "8 Aug 2016", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Atlantic Council of the United States", "Interview Descriptions": "Brief interview. Asked about your skills and why will you be fit for this job, previous experience and knowledge in the subject area is key. Provided job description and asked for availability!", "Interview Questions": "Why do you want to work for the Atlantic Council?"}, {"date": "31 Mar 2017", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Atlantic Council of the United States (Washington, DC) in Jun 2016", "Interview Descriptions": "I went on the first round of interviews, and it was a very easy and relaxed process. Two Human Resources personnel go over your resume with you and ask you to elaborate on your professional experiences. I didn't get an offer, but I had a pleasant experience with the Atlantic Council based on the interview.", "Interview Questions": "Your current job is similar to the one you're applying for. Why are you looking to change jobs?"}, {"date": "24 Dec 2015", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Atlantic Council of the United States (Washington, DC) in Dec 2015", "Interview Descriptions": "Had an interview for about 30 minutes with a director of the program. Interviewing over Skype was offered for interviewees not located in the DC area. Was offered an interview about a week after applying online. Was asked only a few questions. The interviewer spent a lot of time talking about the position and the work involved. Was contacted within 2 weeks after the interview to notify me they decided to go with someone else.", "Interview Questions": "Be prepared to answer questions about yourself and your strengths, what you know about the Atlantic Council, your experience/background, and your specific knowledge relevant to the particular program/department you applied to."}, {"date": "16 Nov 2015", "title": "Events Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Atlantic Council of the United States", "Interview Descriptions": "Phone Interview for Events Position. I called them and it was myself and three individuals on their events team. They gave me background of what their events team does, and then asked me questions. Interview lasted about an hour and they got back to me in about a week", "Interview Questions": "Just give us a general runthrough of your resume"}, {"date": "20 Dec 2015", "title": "Deputy Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Atlantic Council of the United States (Washington, DC) in Nov 2015", "Interview Descriptions": "I had three interview rounds, via 1-1, group interview, and a final interview with the CEO. I never formally spoke with a Human Resources professional during the interview process.  The Atlantic Council is an incredible organization but should enforce stronger Human Resource policies moving forward.", "Interview Questions": "Why Atlantic Council over other non-profit think tank organizations?"}, {"date": "29 Mar 2016", "title": "Editor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Atlantic Council of the United States (Washington, DC) in Oct 2015", "Interview Descriptions": "I applied online and was contacted about two weeks later for an interview. I met with the HR hiring officer and one other person for about an hour in their office. I was not contacted again after that.", "Interview Questions": "Asked specifics about how my experience applied to the job. I was told about the position and asked if it would be something I would enjoy doing."}, {"date": "1 Nov 2015", "title": "Web Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Atlantic Council of the United States in Oct 2015", "Interview Descriptions": "It was a brief phone interview. The Interviewers were friendly, and outgoing. Very informal. Mostly talked about resume. The interviewers described their jobs and what the focus of the Web Assistant would be. There really wasn't much more than that.", "Interview Questions": "Tell us about your background (in relation to job)."}, {"date": "24 Sept 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Atlantic Council of the United States (Washington, DC) in Sept 2015", "Interview Descriptions": "Interview was relatively simple and friendly; I was asked questions about my resume and experience.  I was interviewed by three people; they each had marked-up copies of my resume and asked their own questions.  They took extensive notes.  I was asked relatively few broad personality questions (“What is your biggest weakness”) – interview focused very much on what I had written in my resume and cover letter.", "Interview Questions": "What experience do you have with databases?"}, {"date": "15 Aug 2015", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Atlantic Council of the United States (Washington, DC) in Aug 2015", "Interview Descriptions": "Was contacted with an email to arrange an interview about a week after application.  Interview was very straightforward lasting around 25-30 minutes.  One on one with a member of the department that you applied for.  Very conversational and more interested in getting to know you and explaining the department's functions.  Unfortunately heard back two weeks later that they decided to go with another candidate.", "Interview Questions": "What are your career goals?\r\nHow do you think your experience has prepared you for this internship?\r\nWhat are you currently reading? Or what have you recently read that was interesting and applicable to the internship?"}], [{"date": "21 Oct 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Atlantic Council of the United States in Aug 2015", "Interview Descriptions": "Quite easy interview process done over the phone for about 30 minutes, followed by a background check. Language skills were highly appreciated. An in-person interview was not required at the time of application, especially for candidates who are based outside of Washington, DC.", "Interview Questions": "What are you weaknesses and strengths? What was your experience in handling a stressful situation at work?"}, {"date": "25 Jul 2015", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Atlantic Council of the United States (Washington, DC) in Jul 2015", "Interview Descriptions": "First-round Skype interview in which I spoke with the Program Director and HR person. Very easy and standard interview questions related to my relevant experience and interest in the organization. Overall, it was a very strange experience as the Program Director was not very professional and generally I received all-around strange vibes.", "Interview Questions": "What do you know about the Atlantic Council?"}, {"date": "10 Aug 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Atlantic Council of the United States (Washington, DC) in Jul 2015", "Interview Descriptions": "I had a 30 minute phone interview with the director of the program. The questions were mostly related to my research experience, why I chose Atlantic Council and the sources that I follow to gather data. Overall, quick and pleasant process.", "Interview Questions": "How would your colleagues describe you?"}, {"date": "13 Aug 2015", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Atlantic Council of the United States in Jun 2015", "Interview Descriptions": "About two weeks after submitting my application, I was notified that I had been selected for a first round Skype interview. One week later, I interviewed with the Associate Director for the division to which I had applied as well as an associate from HR. They were very friendly and professional. I really appreciated that they started by having me say what I knew about the Atlantic Council, as I felt it was a clever way of ensuring that applicants had read the website/other materials (I had reviewed everything I could get my hands on, so this questions wasn't difficult for me). The Associate Director reached out a few days later with an invitation to a second round interview as well as a writing/editing assignment, which I found odd but took in stride. The second interview was with the director of the division, also via Skype. Most of the questions in both interviews were fairly straightforward, though in the second round I was asked extremely specific questions about a work experience from a few years prior. I will admit that I had read the Glassdoor company reviews prior to interviewing and as such was on the lookout for indications of the overworking specified in many reviews.", "Interview Questions": "What is the Atlantic Council, and what does the Atlantic Council do?"}, {"date": "21 Aug 2015", "title": "Program (Research) Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Atlantic Council of the United States (Washington, DC) in May 2015", "Interview Descriptions": "After completing a series of interviews with the Atlantic Council, I am still in shock at how unprofessional the process was. Although I thought the first round, during which I was grilled for over an hour by four employees, went relatively well, I was constantly interrupted by the interviewers who at one point stopped to talk among themselves about something completely unrelated to me. The second round included a writing test which I believed I aced, a fact confirmed by the directors. The third round included an interview with the office directors, although using the term \"interview\" was perhaps a stretch. This experience was by far the worst interview I have ever been exposed to. The directors grilled me with questions that were completely subjective and biased for an hour. They harassed me with minute details about my answers and over-analyzed every tiny gesture and word that I used. I felt as though I was at an interrogation and not an interview. By the end of the interview, I wanted to laugh when the directors informed me about the salary. Absolutely ludicrous and not at all feasible in DC!  Don't waste your time!", "Interview Questions": "What would you say to a media member when pressed about ___"}, {"date": "13 Dec 2016", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Atlantic Council of the United States (Washington, DC) in May 2015", "Interview Descriptions": "Applied via email. Had a phone conversation with the supervisor I ended up working for when I arrived. A fairly easy interview which followed a fairly standard set of questions. I assume questions were in a list form provided by HR. Nothing too tricky.", "Interview Questions": "How does your previous experience make you qualified for this role?"}, {"date": "11 Apr 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Atlantic Council of the United States (Washington, DC) in May 2015", "Interview Descriptions": "Very friendly, laid back. Much of the interview was the employer talking about the position and the think tank in general.  Some specific questions about current events.  Ample opportunities to ask questions of the employer.", "Interview Questions": "How should Greece react to its creditors' most recent bailout proposal? "}, {"date": "2 Jan 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Atlantic Council of the United States in Apr 2015", "Interview Descriptions": "Submitted online application for a summer internship in April. Was contacted shortly afterwards for an interview. Interview last about thirty minutes. General interview questions (\"tell me about yourself\"), questions about past/relevant experience, and questions on background interest in the particular center that I applied for. Own your resume and have some insight or knowledge in global affairs and current events.", "Interview Questions": "Tell me about yourself and your interests?"}, {"date": "2 Jul 2015", "title": "Publications/Graphic Design Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Atlantic Council of the United States (Washington, DC) in Mar 2015", "Interview Descriptions": "The interview process was strange - I was simultaneously interviewed by an HR manager and the person who would be my supervisor, but the HR manager was pretty much running the show. They made it very clear that I was to work long hours, but be totally ok with it because I had a passion for the industry. At this point, my potential supervisor said \"but usually when I come in on a weekend, it's because i want to!\" This seemed like a red flag to me, and apparently the feeling was mutual because I was not asked back for a second interview - I got the feeling that either I seemed too old or that my salary requirements were too high, so I wasn't surprised or dissappointed by this.", "Interview Questions": "Why are you interested in leaving your current company?"}, {"date": "11 Aug 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Atlantic Council of the United States (Washington, DC) in Jan 2015", "Interview Descriptions": "I applied online through their website and was contacted by one of the specific programs a few days after. I interviewed on Skype with the Assistant Director (very nice, informal interview) and then had a follow up with the Associate Director a few days after that. I received the offer a week after, I believe. Nothing too difficult with the interview questions - just want to see that you're interested and know a little about what they do and the programs and projects they have in place.", "Interview Questions": "What do you know about the specific program?"}], [{"date": "11 Nov 2014", "title": "Digital Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Atlantic Council of the United States", "Interview Descriptions": "As instructed, applied online for the position and received an e-mail inviting me to the first interview the next day. The first interview was straight-forward with the digital communications manager and he communicated the next steps very clearly and in detail. A week after the first interview, received another e-mail inviting me to the second interview with others in the Communications Department: managing editor and assistant directors. The interview was thorough with qualifications-based questions and consistently at the conclusion was informed about the next steps. A few days later received another e-mail informing me the standard rejection letter: they had decided to move with another candidate.", "Interview Questions": "Tell me about a time when you had a difficulty in media/communications implementation"}, {"date": "10 Jun 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Atlantic Council of the United States (Washington, DC) in Mar 2014", "Interview Descriptions": "After submitting a cover letter / resume etc, there was one round of interview (via Skype, although if I were in the area I would have gone into the office). The interview was fairly standard, asking about my experiences with research, writing, administrative tasks, all of which were on the job description. I heard back within 4-5 days.", "Interview Questions": "Wanted to know about language abilities for news review"}, {"date": "3 Feb 2014", "title": "Writer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Atlantic Council of the United States", "Interview Descriptions": "Phone interview", "Interview Questions": "Outreach and public relations"}]]