[[{"date": "2 May 2023", "title": "Marketing Assitant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Saint Joseph's University", "Interview Descriptions": "It was smooth and easy to navigate. This interview process was one that lead to my job as a marketing assistant for the university. The people the administered the interviews were very nice and supportive", "Interview Questions": "Tell me about your experience at a prior company"}, {"date": "13 Jan 2022", "title": "Marketing Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Saint Joseph's University", "Interview Descriptions": "The interview process was very thorough. There were some writing tests and a few different rounds of meetings with people from across departments within the University. It was conducted via Zoom and all other correspondence was done via email.", "Interview Questions": "What do you like about St. Joe's?"}, {"date": "20 Dec 2018", "title": "Associate Director of Social Media Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Saint Joseph's University (Philadelphia, PA)", "Interview Descriptions": "The initial interview was a 7-minute phone call asking four scenario-based questions. It seemed odd, but I was looking forward to speaking more. The hiring manager said they would be taking their time, but assured that I would receive a call back within 2 weeks and to reach out if not. Two weeks later, the person was on vacation for a week. When I followed up again weeks later, I received a response that nothing had moved forward. I never heard back again and found out they hired someone else. I was not interested anyways, but felt they needed to be more transparent and organized.", "Interview Questions": "How do you respond to negative comments on social media?"}, {"date": "8 Aug 2018", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Saint Joseph's University", "Interview Descriptions": "Taking a class was required for student peer to peer tutoring. After finishing the class, interviews are held. Was granted the position due to successful coursework and training within the class.", "Interview Questions": "why WC"}, {"date": "6 Oct 2020", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Saint Joseph's University (Philadelphia, PA) in May 2018", "Interview Descriptions": "Included a phone interview, in-depth writing/communications test, and individual in-person interviews with the team (5+ people) on campus.  The in-person interview took the majority of the day, so plan accordingly!", "Interview Questions": "Lots of questions about communications oversaturation"}, {"date": "15 Mar 2018", "title": "Associate Director of Communications for Undergraduate Enrollment Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Saint Joseph's University (Philadelphia, PA) in Dec 2017", "Interview Descriptions": "Candidates met with groups of key staff to learn more about the work of the department and have meaningful conversations, followed by a one-on-one meeting with the hiring manager.", "Interview Questions": "How do you feel like your background and experience align with the mission of the University?"}, {"date": "25 Oct 2017", "title": "Van Driver Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Saint Joseph's University", "Interview Descriptions": "Easy hire. I submitted an application online via the university careers website and then was contacted for an in-person meeting and overview of the job. The interviewer was very nice and easy to talk to. It was a reassurance for them of your character.", "Interview Questions": "Do you have any questions for us?"}, {"date": "16 Dec 2019", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Saint Joseph's University (Philadelphia, PA) in May 2017", "Interview Descriptions": "It really depends on which department and supervisor you work with. And Some of the positions low payment. And also you need to pay more attention to job recruitment. The interview was not difficult and talked about your experiences and what can you do for this position. The most of important things are fit for your class schedule if you have. Then you get the job.", "Interview Questions": "what is your challenge in your current situation?"}, {"date": "25 Aug 2020", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Saint Joseph's University in Feb 2017", "Interview Descriptions": "The interview is a typically quick, lasting 30 mins roughly. It’s usually held in Doyle Banquet and the ask behavioral and character questions normally. I would highly recommend taking time to think of your answers, like obviously have some things prepared but reflect on it for a better chance. I’ve personally gone through the interview process and conducted interviews and we can typically tell who really has thought about an answer and who just feeds us what sounds “correct”.", "Interview Questions": "(Paraphrased) How would you incorporate diversity into your floor? "}, {"date": "14 Jan 2017", "title": "Graduate Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Saint Joseph's University (Philadelphia, PA) in Dec 2016", "Interview Descriptions": "It was a good Formal meeting between me and my boss. I was asked about my work experience and my working on as a part of a team. A brief about my education and prior work expericenes", "Interview Questions": "How do I work as a team player."}], [{"date": "24 May 2016", "title": "Part-Time Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Saint Joseph's University in Mar 2016", "Interview Descriptions": "lesson planning, assessment, scenario issues, like \"he has gone to new york\" what is wrong with this sentence\r\nwe talked about how the lesson is usually constructed here. we talked about the students' groups and diversity. it was a fun talk.", "Interview Questions": "how would you correct this sentence's grammar mistakes?"}, {"date": "2 Dec 2015", "title": "Assistantship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Saint Joseph's University", "Interview Descriptions": "Two interviews with various members of the department. The first interview took place in a room with two employees. This occurred before the second, which I made it to by doing well in the first. I also did well in the second and received a call stating that I was being offered the job and would I accept. I said I would think about it then responded back with a yes. The whole process took two weeks from the start of the first interview.", "Interview Questions": "1. What is my definition of leadership? \r\n2. What is your biggest weakness?"}, {"date": "8 Oct 2015", "title": "Marketing & Customer Insights Analyst II Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Saint Joseph's University (Lancaster, PA) in Jul 2015", "Interview Descriptions": "The interview process as it turns out now was bizarre to say the least. The concerned department head called me up first saying that he just loved my qualifications and skill sets and would like me to work for Fulton. The HR called up 20 minutes later and set up an interview at their main office in Lancaster- Pa( A distance of around 56 miles from my residence.)\r\n\r\nThe interview process ran for 1 long hour with free frank exchange of views and it looked like it was  just a matter of time before I would be selected and given a offer. I was interviewed by 2 people and it went really well. I was told to meet the Hr,who  asked me about my salary requirements  and he was happy with what I wanted. He told me all bout the benefits the company offered and all along I was given the impression that I had the job in my bag .\r\n\r\nI was told that I would be informed about the result on Monday of the coming week(4 days after the interview). It however turned out to be a long wait. I had to make a total of 8-9 calls the next 3 weeks to know what was happening.\r\n\r\nI was told at the beginning of my 9th call to the HR that the position has been filled by some one else.It was shocking and beyond reason that I as a candidate was treated poorly. I would tell all prospective candidates not to apply( they would be treated real bad.It is not worth travelling 56 miles to be  get insulted. Beware of Fulton!", "Interview Questions": "They asked me about the Projects that I did at School."}, {"date": "6 Aug 2015", "title": "Human Resource Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Saint Joseph's University (Philadelphia, PA) in Mar 2015", "Interview Descriptions": "I interviewed as a referral. Short interview process and long wait to receive my rejection. I had panel interview with 4 ppl. Unfortunately, 3 out of the 4 had no decision making authority. For an entry level position they wanted someone with experience. Go figure. I answered all questions, and had a great exchange throughout the interview.  The interview lasted approximately an hour. Skills and IQ assessment was easy; your scores are generated immediately.", "Interview Questions": "Do you have any benefits experience? "}, {"date": "5 Jul 2015", "title": "Print Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Saint Joseph's University (Philadelphia, NY) in Jan 2015", "Interview Descriptions": "First emaill and schedule a interview.And I went directly to manager's office 2 days from email and told about the job .This was part time job and only worked during winter break,manager asked me few very simple question and I discussed time schedule with manager then I get the offer.", "Interview Questions": "Are you trustworthy?"}, {"date": "26 Apr 2017", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Saint Joseph's University (Philadelphia, PA) in Jan 2015", "Interview Descriptions": "there were four rounds of interviews, and everyone was very friendly. each round was different, the beginning rounds were group interviews and the last few rounds were individual, where it would get to be more personal questions.", "Interview Questions": "What would you do if a certain scenario were to happen? "}, {"date": "1 Jun 2017", "title": "Call Center Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Saint Joseph's University in Sept 2014", "Interview Descriptions": "Really simple interview process. Was over the phone and really relaxed, asked a few questions about my experience at the university and if i thought i'd be a good fit for the call center.", "Interview Questions": "How has your experience at the University been?"}, {"date": "13 Mar 2014", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Saint Joseph's University", "Interview Descriptions": "Come in and meet with your direct contact person, who you initially had contact with, then you will have a meeting with the assistant provost. Afterwards, you will meet half of the admissions counselor a you will potentially be working. In advance, you will be asked to prepare a presentation in advance for your interview. It could have been any topic!", "Interview Questions": "How would you project the Jesuit missions to our prospective students "}, {"date": "27 May 2016", "title": "Technical Operations Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Saint Joseph's University (Phila, PA) in Dec 2013", "Interview Descriptions": "The interview went well. Discussed the job, description of duties, personal strengths/ weaknesses, ect. The interview was not too long considering I met with 5 individuals at one face to face interview time.", "Interview Questions": "I do not recall being asked anything that threw me off my game. In retrospect I was well qualified and looking to relocate. The job at the time was personally a good fit."}, {"date": "13 May 2014", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Saint Joseph's University (Philadelphia, PA) in Dec 2012", "Interview Descriptions": "You have to be the top students in class. Then you get a better chance to be selected to go for the interview. You will be asked some basic knowledge and you will need to demonstrate it like you are a teacher.", "Interview Questions": "If you get nervous..."}], [{"date": "11 Nov 2012", "title": "Part Time Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Saint Joseph's University (Philadelphia, PA)", "Interview Descriptions": "I had one interview with department head and was hired on the spot.  I only had to return to HR to fill out paperwork.", "Interview Questions": "N/A"}, {"date": "7 Sept 2012", "title": "Assistant Professor of Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Saint Joseph's University (Philadelphia, PA)", "Interview Descriptions": "Speed dating at AOM, phone interview, campus visit. Campus visit includes a teaching and research presentation.", "Interview Questions": "How do you see yourself fitting in with the Jesuit tradition? What does your ideal job look like?"}, {"date": "24 Jul 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Saint Joseph's University (Philadelphia, PA) in Aug 2011", "Interview Descriptions": "The interview process was fairly lengthy for an admin position because I first spoke on the phone with the chair of the department, then came in for an interview and then came in for a committee interview.  I was asked about my organization skills and what I was excited about bringing to SJU. It helped to be knowledgeable about their mission and understand the jesuit ideals.", "Interview Questions": "How did you find out about the position and company?"}, {"date": "16 Apr 2014", "title": "Web Applications Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Saint Joseph's University (Philadelphia, PA) in May 2011", "Interview Descriptions": "Long and tedious. It takes months for HR to actually go through everything and make an offer. I went in for three interviews, the last one just to meet the CTO, which was a bit annoying, but a great meeting. I applied online in March, started in July.", "Interview Questions": "\"Why should we hire you?\" - an open-ended question you can always expect here. "}, {"date": "18 Apr 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Saint Joseph's University (Philadelphia, PA) in Jan 2011", "Interview Descriptions": "phone interview; skype interview; campus visit; quick decision", "Interview Questions": "None, all questions came out of my own cover letter and CV"}, {"date": "5 Sept 2013", "title": "Visiting Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Saint Joseph's University (Philadelphia, PA) in May 2009", "Interview Descriptions": "Changes by department.  Some departments have very rigorous 3-day interviews including a dinner, full campus tour, teaching showcases, and so forth.  Other departments have a one-day interview process and abbreviated meetings.\r\nThere is a final set of interviews with the Assistance Dean, the Dean and a couple of other professors in your department.", "Interview Questions": "Would you want to be chairman of the department?"}]]