[[{"date": "29 Nov 2021", "title": "Technical Program Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at United We Dream", "Interview Descriptions": "Do not interview here. The interviewers are unprepared, they make fun of people and the salary is extremely low, they will not value your skills. They are very RACIST with non Hispanics which is unfair, they should judge you based on your knowledge! \n\nThis organization does not deserve any donations or your time as an employee!", "Interview Questions": "What is your Favorite holiday?"}, {"date": "22 Mar 2021", "title": "Advocacy and Policy Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United We Dream in Mar 2021", "Interview Descriptions": "Applied online over the weekend and heard back two days later. Scheduled a phone interview that same week I heard back. Phone interview was about 45 min. Within two weeks, heard that my application was not moved forward within the application process.", "Interview Questions": "What is there missing within the immigration movement? How do we do more outreach within a virtual environment"}, {"date": "12 Apr 2021", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at United We Dream in Mar 2021", "Interview Descriptions": "I applied Online.  A week later, they invited me for a phone screening.  They set up my interview with GMT zone, even though both of us lived in the U.S., Then sent me a Zoom link.  On the interview day, the Zoom connection worked partially, and I had to dial the numbers into the meeting.  All these small technical issues aside, they completely disappeared after this phone call.  They were supposed to follow up in two weeks after this call, but that never happened.  After three weeks, I sent them a follow-up email but never heard back from them! Extremely unprofessional and disorganized.  I guess they only favor Latino candidates since the founder of this organization is Latino.", "Interview Questions": "How do you think technology will play a role in immigration policies in the next 5 years?"}, {"date": "17 Nov 2020", "title": "Communications Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at United We Dream in Aug 2020", "Interview Descriptions": "The process was wildly disorganized, and took place over the course of three months after submitting my application. About every five weeks, I was contacted about the next round. Seven weeks after initially applying, I completed a skills based exercise (writing a press release, and compiling a list of news outlets to send said list to).  One month later, they scheduled a follow up interview. After that, there was one more round of interviews which I declined, as the interviewer in the first round could not answer basic questions about the position.", "Interview Questions": "Where do you think the climate surrounding immigration will be in five years?"}, {"date": "9 Sept 2020", "title": "Accountant Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at United We Dream (Washington, DC) in Jun 2020", "Interview Descriptions": "It was a very friendly call in about 45 minutes.  I feel very confident even though it was my first interview.  they told me to wait for 3 weeks but I could not make it to the second round. It was very sad", "Interview Questions": "How do you see the immigration law in 5 years?"}], [], []]