[[{"date": "6 Jul 2022", "title": "Patient Care Mentor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Odyssey House of Utah (Salt Lake City, UT) in Mar 2022", "Interview Descriptions": "I got asked the questions and answered. The person on the phone seemed to approve the answers because they told me that they would call me back for the background/drug testing information. It took a month before I did the initiative and contacted first to ask what happened to the information that was going to be sent to get started. I could only say that it became a cycle of repeats for the last 3 months. I in the end did not contact back again due to the unprofessionalism of communications. I checked back to see if the position was still there on the website, it wasn't. Rather than have me go in circles for months and actually tell me if I received the position or not, they wasted my time and effort.", "Interview Questions": "How would I feel about working with male patients?\nCould I pass a drug screening test?\netc."}, {"date": "23 Dec 2021", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Odyssey House of Utah (Salt Lake City, UT) in Mar 2020", "Interview Descriptions": "Very comfortable and welcoming. \nAllowed me to put my two weeks in with my previous employer and I felt welcomed from the first minute I walked in the door. Very professional  and answered any questions that I needed and wanted to know", "Interview Questions": "What do you do to stay organized Etc. "}, {"date": "5 Sept 2015", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Odyssey House of Utah (Salt Lake City, UT)", "Interview Descriptions": "interviewed with two middle management people, fair interview, friendly, walking into the house was a little intimidating and had to wait, was not too hard and was offered the job the same day", "Interview Questions": "Why do you want to work here"}, {"date": "23 Oct 2016", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at Odyssey House of Utah (Salt Lake City, UT) in Mar 2014", "Interview Descriptions": "I am a graduate of the program so, I was already well known; However, I met with the Human Resource Manager and Marketing manager. I was not hired for that position but, was suggested that I would be a perfect fit for the admissions/sales position.  I am not a huge fan of sales, but would be working hands on with new clients and I was given the opportunity to help a lot of people make that first step in recovery.  The pay was a big pay cut from the job that I was currently working but, being so passionate in helping others, I took a leap of faith that I could make it work. At the time I was hired, we were receiving bonuses on certain clients, but that was later taken away..", "Interview Questions": "Are you very organized"}, {"date": "4 Sept 2015", "title": "CDS Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 days. I interviewed at Odyssey House of Utah (Salt Lake City, UT) in Aug 2013", "Interview Descriptions": "You sit in a room with the facility manager and answer pretty standard interview questions. Questions such as what are your strengths and weaknesses, what background do you have, and scenario questions. Mainly what they were looking for is if you can handle stress in a highly chaotic position.", "Interview Questions": "What are some of your strengths that you think will benefit Odyssey House of Utah?"}], [], [], []]