[[{"date": "9 Mar 2023", "title": "Development Assistant - Alumni Affairs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Cooper Union", "Interview Descriptions": "I read a previous interview review from someone who applied to work in this area (Alumni Affairs) that said, \"As far as overall reactions go, I was alarmed by a lack of diversity, seeing that everyone I encountered in that office or on the team was a white woman aged between 40-60. The poor communication from the hiring manager didn't help matters, as I felt that I was strung along during this entire process, reference checks and all.\" and I completely agree with it. I applied to this position and was emailed for an interview about a week later for a Zoom interview. The person who interviewed me seemed generally extremely uninterested and skeptical of me (asking me what felt like leading questions about how this might not be a role for me, despite my background in Development?), and was not easy to connect with at all. I sent a follow-up email thanking them for their time etc, and they just never got back to me one way or another. Felt like they did not respect my time during the interview or afterwards. Not exactly sure what kind of candidate they are looking for, or why I was contacted in the first place for an interview.", "Interview Questions": "What do you like about Development?"}, {"date": "23 Jan 2022", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Cooper Union", "Interview Descriptions": "Depending on your interest, the teacher in charge of the Summer STEM course will interview you personally. It consists of them describing the experience and also would like you to talk about your experiences listed in your resume", "Interview Questions": "N/A"}, {"date": "7 Nov 2019", "title": "Assistant Director of Alumni Affairs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cooper Union (New York, NY)", "Interview Descriptions": "I applied in early October via indeed and heard back from the hiring manager on October 7th.  Had a phone screening, which was quickly moved up to an in-person interview within a few days. I met with the team on October 16th, which seemed to go well.  I immediately sent a standard thank-you note, but heard nothing until I  followed up on October 23rd, at which point the hiring manager indicated that a writing sample was a good idea. I submitted the writing sample on October 25th. However, hearing no response for a week, I followed up again on November 1st, this time around with a list of references because  I was then told that there was another serious candidate. The hiring manager proceeded to call all of my references.  and sent me a polite e-mail wishing me all the best with my future endeavors on Wednesday, November 6th. In her note, she explained that the other candidate had already accepted the position.\r\n\r\nAs far as overall reactions go, I was alarmed by a lack of diversity, seeing that everyone I encountered in that office or on the team was a white woman aged between 40-60.  The poor communication from the hiring manager didn't help matters, as I felt that I was strung along during this entire process, reference checks and all.", "Interview Questions": "There is a strong emphasis on the history, the recent changes in tuition costs and what the alumni organization is doing to change things for the better. I can't recall all of the questions, but definitely be in the know."}, {"date": "23 Sept 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Cooper Union", "Interview Descriptions": "I emailed the professor, and told him I was interested in doing research with him. Then we had a small meeting discussing my qualification. Overall, it only takes two weeks.", "Interview Questions": "The questions are very general about physics, and computer simulation stuff."}, {"date": "31 Jul 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Cooper Union (New York, NY) in Sept 2016", "Interview Descriptions": "Interview was brief and to the point. Interviewer gave lots of background on history of Cooper, detailed daily duties and asked if I would like to do them. Very cordial. Follow-up was almost immediate (two to three days later).", "Interview Questions": "Describe a leadership position you took in a previous job. How did you take the lead? What were the results?"}, {"date": "5 Dec 2019", "title": "Administrative Assistant for Public Programming and New Projects Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Cooper Union (New York, NY) in Feb 2016", "Interview Descriptions": "The interview was conducted by the person who was going to be my supervisor, the Associate Dean of the School of Architecture, and it was conducted in person. We spoke for about 45 minutes about the position and our shared goals for Cooper. I am a Cooper alumnus, so I already knew the culture of the institution which distinguished it from other schools.", "Interview Questions": "Why would you like to work here? What do you plan to contribute to the school? How do you feel about your capacities to perform in the position you are applying to? Can you give examples of how you have developed those capacities and what they are? "}, {"date": "5 May 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Cooper Union (New York, NY) in Sept 2015", "Interview Descriptions": "Interviewed by three people. From my perspective, it seemed like they weren't interested in me as a candidate, since they didn't ask questions that would enable them to get to know my work. They made snarky comments about the institution. Not professional. I'm really not sure why they asked me to come in for an interview.", "Interview Questions": "Tell us about yourself..."}, {"date": "12 Sept 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cooper Union (New York, NY) in Sept 2015", "Interview Descriptions": "My interview was brief but pleasant. Cooper has a lot of history and it pays to know what it is since it looms large in your work at the institution. Administrative jobs usually have basic duties common in the industry, so as long as you're basically competent and have a little experience it's all about a cultural fit.", "Interview Questions": "What was a challenge for you that you overcame in your last position?"}, {"date": "26 Jun 2016", "title": "Computer Center Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Cooper Union (New York, NY) in Nov 2014", "Interview Descriptions": "Easy interivew. Basic questions regarding wires, ports and etc. It had a lot more questions regarding behavior and what not. The questions included things like what is this wire? What is this wire used for? How are these wires used in real life. It was sort of interesting in terms of the explanations that the interviewer gave. The interviewers were all students.", "Interview Questions": "Why do you want to join the CUCC?"}, {"date": "6 Mar 2014", "title": "Matlab Instructor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Cooper Union", "Interview Descriptions": "This is a position for a student currently at Cooper Union.  There is no interview. You are directly contacted by  the department head and asked if you would like the position. Two year agreement. Class size is approximately 10 - 15 students. Weekly 1 hour classes. Spring semester only. Job responsibilities include preparing class lectures and assignments and teaching.", "Interview Questions": "N/A"}], [{"date": "4 Mar 2013", "title": "Communication Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Cooper Union (New York, NY) in Feb 2013", "Interview Descriptions": "I applied with an email on 2/4/2013.  The Assistant Dean called me on 2/12/2013 to meet with him on 2/13/2013.  I met with a panel of 3 people.  It was a very interesting interview and they were all very friendly and welcoming.  I was overqualified for the job and It seemed that there was a another position opening up that they might have in mind for me.  Also they were kind enough to email me and let me know that I did not get the position.  Seemed to be a great place to wok for.", "Interview Questions": "Straight forward and very easy going.  Great group of people."}]]