[[{"date": "14 Jan 2016", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Individual Advocacy Group", "Interview Descriptions": "I found this job on another job posting site. I submitted my application and they called me the next day. I went in the meet with a director and had to make another application. Then they sent me for a background check and a TB test. It was easy but the whole thing took a couple of weeks. I had another job then so I didn't have a lot of time to go in.", "Interview Questions": "They asked me how much experience I had working with people with intellectual disabilities."}, {"date": "3 Jan 2016", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Individual Advocacy Group (Champaign, IL) in Sept 2015", "Interview Descriptions": "Easy, great interviewer. The process was very simple and direct and was in a very convenient and suitable location. My interviewer was very friendly and listened to everything that I had to say. She then went on to be my direct manager and was the best manager that I have ever had.", "Interview Questions": "Name a difficult situation you had to deal with."}, {"date": "7 Feb 2015", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 3 days. I interviewed at Individual Advocacy Group (Moline, IL)", "Interview Descriptions": "Meeting with upper management. Questions about self, family and experience were included. Job description was minimal. Promises for numerous pay raises were made and not followed through with. Lies..lies...and more lies.", "Interview Questions": "Why do you want to work here?"}], []]