[[{"date": "15 Mar 2023", "title": "Career Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Victoria", "Interview Descriptions": "Zoom - 1hour - includes a 5min PPT that you deliver from the perspective of attending a first year new student orientation on the services and resources that career services offers.", "Interview Questions": "What theoretical or practical perspectives would you use when developing curriculum?"}, {"date": "9 Apr 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Victoria (Victoria, BC) in Mar 2023", "Interview Descriptions": "I have two interview the first one was basically a introduction on the second interview they gave me a couple of questions to answer and after I answer this question I got the third one that told me I got the job.", "Interview Questions": "there were questions about the topic but pretty simple and basic questions."}, {"date": "16 Aug 2022", "title": "Programmer Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 days. I interviewed at University of Victoria (Victoria, BC)", "Interview Descriptions": "The interview process was welcoming and comfortable. The interview was conducted through Zoom and went on for forty-five minutes to an hour. The questions involved situational-type questions as well as some general theory questions.", "Interview Questions": "Q1) Tell me about a time when you disagreed with your employer.\r\nQ2) What is the difference between TCP and UDP?"}, {"date": "25 Apr 2023", "title": "Senior Lab Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Victoria (Victoria, BC) in Aug 2022", "Interview Descriptions": "Meeting in a conference room with about 5 people, including a mix of biology professors, staff, and lab instructors. I was asked 10-12 questions over the course of about an hour, and had about 5 minutes at the end to ask questions.", "Interview Questions": "Among other things, they asked about specific experience teaching subjects and lab classes relevant to the position, and about expertise working with various types of laboratory equipment."}, {"date": "14 Jul 2022", "title": "Full Circle Producer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Victoria", "Interview Descriptions": "The interview questions were given beforehand so that we could prepare some answers. Three staff members, including the manager were present in the zoom call and took turns asking the questions verbally.", "Interview Questions": "How familiar are you with the podcast Full Circle?"}, {"date": "12 Mar 2021", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Victoria", "Interview Descriptions": "Applied for current Teaching Assistant jobs on the University of Victoria website (for each department).\r\nYou need to read the qualifications for the course.\r\nIf you passes the course before, your chance is higher.", "Interview Questions": "Once you are selected, there is a meeting with Professor.\r\nGeneral questions about how much you are familiar with course materials.\r\nUsually, this is just a general interview to meet with the Professor."}, {"date": "12 Mar 2021", "title": "Academic Adviser Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Victoria (Victoria, BC) in Jan 2021", "Interview Descriptions": "It was a panel interview with 3 people who took turns asking questions. I also had to prepare a short presentation. There were lots of behavioural questions too. The whole interview lasted about an hour.", "Interview Questions": "Why did you apply for the position?"}, {"date": "24 Nov 2021", "title": "Partner Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of Victoria (Victoria, BC) in Jan 2021", "Interview Descriptions": "A great interview, aproximately one hour with a recruitment team, questions about experience, credentials, personal and professional objectives. Describe past experience and mention singular cases, how I  execute marketing strategies, face to face and dogotal actions.", "Interview Questions": "Describe your experience in the last five years"}, {"date": "24 Jun 2020", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Victoria (Victoria, BC) in Jun 2020", "Interview Descriptions": "I applied online through the UVic website and I got an e-mail to say that I was selected for an interview about a week later. It was a panel interview with 4 people on Zoom. Each person asked me a question and then I was put into \"break-out\" rooms (via Zoom) to interview individually with each person. They asked one question each mostly which were mostly behavioural  questions so I would brush up on the STAR format (situation, task, action, and result). I do\r\n\r\nThe interview was okay, I wouldn't say it was easy but it wasn't difficult.  I'm just not a fan of behavioural questions because it doesn't show how you would do a job but more on your reaction. The questions were based on collaboration, team-work, and how I will do supervising others and show how I can deal with conflict at the workplace.", "Interview Questions": "Tell me about a time you had to learn something quickly? "}, {"date": "23 Jan 2020", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Victoria", "Interview Descriptions": "The group interview was fun, it was an engaging experience. The solo interview is intimidating because it was 3 people interviewing you. However, they were very kind and will provide feedback upon requests. overall it was good.", "Interview Questions": "Any other question you would like to ask the company?"}], [{"date": "27 Sept 2021", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Victoria in Jan 2020", "Interview Descriptions": "It was good, the prof asked questions related to my previous research work, and was curious about my motivation and overall behavior. but majorly it was a technical interview which revolved around basics of my field (energy materials), semiconductor devices, and thesis related questions.", "Interview Questions": "questions related to my MS thesis, XRD and absorption coefficients, solar cells, thin film solar cells etc"}, {"date": "2 Dec 2019", "title": "Work Study Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at University of Victoria", "Interview Descriptions": "I sent my cover letter and resume to the email posted. They got back to me and were efficient about setting up an interview. I received the job offer the next day.", "Interview Questions": "Are you able to work independently?"}, {"date": "30 Jul 2021", "title": "Development Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Victoria (Victoria, BC) in Jun 2019", "Interview Descriptions": "Panel interview with three people who seemed to be very bored and not interested in anything I had to say.  I was shuffled around from room to room and then left for an hour in an empty office to write the practical piece.", "Interview Questions": "If a donor called you angry because he got a parking ticket, what would you do?"}, {"date": "13 Apr 2019", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Victoria", "Interview Descriptions": "I met with the employer at a conference and we had an in-depth chat about the projects and research problems, later we exchanged a few emails, and then I got a job offer.", "Interview Questions": "Nothing in particular, just whether I'm interested in joining the team or not."}, {"date": "8 Jan 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Victoria (Victoria, BC) in Jan 2019", "Interview Descriptions": "Quick and brief and easy and smooth and simple and why 30 words minimum I just want access to other people reviews lololol I am literally just typing more words because it said please write at least 20 words on hiring and interview process", "Interview Questions": "when are you ready to start?"}, {"date": "5 Jan 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at University of Victoria (Victoria, BC) in Jul 2018", "Interview Descriptions": "Interviewed with the prof and he offered me a position at school. The process took less than 2 days and he offered me a volunteer position then he made it a paid position.", "Interview Questions": "Why am I interested in the field of research? What skills I have that they can use?"}, {"date": "18 Mar 2018", "title": "Receptionist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Victoria (Victoria, BC) in Jan 2018", "Interview Descriptions": "A panel interview with me and 5 employees from the dept. in one room, taking turns asking questions.   It was a bit intimidating for someone who has not experienced an interview like that before.  You'd have thought they were interviewing for the CEO or something.", "Interview Questions": "Tell us what you know about our program."}, {"date": "14 Dec 2017", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Victoria", "Interview Descriptions": "Interviewing with Continuing Studies, the process was great -- fair and approachable, with people who want you to succeed.  One great idea I've never seen anywhere else:  when you're offered an interview, they ask you to arrive 10 minutes early to read over the questions before the interview begins.  It must be particularly helpful if you suffer from interview anxiety, but regardless it's super helpful -- you can plan your interview to make sure you talk about all you relevant experience, and you know there won't be any curveballs.  I wish everyone did this!", "Interview Questions": "Lots of \"a time when\" questions, and a few scenarios."}, {"date": "25 Aug 2017", "title": "Helpdesk Analyst (Co-op) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Victoria (Victoria, BC)", "Interview Descriptions": "A lot of various, general questions about hardware and software. And customer service questions too. The panel was super nice and made the whole interview feel very comfortable for the 30 minutes.", "Interview Questions": "What is the difference between IPv4 and IPv6?"}, {"date": "6 Jun 2017", "title": "Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at University of Victoria", "Interview Descriptions": "This was for a summer hire at the English Language Centre (ELC). Just a 3-4 week contract, only mornings. I was told to arrive 20 minutes before the interview, and was handed a piece of paper that said I had to come up with a lesson plan for one of two options: one was present perfect, one was conditionals, for a certain group of students and a certain level of English. I was told to prepare for  a scenario so I wasn't expecting this exactly, which is why I'm sharing this to give others a heads up! (Maybe this is normal in the industry; I'm new to it)\r\nThe first part of the interview was explaining how I would teach that lesson; not a demo, but explaining what you would do and why. Then they proceeded to questions. Some of the questions were quite wordy so I struggled to keep it straight what I was being asked (was also very nervous).\r\nThe interviewers were pleasant or even kind. There were three of them, including a head teacher, director and associate director.", "Interview Questions": "How do you see your training and experience matching up with the programs that the ELC offers? "}], [{"date": "14 Jul 2017", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Victoria (Victoria, BC) in Feb 2017", "Interview Descriptions": "Panel interview with one external and three internal, oral questions took about 40 minutes and written question about 20 minutes. The panelists wrote down my answers while I talked. There was some eye contact. HR was not involved in the interview process.", "Interview Questions": "Tell us about yourself and why you are the best candidate for this job"}, {"date": "20 May 2018", "title": "Learning Strategist/Assistive Technology Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Victoria (Victoria, BC) in Jan 2017", "Interview Descriptions": "There were around 12 questions, based mainly on behavioural examples, it was 1:1 and there was a panel of three people. They were very supportive throughout the interview. Tell us a time when you faced challenges at your workplace and what did you do?", "Interview Questions": "Tell us a time when you faced challenges at your workplace and what did you do?"}, {"date": "26 Jun 2019", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Victoria (Victoria, BC) in Jan 2017", "Interview Descriptions": "Just chatting one on one with the managers and orientation. They ask you your availability and then just assign you times for shifts and that is all for student workers", "Interview Questions": "Availability?"}, {"date": "12 Mar 2019", "title": "Work Study Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Victoria in Sept 2016", "Interview Descriptions": "Very casual asked a few questions just wanted to see if you are trust worthy and a good personality fit. Stay profressional and relaxed. Got back to you quickly. Free work for them so just looking for extra help for them. Good luck.", "Interview Questions": "Typical interview questions "}, {"date": "28 May 2018", "title": "Instructor, College Or University Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Victoria (Victoria, BC) in Jul 2016", "Interview Descriptions": "I've been interviewed by department chair and it was very straightforward about my teaching experiences and my knowledge about the course topic.\r\nThere was questions about  the size of classes that I taught and how I dealt with problematic students. I've been asked about the industry experience related to the topic as well.", "Interview Questions": "What methodology did you use in your teaching?"}, {"date": "1 Dec 2015", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Victoria", "Interview Descriptions": "Fair and balanced; standard behavioural and situational interview questions.  Interview was approximately one hour in length and included a brief (10-minute) presentation on current trends in advising practices and how, as an applicant, my values align with those of the department and how past experiences can inform my practice as an advisor.", "Interview Questions": "Describe your approach to counselling a student who is experiencing personal or emotional distress during an appointment."}, {"date": "24 Mar 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Victoria (Victoria, BC) in Nov 2015", "Interview Descriptions": "not memorable, just the usual questions not describing the true scope of the job. The skills testing was bizarre, the professor who wrote the materials seemed so illiterate that i thought they were trick questions.  Unique situation though, no other department was like the one I was in.", "Interview Questions": "tired old question what are your strengths and weaknesses"}, {"date": "10 Feb 2016", "title": "Assistant of the Writing Centre Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Victoria (Victoria, BC) in Sept 2015", "Interview Descriptions": "Interviewed with two of the specialists for twenty minutes. They were very friendly and had their question ready. I was asked about my experience in the field and then I was given different scenarios and situations that could happen while I was working. I was expected to describe my reaction to each of these situations. they also asked if I had any new ideas or suggestions as to improve the centre. I think being creative about my answers to this question was very helpful in getting the job. After the interview I got an mail with a job offer. after a week of paid training I was set to officially start the job.", "Interview Questions": "How much experience I have and what I would do in stressful situations?"}, {"date": "22 Nov 2015", "title": "House Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Victoria (Victoria, BC) in Apr 2015", "Interview Descriptions": "Applied online through the UVic jobs website, and was sent an email saying an interview would be scheduled shortly. The interview took place on campus in the residence services office. It was a very friendly environment. A tucked in polo shirt or button up should be fine for attire, the office was not wearing formal clothes by any means.", "Interview Questions": "Name a time when you've had to work in a team environment."}, {"date": "24 Aug 2016", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at University of Victoria (Victoria, BC) in Mar 2015", "Interview Descriptions": "Skype interview process  + in-person; usually interviews are scheduled by program director or dean. A lot of interview questions focusing on academic backgrounds such has strength and weakness, what is your long term goal and why you choose this program etc. References need to be provided once you applied for admission and good references will be really helpful.", "Interview Questions": "common questions like background, careers, interests"}], [{"date": "30 Apr 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Victoria (Victoria, BC) in Jun 2014", "Interview Descriptions": "Met with the director and associate director of the research center for approximately 40 minutes. They asked me about my previous academic and work experience and I was hired the next day.", "Interview Questions": "How I got along with co-workers at my previous position"}, {"date": "13 Jan 2014", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Victoria", "Interview Descriptions": "The job assignment was a part of my master's program application.", "Interview Questions": "N/A"}, {"date": "11 Dec 2013", "title": "Alumni Relations Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Victoria", "Interview Descriptions": "I found the position on UVic's UHire job board. Unfortunately the platform is terribly outdated and it was a laborious process to submit my CV. A week or two after the closing date I received a call saying I'd been shortlisted for an interview. The interview was very formal: a panel comprised of 3 people from various departments interviewed me for about 30 minutes. Following that I completed a written skills test. Everyone I spoke to was courteous.", "Interview Questions": "To be honest, the questions were very standard and boring; even the people asking them looked bored. The most difficult part was trying to inject some personality and creativity into my answers while still being professional."}, {"date": "15 Mar 2017", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Victoria (Victoria, BC) in Dec 2013", "Interview Descriptions": "Full day interview with panel. Presentation required. Multiple meetings with staff and administrators and lunch meeting. Interview lasted for 90 minutes and was followed by informal session with colleagues.", "Interview Questions": "Relevant experience"}, {"date": "3 Dec 2015", "title": "Seasonal Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Victoria (Victoria, BC) in Oct 2013", "Interview Descriptions": "meeting with a prof who had taught the class before, meeting with the departmental secretary. I had to prepare some sample lesson plans and talk about my teaching experience a bit.", "Interview Questions": "lesson planning"}, {"date": "19 Sept 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Victoria (Victoria, BC)", "Interview Descriptions": "One interview with a panel of three employees.  Generally one will be your direct supervisor, another from your office, and the latter from another office.", "Interview Questions": "The questions are pretty straight-forward.  Give good examples.  The thing that threw me off was that there was a test!  The tests vary from job-to-job, but are generally about composing emails, using Microsoft Office, or how to deal with a situation.  Mine was partially multiple choice."}, {"date": "30 Aug 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Victoria (Victoria, BC) in Jan 2013", "Interview Descriptions": "The hiring professor ensured that I had the required knowledge of the subject matter along with appropriate supplemental, non-academic and theoretical, skills before offering me the position. Very relaxed interview.", "Interview Questions": "Do you have the required morphological knowledge?"}]]