[[{"date": "17 Mar 2022", "title": "Clinician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wheeler Clinic", "Interview Descriptions": "It was good, the interviewers were supportive and expressed the opportunity for growth and experience within the agency. They were willing to answer any questions that I had at the time regarding the position or agency.", "Interview Questions": "What do you believe are your strengths?"}, {"date": "20 Dec 2021", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Wheeler Clinic (Hartford, CT) in Dec 2021", "Interview Descriptions": "It was very nice to meet with them. They were very transparent and straightforward about what they looking for. They made me feel like I had no reason to feel intimidated because they were very warm and inviting.", "Interview Questions": "How would I handle a task that I feel I can not complete by the due date?"}, {"date": "16 Jul 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wheeler Clinic", "Interview Descriptions": "Structured interview, typical questions for a clinical position. Two step process with a quick response time. Inviting environment was made by the interviwer with time to ask follow up questions.", "Interview Questions": "What's your five year professional goal?"}, {"date": "13 Dec 2021", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wheeler Clinic (Plainville, CT) in Jul 2021", "Interview Descriptions": "It was a super straight forward interview process, scheduled a time to come in, met with somebody. Questions included things like relevant experience in school, past jobs, etc… why this role in particular was of interest to you/what makes you a good fit.", "Interview Questions": "What experience did you have relevant to this position?"}, {"date": "16 Oct 2020", "title": "Benefits Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wheeler Clinic", "Interview Descriptions": "I Interviewed by telephone and was immediately invited to move forward to the next step in the process, which was interview via Zoom.  I was told the interview would be on Tuesday of following week and I would receive a confirmation phone call.  The day came and went.  No follow up phone call. Nothing. I then received a rejection email three days after our supposed scheduled interview.  What an unpleasant surprise to say the least.   I thought this company was a professional up until this point.  Do yourself a favor and find success elsewhere.", "Interview Questions": "Tell me about your experience with Leaves of Absence?"}, {"date": "28 Mar 2021", "title": "Community Health Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wheeler Clinic (Hartford, CT) in Oct 2018", "Interview Descriptions": "Straightforward interview that was very conversational. Basic interview questions, know your resume and motivation. The interview was not stressful and not that long. A tour is also given sometimes. Everyone is very nice and kind. Very open to answering questions.", "Interview Questions": "What are your biggest strengths?"}, {"date": "7 Aug 2018", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wheeler Clinic", "Interview Descriptions": "Quick response, 1 interview, basic questions about history and experience. Brief case scenarios discussed along with how to deal with difficulty patients and staff. How to handle conflict. Salary and benefits discussed.", "Interview Questions": "How would you deal with a difficult client"}, {"date": "16 Sept 2016", "title": "Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Wheeler Clinic (New York, NY)", "Interview Descriptions": "Phone and in person interviews. Good at reaching out to you for follow up. They ask lots of questions which can require very thorough answers. Very friendly and make you feel comfortable", "Interview Questions": "What experience you have related to the position based on the job description?"}, {"date": "25 Jun 2019", "title": "Special Education Paraprofessional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wheeler Clinic (Plainville, CT) in Mar 2016", "Interview Descriptions": "You meet one-on-one with an education coordinator in their school office. They ask you standard questions (no trick questions) and give you a tour of the school. If you do well, they will invite you back to try out in a classroom.", "Interview Questions": "Was there ever a time when you had to handle a crisis? How did you do it?"}, {"date": "13 Oct 2015", "title": "Direct Care Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wheeler Clinic", "Interview Descriptions": "Imterview went really well, it was very forward and simple. They want to confirm your experience and know what qualifications you have for the position you consider yourself fit for.", "Interview Questions": "What background experience do you have with these types of clients?"}], [{"date": "15 Mar 2015", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Wheeler Clinic (Plainville, CT) in Jan 2015", "Interview Descriptions": "Applied on-line. Was called for an interview.  Went to interview the questions the interviewer asked were not hard very easy interview. I was asked to take a clerical exam consisting of:  Microsoft Word, Excel, Grammar and proofreading. Took the exam and was called to go in and meet the manager.  I will know within a week if I get the job or not.  The managers and supervisors are very nice and made me feel very comfortable.", "Interview Questions": "Why do you want to work for us?  What do you know about the company?  Tell about a time you had an upset client."}, {"date": "24 Mar 2014", "title": "Youth Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wheeler Clinic", "Interview Descriptions": "Got a call requesting an interview. Went to the interview and it was bizarre. The director and manager talked amongst themselves 90% of the time. I felt like I was just there to listen to a conversation. I only got asked a few questions. Only lasted 30 minutes.", "Interview Questions": "None. I got asked if I would be willing to restrain youth, deal with verbal abuse, and why I was interested in working for the clinic and their youth population. "}, {"date": "21 May 2015", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wheeler Clinic (Plainville, CT) in Aug 2011", "Interview Descriptions": "depending on position can be 2-3 separate set of interview. it is important to do preparation in advance as they frequently ask about the program details. Sometimes you wont hear from them for 1-2 weeks. Most of the time they are good with returning to you on time.", "Interview Questions": "motivation for change, understanding of the program. past hx and reason for request"}]]