[[{"date": "4 Mar 2022", "title": "Student Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at GBMC HealthCare", "Interview Descriptions": "Interview with recruiter, 2nd interview with nurse manager. Behavioral and slight situational questions.  All on zoom, offered position at 2nd interview. Very nice recruiter and nurse manager and loves GMBC overall.", "Interview Questions": "Name a situation that you had when dealing with a customer at your past job. "}, {"date": "14 Feb 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at GBMC HealthCare", "Interview Descriptions": "I heard at least three different things from three different managers, very disorganized. Miscommunication is a big problem and you’re expected to know things without them telling you, not willing to work with you.", "Interview Questions": "They asked if I had applied to other hospital organizations"}, {"date": "5 Aug 2021", "title": "HR-Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at GBMC HealthCare (Towson, MD) in Jun 2021", "Interview Descriptions": "I was one of the final candidates but nobody ever called to tell me that the job was offered to someone else.  When I finally went to them and learned that I had not been selected, I was also told that the recruiter had left me a message on my cell phone!  That's like breaking up in an email - or maybe worse.  I never got any sort of voice mail message from GBMC and a part of me is glad because that is totally unprofessional conduct.", "Interview Questions": "They asked me how I would handle a variety of leadership issues."}], [{"date": "1 Jun 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at GBMC HealthCare (Towson, MD) in Jul 2020", "Interview Descriptions": "3 part interview, group interview \r\nGot back to me same day \r\nICU\r\nGood experience \r\nApplied as a new grad, HR is very organized and on top of things \r\nHad 2 phone interviews and 1 FaceTime interview", "Interview Questions": "Experience \r\nWhy you chose this position "}, {"date": "11 May 2022", "title": "Patient Services Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at GBMC HealthCare in Feb 2020", "Interview Descriptions": "I went two times in person to do interview with Manager, I went two times in person to do interview with Manager , I went two times in person to do interview with Manager.", "Interview Questions": "Tell me about your self?"}, {"date": "16 Apr 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at GBMC HealthCare (Towson, MD) in Jan 2017", "Interview Descriptions": "Long and tedious.  Asked strange questions. Very little about philosophy of patient care. They seemed more interested in asking hypothetical questions.  It seemed more as if they wanted to see if you were able to give rote answers.  I was not impressed at all.  I found some questions were not relevant to my job or profession.", "Interview Questions": "Do you know what a non profit versus a for profit hospital means?  Of course I do.  Why is that important for a nursing position.  I will not treat a patient any differently."}], [{"date": "17 May 2015", "title": "Systems Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at GBMC HealthCare (Towson, MD) in Dec 2014", "Interview Descriptions": "Normal for higher level engineer. 1 or 2 phone screenings to verify you know what you say you do on resume. Then an interview with manager and final panel interview with director, manager, and senior level engineer. It did take about 2 months before I got offer after final interview, not first time that's happened but I had honestly thought I didnt get position it took so long. I was happy when I did get the call.", "Interview Questions": "Normal what would do, how you handle questions. Not super technical until last interview where senior engineer was present. Nothing too difficult but you had to know what you were talking about. To put it bluntly, you couldn't have BS your way through technical questions. As long as you actually know what you put on your resume them nothing to fear."}, {"date": "5 Jan 2014", "title": "Emergency Department Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at GBMC HealthCare (Towson, MD)", "Interview Descriptions": "First you meet with a nursing recruiter in Human Resources. Then, you are taken to the department where you meet with a Clinical Coordinator and the Nurse Manager. After the Clinical Coordinator asks questions, you have a 1:1 interview with the Nurse Manager.", "Interview Questions": "I didn't get asked difficult questions, but some questions were: \"What do you find the most challenging about working in the ER?\" \"Tell me about a situation where a patient was very upset with you and how you handled it.\" \"Tell me about a scenario where you had integrity.\""}, {"date": "2 Jan 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at GBMC HealthCare (Baltimore, MD)", "Interview Descriptions": "The interview process isn't too stringent.  They are mostly looking to see that your are a thoughtful person that can handle responsibilities at the hospital.", "Interview Questions": "Why do you like healthcare"}, {"date": "4 Feb 2014", "title": "Registration Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at GBMC HealthCare (Baltimore, MD) in Jun 2013", "Interview Descriptions": "There were too many people (unnecessary) in the interview. There were a total of four people and only one person spoke; which was the same person who was conducting the interview", "Interview Questions": "N/A"}, {"date": "23 May 2015", "title": "Environmental Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at GBMC HealthCare (Baltimore, MD) in Mar 2013", "Interview Descriptions": "I had two days of orientation and I spoke very well during the interview.I was explained the process of the job as far as what they accept and what the do not tolerate.I was given a toar of the hospital,introduced to some of the employees,and most the manager treated me with the up most of respect.", "Interview Questions": "how well do you get along with other people"}, {"date": "13 Apr 2016", "title": "Buyer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at GBMC HealthCare (Towson, MD) in Mar 2012", "Interview Descriptions": "Meet with HR - manager - department associates in a conference room- they ask questions personal and business- kind if a ice breaker .  and  then I had a three day have orientation before the actual work week", "Interview Questions": "What is your favorite pass time hobby"}], [{"date": "21 Oct 2013", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at GBMC HealthCare in Jan 2012", "Interview Descriptions": "The hiring process is different for every position. It also depends if you are an existing employee or not. My interview process was an average one. I was well prepared and the hiring managers were easy to talk to.", "Interview Questions": "I have no comment. "}, {"date": "4 Dec 2015", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at GBMC HealthCare (Towson, MD) in Jun 2011", "Interview Descriptions": "one interview. basic questions about experience.    again it was very simple and basic interview.  just study any general interview questions and dont be an idiot/ jerk.  tell them you loe collecting co-pays because they loooove taking peoples copays as soon as posible.  good luck to you all. no college degree requiered.  just make sure you like asking sick people for their money.", "Interview Questions": "tell us about your past experience."}, {"date": "3 Dec 2014", "title": "Practice Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at GBMC HealthCare (Towson, MD) in Dec 2010", "Interview Descriptions": "I was promoted to this position 5 years ago. The hiring process for managers have typically been within the organization and you must know someone (so to speak) to advance.", "Interview Questions": "Do you have a degree? You are doing the work but without a degree you can not advance... "}, {"date": "9 Apr 2010", "title": "Ccu Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at GBMC HealthCare (Towson, MD) in Nov 2009", "Interview Descriptions": "I had one phone interview and an inperson interview with the unit manager.  The interview with the unit manager was preceeded with a share day with another nurse on the unit.  This is typical of interviews in the nursing field.  I was made an offer while I was driving home from the interview and I accepted the offer after requesting and reviewing information about GBMC that was sent to me from HR via e-mail.  Everyone was pleasant and the experience was quite smooth.", "Interview Questions": "What are your weaknesses?"}, {"date": "26 Mar 2010", "title": "Business Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at GBMC HealthCare (Towson, MD) in Mar 2009", "Interview Descriptions": "The interview process was with a director and senior vice present. The interview was relatively informal and conversational with no curveball questions. They also asked about my strengths and what I would bring to the team.  They also asked questions about my resume and my future goals. I had a few follow up phone calls afterwards with another person in the department.", "Interview Questions": "What would you bring to the team?"}]]