[[{"date": "6 Jun 2023", "title": "Office Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Eastern Virginia Medical School", "Interview Descriptions": "Interview conducted on Blue Jeans video conferencing platform, then I was invited for an in-person interview, the final interview was on Blue Jeans, then I was offered the role. Each interview had more staff from the department involved.", "Interview Questions": "Are you tech savvy? How quickly you can pick up new skills?"}, {"date": "17 Oct 2022", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Eastern Virginia Medical School", "Interview Descriptions": "The interview was conducted in a very efficient manner with an outstanding conversation with the hiring manager and supporting personnel. The team provided a very realistic picture of the job and the expectations from the candidate. The interview team was very welcoming and had great questions.", "Interview Questions": "Q. Tell me something that you had to unlearn."}, {"date": "6 Dec 2021", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Eastern Virginia Medical School", "Interview Descriptions": "I would describe the interview process as being generally   positive and friendly.  I expected to hear back regarding the outcome of the process, whether positive or negative,  but I did not. Additionally, the responsibilities outlined in the advertisement did not actually match with the actual responsibilities. So there was a disconnect between what I was presenting as my abilities and what the search committee was actually looking for.", "Interview Questions": "N/A"}, {"date": "23 Aug 2022", "title": "Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Eastern Virginia Medical School (Norfolk, VA) in Jan 2021", "Interview Descriptions": "The Director did not ask me anything that pertained to the job because she had already reached out to a person she knew personally and wanted to make sure she was hired.", "Interview Questions": "Questions had nothing to do with the job I applied for"}, {"date": "18 Apr 2019", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "The process took 2 days. I interviewed at Eastern Virginia Medical School (Norfolk, VA)", "Interview Descriptions": "Lasted maybe 30 minutes.  General questions  the what if questions . It wasn't very long,I was ask why the people that what are HIVAIDS positive don't seek treatment,  I simply  said they feel like they are being judge, or treated .", "Interview Questions": "What if a patient screams at you,   what if a co worker takes things home from the job, HIPPIA questions "}, {"date": "4 Dec 2017", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Eastern Virginia Medical School (Norfolk, VA) in Dec 2017", "Interview Descriptions": "They called me 2 months after I applied which was in September. I had forgotten that I even applied until they called me the week after thanksgiving that Wednesday for an interview friday. I interviewed with 2 managers. It was short.. About 15 mins literally. I was told i would get a call later that day or by noon Monday. They finally called around 3pm today..12/4.. Was offered the position. Start date is 12/18.. So i now have to take an occupational health physical and urine screen.  Salary is decent..A little mlre than what i thought. I am just happy to be working before Christmas because i have been out of work since September.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "29 Jan 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Eastern Virginia Medical School", "Interview Descriptions": "Average time 30-40min. Met with the Principal Investigator and he gave the run down. Pretty standard kind of interview. Be ready to answer in-dept questions about what you know and what you need training in.", "Interview Questions": "What do you know about this position/this lab/their work?"}, {"date": "15 Jun 2017", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Eastern Virginia Medical School (Norfolk, VA) in Jun 2016", "Interview Descriptions": "I was aggressive because I really wanted this job. I did not just submit my resume and hope for the best. After submitting my application & resume online, I found the phone number of the dept. I would be working for, then found the right person to talk to. I emailed this person, introduces myself and said, \"I don't want to be just another resume in the stack on your desk. Please let me interview for the job.\" If I hadn't done this, I would have been passed over. I was actually told I was selected because I was showing genuine interest in the position and they needed someone they could count on to stay. I got a couple phone calls when they were in the decision making process, one was for invitation to an interview.\r\n\r\nDuring the interview, there were 3 people interviewing me in a conference room and they all had questions. They were all very friendly, though, and the interview was a breeze. The questions centered around the type of questions all employers have: What are this person's chances of staying? Are we going to hire him/her and then they leave right after we've trained them? What goals/plans do they have for their future?  Let's find out about this person's work ethic, we want to make sure we are hiring a solid employee. They basically got a sense of my work ethic, my desire to work for the company, my long-term goals, my past achievements, how I've handled problems at work in the past, how independent can I be since my boss is normally too busy to supervise, etc.", "Interview Questions": "Tell us three things about yourself that you haven't mentioned yet."}, {"date": "16 Jun 2016", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Eastern Virginia Medical School (Norfolk, VA) in Feb 2016", "Interview Descriptions": "I applied online and received a call approximately one month later for an interview. The interview was in two parts - one on one with two staff members and then with the executive (all the same day). The interview was relaxed and fairly informal. I was told that a decision would be made by the beginning of March. I followed up and was told that I would be contacted by phone, email or by mail. I never received anything.", "Interview Questions": "Describe your experience working directly with an executive employer? Are you comfortable providing constant reminders to keep him/her on task?"}, {"date": "18 Nov 2015", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Eastern Virginia Medical School", "Interview Descriptions": "I applied online using the system and received e-mail asking me to schedule interview several days later.  I talked to several people in the office, most of them just provided information about what they do.  The would-be supervisor asked typical questions: Tell me about yourself, What is your previous job experience? Why do you want to work here? Do you know how to use a computer? etc.", "Interview Questions": "Typical interview questions"}], [{"date": "6 Dec 2018", "title": "Administrative Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Eastern Virginia Medical School (Norfolk, VA) in Oct 2015", "Interview Descriptions": "Its been over 3 years but my interview was in a conference room surrounded by every single person that worked in that department (including the woman I was replacing). Each member asked questions and wrote their own notes about my answers. I don't remember it being a long interview. It was about 20 minutes, I believe.", "Interview Questions": "How does your background fit into the goals of our department?\r\n"}, {"date": "11 Sept 2018", "title": "Research Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Eastern Virginia Medical School in Oct 2014", "Interview Descriptions": "Relaxed interview environment.  Met one on one with my immediate supervisor in office.  Was asked questions, including ability to learn new techniques.  Presented my transcripts from undergrad for review during interview.", "Interview Questions": "Are you familiar with (X) laboratory techniques."}, {"date": "14 Sept 2015", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at Eastern Virginia Medical School (Norfolk, VA) in Feb 2014", "Interview Descriptions": "2-3 week, phone interview, then a panel interview. Was told after the interview that they would notify me about a week later, but by the time I arrived home, they had already called to offer me the job.", "Interview Questions": "where do I see myself in 5 years?"}, {"date": "17 Aug 2017", "title": "Financial Aid Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Eastern Virginia Medical School (Norfolk, VA) in Jan 2014", "Interview Descriptions": "Very fast and intimate although it was a panel.  It's very important to be well acquainted with the job you are applying for and the skill set you listed on your resume.", "Interview Questions": "Specifics related to the job, the past databases and systems worked on and regulations"}, {"date": "19 Jun 2017", "title": "Data Entry Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Eastern Virginia Medical School (Norfolk, VA) in Mar 2013", "Interview Descriptions": "Contacted and screened my HR. Contacted by department to schedule interview. Interview with department manager. Called within a week and offered position. Salary was non-negotiable. Drug tested the following day. Pretty straight forward process.", "Interview Questions": "Asked about job history."}, {"date": "21 May 2013", "title": "Public Relations Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Eastern Virginia Medical School (Norfolk, VA) in Jun 2012", "Interview Descriptions": "Interviewed with three people - the director of the department and two other PR Managers.  They took turns asking questions.. The interview lasted almost three hours.  In comparison to other interviews I have been on I felt that it was excessive.  Many of their questions were repetitive.", "Interview Questions": "N/A"}, {"date": "13 Sept 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Eastern Virginia Medical School (Norfolk, VA) in Nov 2011", "Interview Descriptions": "Took a while after my application submission to receive interview offer.  Interview was at my lab where I met with the office manager and investigator who was running the lab.", "Interview Questions": "What is your previous experience?"}, {"date": "27 Jun 2012", "title": "Administrative Services Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 days. I interviewed at Eastern Virginia Medical School (Norfolk, VA) in May 2011", "Interview Descriptions": "Phone interview and then one on one interview", "Interview Questions": "What is your worst quality."}]]