[[{"date": "14 Jun 2023", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Nicklaus Children's Health System (Miami, FL) in Jun 2023", "Interview Descriptions": "I really wish the idiot manager would’ve read my resume and realized I didn’t have the necessary qualifications/experience before I had to talk to him for 30 painful minutes.  He basically undressed me the entire time about my lack of knowledge and didn’t ask any questions.  What a terrible experience.  I had been in a similar role before this but apparently not up to his standards!", "Interview Questions": "Tell me about your excel knowledge?"}, {"date": "10 May 2023", "title": "Social Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Nicklaus Children's Health System (Miami, FL) in Mar 2023", "Interview Descriptions": "Conducted virtually with manager and members of the team. Asked to share a bit about myself and was explained role. Asked questions about ability to manage certain situations that can occur in hospital.", "Interview Questions": "Can you tell us a bit about yourself?"}, {"date": "21 Jan 2023", "title": "Sterile Processing Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Nicklaus Children's Health System in Dec 2022", "Interview Descriptions": "Quick and easy information given prior to starting emails sent on how to accept and start the ro was step by step, appointments made only thing the lady on the phone was rude as to asking questions", "Interview Questions": "Basic questions about experience and credentials"}, {"date": "5 May 2023", "title": "HR Generalist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nicklaus Children's Health System (Miami, FL) in Oct 2022", "Interview Descriptions": "The initial screening process with an HR representative was straightforward. The individual was polite and followed a scripted guide during the interview. Unfortunately, I was called late in the morning for an early phone interview. There was not much flexibility on the schedule. It felt that it was more of a \"last minute\" interview.", "Interview Questions": "Why are you interested in this position?"}, {"date": "11 Oct 2022", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nicklaus Children's Health System (Miami, FL) in Aug 2022", "Interview Descriptions": "I got called for an interview, received great feedback, sent thank you notes and never heard back from them. I followed up with an email and got completely ghosted. They told me I would hear back from HR and nothing.", "Interview Questions": "Tell me about yourself and why this position interest you"}, {"date": "6 Jun 2022", "title": "Speech-Language Pathologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nicklaus Children's Health System", "Interview Descriptions": "I was contacted by HR to schedule a virtual meeting with Rehab manager and 2 team leads. The meeting lasted about an hour, with questions regarding my experience and interests asked by the Rehab manager. After I answered all their questions, I was given an opportunity to ask my own questions. At the end of the interview, I was told next steps would be contact from HR.", "Interview Questions": "Tell me about your experience. \n\nWhat is an area where you feel you need the most support?"}, {"date": "24 Mar 2022", "title": "Administrative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Nicklaus Children's Health System", "Interview Descriptions": "Phone screening. Then panel screening. I had to reach out to them for a response regarding a decision. Once I emailed they said they will not be moving forward with me, very unprofessional that they could not inform their candidates of their decision.", "Interview Questions": "Can you describe what peeked your interest "}, {"date": "20 Dec 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nicklaus Children's Health System", "Interview Descriptions": "Positive. Good interview questions and provided an atmosphere that was exciting. Good interviewers and seemed like a great place to work. Overall a great experience I would say. Would like to work here someday.", "Interview Questions": "Tell me about yourself in a few words. "}, {"date": "7 Sept 2022", "title": "SNIP Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nicklaus Children's Health System (Miami, FL) in Dec 2021", "Interview Descriptions": "It was organized, I felt comfortable with the process, and they were quick on getting back to me once the application closed and interviews were being scheduled. The actual interview was also well organized regarding the questions they asked me.", "Interview Questions": "What were the units I was interested in and why I chose their hospital. "}, {"date": "14 Nov 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Nicklaus Children's Health System", "Interview Descriptions": "Went to a hiring event and was interviewed by multiple specialties with relevant questions and a good atmosphere. Standard questions such as stregths and weaknesses and relevant experience.  Thy also asked for your preferences.", "Interview Questions": "What are your stregths and weaknesses"}], [{"date": "19 Aug 2021", "title": "Cardiac Icu and Cardiac Stepdown Unit Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Nicklaus Children's Health System (Miami, FL)", "Interview Descriptions": "The interview for this position was lengthy (over an hour) with rapid fire of scenario questions/ personal questions like what’s your biggest strength and weakness, why should we hire you, what’s your 5 year plan etc.", "Interview Questions": "What is your biggest strength, what is your biggest weakness, tell me about a time you were a team player "}, {"date": "16 Apr 2021", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nicklaus Children's Health System (Miami, FL) in Mar 2021", "Interview Descriptions": "The interview process wasn’t that hard. They are very nice and respectful. They are very clear with what they are looking for and the duties and responsibilities for the job you are interviewing for.", "Interview Questions": "Tell me the duties you did in this job?"}, {"date": "26 Nov 2019", "title": "Volunteer RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Nicklaus Children's Health System", "Interview Descriptions": "Very easy interview process where I was given the volunteer position on the spot. Had to fill out several documents before though including a quiz about safety codes and other information front the orientation packet. Was requested two references.", "Interview Questions": "What do you do in case of a hospital incident "}, {"date": "13 Feb 2018", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nicklaus Children's Health System in Jan 2018", "Interview Descriptions": "You apply online for the Horizon program. It was only open a week long since they receive many applicants. The next day, I received a request for a video montage interview. You are required to answer about 4 questions in 2 minute long responses. If you pass that round, they ask to schedule a panel interview.", "Interview Questions": "What is constructive criticism you received and how did you handle it?"}, {"date": "30 Oct 2017", "title": "RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nicklaus Children's Health System", "Interview Descriptions": "First was an online application,  if you were accepted there was second  video interview, and  then if accepted, was  was a panel interview with about 10 interviewers.", "Interview Questions": "Describe a time you had to think on the spot"}, {"date": "20 Nov 2017", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Nicklaus Children's Health System (Miami, FL) in Oct 2017", "Interview Descriptions": "Two months prior to the official start date, an application for the Horizon Internship Program was posted on NCH the careers page. After submitting an application, if selected to move onto the next round, you would receive an email requesting a video interview that was comprised of a couple of questions. This video interview is meant to replace phone interviews, and weed out weaker candidates from stronger ones that would fit well within the system. The video interview was fairly simple, and allowed for candidates to rerecord their answers as many times as they desired. Questions should be answered in under two minutes each. After completing the video interview, within a couple weeks if selected to move onto the final round, candidates would be invited to attend an in person panel interview with the head's of all the hiring departments. Candidates who have been selected will be notified shortly after all interviews have been concluded. As soon as the candidate receives an job offer over the phone, the candidate will begin to receive a slew of emails detailing the onboarding/hiring process.  The hiring process involves (aside from filling out paperwork online) going in person to the employee health clinic for a physical, blood draw, and drug screen. The future employee will also be asked to visit corporate headquarters to sign the contract, get their picture taken for their ID, and receive a parking decal for parking on hospital grounds.", "Interview Questions": "Most of the questions they asked me during my interview were related to my volunteer experience at the hospital, my experience on the oncology floor I did my practicum on, and specific details that I had on my resume.  \r\nThe questions weren't difficult, they mainly just want to get to know you. Even if you do get a tough question, keep your cool, its okay to take a minute to process it and come up with an eloquent answer instead of answering right away with word vomit. \r\nMake sure to show them your smile, make sure your answers are personal and unique - work in personal experiences and tell a story with your answer instead of just giving a generic response. For example, if they ask \"why pedatrics\", instead of saying \"I love kids\", tell them a story of a time when you really enjoyed teaching/spending time with a child, make it personable. They WILL remember stories, and you want to stand out from the crowd. I cannot stress this enough,  NO GENERIC ANSWERS.\r\nPrepare beforehand, look up nursing interview questions but don't just prepare for those. Think out of the box. Because this interview was for a new grad position, they know that you don't have much floor experience so they're not going to ask you random, out of the blue questions that a more seasoned nurse will be asked, but do prepare for situational questions such as \"what would you do if xyz happened, how would you react, what would be your next step?\".  \r\nLastly, do your research about the company and work in their mission and vision into your answers! They want to know that you'll fit in well with the culture they are cultivating on campus. I had a friend who was asked why she wanted to work at NCH and she gave the most generic answer instead of working in how different the hospital is from other hospitals, and the distinct services they have to offer to their patients and their families.\r\nDo your homework!"}, {"date": "30 Jan 2018", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nicklaus Children's Health System (Miami, FL) in Oct 2017", "Interview Descriptions": "Basic questions, \"why would you like to work with us?\" \"tell us about a time you had a conflict with a customer and how did you handle it?\" I dressed with business attire, the interview described the role of the position, pay, benefits and what's expected as a new hire.", "Interview Questions": "\"Tell me about yourself\""}, {"date": "5 Jan 2018", "title": "Senior Supply Chain Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nicklaus Children's Health System (Miami, FL) in Oct 2017", "Interview Descriptions": "A panel of 6-8 people asking questions about your experience and situational questions regarding office eitiquette. Each person went around the room and chose a question of their choice in regards to your personal and professional life.", "Interview Questions": "What would you do if you find yourself in a difficult situation with another conworker. How would you resolve disagreements in the office. "}, {"date": "6 Sept 2017", "title": "Strategy Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Nicklaus Children's Health System (Miami, FL) in Aug 2017", "Interview Descriptions": "The interview process was very long and at times seemed uncoordinated and with a lack of preparation. At the end of the interview process I never received an answer neither from the hiring manager or the HR manager as to whether I was accepted or declined for the role. There was a lack of professionalism.", "Interview Questions": "They required me to provide a business case explaining my suggestion as to how to implement a strategy for the organization."}, {"date": "12 Jul 2017", "title": "Registered Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Nicklaus Children's Health System (Miami, FL) in Jun 2017", "Interview Descriptions": "I was called based on referral, interviewed the next day for about an hour and was offered a position immediately.  They told me to keep in touch and let them know of my progress for my exams and certifications.", "Interview Questions": "How well do you work under pressure?"}], [{"date": "28 Oct 2016", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Nicklaus Children's Health System (Miami, FL) in Oct 2016", "Interview Descriptions": "The first step was your regular apply and include resume.  The second step, I was emailed a link to upload video answers for an online interview.  The final step was an in-person interview at the hospital with more than 10 people in the room! They were all friendly but the crowded room was intimidating!", "Interview Questions": "If you were a drug, which one would you be and why? If you were an animal, which one would you be and why, What do you like to do outside of work? What's your favorite specialty to work in? Which is your favorite patient to work with? Name a time when you didn't get along with a coworker and what happened? Draw a picture of what a home looks like to you."}, {"date": "26 Oct 2016", "title": "Urgent Care Charges Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Nicklaus Children's Health System (Miami, FL) in Oct 2016", "Interview Descriptions": "Got a call from the HR dept to schedule an interview. Got there 15 minutes before and everything went fine. Was a little disappointed to find out the HR dept was not fully informed about the details of the position like the location of the opening and there will be a second interview. I asked those things to the HR person over the phone and got a completely different answer than what I was told at the interview.", "Interview Questions": "Why are you looking for a job ?"}, {"date": "21 Nov 2017", "title": "Senior Software Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Nicklaus Children's Health System (Miami, FL) in Sept 2016", "Interview Descriptions": "Phone interview.   Followed by technical phone interview.  The person asking most of the questions was reading from an internet list.   Expecting word-for-word answers, which I gave as the answers.  I could hear them saying the answers were what I was answering.    Rudimentary and average level questions.   A lesser Engineer could have answered what was asked.", "Interview Questions": "Specifics of ETLs, SQL queries and Oracle DBs"}, {"date": "20 Jul 2016", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Nicklaus Children's Health System (Miami, FL) in Jul 2016", "Interview Descriptions": "Interviewed for NICU position. 3 total interviewers including hiring manager, nurse manager, and clinical nurse educator. Very friendly and open to questions. Wish the NICU nurses went on transports instead of having a transport team outside the NICU. The interview lasted about 30 minutes. It was a very pleasant experience.", "Interview Questions": "Why should we hire you? What would your former boss say about you?"}, {"date": "22 Jun 2017", "title": "Cook Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nicklaus Children's Health System (Miami, FL) in Jun 2016", "Interview Descriptions": "First they do an interview by phone wich i pass and then a face to face interview with the operation manager director in the time and day scheduled, they ask mamy question to check how fit i could be for the position", "Interview Questions": "The check may expirience for the position. My liabilty to do the job and how abailable i am"}, {"date": "15 Feb 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nicklaus Children's Health System", "Interview Descriptions": "Applied online, heard back after a month for an in person interview. The interviewers were very welcoming and were accommodating to me. They asked very basic interview questions and elaborated on the program and what is expected of me. Asked about my future in the company.", "Interview Questions": "Strengths weaknesses"}, {"date": "8 Dec 2016", "title": "Senior DBA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Nicklaus Children's Health System (Miami, FL) in Jan 2016", "Interview Descriptions": "This depends on the personnel and how good he wants to grow. Once that is clear, management does a pretty good job at promoting from within. One amazing fact i saw, management provided training and resources to help you on the career grow.", "Interview Questions": "what qualify you for this position?"}, {"date": "9 Jun 2015", "title": "Staff RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Nicklaus Children's Health System (Miami, FL) in Jun 2015", "Interview Descriptions": "I call called to have an interview with the hiring manager, I was very short. I am still waiting for an answer. I am not sure if they are going to call, but she said to give a week or two.", "Interview Questions": "easy questions"}, {"date": "10 Aug 2015", "title": "Mental Health Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Nicklaus Children's Health System (Miami, FL) in May 2015", "Interview Descriptions": "HR assistant called and schedule an interview, then you interview with the HR assistant and then with both the HR assistant and the Manager or the department. If you pass that interview then they started the hiring process.", "Interview Questions": "Tell me about yourself.\r\nWhat are your strengths?\r\nWhat are your weaknesses?\r\nWhy do you want this job?\r\nWhere would you like to be in your career five years from now?\r\nWhat's your ideal company?\r\nWhat attracted you to this company?\r\nWhy should we hire you?\r\nWhat did you like least about your last job?\r\nWhen were you most satisfied in your job?\r\nWhat can you do for us that other candidates can't? \r\nWhat were the responsibilities of your last position?  \r\nWhy are you leaving your present job?\r\nWhat do you know about this industry?  \r\nWhat do you know about our company? \r\nAre you willing to relocate?  \r\nDo you have any questions for me?"}, {"date": "5 Aug 2015", "title": "Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nicklaus Children's Health System (Miami, FL) in Apr 2015", "Interview Descriptions": "The interview process is very easy it only lasted about 15 minutes the same all questions that you ask her every other interview so everything is typical.  No it's your basic interview like every other job so you really don't have to prepare for anything just call him now", "Interview Questions": "What do you want to work for Miami Children's Hospital?"}], [{"date": "16 Jul 2015", "title": "Registered Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nicklaus Children's Health System (Miami, FL) in Feb 2015", "Interview Descriptions": "All Pharmacy Supervisors were there, it was more of a one on one with the director. The interview was generic overall. They want to know what you have done in the past and if you're competent, just as many other jobs do.", "Interview Questions": "What are your strengths and weaknesses"}, {"date": "28 May 2015", "title": "Lawson Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Nicklaus Children's Health System in Feb 2015", "Interview Descriptions": "Talked to the manager, skype interview with director and they seemed to be interested in my profile. Recruiter was not happy the way they handled the communication. It looked to me they use interviews to gather information so that they can get their job related questions answered.", "Interview Questions": "Lawson ctp env patches etc"}, {"date": "28 Jul 2017", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Nicklaus Children's Health System (Miami, FL) in Sept 2014", "Interview Descriptions": "Nice, good opportunity, good salary, equal opportunity , HR, every thing was easy, i felt confiable with the person doing my interview, i get an offer and I accepted", "Interview Questions": "Experience "}, {"date": "4 Aug 2014", "title": "Speech-Language Pathologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nicklaus Children's Health System (Doral, FL) in Mar 2014", "Interview Descriptions": "I had my interview scheduled for one day by the centralized scheduling office. Then my interview was moved up by more than a week partly because they really needed to fill my position but also because the hospital had the joint commission survey going on. There were at least 10 people at my interview from different disciplines and almost all of them asked me different relevant questions. 2-3 of those people asked me questions from the form interview questions.", "Interview Questions": "What would you recommend for an 11 year old with Down's syndrome who many people report that they cannot understand the child? "}, {"date": "15 Jan 2014", "title": "Administrative Assistance Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Nicklaus Children's Health System", "Interview Descriptions": "quick and easy", "Interview Questions": "N/A"}, {"date": "25 Mar 2013", "title": "Software Developer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 days. I interviewed at Nicklaus Children's Health System (Miami, FL)", "Interview Descriptions": "Initial phone screen, then face-to-face interview. In person interview with management representative, senior technical architect, and two developers. The management and senior architect interviews both involved waiting for some time, and afterwards were very rushed affairs with many references to how busy they were. The peer interview was more pleasant and professional, with questions that were more appropriate to the position. The peer interview was cut short by management.", "Interview Questions": "They will ask you a 'think outside the box' question similar to questions that Microsoft is famous for asking. Not difficult but makes you think it might be a trick question."}, {"date": "16 Aug 2017", "title": "Collector Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nicklaus Children's Health System (Miami, FL) in Feb 2013", "Interview Descriptions": "They were reading off a paper not a very personal interview made you feel like you were taking a test very impersonal. Questions felt more like a interrogation and not really wanting to know me or my experience so I could of written anything on my resume", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "1 Aug 2015", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Nicklaus Children's Health System (Miami, FL) in Jan 2013", "Interview Descriptions": "Interview was typical.  Questions focused on skillset.  Received call, then was scheduled to come in for interview.  Once interviewed, I was called for additional interviews.  At the end, recruiter called to let me know I was chosen.  Then I was scheduled for orientation.", "Interview Questions": "How to build specific queries based on use case"}, {"date": "23 Oct 2012", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nicklaus Children's Health System (Miami, FL)", "Interview Descriptions": "Waited a long time for interview", "Interview Questions": "regualr questions"}, {"date": "23 May 2014", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Nicklaus Children's Health System in Jul 2012", "Interview Descriptions": "Hiring was a smooth process as well as the interview process. The interview was very imformative about the position expectations and I was given a moment to ask questions.", "Interview Questions": "How have you gone the exra mile at a previous work place?"}], [{"date": "10 Oct 2012", "title": "Manager Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Nicklaus Children's Health System (Miami, FL) in Apr 2012", "Interview Descriptions": "Fragmented. People have no clue hoe to interview. It's easy to get it.  I bet they hire many dysfunctional people.", "Interview Questions": "Role play a scenario on conflict. "}, {"date": "8 Aug 2015", "title": "Pharmacy Business Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Nicklaus Children's Health System (Miami, FL) in Mar 2012", "Interview Descriptions": "HR Screening, business leader skype, in-person panel interviews.  Personality tests were administered and consulted throughout.  In person interview was paid for with flight and hotel.  Some members of the interview panel did not adhere to their meeting commitments. Recruiter negotiated salary in an aggressively.  Executives were prepared and engaged during their sessions.", "Interview Questions": "Very interested in cultural fit"}, {"date": "17 Mar 2014", "title": "Regional Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Nicklaus Children's Health System (Miami, FL) in Dec 2011", "Interview Descriptions": "Was an internal candidate - submitted resume, internal panel of other regional directors and VPs for detailed interview that contained questions on all service lines and budgets", "Interview Questions": "what else would you do for the MRI service line to increase volumes (not including marketing) "}, {"date": "29 Aug 2014", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Nicklaus Children's Health System (Miami, FL) in Jul 2011", "Interview Descriptions": "Took forever to get a call. Phone interview was formal. Personality test was easy but they never go back and explain anything to you. It would be nice to get an explanation. Some questions on the phone were like \"are you for real\". If you have a question, forget it. They wont answer any calls.", "Interview Questions": "Mostly casual questions. No difficult questions."}, {"date": "10 Aug 2015", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Nicklaus Children's Health System (Miami, FL) in Jan 2011", "Interview Descriptions": "I submitted an online application (you cannot speak face-to-face with HR until they approve this).  I participated in a phone interview first, then I was called in (the next day) to meet the director of my unit for a face-to-face interview.  The following day I was offered employment and I was able to negotiate my salary.", "Interview Questions": "Why do you want to work at Miami Children's Hospital?"}, {"date": "9 Jul 2012", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nicklaus Children's Health System (Miami, FL) in Jan 2009", "Interview Descriptions": "I applied 2 months before I was contacted. \r\nDuring the in-person interview. Half of the panel didn't make it. \r\nSome of the Directors had no clue about the responsibilities of the position so they didn't ask many questions. It was like if they were told they needed to be there but didn't really want to.\r\nIt felt like I got there at the right time as the interview was quick.", "Interview Questions": "What would you do if you need to report your boss due to a policy compliance violation?"}, {"date": "17 Oct 2012", "title": "Director of Technology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nicklaus Children's Health System (Miami, FL) in Nov 2008", "Interview Descriptions": "The process was rather simple once you got past HRs screeners", "Interview Questions": "No difficult questions were really asked mainly because that directors and managers I interviewed with had a very limited expertise which i noticed during 6 different interviews   "}, {"date": "9 May 2010", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Nicklaus Children's Health System (Miami, FL) in Apr 2008", "Interview Descriptions": "The interview process consisted of a panel of staff nurses, medical and nurse directors of the emergency room.", "Interview Questions": "How would you handle a difficult situation with a colleague or peer? Give and example."}]]