[[{"date": "7 Sept 2021", "title": "Campus Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intervarsity", "Interview Descriptions": "There is a very detailed application that was 30+ pages by the time I finished answering all the questions on it. The interview was a 1-2 conversation which was the easy part - the application was the lengthy and more difficult portion.", "Interview Questions": "How would you handle different ministry situations"}, {"date": "10 Aug 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Intervarsity", "Interview Descriptions": "I reached out to the regional director for an opportunity. The application was long and covered most of the interview. The interview was about 90 minute long with 5 people.", "Interview Questions": "How would you invite someone to Christ?"}, {"date": "23 Jul 2020", "title": "HR Generalist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Intervarsity", "Interview Descriptions": "I had a recruiter on Indeed reach out to me because her client, Intervarsity was interested in setting up a phone interview. I was hesitant at first, but after a few emails I decided to give it a chance. \r\n\r\nOverall, the phone interview was a little bit uncomfortable and odd. The manager stated that this role would be responsible for fundraising for part of their own salary. This would include asking for donations from family, friends and different organizations. \r\n\r\nThe manager then asked, \"are you religious or of Christian faith?\" After I told him that I didn't necessarily follow a specific religion, he stated that \"unfortunately if you were to be put up against candidates who were of Christian faith, they would have the upper hand.\" \r\n\r\nI understand that Intervarsity's mission is to promote the Christian faith, but to make someone feel inferior because of their religion is unacceptable. If I knew that this organization was this strict about religion, I wouldn't have gone through with the phone interview.", "Interview Questions": "Are you religious? Which religion do you follow?"}, {"date": "15 Jun 2023", "title": "Campus Staff Minister Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Intervarsity in Feb 2020", "Interview Descriptions": "Inconsistant in their process, and were unable to provide a clear idea of what they were looking for in their staff. Requiring staff to fundraise their salary makes it exclusive and unequitable.", "Interview Questions": "Share expereince calling someone to faith"}, {"date": "28 Jul 2021", "title": "Donation Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intervarsity (Madison, WI) in Sept 2018", "Interview Descriptions": "Not professional; the interviewer was not paying attention to me and also did not know enough about the role and what was needed. Made a comment on my age and the 'life I have left to live'.", "Interview Questions": "How often do you attend church and what type of faith-based extra curricular events to you attend?"}, {"date": "1 May 2018", "title": "Campus Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intervarsity (Madison, WI) in Mar 2016", "Interview Descriptions": "More like a conversation than an interview. They asked questions regarding your faith journey, skills for the job at hand, and scenario questions. Overall, not as difficult or nerve wrecking as other job interviews.", "Interview Questions": "Questions about faith journey and general skills for the job at hand"}, {"date": "5 Jan 2016", "title": "Campus Staff Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Intervarsity (Atlanta, GA)", "Interview Descriptions": "The interview process was very laid back. I already had a relationship with the hiring manager, so it was more about ways that I could grow in my this new position.", "Interview Questions": "What are your weaknesses?"}, {"date": "18 Apr 2014", "title": "Campus Staff Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intervarsity", "Interview Descriptions": "Fill out a long and detailed application.  Application is almost as if it is an interview, but on paper.  An area director along with a regional director will meet with you to discuss your answers and may ask additional questions.", "Interview Questions": "Views on homosexuality, sex, and money.  "}, {"date": "3 Sept 2016", "title": "Program Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Intervarsity (Austin, TX) in Feb 2012", "Interview Descriptions": "The job interview was formal but also relational. They really do try to get to know you beyond more than your qualifications. They ask about your life journey and significant experiences. They also ask situational questions regarding what you will do and how you arrive at that conclusion. I would say it's pretty straight forward of a process.", "Interview Questions": "What would you do if your entire staff team quit?"}, {"date": "31 Aug 2015", "title": "Campus Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Intervarsity (Golden, CO) in Feb 2012", "Interview Descriptions": "The application process is extensive and is very helpful in evaluating for yourself if this is a job you would enjoy and be qualified for. The interview process following the application is short and the phone call interviews are not extremely formal. The interviewer made it a helpful time for me to learn more about the organization and position while also interviewing me for my fit in the role.", "Interview Questions": "Why do you want this position?\r\nHow have you been prepared for this position?"}]]