[[{"date": "24 May 2023", "title": "Adjunct Faculty Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Louis University (Chicago, IL) in Mar 2023", "Interview Descriptions": "It was a 45 min long interview. They didn't ask me any technical question from my subject expertise. The questions were very routine, situational and behavioral questions. They gave me a few situations and asked me how will you handle this.", "Interview Questions": "1) What is your teaching philosophy? 2) How will you cater a diverse set of students? 3) What are your expectations from students in Chicago? 4) How will you behave if some student is not behaving properly in a classroom?"}, {"date": "9 Feb 2023", "title": "Chief of Staff Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Louis University", "Interview Descriptions": "Exchanged emails with HR and then setup a Zoom call with the Provost. Easy and pleasant process. But that’s the end of it. I was ghosted after the Zoom interview. For a position at this level, I expect more from a reputable employer. Do better NLU.", "Interview Questions": "Why do you want to work here?"}, {"date": "24 Jun 2021", "title": "Administrative Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Louis University (Chicago, IL)", "Interview Descriptions": "My experience was mostly very casual and friendly. I had an initial Zoom interview, then I put together a small presentation prior to an in-person interview and walked through it for the team. Then I met with a higher-up for a 1-on-1 interview.", "Interview Questions": "A lot of focus on my interests and technical skills, as well as why I was interested in working at NLU."}, {"date": "26 Mar 2021", "title": "Admission Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Louis University", "Interview Descriptions": "You do a group process interview that is filled with over 30 people. It is then narrowed down to 10. & then they pick the one person.  It's very rushed and you hardly get to explain your experiences or talk about why you are qualified. You have to say the right things at the right moment in order to be selected.", "Interview Questions": "How would you approach recruiting students? "}, {"date": "5 Mar 2021", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National Louis University", "Interview Descriptions": "Was told to watch a long presentation on Zoom. Followed up with a lengthy assignment to which I never heard back from anyone on the team. Waste of time. Never even a generic \"We've Moved On\" email. Never had that happen before - thankfully I found a better position in a matter of days.", "Interview Questions": "What makes you want to work with us?"}, {"date": "22 Dec 2020", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at National Louis University in Nov 2020", "Interview Descriptions": "I had 2 video interviews with them and that was all. I have yet to hear back from me. Very unprofessional when a company does not Inform you that you did not get the position . Companies should always let you know and not leave you waiting", "Interview Questions": "Why would you be a good fit for this position ?"}, {"date": "7 Dec 2019", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Louis University (Chicago, IL) in Dec 2019", "Interview Descriptions": "The interview was an online Zoom meeting with six current professors representing blended model, online, traditional classes and practicum student teaching supervisor roles.  Different content areas in education were represented in the interviewers as well. Everyone was kind and welcoming during the process. They heavily focus on serving the whole student socially, emotionally and educationally.  Great experience!", "Interview Questions": "How do your experiences relate to what you would be doing here?"}, {"date": "29 Jul 2019", "title": "Web Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Louis University (Chicago, IL) in Jun 2019", "Interview Descriptions": "I had my first interview in April 2019. I was asked to view their website that was still under maintenance and give my thoughts. I told them Cold Fusion was out of date and then was asked to code in Cold Fusion which I completed with no experience in CF. I did not get the offer. I was then contacted June 2019 again even though I did not reapply to the position. They wanted to see my websites and asked what I used to build them. They told me they are planning to leave CF behind and rebuild their site. After that interview, I was sent an email a month later saying \"position has been filled\". Feels like they contacted me to get ideas on recreating their website by viewing the technologies I have used because there were no technical questions this time. They picked one of my websites and asked what I used to build it.", "Interview Questions": "Iterate, in Cold Fusion, 1-10 and display only evens. "}, {"date": "8 Apr 2019", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Louis University", "Interview Descriptions": "Phone interview, then in-person interview with 2 managers. HR person got in touch with basic information and then offer was made 2 weeks later. Relatively quick and easy process. No softball questions or anything too challenging.", "Interview Questions": "Generic interview questions - tell us about a difficult situation with a student and how it was resolved."}], [{"date": "5 Oct 2018", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Louis University (Chicago, IL)", "Interview Descriptions": "Got an email about interview invitation and I visited the interviewer's office and had about 30-40minutes of conversation. I was questioned specifically about the contents on my resume and basically, I was explained about the program and about the things I need to expect once I start working.", "Interview Questions": "How can I help students to engage during the class hours and encourage them to complete required assignments?"}, {"date": "25 Sept 2018", "title": "Assessor and Training Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at National Louis University (Chicago, IL) in Aug 2018", "Interview Descriptions": "I applied earlier this summer and received notice that they wanted me to come into interview in August. There was a panel of four interviewers and overall was a positive experience, even though was a long one.", "Interview Questions": "What do you know about the McCormick Center of Early Childhood Leadership? "}, {"date": "21 Apr 2018", "title": "Career Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National Louis University (Chicago, IL) in Nov 2017", "Interview Descriptions": "Traditional process - experienced a phone interview, then in-person group interview, then job offer. The whole process moved quite quickly. The interview was quite informal, but the questions asked were not particularly easy.", "Interview Questions": "Tell me about yourself"}, {"date": "17 Nov 2015", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Louis University", "Interview Descriptions": "I applied online and was contacted for a video interview with the search committee after about 2 weeks. It was a screening interview and the questions were more at the macro level. The interview lasted about 20-30 minutes. They asked about my opinion on various educational issues (e.g. diversity) and there were no specific questions about my research and teaching experience.", "Interview Questions": "What is the most important issue for educators today?"}, {"date": "24 Mar 2015", "title": "Assistant Professor (Non-tenure) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Louis University in Nov 2014", "Interview Descriptions": "Interview consisted of me giving a presentation, then one on one interviews with the Dean and Provost. After the interview it took three months for the HR department to make a decision regarding my status. I was told that the department was undergoing leadership changes and would get back to me. This process was unnecessarily long considering they did not offer me the position.", "Interview Questions": "How will you help prepare teachers to work in an urban school?"}, {"date": "26 Jul 2014", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at National Louis University (Chicago, IL) in Mar 2014", "Interview Descriptions": "The process was fairly straight forward. Everything is listed on their website. They have a sheet now that gives an idea or screenshot of what someone doing the job can expect. Apply online and follow the details exactly on the career website. It's pointless to try to call into the Human Resources department.", "Interview Questions": "\"What if\" type questions were asked, but nothing was too out of the box"}, {"date": "17 Nov 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Louis University (Chicago, IL) in Jan 2011", "Interview Descriptions": "You were first called on the phone by HR  interview was about 15 minutes of standard questions. HR invited me to meet and  Interview with director of admissions. After director of admissions you then meet with the director boss, but typically people who make it to that stage usually are going to get a job offer.", "Interview Questions": "What has lead you to choose admissions advisor as a career"}]]