[[{"date": "19 Jan 2019", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Lahey Health Behavioral Services in Sept 2017", "Interview Descriptions": "It was a one-round interview in which the program manager and director interviewed me. The interview lasted roughly 40 minutes. Much of the interview was informative and provided me with the perspective of the expectations and qualifications needed to be successful for the position.", "Interview Questions": "What is your education history?"}, {"date": "9 Mar 2017", "title": "S&R Former Employee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Lahey Health Behavioral Services", "Interview Descriptions": "Brief phone call interview followed by a group interview that is easy in my opinion since your trying to present your self as an employee and show your group skills. Not so much a competition to impress just your ability to comunícate with others.", "Interview Questions": "Have you ever caught anyone stealing? "}, {"date": "15 Apr 2020", "title": "Family Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lahey Health Behavioral Services (Beverly, MA) in Jan 2017", "Interview Descriptions": "Multiple interviews, interview with current employess.  Onboarding took a few weeks.  Pay doesnt reflect work production.  Interview process was fairly easy.  Good for interns, why process with filing so long.", "Interview Questions": "Greatest accomplishment"}, {"date": "5 Jan 2016", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Lahey Health Behavioral Services (Beverly, MA) in Mar 2015", "Interview Descriptions": "Interviewer was friendly and personable, made me feel comfortable and the interview was more of a conversation.\r\n\r\nThe process started as a phone screen and although there was a lapse in communication between the phone screen and the actual interview, I have no complaints.", "Interview Questions": "Why I was interested in an internship in human resouces"}, {"date": "24 Jan 2018", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Lahey Health Behavioral Services (Ipswich, MA) in Jun 2014", "Interview Descriptions": "The director at the time was very thorough and gave a good overview of what the job consisted of. I learned a lot about what the day to day structure consisted of and what to expect.", "Interview Questions": "Why I wanted to work in a residential facility and what were my long term goals."}, {"date": "4 Feb 2018", "title": "Methadone Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Lahey Health Behavioral Services (Danvers, MA) in Jun 2014", "Interview Descriptions": "I met with the clinical supervisor for more than 2 hours.  I had to provide a drug screen. The company had to do a background check. Also I have three references but I am not sure how many of them they called. Shortly after that interview I was offered the job.", "Interview Questions": "What makes you want to work with this population? What kind of evidence-based treatment do you use?"}, {"date": "16 Mar 2016", "title": "Family Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lahey Health Behavioral Services (Beverly, MA) in Mar 2014", "Interview Descriptions": "First there was a phone interview and then I was invited for an in person interview with the Senior Family Partner.  I was offered the position during this interview, and accepted at that time.  The process was casual and very comfortable and I was at ease immediately!  I met the director who gave the ok to the Senior Family Partner to hire me.  I was also given a tour and met several other Family Partners.  All in all it was a welcoming and pleasant experience!", "Interview Questions": "Why do you want to be a Family Partner?\r\nWhat do you bring to the position?"}, {"date": "7 Jun 2013", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Lahey Health Behavioral Services", "Interview Descriptions": "Went for an interview, extremely qualified.  Offered job within hour of interview.", "Interview Questions": "N/A"}, {"date": "7 Apr 2014", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Lahey Health Behavioral Services (Tewksbury, MA) in May 2013", "Interview Descriptions": "I only had one interview.  I heard of the job through my co-workers from another job who had already switched from the company I was at to the company I currently work for.  I forwarded my resume to my co-worker's email, she was at my current company already training for the site opened and was also picking up hours per-diem at my former employer's site.  My co-worker then forwarded my resume to the hiring manager for my position who called me within the next few days for an interview.  After the forty five minute interview, which included me filling out the application as I had not actually applied for the job, I was called back a few hours after by HR and was offered the position.  Once the paperwork was straightened out I put my two weeks notice in to my other job.  The interview was fairly easy, no difficult questions.", "Interview Questions": "N/A"}, {"date": "23 Nov 2013", "title": "Outpatient Clinician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Lahey Health Behavioral Services (Salem, MA) in May 2013", "Interview Descriptions": "Initially contacted by email and resulted in phone communication. Scheduled a meeting to meet with Site Director at certain date and time.  Arrived at the site 15 minutes early and was told to sit in the waiting area.  Thirty minutes go by and the interview had not yet started.  I went back to the reception desk and asked if the Site Director knew I was there waiting, to which the receptionist replied \"Yes, she knows\".  Finally, the interview started without an apology for the delay.  The Site Director was distracted (kept jumping up to get coffee or write a note).  Unprofessional from start to finish.", "Interview Questions": "\"What would your supervisor consider to be some areas that need improvement?\""}], [{"date": "10 Jun 2015", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lahey Health Behavioral Services (Lowell, MA) in Sept 2011", "Interview Descriptions": "Met with director. She didn't check references. Hired me on the spot. Then checked references. I told her of my experiences in the Emergency Room. Was giving her ideas that she hadn't thought of. I was amazed at how primitive the services were. Didn't even need to get credentialed by the hospitals to work in them.", "Interview Questions": "N/A"}]]