[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Patient Greeter", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Jun 2023", "job_title": "Patient Greeter in Portland, ME", "duration": "N/A", "pros": "Easy job, friendly people, fun interaction.", "cons": "Sometimes gets a bit boring but overall not bad."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Change in leadership changed the company", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Apr 2023", "job_title": "Supervisor in Portland, ME", "duration": "N/A", "pros": "Good pay Great building Good retirement", "cons": "Leadership was built by who you knew and who you were related to. Leadership at site level had no voice in operations or decisions. They let 5 people go two weeks before Christmas because their positions were cut due to budgeting. All of these people had been there a minimum of 5 years and one of them almost 20 years. They did not replace anyone but instead gave their responsibilities to others who were already stretched thin."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Data Analyst", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Feb 2023", "job_title": "Senior Analyst in Portland, ME", "duration": "N/A", "pros": "Great company with good benefits and employees.", "cons": "Data validity and departmental structures are not all stable."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Poor management", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "3 Feb 2023", "job_title": "Registered Nurse in Brunswick, ME", "duration": "N/A", "pros": "Great benefits and decent pay", "cons": "Bad managers and changes that they made worsened the patient experience."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Changing Values", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Jan 2023", "job_title": "RN Supervisor in Gorham, ME", "duration": "N/A", "pros": "pay/ benefits/ perks coworkers management", "cons": "lack of job security- positions being eliminated"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Over worked! Burnt out! No development", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "25 Sept 2022", "job_title": "Member Service Representative in Portland, ME", "duration": "N/A", "pros": "The benefits are okay. Yep.", "cons": "Everything. Leadership cancels 1x1 almost all the time. There is hardly any guidance, or mentoring given to staff. They provide no feedback besides lower your call time. I have only spoken with my supervisor for 10 minutes in the last 6 months due to answering high volume calls. They do not mention that the high volume last ALL YEAR LONG. There is absolutely no down time to what so ever. Callers are always angry over the wait time and take it out on staff. The queue gets up to 90 plus people at a time and the wait time is easily over an hour to speak with a rep, and once they get a rep they let their frustration out on them (when the staff is just as frustrated). You literally are glued to your desk answering call after call after call as soon as you start your day to the end. Lack of information and resources given to reps so we can provide accurate answers. Training is only educational for Medicare and the basics of the plans and then you are thrown to the wolves not even knowing how to perform the actual job. Not to mention that members tear into for not knowing the answer you are desperately looking for. You only have 3 ten minute breaks for the whole day and those you must use to go to the bathroom. Leadership slashed our bonuses in half this year when it was needed MOST while keeping theirs the same. The technical problems and phone issues to top it off are absolutely terrible and it’s a company wide known issue. There is about 20 different systems that you are required to use because they will not upgrade to a more advanced system. It takes about ten minutes to sign into all these systems each morning which we are not allowed to put on our time cards. Thats an hour of OT each week we don’t get paid. We are also now expected to work until the queue is empty or close too, even past our clock out time to help manage the queue for the closers, so the lack of empathy for our personal lives /plans is right out the door. Leadership can’t keep it fully staffed because of the turn around due to all these issues above along with the terrible pay. People at Walmart are starting with higher pay, less stress, and they seem to refuse to adjust it even with the inflation at an all time high. People usually quit after a few weeks or a few months. SAVE YOURSELF and YOUR MENTAL HEALTH and do not work here! Also, may I add that the disorganization is unbearable. On top of everything else, they do not even provide you with the equipment needed to do the job at home when they are the ones sending you home. I need two monitors and I only got one, so I had to get a stand prop for my laptop to use as a second tiny monitor. I also had to buy my own headset because the one provided did not work. I have had to buy multiple headsets now. I stay at this job only to help the people calling in who need help. This company also presents its self as a great place to work but if you work on the phones you must work all holidays and never get to participate in fun activities that other departments may be involved in. There is also no room for growth besides answering more calls. Lastly, the supervisors are suppose to help staff manage the call volume when the queue gets insane, but I have not seen that happen for a long time now because they are to busy interviewing to fill positions they will soon by empty again. I have worked in this role for years now and I am about fed up."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Benefits", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "16 Jun 2022", "job_title": "Nurse Practitioner in Portland, ME", "duration": "N/A", "pros": "MP has some good employee benefits, however, will need to step NP/PA salaries up to attract experienced providers.", "cons": "Quality bonuses are near impossible to achieve if you don’t have a competent medical assistant To make matters worse Senior leadership increased the pay out threshold during the pandemic when patients were reluctant to be scheduled for heath screenings like mammograms and colonoscopies. \nMany providers felt played by the organization \nwhen they were denied their quality bonuses during the pandemic. Many providers missing it by only a few points."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Avoid The Koolaid", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "17 Apr 2022", "job_title": "Health Plan Program Manager in Portland, ME", "duration": "N/A", "pros": "The people below the senior leadership level are great and welcoming, they genuinely want to succeed and help improve health outcomes of the community.", "cons": "As long as the organization is led by a retired physician who last practiced in the 90s the organization will continue to fail. Senior leadership doesn't understand how to devote enough resources to actual operate at scale. Projects are often convened and then fizzle out when leadership attention goes to the next shiny thing. Leadership claims to be a great place to work but the sub culture is that of the cult of personality for whatever charismatic leader is in the spot light. Once someone comes along and upstages them with another idea they eventual become less relevant, loose their political capital and then they eventually disappear. \r\n\r\nGreat if you are a front line employee, forget trying to be a middle manager or director unless you are liked. If you aren't, they'll invent performance issues and quietly exit you with a paltry severance package if you don't fight them. \r\n\r\nAlso, before female leaders who are intimidated by younger men with greater levels of education. Gender discrimination goes both ways but this was unexpected."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Think hard before coming to work here", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "24 Oct 2021", "job_title": "Anonymous Employee in Portland, ME", "duration": "N/A", "pros": "Across the board, pay exceeds market rate for the local area. Great benefits as well. Generous time off structure. Advancing at the health plan used to be the purview of a network of \"friends\" who were mostly men. If you were in with them you could get promoted. If not, you couldn't expect to. This has changed somewhat in recent years.", "cons": "Top execs have total control over this organization and decision making sometimes isn't grounded in logic. Weak leaders thrive. If you come here try to disconnect your mind. You will be on your own to get your job done and it might be a major uphill effort. You'll need to make nice no matter what. If you work as a manager or supervisor you will have to report out on some pretty useless metrics to serve the \"Martin's Point Management System.\" The system is supposedly based on Lean manufacturing principles but at Martin's Point it results in a lot of extra work that often times produces nothing in terms of results. This is just one of many ways MPHC wastes money and their behaviors are hardly consistent with Lean. The company will try to keep you happy by over-paying and giving you pie. You'll gain weight. MPHC does little to nothing to encourage it's own workforce to be healthy other than provide health insurance coverage. Which you'll need due to the ill effects of swallowing your stress."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great Company", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Nov 2022", "job_title": "Customer Service Representative in Portland, ME", "duration": "N/A", "pros": "Good benefits, great people to work with.", "cons": "Not a lot of room for advancement"}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Jul 2022", "job_title": "Appeals Specialist in Portland, ME", "duration": "N/A", "pros": "Solid benefits, room to grow", "cons": "Sometimes people are really good at their jobs and not good managers"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Jan 2022", "job_title": "Registered Nurse in South Portland, ME", "duration": "N/A", "pros": "Culture\r\nWork life balance\r\nLimited micro management\r\nSalary\r\nGreat work environment", "cons": "Slow trickle down communication\r\nNot acting on quickly on employee/patient complaints \r\nTransparency is not a priority"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Overall great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "7 Sept 2021", "job_title": "Manager in Portland, ME", "duration": "N/A", "pros": "Fast-paced work environment where continuous improvement and high performance is expected and rewarded. Opportunities offered for learning/development and career growth. Pay and benefits very competitive. Organization is solid financially. Strong team atmosphere with really caring coworkers. Excellent reputation in community and very high scores for  employee satisfaction on Great Places to Work surveys year after year.", "cons": "Rapid growth over the past few years has created challenges. The organization needed to evolve and bring on  high level leaders with broad industry experience, which they have now done."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "g", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Jan 2022", "job_title": "English Teacher in Portland, ME", "duration": "N/A", "pros": "Martin's Point was a great place to work. Managers are kind and understanding.", "cons": "Working in health care during this time is extremely difficult."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "BE CAUTIOUS", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 May 2021", "job_title": "Patient Service Representative in Portland, ME", "duration": "N/A", "pros": "Co-workers, benefits, pay, and that’s it.", "cons": "Favoritism is an ongoing issue here. Management in the contact center are very unqualified. Super fast burnout rate! Management doesn’t care about their employees and does not treat us fairly! Most days it feels like I’m back in grade school being hunted by management if you go one minute over your break.\r\nYou don’t get separate sick days from your vacation days."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Fantastic place", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Sept 2021", "job_title": "Phlebotomist%2FLab Assistant in Portland, ME", "duration": "N/A", "pros": "They care about you as an individual and will assist you with your weaknesses so you can become a stronger employee.", "cons": "I haven’t found any yet"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Wolf in sheep’s clothing", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Mar 2021", "job_title": "Director in Portland, ME", "duration": "N/A", "pros": "Front line people want to do the right thing and genuinely care about customers. Invest in community.", "cons": "Leadership and culture are not what they appear to be in the surface and the longer you are there and the higher up you move the more concerned you should be. They are slow to act and it is a truly emotionally damning place to work. They are not prepared and adaptable for the future, their talent continues to escape and their caring for people is superficial. Business operations are not solid and investments are not made in the right places."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Quantity over quality", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 May 2021", "job_title": "Contact Center Patient Service Representative in Portland, ME", "duration": "N/A", "pros": "Pros... hmm this is tough... working from home is about the only one! Which will soon come to an end.", "cons": "Supervisors very cold, which is understandable because the job is miserable. Never enough employees. \r\nPatients do not get the care they need and are paying for. Long wait times.\r\nPay is not as good as others say it is on here - haven't had a raise in 2 years and starting pay is about the same as what I made in high school and I have a great education. \r\nBenefits are expensive.\r\nYou get watched like a hawk and almost every phone call you answer gets listened to.\r\nSupervisors not open to change.\r\nBonuses stopped when COVID hit, when we needed them most. \r\nThis place is all about the number of calls you can take per hour (QUANTITY) versus taking your time with the patient and talking them through/explaining important steps in their care (QUALITY). We have a lot of elderly patients and the wait times and unconcerned PSRs who only want to breeze through calls are really hurting the quality of care that all patients receive. \r\nDon't work here unless you want to be flooded with weird emails containing obvious fake praise and weird memes. \r\nNo room for growth here at all.\r\nUnfair treatment unless you are making/exceeding the call volume goal."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great company, great people.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "22 Feb 2021", "job_title": "Family Nurse Practitioner in Portland, ME", "duration": "N/A", "pros": "Middle management is supportive, upper management is accessible if needed. Generous time off and CME benefit.", "cons": "Complicated compensation structure beyond your base pay salary.\r\n Some objectives are difficult to meet depending on your patient population(e.g annual diabetic eye exams). Sign-in to EMR is tedious, morning boot up is slow. Dragon is available , however, not really supported by IT, would make chart completion possibly quicker for provider if 1:1 training was readily available."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Poorly managed and perpetually bleeding talent", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "19 Aug 2019", "job_title": "Anonymous Employee in Portland, ME", "duration": "N/A", "pros": "You'll get a ton of free food. The salaries are quite high, especially for a nonprofit. A few teams are genuinely talented, and I believe the company really does try to do right by their patients and members. The CIO seems to be a genuinely good leader, and would probably make a good CEO if he actually sticks around that long. Big bank account and strong balance sheet.", "cons": "Where to begin?  The problems start at the top. The CEO is a genuinely nice man, but this company needs someone to take firmer control and provide clear vision, direction, and accountability. As it stands now, it's more like the company is made up of many unrelated fiefdoms pulling in different directions and jockeying for position. Top to bottom the company is rife with managers who epitomize the peter principle. The better ones seem afraid to speak the truth for fear of being the tall poppy.\r\n\r\nThe technology is dated and sometimes downright archaic, to the point that it's detrimental to business processes. Being stuck using it may jeopardize your career and prospects of working elsewhere.\r\n\r\nThe other reviews criticizing the culture are spot on. The phony \"culture\" of mandatory fun reigns supreme, and this has led to an organization where results aren't particularly valued by comparison. Actual talent and new ideas are often seen as a threat. Depending on your department, being good at your job and trying to improve things may get you nowhere fast - or even straight up shown the door. Top talent is forever fleeing for greener pastures, and turnover is a constant issue. Being cash-rich and badly managed has allowed the company to become bloated and disjointed while somehow still feeling understaffed for many of the core functions."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Toxic environment", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "10 Mar 2021", "job_title": "Registered Nurse in Brunswick, ME", "duration": "N/A", "pros": "Very good pay and benefits", "cons": "Management is awful. People are treated like they aren’t important and are easily replaced. Not caring."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "DO NOT APPLY", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "9 Feb 2021", "job_title": "Member Engagement Specialist in Portland, ME", "duration": "N/A", "pros": "Free coffee (it's cheap) decent location, some nice co-workers.", "cons": "Extremely poor management, micromanagement, terrible training, poor communication, awful \"culture\" almost cult like."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Terrible company", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Feb 2021", "job_title": "Customer Service Representative in Portland, ME", "duration": "N/A", "pros": "None. Treated as a number.", "cons": "This is the worst place to work! \r\nYou are treated as a number. \r\nManagement is no helpful WHATSOEVER!! \r\nThey do not help their employees grow in anyway!\r\nThe feedback they do offer is insulting, irrelevant, and not productive."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "good place", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "9 Jan 2021", "job_title": "Manager in Portland, ME", "duration": "N/A", "pros": "People are good and Work life balance", "cons": "move faster on decisions to progress"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Fit their mold, or else - an emotionally disturbing environment", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "1 Apr 2019", "job_title": "Anonymous in Portland, ME", "duration": "N/A", "pros": "Good, hard-working people;\nHave managed to preserve some of the feel of a small local business;\nDo nice things for the community;\nStrong balance sheet", "cons": "Executive leadership does not trust anyone below them to do their job -everything has to go through layers of people before a decision is made;\nMust do your work and handle everything in exactly the way the organization tells you with no freedom to think for yourself or innovate;\nDay to day operations and programs are hampered by inefficient and ancient technology that does not promote improvement and requires many manual processes and work arounds;\nContinue to lose some of their best talent that has cared the most and brought them through hardest times because they are not willing to invest in people and act with no sense of urgency;\nVery hyper-critical of personal characteristics and make many assumptions without seeking to understand and giving benefit of doubt - will basically beat you down till you believe you aren’t good enough or valuable;\nOne side of the business is treated like royalty and can do no wrong, while the other is treated poorly and will always be the bad guy regardless of results or how hard they try to do the right thing;\nSpeak very ill of anyone who departed - even though they essentially push people out"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Health care provider", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "6 May 2016", "job_title": "Anonymous Employee in Portland, ME", "duration": "N/A", "pros": "Salary, benefits and work schedule - there are still a few good people left there trying to make a difference under nearly impossible odds", "cons": "Very dysfunctional management team; pushes a false company culture on employees; high rate of employee turnover which management ignores;  department budgets are more based in inner cliques and not on customer needs; a lot of 'smoke and mirrors' leads to lack of trust and confidence in management by employees; most management is done by fear and intimidation; really not a \"Great Place to Work\""}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Wrong Leaders in Wrong Roles", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Dec 2019", "job_title": "Health Plan in Portland, ME", "duration": "N/A", "pros": "Under the right leader, in the right department, a solid place to spend time on meaningful work", "cons": "It has been painful to watch the many leaders (directors, vps, coo) who have been promoted into key leadership roles that are simply not qualified or because they were next in line or irrational decision making by the CEO"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Conflicted on what it wants to be in this world. Great place to work or make a lot of money", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Mar 2015", "job_title": "Front Desk in Portland, ME", "duration": "N/A", "pros": "Solid benefits, the pay was lower than area and they started to see that and try to increase salaries to meet that expectation. The training was lazy. They are way too top heavy. Some groups might have 3 or 4 different manager, supervisor role that no one understands. Great 401k match. Good education reimbursement.", "cons": "The training was lazy. They are way too top heavy. Some groups might have 3 or 4 different manager, supervisor role that no one understands. No room for growth. After 4 years and many times trying to move to different departments I had to leave to another company."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Somewhat decent pay, bad place to work", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Jul 2017", "job_title": "Patient Service Representative in Portland, ME", "duration": "N/A", "pros": "Pay is decent, but not really worth it for the stressful environment. Good experience gain. Bonuses and rewards are nice. A good amount of friendly and helpful co-workers. Tuition reimbursement.", "cons": "Extremely high turnover rate due to poor management. Management is hired that has no healthcare background and is frustrating to deal with. Poor workflows. Tremendous lack of help from the team's 'lead'. Lots of changes to keep up with. There is little to no work standardization. Healthcare benefits are expensive. Clinical staff can be unhelpful and rude a lot of the time. Many employees are unhappy here, but stay for the pay.  Unnecessary change in rules are often implemented."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work and develop", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 Feb 2017", "job_title": "Patient Service Representative in Scarborough, ME", "duration": "N/A", "pros": "Management that listens and ACTS on concerns, great communication and transparency between upper management and line level staff, concern and attention paid to all employees, freedom to voice any and all concerns, great career and personal development", "cons": "Benefits aren't cheap, but that's satandard in the workplace now. Lead positions aren't utilized the way they should be for best implementation and support, communication between departments can be a challenge"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Next time", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "26 Apr 2016", "job_title": "Marketing in Portland, ME", "duration": "N/A", "pros": "Benefits\r\nCompensation\r\nEmployee Benefits\r\nComfortable work environment\r\nThe healthcare side seems like a good environment\r\nStaffing ratio's", "cons": "Innovative ideas and workflows are not always adopted without a fight. People have their roles deeply embedded here, and any threat to the status quo is seen as negative. \r\n\r\nThere's a lot of  negative attitudes and cliques in administration. It's hard to navigate the layers of bureaucracy in terms of workflow.\r\n\r\nLeadership is internally focused and they do what has worked for them in the past."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Lots of turnover, be prepared for change", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "4 Jan 2015", "job_title": "Anonymous Employee in Portland, ME", "duration": "N/A", "pros": "It was growing while I was there so it had some interesting changes and career opportunities.  Mostly very nice people.  Reasonable expectations.  Whole HR and Mktg depts turned over during my time there.  Nearly every leader changed aside from the CEO.", "cons": "HR dept must have tripled in size, disproportionate from rest of company.  It brought many changes including culture of the company.  At leadership levels, personality became more important than competence or accomplishment.  It was sad to see."}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Easy job, decent benefits", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "31 Mar 2012", "job_title": "Registered Nurse in Portland, ME", "duration": "N/A", "pros": "Good benefits when I worked there.  Good pay.  Decent amount of vacation time.  Get your birthday off, lots of paid holidays.  Work is pretty easy.  The doctors and some of the staff really care about the patients.", "cons": "Some offices understaffed and others completely overstaffed with unnecessary positions, seems like poor management to me.  If you do not drink the corporate cool aid you will have a hard time stomaching the propaganda from upper management."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Nice People, Management somewhat scattered and some groups not so great to work for", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Jul 2012", "job_title": "Analyst in Portland, ME", "duration": "N/A", "pros": "Overall the people are personable, responsive, and they want to do a good job. Salaries are pretty decent for Maine (I'm in an IT-type of job), benefits are a 4 out of 5. I love the group I work for as my manager is super and the team is fun...like a bunch of friends getting together in the office. My manager actually wants me to be successful and is truly supportive. Work/life balance in my department is excellent, but that is not the case across the company.", "cons": "Senior management team seems to have a tough time with focusing - almost like a group version of ADD. They are often the victims of the \"bright, shiny object\" syndrome and are having trouble transitioning from a \"mom and pop\" atmosphere to something larger and able to compete with the big guys in the industry. Unfortunately because this is Maine and the labor pool is small, there are a frustrating number of people who simply don't know how to do their jobs. In a larger market like Boston, these folks wouldn't be employable due to lack of skills. I find that because of my level of experience, I am teaching a lot of people \"higher\" than me in the food chain how to do their jobs."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Working at Martin's Point", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "24 Aug 2015", "job_title": "Anonymous Employee in Portland, ME", "duration": "N/A", "pros": "At Martin's Point you'll find great coworkers, competitive salary and challenging work. Most departments offer a team environment where coworkers are always willing to help you out. There are lots of fun culture activities such as Pie Day at Thanksgiving and barbecues at each site in the summer.  Overall I had a positive experience working there.", "cons": "At Martin's Point work/life balance is always difficult. Although for years they have tried to curtail the number of meetings throughout the day, it's still a work in process. There are lots of demands and expectations put on leaders, which cause a high volume of turnover in the leadership staff."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "A very good place to work.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Mar 2011", "job_title": "Knowledge Worker in Portland, ME", "duration": "N/A", "pros": "People care about each other. Staff and management are increasingly pushing to make MPHC a great place to work. The focus on culture is unlike any other company in Maine. Great Benefits. Fast pace. Lots of food. Cutting edge technology. Work for a non-profit. Extra insight into the state and future of health care. Family feel.", "cons": "Fast pace and constant change without much time to reflect and perfect our work. Growing size has made it more challenging to maintain a tight workplace community between sites/departments."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Supervisor Patient Services", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "17 Dec 2015", "job_title": "Supervisor Patient Services in Bangor, ME", "duration": "N/A", "pros": "Customer focus. Great team to work with. Bangor team has a flat hierarchy and there is consistent encouragement to expand and grow in area of interest to you.", "cons": "This office is unfortunately closing in January 2016 as Martins Point has chosen to no longer offer a presence in the Bangor area."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Committed to taking care of their Medicare and military members and health care patients.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "18 Jul 2014", "job_title": "Anonymous Employee in Portland, ME", "duration": "N/A", "pros": "Two separate lines of business, a health plan and have 9 health care centers.  Committed to taking excellent care of their members and their patients.  Great benefits to employees: vacation time, 401K, Holidays, Gym benefits.  Excellent personal development opportunities through their local courses.  Dr. David Howes (CEO) is a true visionary in health care and is dedicated to the mission of revolutionizing healthcare.  CEO  is very enjoyable to talk with,  down to earth and extremely approachable.", "cons": "A large challenges of the organization is that it is very fast paced and changing environment.  I have been in healthcare for over 20 years and know that healthcare is ever changing, but Martins Point is in rapid change mode.  Your job description can change quickly and not always for the better and not always within your control.  This can leave employees feeling like it is difficult to master a skill and has led to many good people leaving the organization.  Management changes occur frequently, too frequently.  Wonderful values and culture but they are not always lived.  Managers do not \"Walk the talk\" when it comes to the values and culture.  Great training opportunities for Managers but unfortunately the personal development courses are not required for managers, so they fall short of being good managers.  There has been many employees who's jobs have been re-purposed and have been laid off.  However the severance package is very fair, including allowable for outplacement services."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "A good place to work...becoming a great place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "25 May 2011", "job_title": " in Portland, ME", "duration": "N/A", "pros": "Committed and compassionate management, cutting edge of health care reform personal development opportunities (training and development within your position). Senior leadership is truly committed to developing middle management and front line staff.", "cons": "Fewer opportunities for growth into higher level (director and above) positions. VERY fast pace to change, frequent leadership turn over at the executive level. Though in fairness this is slowing down."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Good compensation and benefits, but limited opportunities for growth", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "2 Oct 2020", "job_title": "Patient Services Representative in Portland, ME", "duration": "N/A", "pros": "Compensation is usually on the higher end, compared to other health care companies in the area", "cons": "It is a fast-growing company, but for current employees, there are limited opportunities for growth. The company tends to hire more externally than internally."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great place to work, overall", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Aug 2015", "job_title": "Business Intelligence Reporting Analyst in Portland, ME", "duration": "N/A", "pros": "I was working in the IT/Technical side of the company. I felt respected and valued by my team and supervisor. The work was interesting and challenging. Helpful, smart people, and would gladly work there again. The pay was very good.", "cons": "Because it's healthcare, there wasn't much opportunity to work remotely. We had some flexibility within our group but overall, this is not a place that can offer much flex-time (just the nature of healthcare)."}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Dedicated staff, lack of focus at the top", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "5 Oct 2012", "job_title": "Anonymous Employee in Portland, ME", "duration": "N/A", "pros": "The employees in all areas of Martin's Point are caring, dedicated, and very hard working. People put their heart and soul into their work and the company.", "cons": "As workloads grow the priority seems to be - do everything. This causes some to wonder how they can live the \"we take care of ourselves\" value."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Anonymous", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Aug 2016", "job_title": " in Portland, ME", "duration": "N/A", "pros": "There are some very good people that work for this company.  The pay is competitive and on the higher side for a non-profit.", "cons": "This company has a \"cult like\" culture.  This is an organization where the tenured employees  often feel threatened by new emerging talent to the extent where they will pick an individual apart and report perceived insufficiencies  to the sector  leader repeatedly, until the person starts to believe there is something fundamentally wrong with them.  This company does not embrace team members and leaders that are professionally direct and or question the status quo.  Therefore change management does not move swiftly.  This is extremely disheartining as there truly is no room in this organization for anyone that is not \"just like them\".  This unfortunately stifles enthusiastic new employees that bring an incredible amount of talent to the table.  This is a known issue within this organization and among the  Leadership team, however continues to be allowed.  This company lacks diversity and has a firm grip on \"this is how we've always done it\".  The culture of \"raising the bar\" has created and environment where fear is so strong that many team members are more focused on self preservation than working with new and existing talent collaboratively.  Many of the leaders have not worked in other organizations, therefore are incapable of seeing a perspective other than  what is directly in front of them.  This company could have great potential however there are fundamental flaws in the culture that if not corrected will more than likely continue to hurt the reputation and deter new growth opportunities and innovative ways of thinking. Small company with a very narrow way of thinking."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Data Intern", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Apr 2016", "job_title": "Intern in Portland, ME", "duration": "N/A", "pros": "Great people and culture. The work was very interesting and I enjoyed the time I spent working for this organization.", "cons": "There were no cons in the role that I had. I appreciated my time with Martin's Point and I am happy that I had the opportunity to work there."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Excellent wages, excellent benefits", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "10 Dec 2015", "job_title": "Patient Service Representative in Bangor, ME", "duration": "N/A", "pros": "Great benefits and great pay. They have really good values that they live by every day. They value their employees and show their appreciation.", "cons": "I don't have any cons. It was a great place to work. It was very sad when they closed the Bangor Maine office, both for staff and patients."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Very high turnover rate, unstable environment", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "29 Nov 2014", "job_title": "Anonymous Employee in Portland, ME", "duration": "N/A", "pros": "Portland is a great city -- fabulous restaurants and skiing, beaches.", "cons": "The turn over rate is so high that you never know who you will be working with or for. The company strategy changes every couple of months. Company has a very bad reputation and is looking to merge with a huge out of state company. Without another company taking over management, things look bleak."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Medical staff are great other employees not so much....", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Mar 2018", "job_title": "HIM Specialist in Portland, ME", "duration": "N/A", "pros": "Lack of supervision. Not much is expected of you. You can take time of easily. Breaks are taken whenever you want.", "cons": "No one does their job because they don’t care. Very clicky and lots of interoffice conflicts. High turn over rate as well as boring workload. Things could be done much more efficiently if training was done properly."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Wonderful Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Jul 2016", "job_title": "Anonymous Employee in Richmond, ME", "duration": "N/A", "pros": "Martin's Point is a great company to work for. They truly care about their employees and their patients.", "cons": "There are a lot of changes happening and a lot of people who are looking to management for answers."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Miserable place to work", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Mar 2020", "job_title": "PSR in Portland, ME", "duration": "N/A", "pros": "Good starting pay, good benefits", "cons": "Major turnover company wide, unqualified management, rewarded only for number of calls taken instead of patient care, too much hiring from outside instead of promoting talent from within."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Reality does not match what they portray in interviews", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Jan 2015", "job_title": "Health Plan in Portland, ME", "duration": "N/A", "pros": "Very friendly staff and you get lots of free snacks/lunch.", "cons": "Poor leadership, disorganized work system, and low retention rate. Unprofessional work environment. CEO is most highly paid health care leader in Maine (?!), but revenue is shrinking, doctors are constantly leaving the clinics, no stability, highly political; no trust"}], [{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Enjoyed my time there", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Sept 2016", "job_title": "Data Warehouse Analyst in Portland, ME", "duration": "N/A", "pros": "Diverse, challenging work environment with great pay and benefits for the area. I worked with a fun, dynamic group.", "cons": "Disorganized upper management lacking focus."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Beware", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "16 Apr 2020", "job_title": "Provider in Portland, ME", "duration": "N/A", "pros": "Location and  Co workers , pay", "cons": "Management , culture  of Favoritism, intolerance of independent thought"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place to work", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 Oct 2015", "job_title": "Systems Specialist I in Portland, ME", "duration": "N/A", "pros": "This company takes pride in their employees. There are great benefits and the people are fun to work with.", "cons": "No cons come to mind!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Patient Service Rep", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "14 Apr 2016", "job_title": "Anonymous Employee in Gorham, ME", "duration": "N/A", "pros": "Great company to work for, great benefits", "cons": "leadership inconsistencies, need to improve work flow, clinical staff needs better support"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "It is a Great Place to Work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "11 Aug 2017", "job_title": "Administrative Assistant in Brunswick, ME", "duration": "N/A", "pros": "Good Benefits, fun activities, great training classes", "cons": "possibly too many meetings, locations are spread out"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "QA Engineer", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Apr 2016", "job_title": "QA Engineer in Portland, ME", "duration": "N/A", "pros": "Company is very good for employemnt", "cons": "Only cons I felt is the company uses same tools years."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not sure how it could be worse", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "3 Apr 2016", "job_title": "Human Resources in Portland, ME", "duration": "N/A", "pros": "Great patients and members who deserve the best", "cons": "Unqualified leaders who have no idea what they are doing. The chief club is a joke, a very rich and exclusive club that boots anyone with sensible ideas"}]]