[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Sightsavers is a great International organisation", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "29 May 2020", "job_title": "Programmer Officer Neglected Tropical Diseases in Yaoundé", "duration": "N/A", "pros": "Sightsavers is a great organisation that provides an efficient and conducive environment for her employees which is adapted and based on employee's need and comfort with particular attention to persons with disabilities and the mental wellbeing of staff. The organisation provides accessible workspace and comparative wages to their staff. Staff enjoy a good work life balance with 25 days of paid annual leave, 5 days of compassionate leave, 5 days of paternity and adoption leave and a maternity leave of at least 14 weeks upward depending on the local laws. \r\nWith all these benefits, staff are able to function properly in achieving the organisation's vision and mission of a world where no one is blind from avoidable causes and where people with disability participate equally in the society. \r\nThe organisation is build on good policies and framework which guide employees and beneficiaries during execution of our programmes. Some of these policies include safeguarding policy, whistleblowing policy and code of conduct for employees just to mention a few. All these policies and frameworks ensure employees and beneficiaries are protected from sexual harassment, extortion, physical and mental abuse especially to children whilst implementing our programmes. \r\nThrough the organisation, I have gained international experience through our exchange programmes in the different countries where we work and international capacity building workshops toward improving staff performance whilst developing our career path. \r\nSightsavers is a perfect organisation to begin and grow your career for those interested in positively improving other people’s livelihood through universal health coverage and sustainable programmes targeting the less privileged and vulnerable persons of the society.", "cons": "Despite it's great status, Sightsavers is a comparatively flat organisation in terms of career growth due to its nature as a charitable organisation that changed its status in 2008 to an International Non Governmental Development Organisation. Growing within Sightsavers is only usually possible when new projects are launched."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Ever-growing motivation working for such an impactful organisation", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "28 May 2020", "job_title": "Country Director in Yaoundé", "duration": "N/A", "pros": "Evidence-based change in the lives of target groups. Responsiveness to a constantly changing World thanks to a culture of learning and innovation. Accommodative and boosting workplace culture and environment.", "cons": "Staff capacity in country offices is overstretched despite recent rightsizing efforts."}]]