[[{"date": "15 Dec 2022", "title": "Graduate Student Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at SEGi University (Perai)", "Interview Descriptions": "First, fill the form about myself, them go in and intro myself to them, then they also will do intro themselves. Next asking question about internship did i request another company and the company backgorund. Last, let me ask them what i want to know.", "Interview Questions": "about the company and college"}, {"date": "11 Mar 2022", "title": "Lab Executive Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at SEGi University in Feb 2022", "Interview Descriptions": "Very casual interview.  The interviewer is very nice. For this position, only the HR and School Lead will conduct the interviewer. Done online, you will get an email offering for an interview and you can set the date and time as you see fit.", "Interview Questions": "What do you know about lab safety?"}, {"date": "19 Jan 2022", "title": "Marketing Head Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at SEGi University (Perai) in Jan 2022", "Interview Descriptions": "It was a horrible interview experience. There was a lady who were shouting non stop during an online interview. She shouts to ask question basically. Felt kinda racist too. Also, felt so obvious that she was like showing her hands pointing to me and saying she is not a good fit and stuff. \r\n\r\nIt doesn't matter someone is fit or not fit for the position they've applied for. The interviewer should be professional handling the interview. I totally lose interest in answering any questions after all the shouting and stuff. I am surprise well known university like Segi has people like that. Imagine students who are studying there. How would they be treated?", "Interview Questions": "Q1: Tell me about yourself (interrupt a few times before you were about answer anything)\r\n"}, {"date": "18 Oct 2021", "title": "Senior Lecturer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at SEGi University (Kuala Lumpur) in Jul 2020", "Interview Descriptions": "Interviewed by the HOD and Deputy HOD. The process was typical interview, 1. Introduce yourself followed by QnA; 2. Presentation; and 3. Negotiation with HR. \r\n\r\n1 and 2 went well, for nearly 1 hour. \r\nHR was offering a salary apt for school teacher not for a lecturer.", "Interview Questions": "1. Introduce yourself.\r\n2. What did you learn most during your study?\r\n3. How can you contribute to the department? "}, {"date": "26 May 2020", "title": "Administrative Executive Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at SEGi University", "Interview Descriptions": "I applied for sales & marketing, but they offered me another saying this is the only position they have. But in just 2 weeks time, my friend got the position for sales. During the interview, they did not provide clear expectation of what my role is, and we proceed with test consist of 3 short essay and 1 letter.", "Interview Questions": "What do you want to learn"}, {"date": "12 Feb 2020", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at SEGi University (Kuala Lumpur)", "Interview Descriptions": "The Interview Process is simple and straightforward. The question asked was based on your resume and position applied. Panel go through the resume and asked based on experience and information given to them. The question was difficult but more importantly it is relating to the job scope and personality.", "Interview Questions": "What can you contribute to the University"}, {"date": "6 Jul 2020", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at SEGi University in Nov 2016", "Interview Descriptions": "I applied for the position through Job street. after couple of weeks i was called for an interview. normally there will 2 sessions for the interview but since the Head join the interview was cut into 1", "Interview Questions": "What is your career plan in 5 years time"}, {"date": "24 Jan 2020", "title": "Senior Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at SEGi University (Petaling Jaya) in Aug 2016", "Interview Descriptions": "Smooth and rapid interview process, taking less than 2 months from the time of application. I was asked to give a mock lecture and describe my past working experience in the presence of the Dean and a few faculty members.", "Interview Questions": "Why have you decided to join the University? How would you contribute to the university if you get selected?"}, {"date": "4 Mar 2016", "title": "Faculty Staff Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at SEGi University (Kuala Lumpur)", "Interview Descriptions": "HR dept have 2 interview process. They shortlist and called in for first round interview. The recruiter was very polite and pprofesional in her approach. They ask relevant questions pertaing to role applied for. The overall session was average.", "Interview Questions": "How long were you serving in the education industry ?"}, {"date": "11 Aug 2016", "title": "Copywriter Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at SEGi University (Kuala Lumpur) in Apr 2015", "Interview Descriptions": "Pretty straight forward with some tests I have to sit for. Interviewers were professional and accommodating. The questions asked were relevant to what i've applied for and their feedback towards my answers were positive and persuasive.", "Interview Questions": "Do I handle stress professionally?"}], [{"date": "17 Dec 2013", "title": "Head of Department Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3+ months. I interviewed at SEGi University (Kuala Lumpur) in Jan 2013", "Interview Descriptions": "Headhunter company called to arrange interview. First interview with immediate superior was short but pleasant. Managed to 'sell' the reasons why my boss should hire me. Thereafter the HR department was very efficient in following up on the job offer.", "Interview Questions": "How are you able to use your experience, skills and knowledge to bring your department to the next level?"}]]