[[{"date": "29 May 2022", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Albertina Kerr", "Interview Descriptions": "The interview was over the phone and was approximately 20 minutes long. Questions about work history, how you deal with stressful situations, and general experience with people who have intellectual disabilities were asked.", "Interview Questions": "What is your previous work experience?"}, {"date": "26 Jul 2019", "title": "Psychiatric Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Albertina Kerr in Jul 2019", "Interview Descriptions": "It was smooth, the interviewer did most of the talking and it is a very casual interview. After the interview, we went to look around the campus and knowing more about the details of the job.", "Interview Questions": "Share one past experience that how did you manage a crisis. "}, {"date": "4 Nov 2019", "title": "Psychiatric Technician II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Albertina Kerr (Portland, OR) in Jul 2019", "Interview Descriptions": "Not a lot of questions, more an explanation of the business. Walk through the building. This interview was a simple process, and questions of why would you want to work here.", "Interview Questions": "What do you know about Subacute?"}, {"date": "12 Dec 2018", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Albertina Kerr (Salem, OR) in Dec 2018", "Interview Descriptions": "Filled out the application online. Got a call for a phone screening about a week later, where the HR rep asked me about my availability and if I had any experience working with individuals with developmental disabilities. HR rep scheduled me for a Skype interview for a couple days later. During the Skype interview I was asked what position I was looking to fill and then answered some basic behavioral interview questions. I was offered the job on the spot and was sent some new hire paperwork a few minutes later. Overall the interview was very pleasant and I'm excited to start working in a position where I can make a positive difference in the lives of different individuals.", "Interview Questions": "What was the funniest thing that happened to you in a previous job?"}, {"date": "19 Nov 2018", "title": "Psychiatric Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Albertina Kerr", "Interview Descriptions": "More like a casual conversation then a interview process. Its followed by a visit to the facility where you get a good understanding of work culture and regular day to day operations.", "Interview Questions": "How are you with kids and teenagers"}, {"date": "28 Jun 2018", "title": "Prefer Not To Say Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Albertina Kerr", "Interview Descriptions": "This was a three part interview. The first was over the phone for about 15 minutes. The second was a group interview with staff from the department. The third was a 1:1 with the department manager.", "Interview Questions": "What is the most difficult issue you have ever had to deal with at a job?"}, {"date": "21 Jun 2017", "title": "Psychiatric Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Albertina Kerr", "Interview Descriptions": "The interview was short and conducted by the lead Psychiatric Technician, who seems like a pleasant guy. We went over my resume then discussed the nature of the job. Questions about my previous experience and how I would handle certain on the job situations were asked here and there throughout the interview. The interview concluded with a tour of the facility.", "Interview Questions": "How do you handle stressful situations in the workplace, and do you think you could handle some of the situations that may arise on the job."}, {"date": "1 Jul 2016", "title": "Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Albertina Kerr (Portland, OR)", "Interview Descriptions": "Applied online and was called to schedule an interview within the week. The following week, I went for an in person interview with the team I'd be working with. Ultimately, another candidate was selected for the position, but it was a great interviewing experience and the organization and team seem solid. Left interview process with good feelings about this organization regardless of not being selected.", "Interview Questions": "Strengths and weaknesses? How to respond in crisis situations"}], [{"date": "14 Nov 2016", "title": "Psychiatric Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Albertina Kerr (Gresham, OR) in Mar 2016", "Interview Descriptions": "Filled out application online. They contacted me by email right away. The interview was a joke. They basically asked if I could work the hours, if I was comfortable putting clients in holds, and one other generic question. They gave me a tour, took my picture and set up my schedule. Beware any place that hires that fast.", "Interview Questions": "Generic. No sweat. "}, {"date": "24 Sept 2015", "title": "Life Enrichment Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Albertina Kerr", "Interview Descriptions": "I had to answer a few questions that they read out of a book, they took down my answers. Then I watched a video and after that we sat down and filled out all the hire paperwork...they basically hired me on the spot, it was too easy and I don't think they even ran the background check or checked my references. They asked the \"tell us about a time at work when...how did you handle this...etc etc\" type questions, and we really didn't even talk about anything relevant in my resume or anything like that. I felt like they would hire anyone who showed up and was willing to work there. I know the turnover rate is very high at this company, so they probably have to hire people constantly to make sure they are staffed adequately.", "Interview Questions": "Name the funniest thing that has ever happened to you at work"}, {"date": "1 Oct 2015", "title": "Human Resources Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Albertina Kerr (Portland, OR) in Sept 2015", "Interview Descriptions": "I spoke with an HR professional on the phone the day after I applied and she gave me a very clear idea of what to expect. I met with her 2 business days after for 25 minutes, no one else was asked to interview me in addition.", "Interview Questions": "I was really displeased by the questions.They were the seven most asked interview questions about time management and dealing with difficult people.\r\nThere were no questions regarding my background or competencies. "}, {"date": "13 Jul 2015", "title": "LES (Life Enrichment Specialist) Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Albertina Kerr (Cornelius, OR)", "Interview Descriptions": "There was none. They tend to have a terrible turnover rate because of how seriously stressful the job is. So I was hired basically sight unseen, which I was grateful for, but in retrospect they needed me so it made sense.", "Interview Questions": "&#034;Have you worked in customer service before?&#034;"}, {"date": "25 Nov 2017", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Albertina Kerr (Salem, OR) in Jan 2015", "Interview Descriptions": "The interview process is ABSOLUTELY un professional, managers with open floor positions all sit at a table and read 6 questions that have nothing to do with the job, asking about what would you do if you needed help, what would you do if you couldn't find something, and as long as you are moderately dressed and pleasant they will offer you a job on the spot regardless of the answers you give. ( you can completely make up your answers an no one would ever know the difference)", "Interview Questions": "In your previous work experience when you had a conflict with another Co-Worker how did you handle it?"}, {"date": "23 May 2015", "title": "Psychiatric Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Albertina Kerr (Portland, OR) in May 2014", "Interview Descriptions": "I applied online and got a call back within a day. Erin contacted me (she's the administrative assistant and works very hard but seems sort of fake in personality but sometimes sweet). I had an interview the the main director and she was kind of socially awkward and seemed more nervous than me. She had asked if I knew what the job entails (including violence, poop being thrown etc) and I said yes (due to reading the reviews online). I knew what I was in for, and was still willing. I got introduced to the unit, and a girl was acting out and eating paper. The interviewer was very cautious about me being there and closed the door as if she would attack me. I had thought in my head \"She's just a child I am not scared of her\". I got hired as an on-call, this process was very abrupt and fast the next day I was asked to come in immediately to sign papers. They were very strict about this, and it was hurry hurry hurry! Be careful and read through everything and know your rights. You basically sign a waiver saying you aren't guaranteed breaks or food breaks. You will be signing a lot of papers that will take you about an hour. Be expected to do a drug test instantly within 24 hours.", "Interview Questions": "You will be in contact with bodily fluids, how do you feel about that?"}, {"date": "4 Jul 2014", "title": "Residential Counselor Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Albertina Kerr (Portland, OR) in May 2014", "Interview Descriptions": "I applied for the position online with just my resume attached.  I received a phone call asking basic screening questions about criminal and driving history.  I was then invited to come into the center and sat with four ladies as they asked my questions from a piece of paper.  My answers were scored immediately on the sheet where they were taking notes.", "Interview Questions": "They gave scenario questions asking what you would do in different situations concerning health and safety of the residents."}, {"date": "2 Jun 2015", "title": "Assistant Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Albertina Kerr (Hillsboro, OR) in May 2014", "Interview Descriptions": "Already worked for the company, so it was an easier interview. Interviewed with my current program manager and assistant director. They were both very laid back and easy to talk to", "Interview Questions": "How do you handle conflict with co workers and management?"}, {"date": "11 Jun 2013", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Albertina Kerr (Portland, OR)", "Interview Descriptions": "Kerr has an exhaustive pre-hire process that includes drug testing, fingerprinting, and a background check.  There is a big package to wade through to complete the application, which, mercifully, I now understand to be at least partially online.  Don't forget your password, though, because it is tough to recover.  The HR department is helpful on the phone, but will continue to refer you to the website for application purposes.  My interview was different from any other because of the distance I was interviewing from.  I can't say more about it because of that uniqueness.", "Interview Questions": "N/A"}, {"date": "19 Oct 2015", "title": "Psychiatric Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Albertina Kerr in Dec 2011", "Interview Descriptions": "I got a call about 2 weeks after applying at a job fair. I entered a locked residential facility and met wit the assistant program manager. After about 30 minutes, I was taken on to the units to meet the staff. Don't dress too fancy, you never know what you'll be walking into behind those locked doors.", "Interview Questions": "Many questions that would require reading their policies and procedures before hand."}]]