[[{"date": "1 Jun 2023", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine (Irvine, CA)", "Interview Descriptions": "Panel interview with generic questions, fairly straightforward process involving multiple levels of managers (immediate report and above). Nothing much to say beyond that since the questions and format of these interviews is pretty similar for assistant positions across libraries.", "Interview Questions": "I don't remember the specific questions, nothing unusual for the field"}, {"date": "21 May 2023", "title": "Museum Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "It was not hard. The questions are easy to answer. The interviewers are also caring and friendly that they really want to help you to learn and reach your goal", "Interview Questions": "What do you know about California art?"}, {"date": "25 Apr 2023", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2+ months. I interviewed at UC Irvine (Irvine, CA)", "Interview Descriptions": "Very smooth, relax and casual was able to have great conversation with interviewer. Ensure to be your authentic self. Be prepared to answer a lot of situational questions. Took a month to respond back to me with my acceptance.", "Interview Questions": "Why do you want to attend Uci For grad school?"}, {"date": "12 Apr 2023", "title": "IT Student Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UC Irvine (Irvine, CA)", "Interview Descriptions": "This was a very Standard Thirty Minute Interview with Three Person Panel on site in person. Approximately fifteen minutes of questions followed by a skill test and any of your questions.", "Interview Questions": "Why are you interested in this job?"}, {"date": "24 Mar 2023", "title": "Tutorial Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine", "Interview Descriptions": "Formal interview showing demonstration of tutoring specific subject. interview with two people, usually ask about experience with specific subject and why you liked about that course, mine was for math2b(calculus)", "Interview Questions": "How would you explain to me without using specific terms how to draw a bike?"}, {"date": "24 Mar 2023", "title": "Ruby On Rails Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine (Irvine, CA) in Mar 2023", "Interview Descriptions": "After applying online, a week later I got an email from the recruiter. We then talked on the phone and he asked me what I did at my previous job. Then they scheduled an interview the following week. The interviewer was a senior developer. He asked me basic questions about software development. This was not a technical interview. Then they scheduled me for a technical interview. During the interview, I was given 45 minutes to solve a problem. I was able to solve it and get the desired output. I had 2 interviewers one of whom was the same person who interviewed me before. They then asked me questions about my code like how it worked and how I would have coded it if I had more time. Then they asked me other basic questions about programming in general. 2 weeks later I had a \"meet the team\" interview with 8 other people. Each person asked me a question or two about how I would react to different situations. I felt optimistic because I passed the technical interview and the meet the team interview went well. However, the next week I was informed they chose another candidate. I was disappointed.", "Interview Questions": "During the technical interview I was asked to read from a CSV file. The data from the CSV file had to be processed and filtered and written to another CSV file. I was given 45 minutes to complete the task. I was allowed to google search. I was able to finish it and get the desired output. Other questions: 1) Have you worked in an agile environment and describe the process 2) What is the biggest challenge you have ever had? 3) If you have a conflict with one person, how would you deal with it? 4) What is your way of writing bug free code?"}, {"date": "7 Feb 2023", "title": "Aerodynamics Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "First you submit your resume, and later they will contact you via email to fill in the interview time slot. It was through a zoom call, and they asked both technical and behavioral questions.", "Interview Questions": "What are the four forces that act on an airplane?"}, {"date": "18 Dec 2022", "title": "Esports Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "Asked a lot of scenarios - did not ask much about prior qualifications. Was interviewed in a group of two at a time. Was given ample time to think of responses and in a group setting, was more comfortable during the interview and the interviewer was extremely easygoing.", "Interview Questions": "Describe a scenario where you were in the middle of conflict and you were able to settle it."}, {"date": "7 Dec 2022", "title": "Photographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "The interview process was straightforward and went through a few rounds. I was sat in a room with a group of three interviewers and went through the regular process of the interview. The interview lasted about half an hour.", "Interview Questions": "What do you think we can improve on for photo organization and workflow?"}, {"date": "5 Dec 2022", "title": "Career Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "Interview process was straight forward, there were no trick questions. They provided a clear expectation of what the process was going to be. There was clarification about some of the responsibilities and I asked if there was flexibility on any of them and/or if there were any deal breakers so that we wouldn't waste any time for the rest of the interview process.", "Interview Questions": "Where do you expect to see yourself in three to five years?"}], [{"date": "20 Sept 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "Applied to the position online and got a 30 min video interview with the current project coordinator in the lab about 3 weeks after the application.  That was the only interview in the whole process", "Interview Questions": "What are your three biggest strengths and why"}, {"date": "26 Aug 2022", "title": "Graduate Student Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "It was a typical zoom interview process with the usual questions you would expect and it was clear that they really did care about what you had to say and had great feedback/reactions.", "Interview Questions": "Why UCI over other schools you applied to?"}, {"date": "8 Aug 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "people are kind, professional about describing the position and my interested topic during the interview. But I never got to move forward with the position even though I applied to mutliple position already.", "Interview Questions": "talk me through your resume"}, {"date": "1 Aug 2022", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "Challenging but productive and thought provoking as the position straddled that of an administrator and academic. It entailed a committee of five panelists lead by the director. It was for a new position.", "Interview Questions": "N/A"}, {"date": "20 Jul 2022", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "I found the job on Handshake and applied. I received a message asking if I was interested in coming in for an interview which I accepted. The interview was in person held on campus.", "Interview Questions": "Are you able to create posters based on verbal instructions?"}, {"date": "15 Jun 2022", "title": "Student Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "The interview was very odd. Asked fewer behavioral questions and more specific questions about the position.  The main interviewer also did not mention that I would be interviewed by a panel of 4-5 people. It was hard to be personable since the main interviewer didn't seem like they wanted to be there.  They also had an activity at the end on prioritization and you had to explain why you chose what you chose. I thought it would be easier since this is a student position.", "Interview Questions": "If you could teach one class, which would it be?"}, {"date": "11 Jun 2022", "title": "Graphic Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "I did zoom video meeting with 2 people. They were okey. Interview process was alright. I just didn't made it to the end. I think it would be good place to work.", "Interview Questions": "What is your strength related to your skill"}, {"date": "7 Apr 2022", "title": "Clinical Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "First I had a phone interview then I went to an in person interview. I was not contacted for weeks afterwards, despite sending a thank you email and expression of continued interest.", "Interview Questions": "They asked about my past experience with medicine."}, {"date": "23 Mar 2022", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "Was a straightforward interview, asking about background in the field, as well as what drives me to study the specific subject. Interviewer was very amiable, did not feel super formal and thus was much easier to relax", "Interview Questions": "What led you to choose this program?"}, {"date": "21 Mar 2022", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "The interview process was very good and about 30 minutes in length. The interviewer was nice and explained  everything thoroughly. The questions were average, so make sure to prepare beforehand.", "Interview Questions": "1. Tell me about yourself "}], [{"date": "9 Mar 2022", "title": "Student Software Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "Very nice people. I had to take an in person coding interview and then explain my code. Also had some extra whiteboard problems. Overall very good experience and I recommend applying here", "Interview Questions": "Regular leet code questions easy-medium"}, {"date": "31 Mar 2022", "title": "AV Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at UC Irvine in Mar 2022", "Interview Descriptions": "Applied online, around a month later I got a call from their HR, 1 week after I got another call to setup an interview for 2 weeks from then. It was a 3 panel interview from their \"OIT\" department. Everyone was very friendly, concise, and wanted to know more about who I was and the role I play with my past work. Only some questions were actually pertinent to the role.", "Interview Questions": "A few questions were about work projects I have worked on and personal projects that I have been a part of and how I lead the operations of them."}, {"date": "6 Mar 2022", "title": "Summer Research Student Program Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC Irvine (Irvine, CA) in Mar 2022", "Interview Descriptions": "basic zoom interview, a few days advance notice will be given, approximately 20 minutes. I haven't received an offer yet, the interviewer was very nice. The interview questions are very basic, it's some behavioral interview content, just prepare well.", "Interview Questions": "tell me a bit about yourself"}, {"date": "23 Feb 2022", "title": "Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "Very brief interview, took less than 20 minutes. Fast decision. Interviewers are relaxed and want to know what brings you to the job rather than why you are not fit for the role.", "Interview Questions": "What makes you different from the other applicants"}, {"date": "12 Feb 2022", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at UC Irvine", "Interview Descriptions": "Interview was on-site, in one of their meeting offices. It was with 5 panel members including the upper-management of the IT team,  and asked a mix of questions about past experiences and behavioral-type questions.", "Interview Questions": "Tell us a bit about yourself."}, {"date": "8 Feb 2022", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UC Irvine", "Interview Descriptions": "Remote call with one of the faculties you chose in your SOP.\r\nI had received a positive sign from my future advisor, by telling me to visit the visiting day to feel the nice weather of California.", "Interview Questions": "Tell me about yourself and your research interest.\r\nTell me about the project (I've written on my SOP)"}, {"date": "27 Dec 2021", "title": "Admitting Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UC Irvine (Irvine, CA) in Dec 2021", "Interview Descriptions": "Interview was about 25 questions, mostly about background and avaliable work schedule. Several questions regarding qualifications and goals to achieve. Several questions about meeting the required skill set. One question about required salary range. Many statements about job benefits such as health coverage and retirement options.", "Interview Questions": "Tell me about yourself and why you think you qualify for this position?"}, {"date": "9 Nov 2021", "title": "Sports Marketing Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "In a group setting. The interviewers asked questions about how to handle high stress situations and give examples. They ask you to give ideas of what can be improved with sports at UCI.", "Interview Questions": "Name a time you had a difficult situation and how you handled it."}, {"date": "3 Nov 2021", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "smooth process and professional. workers there are serious about the job which is how you take it. overall positive experience and would recommend to others who may decide to come here", "Interview Questions": "What would you do first if the phone rang, a customer approached you, and someone in the back needs computer help? "}, {"date": "4 Feb 2022", "title": "Associate Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UC Irvine in Nov 2021", "Interview Descriptions": "Applied and received email for first round interviews, conducted interview over zoom the following week, did not hear back for almost a month that I was not moving forward.  Requested before zoom interview access to questions for reading and comprehension, was not given \"because it wasn't an option for others\" even though I asked as an accommodation request.", "Interview Questions": "Tell us about yourself and why you're interested in the position?"}], [{"date": "23 Oct 2021", "title": "Housing Attendant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at UC Irvine (UCI, CA) in Oct 2021", "Interview Descriptions": "Notified through email. Schedule interview online. Sit in a room with 3 interviewers at Anborn, 2nd Floor of the Middle Earth Towers. Introduce self and pronouns before starting. The 3 interviewers were patient and welcoming, but serious about the interview.", "Interview Questions": "1. Gives paper with situation. Have you rank which tasks to finish in order and give reason.\n2. What would you do if there was a penguin in your fridge?\n3. How would you handle working with a co-worker you don't get along with?\n4. Define professionalism.\n5. How will you manage your time?"}, {"date": "15 Sept 2021", "title": "Executive Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine (Irvine, CA)", "Interview Descriptions": "Several rounds with lots of people. Started with a phone screen then a group interview. Included a final presentation and final meeting with senior executives. There was a broad range of questions. Knowledge of higher ed was key.", "Interview Questions": "How does your past experience relate to this position."}, {"date": "28 Sept 2021", "title": "Operations Crew Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at UC Irvine (Irvine, CA) in Sept 2021", "Interview Descriptions": "The interview was fairly quick, managing to only be around 15-20 minutes. They had the expected questions of \"What do you think you will get out of this job\" and such.", "Interview Questions": "What do you want to get out of this job?"}, {"date": "15 Nov 2021", "title": "Project Policy Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UC Irvine (Irvine, CA) in Sept 2021", "Interview Descriptions": "The virtual interview consisted of three different departmental people, and they gave a lot of information about many different aspects of the project, however it it was confusing and not at all clear what the job duties were.", "Interview Questions": "Why do you want to work here? Name a time in which you resolved a conflict."}, {"date": "20 Aug 2021", "title": "Dining Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "It was conducted over a quick phone interview and it was pretty short. I got the interview over the UCI class facebook page. However, it's possible to get an application by just asking at the front of either of the dining halls.", "Interview Questions": "The manager just asked me why I wanted to work there. "}, {"date": "2 Aug 2021", "title": "Resident Advisor (RA) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "Interviewer asked some personal questions, what you like to do in your free time, why the position fits. The interviewer also asked for examples of handling social situations. Also asked about prior work experiences.", "Interview Questions": "What do you enjoy doing with your freetime?"}, {"date": "26 Jan 2022", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine in Aug 2021", "Interview Descriptions": "It was a smooth process. My first step was a 15-20 minute phone screening. About 2-3 days later I was contacted for a panel interview via zoom. I received email notification about 3 weeks later advising they were moving forward with other candidates for round 3 of the interview process", "Interview Questions": "Explain your experience scheduling/coordinating travel arrangements for your leadership team "}, {"date": "16 Jul 2021", "title": "Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "It's good with the professors. They are kind and would like to answer questions. Need to do some research before going for the interview. They don't push you answer questions. Overall experience is good.", "Interview Questions": "What do you think about a certain paper. "}, {"date": "19 Jul 2021", "title": "Master Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at UC Irvine (Irvine, CA) in Jul 2021", "Interview Descriptions": "First, like any other application we have to apply online and then if we got approved after they check out  our applications records, we will be invited for the first zoom interview.", "Interview Questions": "what was the most challenging time that you had in your last job? and how you solve that?"}, {"date": "18 Jun 2021", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "The interview process was pretty standard. Only one person interviewed me. The interview was about an hour long conducted over skype. The interview process shouldn't be stressed about. Overall, fast interview timeline and easy questions.", "Interview Questions": "describe a situation when you ran into an issue, where do you see yourself in five years?"}], [{"date": "24 Jan 2022", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC Irvine (Los Angeles, CA) in Jun 2021", "Interview Descriptions": "There are four people in the interview, included accounting manager, accountant, HR, and senior financial analyst. They took turns to ask questions. And will ask more detail if any one is interested.", "Interview Questions": "Budgeting experience, year end process"}, {"date": "24 May 2021", "title": "Helper Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "It was cool. Easy interview I don't know why we are forced to write these. How much longer am I supposed to write. Even more still wow, Okay well I guess I have to write an essay.", "Interview Questions": "Trying to get through requirement how much am i supposed to write?"}, {"date": "16 May 2021", "title": "Grad Program Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "The faculty is really kind and patient. They illustrate the details very clear. The curriculum of the MsBA is very practical and useful. All the professors are kowning their topic", "Interview Questions": "Why do you aant to study this subject"}, {"date": "10 May 2021", "title": "Conversation Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "It was a group interview that included 4 other people. The interviewer would ask questions and we would answer in a designated order. most questions were hypothetical so It required a lot of quick thinking and improvisation. The interviewer was looking to see how seemed the most outgoing and friendly.", "Interview Questions": "what would you do on a typical day with your group?"}, {"date": "6 May 2021", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "basic zoom interview, about 5 or 6 questions and one question to ask interviewer. they will send a email to you before the interview. do some research about your program and good luck", "Interview Questions": "introduce yourself and highlight things you're proud of\n"}, {"date": "4 May 2022", "title": "Peer Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UC Irvine in May 2021", "Interview Descriptions": "Very casual zoom call interview.  Asked particular study strategies and ways I would be able to help students struggling in their coursework and how to succeed in the future.  Approximately 15-20 minutes long.", "Interview Questions": "Q: What advice would you give a student who was struggling to succeed in a particular course?"}, {"date": "21 Mar 2021", "title": "Food Services Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "The interview went smoothly: questions were fair, staff was professional, and building was easy to find. I had a good experience. I would recommend this employer. That is all. I am writing this because Glassdoor won't allow me to view content otherwise.", "Interview Questions": "Tell us about yourself, your passions, and experience."}, {"date": "9 Mar 2021", "title": "Student Affairs Officer III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "Questions regarding student cases, organization, and problem-solving. There were about 10 questions (some were long) and there was a chance to ask your own questions at the end. Make sure that you have questions to ask about their department/office to show you did your research on the school and student population.", "Interview Questions": "Student scenarios where they are upset. \nStudent scenario where you have to decide what takes priority."}, {"date": "16 May 2021", "title": "OIT Student Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at UC Irvine (Irvine, CA) in Mar 2021", "Interview Descriptions": "Multiple rounds of interviews, all over zoom. Did an easy coding question. Was asked multiple questions about personal goals, past experiences, etc. Interviewers were always respectful. Did not get an offer.", "Interview Questions": "Talk about a previous leadership experience"}, {"date": "12 Jan 2021", "title": "IT General Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "The network administration team, around 5 or so people, take turns to ask questions. They were pretty general questions for the most part, and everyone was pleasant. The interview was not extremely long, and there was only one application and one interview, and I received my acceptance notification quickly.", "Interview Questions": "What is most important to you when it comes to customer services?"}], [{"date": "12 Jan 2021", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "Asked about your experiences dealing with others. In addition, my background of what I know and how I am qualified for the job is also asked.  There were 3 interviewers each asking a couple questions about my qualifications and such.", "Interview Questions": "How have I dealt with language barriers in the past?"}, {"date": "14 Dec 2020", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "Applied online. After a couple of weeks of waiting. Received email scheduling interview. Interview was scheduled and call was made. Was told that application will be sent to hiring department and will receive a response back later.", "Interview Questions": "Why do you want to work at UCI?"}, {"date": "13 Oct 2020", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "The process was short but does require basic understanding of computer science. This including self-introduction and a couple of coding questions. Those questions are similar to the ones on leetcode. So brush up your algorithms there.", "Interview Questions": "Why do you want to work for this company"}, {"date": "7 Aug 2020", "title": "Project Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UC Irvine", "Interview Descriptions": "It was a quick, smooth interveiw. Questions were direct to the point. \r\nInvited to visit the campus and the lab, and talk to people to learn about the environment. Very straightforward hiring process", "Interview Questions": "How's your research experience relevant to what we do here?"}, {"date": "5 Aug 2020", "title": "General Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine", "Interview Descriptions": "Very straightforward. They asked the typical questions and how well you handle the job such as your computer skills, you interpersonal skills and your public speaking skills. After that they asked about your strength and weaknesses and how well you do under pressure.", "Interview Questions": "What are you strengths and weaknesses"}, {"date": "20 Jul 2020", "title": "Business Systems Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UC Irvine", "Interview Descriptions": "Phone screen, phone interview with peer who asked questions that were more from a BSA certificate exam , 2 hour 4 person panel with hiring manager and peers, final interview with director.", "Interview Questions": "The questions were very canned and straight from the internet. None of them were seriously thought out questions. The team seemed more concerned on if I knew the exact terminology and definitions of the deliverable documents a BSA is responsible for. An example: What is the difference between a functional and non-functional requirement?  Seriously!  They should be asking questions about the persons background and situational questions. "}, {"date": "8 Jun 2021", "title": "Quality Assurance and User Support Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine (Irvine, CA) in Jul 2020", "Interview Descriptions": "Panel interview with manager, team member and another manager. The people were very nice and the there was nothing unusual or remarkable about the interview. Typical job interview that I had fully prepared for.\r\nI felt I performed well and the job matched well with my background and experience. I don't think any of that mattered. During my questions to them, I was able to ascertain that there was at least one internal candidate being considered. I got a strong feeling that they were just going through the motions with me and were planning to hire the internal candidate. This is typical with government and pseudo-government positions where there seems to be a lot of nepotism.", "Interview Questions": "They gave me a list of job-related obligations that I might hypothetically face and asked me to rank them as to the order I would perform the tasks and/or how I would address them."}, {"date": "25 Aug 2020", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UC Irvine in Jul 2020", "Interview Descriptions": "Submit the application online. The HR personnel from the department will make a phone interview to go over the questions. HR personnel will record the interview and report to HR manager for further process.", "Interview Questions": "Explain your experience related to the applied job. "}, {"date": "24 Jul 2021", "title": "Undergraduate Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UC Irvine (Irvine, CA) in Jun 2020", "Interview Descriptions": "The first interview was over the phone and lasted about 15-20 minutes. The interviewer introduced himself and what the job entails, and I was asked 3-5 questions by the interviewer.", "Interview Questions": "How did you mange a stressful work situation? Can you elaborate on your leadership experiences?"}, {"date": "7 Sept 2020", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine (Irvine, CA) in Jun 2020", "Interview Descriptions": "Interview process was not lengthy, but had to go through two interviews. First one was with 3 people, and questions were general interview questions, second interview was with 2 people, and questions were more about the kind of goals I had and what I could bring to the table. The people who interviewed me were very kind, and I also felt they showed genuine interest in my application.", "Interview Questions": "How will this job help you reach your future goals? "}], [{"date": "20 Nov 2021", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UC Irvine (Irvine, CA) in Jun 2020", "Interview Descriptions": "Only be interviewed once by the PI, not so formal for this position. If the PI think you are a good fit, that is pretty easy. No reference letter required.", "Interview Questions": "What techniques do you grasp"}, {"date": "28 May 2020", "title": "Graduate Student Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine", "Interview Descriptions": "medium nice then asked some questions explaining my goals and experience. what i can bring to the table. so gdluck youll be fine its not so stressful . thanks for reading thus far", "Interview Questions": "many questions "}, {"date": "10 May 2021", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at UC Irvine (Irvine, CA) in May 2020", "Interview Descriptions": "I was not as bad as I thought, depending on the interview, it can be solo or in a group. The interviewers were polite and professional, nothing rude or intimidating.", "Interview Questions": "What is your time availability for the next school year?"}, {"date": "29 Apr 2020", "title": "General Assistant, DCE Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at UC Irvine", "Interview Descriptions": "The interview process consisted of 2 rounds. The first was more of case-study questions regarding work behavior and ethics, for instance how you interact in a team environment. The second interview is more so on practical experiences and application.", "Interview Questions": "Are you familiar working with HTML?"}, {"date": "19 Jul 2020", "title": "Post-Baccalaureate Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at UC Irvine (UCI, CA) in Mar 2020", "Interview Descriptions": "Online through Zoom because of the Covid-19 pandemic. Between the recruiting director and another person, the questions were very average and meant to assess on a basic level. However, it was very respectable and mutual on how competitive it was to get into this program", "Interview Questions": "How does the program fit into your greater goals?"}, {"date": "3 Feb 2020", "title": "Student Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at UC Irvine", "Interview Descriptions": "I applied at the job fair. I think it was about 2 weeks later that I received a call over the phone. They asked if I had some spare time and we had a phone interview first, then I was invited to a group interview. There they explained more about what they did and asked some basic questions. They seem to hire based on your phone voice, ability to make rapport, and your creativity.", "Interview Questions": "Sell me this item."}, {"date": "15 Jan 2020", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UC Irvine", "Interview Descriptions": "I applied online and was contacted a few days later for a group skype interview. There was about 5 people in my interview. I was hired a couple days after a salary negotiation.", "Interview Questions": "Tell us about your experience."}, {"date": "15 Jan 2020", "title": "Student Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at UC Irvine", "Interview Descriptions": "First interview was over the phone. If that goes well, then you are invited to a group interview. They ask you a few questions about your personality, ask you to pitch an item to sell, and ask you to talk on the phone so they can analyze your phone voice.", "Interview Questions": "Be as creative as you can and sell me this item"}, {"date": "10 May 2023", "title": "Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine in Jan 2020", "Interview Descriptions": "The interview process was straightforward, well organized, and with several different individuals. The schedule was sent in advance and was followed. Getting from parking to the office was pretty straightforward. One person was a well-trained interviewer, two people were just okay, but pleasant.", "Interview Questions": "Why do you want to work here? What will you contribute to our organization? Tell me about a difficult colleague you have worked with."}, {"date": "22 Oct 2019", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at UC Irvine", "Interview Descriptions": "Interview was pretty straight forward, I was asked about my previous experience. Application was a bit longer and required 3-5 letters of rec. Processing took a while to actually get hired though.", "Interview Questions": "Please describe your previous experience."}], [{"date": "1 May 2023", "title": "Lab Technician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UC Irvine (Irvine, CA) in Sept 2019", "Interview Descriptions": "It was very awkward. The hiring manager would talk poorly about my current company and was rude to his fellow leadership. The also mentioned how I would be on a probation period and emphasize \"I have no problem firing people\". I got bad vibes and declined to move forward in the hiring process.", "Interview Questions": "Experiences/duties on my current job"}, {"date": "17 Aug 2019", "title": "IT Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UC Irvine", "Interview Descriptions": "I was offered to come into the office and interview for the position and was asked a few questions about my experience with computers.\r\n\r\nHave you worked with computers before? How would you rate your computer hardware skills?", "Interview Questions": "Are you comfortable working in a fast paced environment where the answer to a problem may not be apparent?"}, {"date": "14 Aug 2019", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC Irvine", "Interview Descriptions": "Was reached out to by HR about a week or two after submitting my online application; process was a 30-minute phone interview with HR followed by a panel interview and a presentation", "Interview Questions": "Define your worldview"}, {"date": "6 Aug 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at UC Irvine", "Interview Descriptions": "1. Contacted a future advisor by explaining why I am a correct person who can support to his/her research.\r\n2.  Applied on website\r\n3. Interviewed with the professor in-person\r\n4. Receive the admission in 3 months", "Interview Questions": "Given a few important papers, describe the research that you read"}, {"date": "7 Jun 2019", "title": "Internal Auditor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at UC Irvine", "Interview Descriptions": "Two staffs interview. One round. They will ask you about 10 to 15 questions. The questions were asked one by one. Took about 30 minutes. The mood of the interview is easy-going.", "Interview Questions": "Common questions for accounting major related jobs. Such as what is your goal. What do you want to learn from this internship. What is your future career and so on."}, {"date": "5 Jun 2019", "title": "GSR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "I contacted an advisor at UCI and we scheduled an Skype interview when I presented my MS thesis and explained about my background and previous experiences. Then they explained about the open position and current projects and asked a few technical questions to assess my base knowledge.", "Interview Questions": "I explained my MS thesis."}, {"date": "7 Apr 2019", "title": "Senior Accountant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UC Irvine (Irvine, CA)", "Interview Descriptions": "the 1st round interviewed with the hiring manager, who is very nice and talked about the daily responsibilities of the job. the 2nd round interview with the senior manager, felt that did not  answer some of his questions well.", "Interview Questions": "could you tell something about yourself."}, {"date": "23 Jun 2021", "title": "Cashier/Food Server Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at UC Irvine (Irvine, CA) in Apr 2019", "Interview Descriptions": "Interview was quick. 10 min top. The manager pulled me aside to one of the lunch table. We sat opposite each other. I was lucky to meet her right away. I interviewed at some other places in the food courts and the managers were not in.", "Interview Questions": "Do you mind cleaning the trash?"}, {"date": "10 Mar 2019", "title": "Student Venture Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at UC Irvine", "Interview Descriptions": "Going to events at the ANTrepreneur Center helped me meet the people working there and build friendships. Once I met the people at the center and demonstrated past experience alongside the ability to ask good questions, I was brought into the team.", "Interview Questions": "Have you been a consultant before?"}, {"date": "17 Mar 2021", "title": "Marketing Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine (Irvine, CA) in Mar 2019", "Interview Descriptions": "Quick zoom interview with president, and corresponding position directors. Asked a few basic questions then questions specifically pertaining to position. Depending on how many positions applied to, it lasted around 25 minutes.", "Interview Questions": "Please tell us about yourself "}], [{"date": "9 Jan 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine", "Interview Descriptions": "advisors ask you about your previous research. You have to provide them the list of your papers and be ready to briefly talk about your contribution in any of those papers. One hour presentation is necessary.", "Interview Questions": "How did you find about my projects?"}, {"date": "20 Jan 2020", "title": "Master of Science Biotechnology Management Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at UC Irvine (Irvine, CA) in Jan 2019", "Interview Descriptions": "1-hour Skype interview \r\nBackground\r\nWhy are you interested in the program \r\nWhat are some positive and negative experiences you've had working in a team\r\nWhat are you hoping to do in your future career, after the program", "Interview Questions": "Background\r\nWhy are you interested in the program \r\nWhat are some positive and negative experiences you've had working in a team"}, {"date": "31 Oct 2018", "title": "Lab Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at UC Irvine", "Interview Descriptions": "Quick behavioral questionnaire. The questionnaire asked for my availability, proficiency in languages, and experience teaching others. After filling out the questionnaire, the CS student council decided my fate. The questions were quite reasonable. Not at all hard to answer.", "Interview Questions": "What do you think makes you a good tutor?"}, {"date": "31 Mar 2019", "title": "Marketing & Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at UC Irvine in Nov 2018", "Interview Descriptions": "Interviewing with the department was great and they were lovely people, but I was most frustrated with the recruiter who set up the interview. \r\n\r\nShe forgot so many things: the directions, the map, and most importantly she got the interview date mixed up! I was horrified when I received a phone call from the interview panel asking where I was. She scheduled me for a Thursday when her email reflected that I was scheduled on a Friday.\r\n\r\nI rushed to my interview and got there 30 minutes later than my original time slot. I strongly feel that the mix-up on the interview dates and my showing up late impacted their impression of me and also their hiring decision.\r\n\r\nI never received a follow-up email, even when I reached out to my recruiter. Phone calls were ignored too and I haven't heard back from this day.", "Interview Questions": "How do you handle working on different projects? "}, {"date": "22 Oct 2018", "title": "Finance Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UC Irvine", "Interview Descriptions": "The interview process was informal and easy going with a structure list of questions.  the interview was not stressful with only 2 people in the interview.  It was an easy interview and lasted about 40 minutes long with conversation and tour of the building and work stations and other employees.", "Interview Questions": "What type of animal would you be if you were an animal?"}, {"date": "9 Oct 2018", "title": "Postdoctoral Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine", "Interview Descriptions": "Just talked to professors in the video once, then got the offer. The professor may care a lot of the research background and the attitude. They gave me the offer about 2 weeks after the interview", "Interview Questions": "Opinions to make the project possible."}, {"date": "19 Sept 2021", "title": "Office Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at UC Irvine (Irvine, CA) in Sept 2018", "Interview Descriptions": "Nice staff. Very casual interview but sometimes they usually accept work study students who apply. \r\nMost of assistants they are currently enrolling at school. So maybe your coworkers can be your peer student all the time.", "Interview Questions": "Why you are interested in this job?"}, {"date": "4 Jul 2018", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at UC Irvine", "Interview Descriptions": "Professional and courteous. Knew exactly what to expect in the questioning. Interviewer did not hide the ball, was straight forward on expectations for the position.\r\n\r\nInitial interview was a call, then in-person interview. All questions were answered and the hiring decision process was average for the position.", "Interview Questions": "Background, experience and hypotheticals questions"}, {"date": "16 Oct 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UC Irvine (Irvine, CA) in Jun 2018", "Interview Descriptions": "The interview was fairly standard. I met with the lab manager and a few of the team members, the PI was not there, but I expected this. They showed me around the lab, talked about day to day operations then we sat down and I answered a few questions.", "Interview Questions": "Where do you see yourself in 5 to 10 years"}, {"date": "3 Oct 2022", "title": "Labratory Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at UC Irvine (Irvine, CA) in Jun 2018", "Interview Descriptions": "Through asking some of the professors on campus i knew, they sent me to a project head who was looking for undergraduate assistants. Since most of my credentials were based on my grades in the classes i took, the interview was only on a personal basis to see if i would be a good fit with the others in the lab, and my availability to work.", "Interview Questions": "What days and times are you open to work? Have you gotten through X and Y in you electricity and magnetism class? We will using those extensively so let me know if you are not totally comfortable. We need you to learn how to create a Monte Carlo simulation in python. Can you do this?"}], [{"date": "5 Feb 2019", "title": "Housing Programmers Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC Irvine (Irvine, CA) in Apr 2018", "Interview Descriptions": "There are some questions about personal experience in the beginning, they will ask your experience in certain housing community and how do you think about their program. Some behavior questions ask me how to handle residents' problem or how to interact with co-workers. At the end, they ask if I have anything to tell them, any advice to the program.", "Interview Questions": "If students coming to ask you about the academics problem they met,  how would you response"}, {"date": "28 Feb 2018", "title": "Graduate Division Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at UC Irvine (Irvine, CA)", "Interview Descriptions": "It was brief and concise. They were able to get straight to meeting who you are as a person and what you plan to contribute. They asked a few questions regarding organization and punctuality with deadlines and the expectations they had with overall job performance. It was a good interview and very easy-going.", "Interview Questions": "How do you maintain organization?"}, {"date": "25 Mar 2018", "title": "Producer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC Irvine (Irvine, CA) in Mar 2018", "Interview Descriptions": "Submitted a resume and cover letter, about 2 weeks later was called in for a first interview, called later that day for a second interview. The last interview was about 2 weeks ago and haven't heard from them regarding the position and whether it was filled.", "Interview Questions": "How do you deal with the complications involved in video production?"}, {"date": "17 May 2018", "title": "Assistant Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at UC Irvine (Irvine, CA) in Mar 2018", "Interview Descriptions": "I did not have an interview it was an internal posting. Easy paperwork to fill out. Overall an easy job to apply for with minimal barriers. HR staff is friendly.", "Interview Questions": "They asked about GPA, highest degree"}, {"date": "21 Feb 2018", "title": "RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine", "Interview Descriptions": "Well organized, questions were pertinent and expected. HR managers were nice but succinct. They didn't mince words and I appreciated that. Applicants can expect tough questions but as long as you're thoughtful and genuine you'll do great!", "Interview Questions": "Describe strengths, weakness, time you went above and beyond for a patient. The questions were easy but they were looking for competent and clear answers"}, {"date": "3 Sept 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UC Irvine (Irvine, CA) in Feb 2018", "Interview Descriptions": "The Private investigator asked about my availability, also asked about activities from my resume. Then I interviewed with the lab manager, and I was asked if I am able to adapt to the environment,  and if I am willing to work over time.", "Interview Questions": "What is western blot?"}, {"date": "7 Nov 2019", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UC Irvine (Irvine, CA) in Jan 2018", "Interview Descriptions": "Interview was fantastic and very detailed.  Interviewer took time time to explain job description, benefits and the salary.  I would rate the interviewer as very good and knowledgeable.  I was shown the facilities where I would be working.", "Interview Questions": "What experience do you have?"}, {"date": "15 Dec 2017", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at UC Irvine (Irvine, CA) in Dec 2017", "Interview Descriptions": "Applied after 2 month, then got a email for phone interview. The interview was very short and they let you know whether you get the job after a couple days.", "Interview Questions": "Experience with laboratory."}, {"date": "9 Nov 2017", "title": "Adjunct Lecturer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at UC Irvine (Irvine, CA)", "Interview Descriptions": "There was no formal interview, just a series of casual chats, because I'd been a GSA for the same program and they had known me for years. I don't think they have hired anyone who is NOT a former GSA for years--there is such a huge pool of overqualified, underemployed PhDs and no jobs for them.", "Interview Questions": "Ideas for future course themes"}, {"date": "1 Nov 2017", "title": "GA Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "Was student applying for UCI Division of Continuing Education for a part time position. Apply online and get interview.. was easy and fast to do..hiring process was quick and they were responsive", "Interview Questions": "N/A"}], [{"date": "4 Oct 2017", "title": "Conversation Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UC Irvine (Irvine, CA)", "Interview Descriptions": "Interview process was straight forward.  Questions were simple. The hiring manager/program manager of the position was very sweet, and it was lovely to chat with her. \r\nThe hiring process was the usual HR paperwork, even though the position consisted of less than 10 hours per week.", "Interview Questions": "How would you help international students integrate to UCI campus? "}, {"date": "12 Jul 2021", "title": "Telephone Outreach Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at UC Irvine in Oct 2017", "Interview Descriptions": "It was straight forward and they asked questions revolving the job. Nothing out of left field. They scheduled all the interviews on the same day, which was nice so I didn’t have to travel back and fourth multiple days.", "Interview Questions": "Take me through the process of segmenting and creating calling pools? "}, {"date": "21 Sept 2017", "title": "Postdoctoral Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "Skype interview followed by on site interview.  There is one to one meeting with lab member and with Professor.  The experience was great!!They showed me the facility in the lab.", "Interview Questions": "Question from presentation were asked"}, {"date": "23 Sept 2021", "title": "Mesa Court Center Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UC Irvine (Irvine, CA) in Sept 2017", "Interview Descriptions": "I applied as a freshman during their Fall hiring season. They hire most of the team before the summer and then hire 10 or so more people in the fall. \nI was then interviewed by 2 of the student managers.", "Interview Questions": "How would you deal with a situation where you are in conflict with another center attendant?"}, {"date": "22 Feb 2018", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at UC Irvine (Irvine, CA) in Sept 2017", "Interview Descriptions": "Talk about experience and skills, then ask about what the possible challenges will be and introduce the overall duty and opportunity of the job, discuss over the general benefit and possible risk", "Interview Questions": "What relevant experience do you have previously?"}, {"date": "22 Jul 2017", "title": "Senior Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through other source. I interviewed at UC Irvine", "Interview Descriptions": "Recruiter contacted me via LinkedIn.  He scheduled a phone screen 2 weeks out on a Saturday and forgot to calendar it,  missing the call. He reaches out, I immediately call back and he doesn't return calls. Spent process chasing him down for follow up. After 6 weeks, resume has just now landed with hiring committee. Recruiter was to follow up with a link and yet again failed to send.", "Interview Questions": "What are you doing now that you are no longer employed?"}, {"date": "12 Aug 2021", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC Irvine in Jul 2017", "Interview Descriptions": "The environment was very pleasant, and the staff was very aware and willing to work with students' schedules. I went into the office, and was asked why I was interested in the position and when I would be available to work.", "Interview Questions": "What was my class schedule like?"}, {"date": "28 Mar 2018", "title": "Assistant Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at UC Irvine (Irvine, CA) in Jun 2017", "Interview Descriptions": "There was not a formal interview process. The PI offered the position to help my career transition and finish a collaborative project. I have been working with the PI for several years.", "Interview Questions": "Would you like to extend another three months to finish writing the paper and consulting for several projects?"}, {"date": "21 Nov 2019", "title": "General Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at UC Irvine in May 2017", "Interview Descriptions": "Interviewed by the program coordinator, an academic counselor, and senior general assistant. Was asked some behavioral questions and typical interview questions. After the interview, I had to take an assessment test after for detail-orientedness.", "Interview Questions": "Tell me about yourself."}, {"date": "22 Feb 2017", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at UC Irvine", "Interview Descriptions": "After applying for the job, I heard back a few weeks later via phone call. When I answered the phone, they conducted an impromptu phone interview. The person on the phone made the entire hiring process very clear, telling me all the requirements and steps before conducting the interview. Then, we scheduled an in person interview for the following day, which was followed by an assessment test", "Interview Questions": "Why are you interested in this position?"}], [{"date": "20 Apr 2017", "title": "Data Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine (Irvine, CA) in Mar 2017", "Interview Descriptions": "Submitted a cover letter on job website. And few days later, scheduled for an interview. Was asked about the projects I did. Few days later, I got a call for the offer.", "Interview Questions": "How do you solve conflicts? How do tackle a problem?"}, {"date": "9 Feb 2017", "title": "Office Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UC Irvine", "Interview Descriptions": "Applied on their website. If they are interested in you, most communication is done by email. Received email asking if I was still interested in the position and a date was set to come in to meet with the department managers. Parking at the campus was a nightmare. Be prepared to spend more time looking for parking and paying for it than actually getting to the location. And they don't validate.  Finally arrived at the office and was given a list of questions the interviewers were going to ask me. (Not sure if that applies to all departments.)  Because of that, the interview went smoothly.", "Interview Questions": "What qualifies you for this position?"}, {"date": "31 May 2017", "title": "Resident Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 6 weeks. I interviewed at UC Irvine (Irvine, CA) in Feb 2017", "Interview Descriptions": "You have to make it through a dual process application. You first will write about why you want the position and then you will either be invited or not to an in person interview. It can depend on how well you come off, such as being personal. You will really want to study up on the housing community you are applying for and what its values are and give personal responses to the questions.", "Interview Questions": "Please define diversity/ please give an example of a time you dealt with diversity."}, {"date": "26 Jul 2021", "title": "Marketing Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at UC Irvine in Jan 2017", "Interview Descriptions": "I emailed the Alumni Center about the internship. I received an email to schedule a phone call. After a brief phone call interview, an in-person interview was scheduled which lasted around 25-30 minutes.", "Interview Questions": "The interview process mainly focused on my interpersonal skills and reviewing my course load for the duration of the internship."}, {"date": "14 Jun 2017", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine (Irvine, CA) in Dec 2016", "Interview Descriptions": "The interview process depends on the department. I have had interviews with 3 different departments and all of them were different. \r\nOne had a panel of 6 interviewers and it was a pretty difficult hour-long interview.\r\nOne had a panel of 2 interviewers that was too easy.\r\nOne was a pretty casual interview that was pretty easy as well.", "Interview Questions": "How do you keep yourself organized?"}, {"date": "6 Sept 2016", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at UC Irvine (Irvine, CA)", "Interview Descriptions": "Received a call to schedule a time for the interview. For a work study position, it was like any other interview. I was interviewed by the lab that I wanted to join. My interviewer and I sat in a quiet area and she printed out my resume and asked me behavioral/personal questions. Never asked about anything on my resume, but I had to take a basic chemistry quiz (dilutions only).", "Interview Questions": "What are 3 things that describe you?"}, {"date": "25 Aug 2016", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at UC Irvine (New York, NY)", "Interview Descriptions": "Presentation of your PhD work and any manuscripts submitted for publication as well as technical know hows in that particular field.  Questions on collaborations done with other labs as what took place and results of those collaborations.", "Interview Questions": "Technical Question"}, {"date": "17 Aug 2016", "title": "Instructor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UC Irvine", "Interview Descriptions": "Submitted online application and was contacted within 1 month for an initial group phone call.  Contacted 2 weeks later for a panel interview.  One panelist walked in late to the interview, seemed like a red flag.", "Interview Questions": "how would you know that a student has learned something"}, {"date": "17 Aug 2016", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine", "Interview Descriptions": "Application was first submitted online for review. Once accepted, I was given an offer to come and interview with selected faculty who were interested in me. During these meetings we discussed future research plans and fit with respective labs. I was also introduced to other graduate students in the department and taken on a tour with them and later to a dinner. It seemed as if the graduate students were also part of the interview process as they asked a lot of questions about my own work and how it would fit into their respective labs.", "Interview Questions": "Describe in detail a study you would like to run when you start in the Fall."}, {"date": "5 Aug 2016", "title": "Instructor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "phone screening followed by panel interview with HR, department head, hiring manager, and instructors.  Excellent communication throughout the entire process.  Panel had questions prepared in advance, a mix of technical and behavioral questions.", "Interview Questions": "How would you teach concept X to a student"}], [{"date": "10 Mar 2017", "title": "Summer Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UC Irvine (Irvine, CA) in Aug 2016", "Interview Descriptions": "It started by contacting professors and talking about the available projects. Then, a short interview was conducted that was merely like a chat just to get to know each other.", "Interview Questions": "Why do you want to do research?"}, {"date": "16 Aug 2018", "title": "Photographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UC Irvine (Irvine, CA) in Jul 2016", "Interview Descriptions": "It was straight to the point and helpful. The interviewer told me exactly what he was looking for and did not waste my time or his time. I appreciated his honesty and the interview went very well overall.", "Interview Questions": "Do you have a portfolio?"}, {"date": "22 Jan 2019", "title": "Photographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at UC Irvine in Jun 2016", "Interview Descriptions": "Went through a panel interview that lasted about an hour long. I met with the director, supervisor, and a colleague in the same role I applied for.  I was greeted and asked to sit in a group with the 3 interviewers. I was asked about basic understanding of camera functionality and editing software. I was also asked to provide a portfolio going over my best and worst photos, explaining what I liked about each and where I could have improved.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "11 Feb 2018", "title": "Video Production Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at UC Irvine (Irvine, CA) in Jun 2016", "Interview Descriptions": "Got a call from the manager asking to see my interest in the position. Went in for an interview. Later got a call from the manager saying they wanted to move forward and later went in to meet HR.", "Interview Questions": "What kind of video productions did I have experience with?"}, {"date": "3 Jun 2017", "title": "Software Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at UC Irvine (Los Angeles, CA) in May 2016", "Interview Descriptions": "I applied through recruiter. I interviewed at UC Irvine in May 2016. Phone screen and one hour in person interview. Interview level was average.  There was a panel of three members.  Technical questions were basics.", "Interview Questions": "Calculate a^b  that is super power of number."}, {"date": "20 Oct 2020", "title": "Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at UC Irvine (Irvine, CA) in May 2016", "Interview Descriptions": "A couple of questions about work ethic and asked about how much of a school load you have.  I was a student worker so they had to make sure that I had enough credits and time to work.", "Interview Questions": "How many classes are you taking this quarter? "}, {"date": "1 Feb 2018", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at UC Irvine (Irvine, CA) in May 2016", "Interview Descriptions": "It was easy and the process took about 2 weeks. The person was friendly and it was very one on one. Once I started I loved it and wish I could have stayed there longer", "Interview Questions": "How do I work individually and as a group?"}, {"date": "22 Feb 2018", "title": "Lab Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UC Irvine (Irvine, CA) in May 2016", "Interview Descriptions": "One on one in-person interview. The interviewer was in relaxed clothes and spoke candidly about expectations for the job. It was a fairly long conversation (roughly half an hour). The interviewer was never outwardly rude, but was fairly cold throughout.", "Interview Questions": "How do you feel about euthanizing animals? "}, {"date": "7 Mar 2016", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at UC Irvine", "Interview Descriptions": "The process was intense, but the people were amazing. There was a good mix of younger and older professionals and they seemed to value diversity. I had a phone screening with multiple people followed by an in person interview with the director.", "Interview Questions": "why I wanted to work on a college campus"}, {"date": "27 May 2016", "title": "Information Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC Irvine (Irvine, CA) in Mar 2016", "Interview Descriptions": "Communication was good before and after the interview, however the interview was via a website called interviewstream, where you read a question, then record a video answer. You get three tries (which is good), but it makes the interview pointless for the interviewee because there's no way to ask them questions, gauge responses etc.", "Interview Questions": "Describe an accomplishment related to this position."}], [{"date": "26 Feb 2016", "title": "Postdoctoral Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UC Irvine", "Interview Descriptions": "The interview lasted about 1 hour, beginning with an casual chat about things I have done and what I want to accomplish. Then more details into what I did in terms of research projects. Exchanged ideas about what I can do to move the project forward. Overall, very general questions and did not involve specific technical details.", "Interview Questions": "What do you want to do for your future career."}, {"date": "19 Jul 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at UC Irvine (Irvine, CA) in Feb 2016", "Interview Descriptions": "I sent an email to the hiring manager and said I was interested in the position and attached my resume along wit the email. She was quick to respond and set up an interview time with me. The interview was a very quick interview! Basically was told of job requirements and expectations and asked to tell them about myself.", "Interview Questions": "Tell me about your previous work experiences"}, {"date": "23 Mar 2017", "title": "Programmer Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at UC Irvine in Jan 2016", "Interview Descriptions": "Starts with 1:1 phone screen with mostly general tech questions that took about 1h, followed by panel tech interview with whiteboard exercises a week later that was also about 1h, then finally general \"fit\" panel interview for 1h.", "Interview Questions": "How do you prioritize projects?"}, {"date": "26 Jan 2017", "title": "Clinical Nurse I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UC Irvine (Orange, CA) in Jan 2016", "Interview Descriptions": "Very casual! There were three pages of interview questions that come based off of your application and survey, so it will change for everyone. I was just with the nurse manager so I felt very at ease and able to answer as myself without the pressure of multiple people watching me.", "Interview Questions": "This is by far the most common interview question I have gotten as a new grad, name a time your patients status changed rapidly and what did you do?"}, {"date": "17 Dec 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at UC Irvine", "Interview Descriptions": "No interview.  Sign up for preferred TA courses and get assigned about a week before courses begin.  TA position is apart of graduate stipend.  There is no in person interview when you recieve funding through graduate school.", "Interview Questions": "Fill out survey online only."}, {"date": "3 Dec 2015", "title": "Postdoctoral Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at UC Irvine (Irvine, CA)", "Interview Descriptions": "- Email conversation after resume submission. My previous advisor had connection to the new advisor, although I did not know that during initial contact - Skype conversation with main advisor - In person presentation and full day of meetings. Officially offered position at the end of the final interview day.", "Interview Questions": "Very detailed questions about my study system."}, {"date": "22 Nov 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "The interview process was quite simple. It was more of signing paperwork than an interview. This could have been because the position was not competitive at all. After a 6 moths, the salary was renegotiated from ten dollars an hour, to fifteen dollars an hour.", "Interview Questions": "Any previous experience?"}, {"date": "12 Sept 2017", "title": "Student Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at UC Irvine (Irvine, CA) in Oct 2015", "Interview Descriptions": "First I submitted an application in person at the UCI job fair. Then phone interview before being invited to group interview. The group interview consisted of about 20 applicants and 3 interviewers. Fun, out of the box questions", "Interview Questions": "Sell an object that was given to you (water bottle, pen, etc...)"}, {"date": "6 Sept 2016", "title": "Work Study Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at UC Irvine (Irvine, CA) in Oct 2015", "Interview Descriptions": "It was about an hour long and I was asked about myself and what work experiences I have and what programming languages I was comfortable with. Then had a little technical question to do on the computer.", "Interview Questions": "Do this simple query in SQL."}, {"date": "17 Sept 2015", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at UC Irvine", "Interview Descriptions": "Talked to three different people. The research coordinator, the physician, the psychologist. It was all one on one. It was a casual interview. They were professional and punctual. Asked questions and tried to get to know me.", "Interview Questions": "Tell me a little about yourself. What is your availability like? Why do you like research?"}], [{"date": "1 Sept 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at UC Irvine", "Interview Descriptions": "Received a letter of acceptance to the program relatively late in the recruiting season, but was able to attend a recruiting weekend. Met with professors and graduate students throughout the day, and everyone was very friendly. Also had a fun excursion to a bar at night with a few grad students, although in recent years this part of the recruiting weekend has been cut out in favor of on-campus parties.", "Interview Questions": "Professors did not push too hard to recruit, which I liked."}, {"date": "23 Sept 2015", "title": "Pavilion Greeter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at UC Irvine (Irvine, CA) in Sept 2015", "Interview Descriptions": "Started with informational session, followed by quick interviews to determine capabilities for positions.  All recruiters were energetic, enthusiastic and informative.  It was a very positive experience that made me feel good to be offered a position.", "Interview Questions": "What 2 positions I would like most to have."}, {"date": "14 Apr 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at UC Irvine (Irvine, CA) in Sept 2015", "Interview Descriptions": "Very easy, friendly supervisor. Asked basic questions about you, what do you choose this position. Walked you through the job's descriptions and told you what to be expected if you want to work here", "Interview Questions": "Tell me about yourself"}, {"date": "13 Aug 2015", "title": "I Was A Contract Student Affairs Specialist During Summer Session Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at UC Irvine", "Interview Descriptions": "Interviews are conducted by several hiring managers. Generic questions about previous work experience and punctuality. Really relied on detailed orientated staff members. Asked about what makes you stand out from other candidates.", "Interview Questions": "How did you handle an unsatisfied guest?"}, {"date": "1 Feb 2018", "title": "Help Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UC Irvine (Irvine, CA) in Aug 2015", "Interview Descriptions": "The interview process was at least 30 minutes. The interview consist of mostly behavioral Questions with general technical questions regarding OS of my current computer. To summarize, the interview mostly looked for good workable people.", "Interview Questions": "What is your favorite web browser?"}, {"date": "10 Jul 2015", "title": "Graduate Student Researcher Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "I sent my resume to the professor and because of my background I was recommended to apply for admission. The professor also interviewed me and it came out very impressive to be a match for the lab. I applied and got the admission.", "Interview Questions": "I was asked by the professor that how good I am in managing multiple projects at a time and meeting deadlines."}, {"date": "30 Jul 2015", "title": "Instructor (Big Data) Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at UC Irvine in Jul 2015", "Interview Descriptions": "Met with a member of UCI's Extension team over the phone. He was friendly and professional. He mentioned the fee that UCI pays its Big Data instructors, which was significantly below market rate - compared to what a Big Data vendor would pay a contract instructor.  Not only that, but the UCI course is longer in length and requires much more effort than the average vendor Big Data course. The whole conversation seemed pretty unrealistic, to be honest.", "Interview Questions": "Tell me about yourself?"}, {"date": "11 Jun 2015", "title": "Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at UC Irvine", "Interview Descriptions": "Talked to professor. Met him at his lab, met grad students, and he taught me how to use all the required equipment. He asked about my schedule and availability over summer for paid research as well.", "Interview Questions": "What my class schedule was."}, {"date": "26 Jun 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at UC Irvine (Irvine, CA) in Jun 2015", "Interview Descriptions": "I described my area of interest in research to my Professor and asked if a position for Research assistant was available, I had also forwarded my Resume. \r\nHe asked me to meet him and discuss it in detail and after a small discussion I was asked about my availability over the summer, since he already knew that I got a good grade in the corresponding area of interest he offered me the position. \r\nI was also asked to work on some unfinished projects left by prevous members.", "Interview Questions": "Are you Available over the summer?"}, {"date": "12 May 2015", "title": "Assistant Director of Research Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UC Irvine (Irvine, CA)", "Interview Descriptions": "No Process. The individual responsible with hiring has no clue of the process (not qualified for the position to be a manager/director). The department is full of close minded individuals that don't respect the interviewee. Full of hypocrites that are clueless to their own position.", "Interview Questions": "During the 1:1 session, the first question received was, 'are you a cat or dog person?' (from an individual that has an equivalent position)."}], [{"date": "16 Dec 2018", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at UC Irvine in May 2015", "Interview Descriptions": "Applied through the school's job/employment opportunities website. Standard application procedures. Then received a call and follow up email to schedule an interview.. After interviewing,  job was offered 3 days later. Accepted and had to fill out forms etc.", "Interview Questions": "What are your strengths/weaknesses? Why do you want to work here? What's your availability?"}, {"date": "21 Oct 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at UC Irvine (Irvine, CA) in May 2015", "Interview Descriptions": "It was not too difficult. They asked a lot of basic questions like what your job experience was and what the qualifications were for the occupation. They're really friendly people and the interview process went very smoothly.", "Interview Questions": "How organized are you?"}, {"date": "7 Apr 2015", "title": "Composition Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at UC Irvine", "Interview Descriptions": "Granted the position as a graduate student. There isn't much else to say because I didn't have a formal interview until after I'd already been working there for three years. This was just a formality.", "Interview Questions": "Asked about previous teaching experience."}, {"date": "16 Apr 2015", "title": "Administrative Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UC Irvine (Irvine, CA) in Apr 2015", "Interview Descriptions": "I applied online and received an email for a phone interview a few days later. I spoke with the hiring manager for the phone screening, and the office was very accommodating to my schedule. I was offered an interview and was able to conduct it on a weekend. I met with the rest of staff later that week in another round of interviews, one was 2:1 and the other was 1:1.", "Interview Questions": "What are your career goals?"}, {"date": "12 Mar 2015", "title": "Senior Administrative Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UC Irvine (Irvine, CA)", "Interview Descriptions": "Large interview panel of approx 8 ppl--did not know about the panel until I walked into the room. MS PowerPoint presentation by me, as requested by hiring manager prior to accepting and scheduling the interview. Ended with a series of questions asked by each member of the panel.", "Interview Questions": "How do feel about presenting in front of a large crowd, possibly as big as over 200 people?"}, {"date": "28 Nov 2015", "title": "Research Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at UC Irvine (Irvine, CA) in Mar 2015", "Interview Descriptions": "Multiple rounds of interaction with a professor that will try to determine if you are the right fit by asking a range of questions related to your field. Hard to say exactly what the process is because it will vary a lot depending on the department and the professor.", "Interview Questions": "Why would you like to work here?"}, {"date": "1 Sept 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UC Irvine in Mar 2015", "Interview Descriptions": "Written application including personal statement, research experience, resume, etc. The interview process includes one on one discussion of chemistry with professors in the department. Professors assess your knowledge of chemistry through discussion of their own research programs and your prior research experience.", "Interview Questions": "What is your most important scientific contribution?"}, {"date": "13 Oct 2016", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at UC Irvine (Irvine, CA) in Feb 2015", "Interview Descriptions": "Sit down with a manager. Discuss hours you're free to work. Get hired. Really not much more difficult besides the tedious paper application that they never read other than to see your available hours", "Interview Questions": "When can you come in"}, {"date": "6 Jun 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at UC Irvine (Irvine, CA) in Jan 2015", "Interview Descriptions": "very friendly and nice talk. interviewer was not mean or rude at all. very friendly and comfortable. They was very able to know what skill sets i have and how this contribute to their research", "Interview Questions": "why you think that you are qualified with this job"}, {"date": "24 Jul 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at UC Irvine (Irvine, CA) in Jan 2015", "Interview Descriptions": "Brief a series of questions written on paper for me to see and then we went over my availability as well as why I would want to work at the job.", "Interview Questions": "Where do you see yourself in 5 years and how will this job help you achieve that goal. "}], [{"date": "18 Dec 2014", "title": "Activities GA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at UC Irvine", "Interview Descriptions": "Fair and great experience, the interviewer made an easy going environment and also answered her own questions in her own way first. Group interviews are a lot less stressful and takes some of the load off of your shoulders.", "Interview Questions": "Questions were all customer service based."}, {"date": "11 Dec 2014", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "The job interview process can be lengthy. Being interviewed once and getting a job offer is typically a thing of the past. Today, many companies have an involved interview process starting with screening interviews, followed by in-person interviews, second interviews and even third interviews", "Interview Questions": "tell me about yourself"}, {"date": "14 Aug 2015", "title": "Administrative Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UC Irvine (Irvine, CA) in Nov 2014", "Interview Descriptions": "Three person panel interview, was nervous but it went well.  Was offered the job, happily accepted it. Unfortunately the offer was rescinded, illegally according to my attorney, but what can I do?  Don't have the time or funds to legally challenge that, will just move on.", "Interview Questions": "Give example of what you did not like about your last position."}, {"date": "20 May 2016", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at UC Irvine (Irvine, CA) in Nov 2014", "Interview Descriptions": "Usually be tested by the Professor who teaches the class on the class material. You also need to get an A in the same class when you took it. You usually need to apply through the engineering office, then you will need to send your resume to the Professor. He will review it and if he feels like you are a good fit, he will ask you in for an interview.", "Interview Questions": "Describe how OP-AMP works"}, {"date": "31 Oct 2014", "title": "Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at UC Irvine", "Interview Descriptions": "Talk and interview. Met with  most of the faculty. It is a typical interview process for a faculty position. I met with faculty who had common interests with me which I thought was very positive. The whole process was very friendly.", "Interview Questions": "What do I plan to do in 5 years?"}, {"date": "8 Oct 2014", "title": "Marketing Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine (Irvine, CA)", "Interview Descriptions": "Panel interviews seem to be the norm.  I was interviewed by 5 people simultaneously.  They called it popcorn style and questions were directed at me from all members of the panel in a somewhat random order.  After advancing to the next round, I was asked to answer a case and submit my input in writing, rather than a presentation.", "Interview Questions": "N/A"}, {"date": "4 Sept 2014", "title": "Administrative Assistant III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UC Irvine", "Interview Descriptions": "Applied via their website and was called rather quickly. Set up an interview with the Director of the program that week. Immediately after finishing the interview with the Director, I was taken to the neighboring coworker's office and sat for another interview with her. I was also walked around the office being introduced to others. I believe this is so that everyone can get a feel for your fit, even if they aren't directly interviewing you. A few days later, I was invited back for a third and final interview with the most senior colleague which ending up being very casual and conversational. It was definitely the easiest interview of the the three.", "Interview Questions": "What are your future goals"}, {"date": "4 Sept 2014", "title": "Student Affairs Officer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "It was an interesting process. It depends on which department you are interviews for, but most of the questions were to fit and experience questions. The office environment seemed very upbeat and everyone seemed to genuinely be good colleagues .", "Interview Questions": "What was my favorite color and how it relates to the person I am. "}, {"date": "1 Nov 2015", "title": "Graphic Design Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at UC Irvine (Irvine, CA) in Sept 2014", "Interview Descriptions": "There was a brief interview at a campus job fair where I just turned in an application and was asked a few general questions about my skills and experience. This got me to the next interview in an office with the hiring manager. The second interview took around 10 minutes, but was also straightforward and simple.", "Interview Questions": "Do you have experience using the Adobe design products?"}, {"date": "27 Jul 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC Irvine (Irvine, CA) in Sept 2014", "Interview Descriptions": "I was first interview on the phone by the director of HR and the Dean Associate. I was then selected for an in-person interview with the search committee and was invited to come back to do a second round and meet my team. Excellent process!", "Interview Questions": "It was a list of preset questions that opened up to a dialogue about the position."}], [{"date": "25 Oct 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UC Irvine (Irvine, CA) in Sept 2014", "Interview Descriptions": "Get into PhD program. Have experience either in academics and industry. Show you can think on your own. PhD students get first dibs to be a TA. They are required 2 quarters of TAship to get a PhD in the computer science school. Submit online availability form. You can pick which courses you would like to TA for. They will get back to you with an offer.", "Interview Questions": "I did not have an interview besides the online application."}, {"date": "24 May 2016", "title": "Student Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UC Irvine (Irvine, CA) in Sept 2014", "Interview Descriptions": "I applied via Zotlink and got a call a few weeks later. I met with HR and the senior financial analyst. The interview was fun and relaxing, mainly discussing any experiences and volunteerism I had and not much was stated about the position directly.", "Interview Questions": "Tell me about your resume."}, {"date": "15 Jun 2015", "title": "Administrative Specialist, Planning and Budget Office Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UC Irvine (Irvine, CA) in Aug 2014", "Interview Descriptions": "Phone screening, followed by a panel interview with three members. The last interview was with the Vice Provost that was more casual in nature. The questions were very easy and everyone was extremely nice during the process. During my last visit, I was shown around the office and introduced to some of the staff members.", "Interview Questions": "What is your experience working with budgets?"}, {"date": "18 Jul 2014", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at UC Irvine (Irvine, CA)", "Interview Descriptions": "The interview was very simple and straightforward. They just asked how I would teach the course I was applying to teach and I told them and they wanted lots of past references to talk to about my teaching experience. I had to give examples of my teaching methodology and samples of past courses taught with samples of materials and past student evaluations. It was not hard it was just tedious. Good luck!", "Interview Questions": "Give me examples of how you will teach your material."}, {"date": "16 Jul 2014", "title": "Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at UC Irvine", "Interview Descriptions": "In order to be considered for an interview a resume must be submitted to the professor. If the professor likes your resume be ready to answer questions about the projects/experience you have had before. During the interview the professor measures up your personality and how you react under pressure with different types of questions. Also, specific questions can be asked about anything you put on your resume.", "Interview Questions": "He asked questions about the Projects I worked on. Also, asked question about my work ethic."}, {"date": "14 Jul 2014", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at UC Irvine", "Interview Descriptions": "The LARC office sends out an email to all students with GPAs above 3.25 who also did exceptionally well in specific subjects. The student then has a certain amount of time to fill out an application, which includes his/her unofficial transcript and two faculty recommendations. Turn in the application as soon as possible, especially if your GPA is closer to 3.25, because a big part of the decision to invite the applicant for an interview comes from the early submission time of your application. The interview is a group interview, with about 2-3 other applicants and is pretty relaxed. My interviewer emphasized relaxation and no judgement throughout the interview. They ask questions ranging from what do you think are three characteristics a great tutor should have to would you be open to hang out with other tutors and attend LARC socials? They care about providing a sense of community and understanding in the LARC program because that's really how a tutor should be with his/her students.", "Interview Questions": "What is one random fact about you as a child?"}, {"date": "21 Jun 2016", "title": "Full-time ESL Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at UC Irvine (Irvine, CA) in Jul 2014", "Interview Descriptions": "There is a two-step process. The first are the usual employment experience questions, how many years and what skills have you taught, classroom management scenarios, etc. They second stage is a teaching demonstration. You are given a topic (thing of difficult grammar points especially), and given some time to prepare. Then the interviewing panelists will act as your students. Be prepared for them to throw questions and perhaps behavior issues at you.", "Interview Questions": "What is your teaching philosophy?"}, {"date": "15 Oct 2015", "title": "OpenCourseWare Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UC Irvine (Irvine, CA) in Jun 2014", "Interview Descriptions": "Interview was very brief and was consistently focused on my abilities rather than my work experience. I patiently stood outside of the office doors as I waited to called to the interview room. Once called, I was greeted by two directors: one from the department I was applying for, and one from Human Resources. I was not in the best shape to provide a strong interview, but the interviewers continued to make me feel at ease by smiling and sustaining a gentle tone. They ask me specifically if I can fulfill my duties within specific situations and context; which gave me a clearer ideas of how the workflow will be.", "Interview Questions": "Q: How did you learn or train to acquire [specific skill]?"}, {"date": "12 Jun 2017", "title": "Tutorial Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UC Irvine (Irvine, CA) in May 2014", "Interview Descriptions": "Intensive interview process.  Ensures the candidates are well prepared for the rigors of the job.  Staff are welcoming and do not shun you from any response.  Great interview for the job", "Interview Questions": "Please lead a mock tutorial session."}, {"date": "1 Apr 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at UC Irvine", "Interview Descriptions": "Standard Graduate School Application", "Interview Questions": "Standard Application Process. Rather opaque, but that's standard."}], [{"date": "25 Sept 2018", "title": "Grad Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine (Irvine, CA) in Apr 2014", "Interview Descriptions": "Face to face interview with potential research advisors about your research objectives and goals, process pipe line and subjects of interest. Very flexible and understanding environment, they want you to succeed.", "Interview Questions": "Why this program and why this subject "}, {"date": "31 May 2017", "title": "Student Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at UC Irvine (Irvine, CA) in Apr 2014", "Interview Descriptions": "They asked me pretty basic questions. Most of the time they were just talking about the position and what it entails. It's an easy interview to be honest. Just be yourself, they just want someone who is reliable and trustworthy enough to handle their admin work. Just smile and be positive!", "Interview Questions": "Tell me about yourself"}, {"date": "18 Jan 2017", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at UC Irvine (Irvine, CA) in Mar 2014", "Interview Descriptions": "Once you are asked for an intake you will take a few tests on the computer to test typing speed, excel, and word proficiencies. Then you will review your experiences and what you are looking for on campus. There are different levels of employment and the pay scale reflects this.", "Interview Questions": "Test Microsoft Word and Excel knowledge. "}, {"date": "31 Jan 2014", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "There is no interview. Submit your application materials and in most cases you will have no interview.  If there is something special about you, and they really want you, there might be an interview.  There is almost no care about any exams or tests if you are worried about that.", "Interview Questions": "N/A"}, {"date": "24 Feb 2014", "title": "Executive Director of Center for Autism Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC Irvine in Feb 2014", "Interview Descriptions": "The initial call was a phone interview to debrief me about the job description, discuss the details of this job description and salary and benefits it offers. A more in depth interview with a committee will take place late March. There will be more opportunities to learn about this role and ask questions then.", "Interview Questions": "There were no difficult or unexpected questions. "}, {"date": "28 Dec 2016", "title": "Phd Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UC Irvine (Irvin Cobb Resort, KY) in Feb 2014", "Interview Descriptions": "I first emailed one of the professors I found related to my interests. Then he replied me that he wants to take a new student this year. So I applied and after that I was interviewed with him.", "Interview Questions": "Some general questions like why you chose UCI? Why this field? ... He also asked me a bit about my previos projects but not any technical interviw questions"}, {"date": "14 Oct 2016", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at UC Irvine (Irvine, CA) in Feb 2014", "Interview Descriptions": "Walk into the place long waddup I got an interview. Wait for a sweaty manager to come sit down with you to ask what times you're able to come in & if overyime is an option", "Interview Questions": "behavioral"}, {"date": "20 Jan 2014", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at UC Irvine (Irvine, CA)", "Interview Descriptions": "Interview was straight-forward and not intimidating. Questions were job-related so if you understand what the job is about you will be fine. Mostly common sense questions.", "Interview Questions": "N/A"}, {"date": "16 Jan 2014", "title": "Reader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UC Irvine (Irvine, CA) in Jan 2014", "Interview Descriptions": "The professor just ask me some basic knowledge of C programming.", "Interview Questions": "N/A"}, {"date": "2 Dec 2013", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "There was no interview since I have been a teaching assistant for a couple of years and had established myself as a successful TA.", "Interview Questions": "N/A"}], [{"date": "11 Nov 2013", "title": "Graduate Student Researcher Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at UC Irvine", "Interview Descriptions": "Direct contact with faculty.", "Interview Questions": "Research plan."}, {"date": "27 Aug 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC Irvine (Irvine, CA) in Nov 2013", "Interview Descriptions": "I received a call from the recruiter who asked a series of questions.  I was advised that it was fairly likely I would be getting a call back based on my positive feedback & answers. I received a call the following day - interviewed with the supervisor in person.  Was called back for the final panel interview with the Vice Chancellor and 3 of his staff.  Nailed the interview & started working in Jan upon returning from vacation.", "Interview Questions": "To describe one of the most difficult situations in the workplace that I've felt I overcame.  How did I go about the process, what did I do to succeed and what would I do differently next time."}, {"date": "16 Jan 2014", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at UC Irvine (Irvine, CA) in Oct 2013", "Interview Descriptions": "The interview consisted of meeting every person in the lab for approximately 20 minutes.  I met with the PI for 1 hour in the morning and was shuffled between people.  I went to lunch with the lab members and at the end of the day gave a 1 hour talk on my scientific background and recent publication.  \r\n\r\nThe hiring process was fairly simple.  I heard it varies from department to department.  The Department of Anatomy was helpful.  You should follow up if you haven't heard about parts of your paperwork in a few days.  There are lots of post-doctoral researchers, and sometimes they forget.", "Interview Questions": "What specific aims would you propose based on the findings of your last publication."}, {"date": "9 Mar 2017", "title": "Psychologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at UC Irvine (Irvine, CA) in Oct 2013", "Interview Descriptions": "Need to present strong case presentation. Meet with management and other staff. Questions on clinical skills, interpersonal skills, commitment to diversity issues. Interview process is very important to determine fit to staff and job position.", "Interview Questions": "Question about clinical case"}, {"date": "21 Aug 2013", "title": "Staff Research Associate II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UC Irvine in Aug 2013", "Interview Descriptions": "Very strong background in Molecular and Cell Biology, but no stem cell experiences", "Interview Questions": "animal experiments and stem cell experiments"}, {"date": "17 Aug 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at UC Irvine (Irvine, CA) in Aug 2013", "Interview Descriptions": "The interviewer was very friendly and open. She made sure I was comfortable and would stop to make sure I understood the requirements of the job. After going over the requirements, she asked me about my availability as well as a schedule of my classes so that we could find a consistent time where I would be able to work. It was very school-friendly and open to new students looking for work experience and money to help them pay for school, food, or rent.", "Interview Questions": "Do you have any experience in administrative work?"}, {"date": "14 Jul 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at UC Irvine", "Interview Descriptions": "Letter, grades and interview based interview process", "Interview Questions": "Major research interests in details"}, {"date": "29 Aug 2013", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UC Irvine in Jun 2013", "Interview Descriptions": "Applied online, contacted within 2 weeks. Went to two interviews.  The first was an skills and experience evaluation, and the second was an evaluation for fit. Both interviews took a little more than and hour each.", "Interview Questions": "How do you get tasks done when standard procedures give conflicting steps. "}, {"date": "8 Nov 2014", "title": "Finance Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at UC Irvine (Irvine, CA) in Apr 2013", "Interview Descriptions": "I applied on the school career center's website. The process took about one week. I got an interview with four full-time staffs, including the HR Analyst. They basically asked behavioral questions and went over your resume. They only asked if you know about Excel but did not test your skills. It was an easy interview. I was called one or two days later and received an offer.", "Interview Questions": "Easy. Just Behavior questions. Ask if you know Excel."}, {"date": "24 Jul 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at UC Irvine (Irvine, CA) in Apr 2013", "Interview Descriptions": "A phone call was conducted to determine an interview appointment. This led to a face to face interview where the director (hiring manager) walked you through the various roles and responsibilities related to the job. The interview mostly consisted of questions that assessed your competency and ability to manage several tasks at once as well as familiarity with certain processes and tools. It was a one round interview.", "Interview Questions": "What is your availability?"}], [{"date": "3 Mar 2017", "title": "Housing Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at UC Irvine (UCI, CA) in Mar 2013", "Interview Descriptions": "It was a bit intimidating as there were 3-4 people interviewing you at the same time. They asked some outside the box questions such as if you had a super power, what would it be?", "Interview Questions": "If you had a super power, what would you pick and why?"}, {"date": "16 Aug 2015", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC Irvine (Irvine, CA) in Mar 2013", "Interview Descriptions": "Relatively painless and short, just some personal questions and some detail about past work experience. In the end you just walk on site for the interview and then afterwords if they liked you or thought you'd be reliable they let you know that you had an offer. I'm not quite sure how it works if you got rejected though.", "Interview Questions": "How would you act in front of a troubled customer?"}, {"date": "5 Mar 2013", "title": "Division of Dean of Students Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC Irvine (Irvine, CA) in Mar 2013", "Interview Descriptions": "Hiring committee consisted of approximately 8-10  mid-to-senior level employees. There was an agenda that was followed for consistency. Employee introduction to committee members followed by a round-table format of standardized questions approximately 2 per member. Questions closely adhered to job description, job priorities, job stability with only a few left field questions that could not be prepared in advance. Candidates that advanced were also expected to form a mock 5 minute presentation on a scenario.", "Interview Questions": "Left field questions: How/What would you do if (blank) crisis developed and there was no protocol in place?"}, {"date": "20 Oct 2016", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at UC Irvine (Irvine, CA) in Jan 2013", "Interview Descriptions": "I applied through a referral from a friend. Had an interview with one of the managers there, was offered the job. Everyone was very friendly yet professional, and the overall process was very quick. The questions were all very standard and to the point.", "Interview Questions": "Why do you think you're a good fit for this position?"}, {"date": "18 Oct 2017", "title": "Database Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UC Irvine (Irvine, CA) in Jan 2013", "Interview Descriptions": "Had a series of three interviews.  Two in person and one phone interview. Thorough background check and reference check.  The process moved very quickly (less than 7 days from initial phone interview). References were checked same day of in person interview.", "Interview Questions": "Very technical questions around replication and clustering."}, {"date": "24 Oct 2012", "title": "Crew Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at UC Irvine (Irvine, CA)", "Interview Descriptions": "Interview process, asked questions about balancing time work school. Questions about own's weaknesses and strengths. Once hired, get a time card, get the Bren apparel and ID Card. Work hours are flexible. The older members teach the new members how to do things.", "Interview Questions": "What is your weakness is always the hardest question because there are so many. Second would be what is your strength since it is very subjective. Both questions can be easily answered but a lot of thought is put into it afterwards, reflecting upon your answers can make you a better person."}, {"date": "11 Apr 2016", "title": "Tech Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at UC Irvine (Irvine, CA) in Oct 2012", "Interview Descriptions": "Very informal, met with two senior staff who asked about basic programming and scripting techniques. Laid back and made sure everything was comfortable. Started off with basic personality questions and team fit. Then went to the server rooms and had an interview there with more technical questions. Finally was given 20 minutes to write a script.", "Interview Questions": "How would you create a script to run every night across every server to perform XXX task?"}, {"date": "13 Sept 2016", "title": "Computer Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at UC Irvine (Irvine, CA) in Oct 2012", "Interview Descriptions": "Quick and easy. Was panel based, expect 2-3 members of the upper management to interview you. Bring your resume, they will ask about basic IT related topics such as getting rid of viruses, fixing screens, and more. Discussed pay and hours.", "Interview Questions": "How would go about replacing a Logic Board on a MacBook Pro?"}, {"date": "17 Oct 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at UC Irvine (Irvine, CA) in Sept 2012", "Interview Descriptions": "You need to pass an english test if you are an international student. The test has 4 sections. They give you 15 minutes to get ready yourself with some material they will give you. You must explain a graph and be ready to answer questions about it, then, you need to explain a couple of terms from your area of expertise, then you need to give a mini class of 4 minutes and at some point there will be an interview where they will ask about you, just to see if you can understand english", "Interview Questions": "What did you do this summer?"}, {"date": "21 Mar 2016", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UC Irvine (Irvine, CA) in Sept 2012", "Interview Descriptions": "Interview took place on campus in the school of social ecology building. Interviewer was interested in knowing whether I work in a micro or macro managed environment and how I work with others. I was accepted an offer within the next two days.", "Interview Questions": "Do you prefer to work in a micro managed or macro managed environment?"}], [{"date": "27 Dec 2013", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at UC Irvine (Irvine, CA) in Jul 2012", "Interview Descriptions": "I sent my academic resume to UCI through a funding agency. They liked the resume and called me for an interview.", "Interview Questions": "General question about my research interests and future plans."}, {"date": "1 Dec 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at UC Irvine (Irvine, CA) in Jun 2012", "Interview Descriptions": "Prospective interviewees would submit their resume online. Approximately two to three weeks later, administration would call the students and schedule a panel interview lasting around 30-45 minutes long. In about one week, administration would call potential applicants for a second round of interviews. The final applicants would be hired.", "Interview Questions": "How would the student direct somebody who had trouble locating a particular building on campus? Many applicants are in their first year of college and don't know much about the geography."}, {"date": "11 May 2016", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at UC Irvine (Irvine, CA) in May 2012", "Interview Descriptions": "First interview was one-to-one interview with the department manager.  Second interview involved more staffs at the same time, dept manager, school head, and other supervisory level staffs.  Interview does not contain any practical test on computer, no personality test, nor IQ test is required.  However, it requested for your working authorization documents.", "Interview Questions": "Why do you apply for this position?  What make you think you are best suitable for this position?"}, {"date": "26 Nov 2016", "title": "Biomedical Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC Irvine (Irvine, CA) in May 2012", "Interview Descriptions": "First, the applications were reviewed and the candidates were narrowed down to a few. The few that were chosen were then able to have two phone interviews to determine their eligibility. Very professional and intellectual.", "Interview Questions": "What classes have you taken and how do you think they will affect your performance?"}, {"date": "21 Jul 2014", "title": "Sports Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at UC Irvine (Irvine, CA) in Apr 2012", "Interview Descriptions": "I sent in a cover letter and resume. They got back to me and I had a group interview with 2 other people. It was a relatively smooth group interview, everyone a fair opportunity to answer the questions. After that interview, they called me back for another interview, but it was essentially to say that I had gotten the internship", "Interview Questions": "What are the things that motivate you to work?"}, {"date": "16 Dec 2014", "title": "General Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UC Irvine (Irvine, CA) in Mar 2012", "Interview Descriptions": "I applied online through UC Irvine's career website (ZotLink) with just a resume. They called me to schedule an interview, which consisted of a panel. The panel took turns asking questions and all seemed engaged and knowledgeable. I received an offer via phone call about a few days later with a job offer.", "Interview Questions": "Past challenges and how one overcame them."}, {"date": "7 May 2013", "title": "Projektleiter / Verkäufer international Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at UC Irvine (Irvine, CA) in Mar 2012", "Interview Descriptions": "I was contacted through email, asking which days I was available for coming in for an interview. During the interview, I was tested for skills, mainly about Java and inheritance. Then afterwards, he asked me if I was to design a media library program, how would I do it?  Using paper, I drawn out the UI and abstract objects that most likely were needed in such a program.", "Interview Questions": "How would you design a media library program?"}, {"date": "16 Oct 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UC Irvine in Feb 2012", "Interview Descriptions": "I applied online and then went and spoke to the manager and asked them to interview me.  There were 300 applicants for the job, so I became a volunteer.  After volunteering for 6 weeks, I had an interview.", "Interview Questions": "How many children do you have"}, {"date": "7 Feb 2013", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at UC Irvine (Irvine, CA) in Jan 2012", "Interview Descriptions": "The process involved me submitting my resume and application through the UC Irvine job postings web site. That in itself was a cumbersome process, as I was required to enter information about my relevant work experience and education that was on my resume. I received a phone call from the HR department to schedule a phone interview about a month after I submitted my application.\r\n\r\nThe interview was a conference call, with two people from UC Irvine. The phone call lasted about 45 minutes, and the two people alternated in asking me questions about my previous experience.\r\n\r\nAfter the first interview, I received an email about two weeks later that I was not going to be offered the position.", "Interview Questions": "There were no difficult or unexpected questions asked in the interview. The one that was required the most extensive and comprehensive answer was \"describe the most marketing campaign that you developed, and what were the factors for its success.\""}, {"date": "21 Apr 2016", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at UC Irvine (Irvine, CA) in Jan 2012", "Interview Descriptions": "Job talk for 1 hour and 30 minutes, individual 30 minute interviews with faculty discussing research, interview with dept chair discussing benefits, teaching, dinner and lunch with faculty during which we socialized but also discussed research. The department was extremely welcoming.", "Interview Questions": "What is your future research direction"}], [{"date": "20 Aug 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC Irvine (Irvine, CA) in Jan 2012", "Interview Descriptions": "Two professors scheduled a phone interview and asked me questions about my goals. They did not ask much about my background or about the papers I have published. The interview lasted around 30 minutes. I asked one or two questions about what they believe was necessary to be successful in a Ph.D. program. One professor said that creative students fair better. The other just said that it requires a lot of reading. I asked about the average duration of the program, for which they said about 6 years, but I heard that many students take 7 and a few cases almost 10(!).", "Interview Questions": "Why do you want to go to graduate school?\r\nWhat are your research interests?"}, {"date": "7 Apr 2012", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UC Irvine (Irvine, CA) in Nov 2011", "Interview Descriptions": "After applying for this position online, I received an email two days later asking for a phone interview with the hiring manager.  Of course, I accepted, and the interview was schedule later in the week.  The phone interview was about an hour, and it felt like a real genuine conversation between the hiring manager and myself.  Some of the interview questions consisted of student development, program planning, and interest in the position.  During the wrap up of the phone interview, he invited to come to campus for a visit and to meet his supervisor and colleagues.  The following week, I met with him and his supervisor and colleagues during a two hour period.  I was asked everything from my experiences working with students, student development, customer service, etc.\r\n\r\nSome sound advice I would give is to ensure that you know the audience.  Although it was a student affairs position, the department works closely with the admissions staff.  They were included in the interview process and handled their portion of the interview much differently than the student affairs side.  Nevertheless, everyone seemed to be dedicated to their jobs, their work for the students, and the program itself.  Although I didn't receive an offer for the position, I could definitely sense that this team was really genuine, especially the hiring manger.  He gave me some sound advice and feedback, which was greatly appreciated.", "Interview Questions": "Student Development, Program Planning, Customer Service, Event Planning, Experience Advising Students"}, {"date": "23 Oct 2013", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at UC Irvine (Irvine, CA) in Nov 2011", "Interview Descriptions": "Very informal and easy to speak to Advisor.  Great mentor and listener.", "Interview Questions": "What do you plan on doing with this research?"}, {"date": "3 Oct 2013", "title": "Student Affairs Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at UC Irvine (Irvine, CA) in Aug 2011", "Interview Descriptions": "I submitted my application online to a non-user friendly application system. After a few weeks, I was contacted for an interview. It was a pretty straightforward process. I completed a phone interview and then met with the team in person.", "Interview Questions": "Since this deals with student affairs, there are a lot of scenario based questions."}, {"date": "30 Aug 2015", "title": "Lab Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at UC Irvine (Irvine, CA) in Jun 2011", "Interview Descriptions": "I thought that the interview was really easy. They only had a few questions. I answered the questions. I then got the job. That easy. really easy. so easy.", "Interview Questions": "Why do you want to be a lab facilitator?"}, {"date": "21 Sept 2015", "title": "Graduate Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at UC Irvine in Mar 2011", "Interview Descriptions": "Email professor who I was interested in work with. Got a call from the professor within a week. Discussed research interests. Asked some questions about my previous research experience. Explained some technical terms. Asked some questions about my long term goal. We both think Then other paper work came. Very straight forward.", "Interview Questions": "What research you have done? What&amp;amp;#039;s your long term plan?"}, {"date": "6 Oct 2015", "title": "Graduate Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at UC Irvine (Irvine, CA) in Feb 2011", "Interview Descriptions": "Your academic scores and prior research experience is key to getting an interview. The interviews are usually 30 min long and are followed by a graduate reception where you can meet more faculty and graduate students. Demonstrating a desire to go into anything other than academia will cost you an admission.", "Interview Questions": "Why do you want to go to graduate school?"}, {"date": "21 Apr 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at UC Irvine (Irvine, CA) in Feb 2011", "Interview Descriptions": "My advisor phone interviewed me before she accept me as a grade student. She is very nice and I have a great experience for the interview. And after that, I get an offer.", "Interview Questions": "Question are based on what I have on my resume. And my background, what I am going to do in the lab."}, {"date": "5 Oct 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at UC Irvine (Irvine, CA) in Jan 2011", "Interview Descriptions": "the interview was a weekend long process that included: flight and hotel and all meals paid for, a welcome dinner in the hotel conference room with current graduate students and interviewees, multiple interviews with faculty (three or four), multiple department chairs gave presentations about their departments and the school in general, social events with current graduate students, group meals, campus housing tour", "Interview Questions": "what are your research interests"}, {"date": "1 Feb 2014", "title": "Programmer/Analyst II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at UC Irvine (Irvine, CA) in Jan 2011", "Interview Descriptions": "A phone screen is given to make sure you know what you're doing. No brain teasing programming puzzles or anything like that but you need to know the technologies used at the position you are applying.", "Interview Questions": "Implement an algorithm that takes two numbers and returns the result of the first number to the power of the second."}], [{"date": "13 Jan 2012", "title": "Computing Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at UC Irvine (Irvine, CA) in Nov 2010", "Interview Descriptions": "I applied through the school's job website, and received an email to schedule an interview. This was a position for current students, so they were very kind to work around my schedule. The interview was with both supervisors present. Questions mostly were about my technical background and my problem solving skills, specifically with troubleshooting IT problems and my understanding of the current infrastructure. They were up-front about it being OK to not know everything, and explained they were more than willing to teach someone they thought was capable. Towards the end, they asked a few personality questions, just to make sure I was a good fit.", "Interview Questions": "Do your friends and family regularly come to you for help troubleshooting IT issues?"}, {"date": "2 Apr 2014", "title": "Operations Crew Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at UC Irvine (Irvine, CA) in Sept 2010", "Interview Descriptions": "They call you to schedule an interview. The interview itself is in a board room, sometimes with a group of other or sometimes just one on one. They ask you questions and even lead with an icebreaker.", "Interview Questions": "What does customer service mean to you?"}, {"date": "28 Apr 2014", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UC Irvine (Irvine, CA) in Mar 2010", "Interview Descriptions": "Applied via online application, submitted transcripts and letters of recommendation, got a spot.", "Interview Questions": "N/A"}, {"date": "4 Dec 2014", "title": "Graduate Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UC Irvine in Jan 2010", "Interview Descriptions": "A professor contacted me after looking at my resume. His lab wanted to have a Skype call with me to get to know me better. They asked me about my previous projects, my interests, and my goal. They ask me whether I'm ready to work really hard. They were very friendly and positive.", "Interview Questions": "What is your most difficult bug?"}, {"date": "7 Mar 2011", "title": "Personnel Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at UC Irvine (Irvine, CA) in Oct 2009", "Interview Descriptions": "(I was already a UC Irvine employee, just looking to change departments for growth opportunity.)  Learned about the position directly from the hiring manager, who I met through a campus-wide training event.  Had an in-person interview later with the hiring manager and a higher-up who would have a working relationship with the hired candidate.  Questions focused on knowledge of personnel policies.", "Interview Questions": "What do you know about the merit review process?"}, {"date": "2 Jul 2009", "title": "Student Programming Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UC Irvine (Irvine, CA) in Jun 2009", "Interview Descriptions": "Since I sent my resume and cover letter directly to the hiring manager, my first contact with the University was with him. He was very friendly and accommodating as he tried to schedule an interview time.\r\n\r\nThe interview was held outside with just him. Although he had a set of questions printed out on what looked like a standardized form, he pushed a bit so don't expect a generic interview. He had intelligent questions.\r\n\r\nAfterwards, he made a verbal offer.\r\n\r\nUnfortunately, he later found that his boss wanted to interview me. It was very difficult to schedule that one and so, though the first interview was in May, the next one was in June. When we finally met, she was friendly though the interview was very brief; it took less than half an hour.\r\n\r\nThe office was clean but the work areas are cramped. The student programming offices are shared with each office holding 2 to 3 people.", "Interview Questions": "What do you do when you get up in the morning?"}, {"date": "5 Aug 2010", "title": "Technical Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at UC Irvine (Irvine, CA) in Feb 2009", "Interview Descriptions": "Simply applied online through zotlink, then I was contacted via email for an interview. It was 1 on 1 with some technical questions. The questions include Javascript, basic computer knowledge, and web designing. The interviewer was very professional.", "Interview Questions": "read javascript"}, {"date": "12 Jan 2011", "title": "Engineering Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at UC Irvine (Irvine, CA) in Jan 2009", "Interview Descriptions": "they asked me about the experience related to the class that I'll be teaching and asked some related technical questions.", "Interview Questions": "N/A"}, {"date": "3 Dec 2010", "title": "Associate Director, MBA Career Center Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at UC Irvine (Irvine, CA) in Nov 2008", "Interview Descriptions": "Called exec director, gave elevator speech, invited in for first interview.  Had 2nd interview with soon to be colleagues, then third interview was presentation.  First interview, just listened to exec director go on and on and on about his philosophy - kinda zoned out b/c he just kept going.  Second interview - talked to a potential colleague - really didn't care for her, but liked position so continued (should have gone with gut on this one) - not very probing in questions - not much of an interviewer.  Final interview met rest of team - they asked a couple of   \"what if\" questions - again not taxing and I presented for them.  Presentation was fun and they liked it.  \r\nBiggest caution to potential candidates is current regime - just be careful b/c more than any place I've ever been, one on the team definitely favors certain members.  On the good side though, leadership is pretty old and won't be there much longer so you may want to wait until a new group takes over before you apply.", "Interview Questions": "You must perform a 20 minute presentation on the field of marketing and where the opportunities are for MBA students"}, {"date": "15 May 2010", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at UC Irvine (Irvine, CA) in May 2008", "Interview Descriptions": "I interviewed with two library assistants.", "Interview Questions": "How would you act if a patron yelled at you?"}]]