[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Rewarding and Growing Career", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "13 Mar 2017", "job_title": "Technology Integration Specialist in Las Vegas, NV", "duration": "N/A", "pros": "Back in 2013, my resume was found online and I was called in for a special project. I have been working directly with every team at the college ever since, and must say it has truly been a rewarding experience. I've personally grown and have been tasked with new projects that push me to learn and explore my abilities and discover multiple ways to help the company grow as well. I work with each campus, helping integrate new technologies into their classroom and lectures, as well as admissions and clinical staff. The owners of the company, and all other staff members truly care about student success and will do whatever it takes to make sure the students are prepared for the real working world outside of college. I've first-hand experienced a personal friend graduate the college and go off into the world with a rewarding career, I really believe in what they do here. I look forward to growing more with the company and expanding my abilities to help in any way I can! Thank you for the opportunity!", "cons": "None. Many of the issues I see here and complaints are very odd and unexplained. I've never encountered an issue with corporate, or any other staff members.. Everyone really does care about giving the best service they can to the students."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Admissions Representative", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "19 May 2015", "job_title": "Admissions Representative in Glendale, CA", "duration": "N/A", "pros": "Attempts are made to provide a quality professional educational experience for their students. Most instructors do care about the students and their opportunity to excel in their chosen field of studies.", "cons": "A. Lack of seasoned professional management that sincerely care about their staff.\nB. Lack of a decent benefit package \nC. Leadership is very prone to petty and juvenile behavior \nD. Long hours with no overtime\nE. I've seen a revolving door of seasoned professional staff members leave the company for reasons that any worthwhile organization would never allow to exist\nF. Many decisions are made based on nepotism and not for the good of the company\nPLEASE STAY FAR AWAY...IF YOU CARE ABOUT YOUR CAREER SUCCESS !!"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "No Appreciation", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "23 Aug 2017", "job_title": "Instructor in Las Vegas, NV", "duration": "N/A", "pros": "One of the things that keeps me coming back and staying is seeing the students' success.  A lot of them have struggles, like most of us, but when you can help a student push through those rough times and watch them overcome and succeed, that, to me, is one of the best things to witness. Sadly, that's about the only reason I'm still here.", "cons": "No appreciation showed towards employees who have been there for a long time. I've been there for years and have never received a raise and I'm considered one of the better workers here. At this campus specifically, I believe that there needs to be adjustments made in leadership, either improve it or replace it. Communication among our staff has ALWAYS been an issue, which then extends to lack of communication with our Campus Support team. We are the only campus in a different state as all the rest so I feel this campus is severely neglected not only interpersonal relationships, but the facilities seems to be forgotten about a lot or, seemingly, \"put on the back burner.\" Students get blamed for things they have no control over, and staff will be blamed sometimes in search of scapegoats. Over all the years I've been here, I've seen this campus slowly deteriorate, and it doesn't seem to be getting better down the line. One can only hope."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Do not waste your time, education,experience.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Jun 2016", "job_title": "Nursing Instructor in Las Vegas, NV", "duration": "N/A", "pros": "The students despite all their hardships, lack of resources, etc., truly want to change their & their children's lives, most of them are the first person in their family to go to school after high school.", "cons": "Management, locally and in California, not allowed to work during holidays, almost non-existent benefits, will not pay for many things, instructors bought for the students. Not a safe location, parking lot, night classes, no break area/room or from students, no raises. Does not matter if all students and clinical facility site excellent evaluations for years, you will be replaced with friends of new Director."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": "N/A", "review_title": "Dental assistant instructor ( Las Vegas NV )", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "12 May 2017", "job_title": "Registered Dental Assistant/Instructor in North Las Vegas, NV", "duration": "N/A", "pros": "I see nothing that has pros at least for the employee. Its all Employer based", "cons": "They want a instructor to work for free at home for more hours than the position even pays for . The job is only 20 hours a week. They want to tell you how lucky you are to be able to buy the Dell work computor for $260.00. ( Why do the employees have to buy and /or provide a lap top to teach THEIR CLASS? i REQUESTED $22 a hour and was told you will get that maybe $18.00. Well that add u p to $1292.00 a month after 16% tax.  They are making 320,000. per class for the 8-9 month course. I was told they will not ay for any  before class prep time and if students need any help or I need to go over anything after class ends that I WILL NOT GET PAID FOR THAT. I was told I would be working on the class curriculum at home free . I found myself asking , myself\" do they have any school preparation for the Dental Assisting program?'  I was told that they have een doing this over 25 years. I again, asked myself \" the heck they have nothing prepared and they have taught this dental class in California for 25 years , yet they need me to work 30-40 hours a week at home for free preparing?  Boy, what kind of Company is this? LOL I turned and ran real fast !!!!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Embarrassing", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Jul 2014", "job_title": "Anonymous Employee in Las Vegas, NV", "duration": "N/A", "pros": "attempting to offer quality education to students that want to learn", "cons": "lack of integrity, support, management, professionalism"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Horrible!!!", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Feb 2015", "job_title": " in Las Vegas, NV", "duration": "N/A", "pros": "No weekends... Great Anatomy teachings", "cons": "No Benefits! No Overtime! No Raises ever after 5 years....!!!\r\nRun away good people! Rude! Unprofessional!  Will retaliate if you voice a concern still after seeing the first review. LOW LOW LOW WAGES."}], [], []]