[[{"date": "16 Oct 2022", "title": "Team Member Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AIESEC", "Interview Descriptions": "online through zoom one on one in semi-formal. You will ask about your self and how you deal with the condition and what global issue you updated. How we prioritize our activity and what our weakness and our strength. Oh..ya about what you know about AFL itself", "Interview Questions": "When the lowest and highest position ever you were? How if you should attend two event at the same time?"}, {"date": "25 Jan 2023", "title": "Team Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at AIESEC (Jakarta) in Oct 2022", "Interview Descriptions": "The interview started with general questions and continued regarding AIESEC's knowledge. Real study cases have also been given during the interview and expected to analyze and give the best solution.", "Interview Questions": "What is your life values and purpose?"}, {"date": "11 Apr 2022", "title": "Head of PRIM Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at AIESEC", "Interview Descriptions": "It was fun and reflecting on yourself, also it was long and almost 3 hours of interview, you need to think a lot about strategy and values. But you will get interviewed by LCP and formers LCVP and that will make it easier since you already know the person.", "Interview Questions": "All about yourself and how did it reflect on AIESEC values"}, {"date": "4 May 2023", "title": "Product Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at AIESEC (Jakarta) in Feb 2022", "Interview Descriptions": "Have an administration process such as recommendation latter CV strategy summary, Vote of confidence and interview with the head of the team, for the interview it would take around 60-90 hours of talking deeply about your personal experience, persona as an applicant and experience relate with the role you are applying for", "Interview Questions": "What is your selfless and selfish montivation"}, {"date": "10 Jun 2021", "title": "CR Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AIESEC", "Interview Descriptions": "Basic interview questions, Done after you passed the FGD.  It is easy. After that they will give you a 3 to 6 months probation period to know wether you will be a good candidate or not.", "Interview Questions": "Why do you want to join AIESEC? "}, {"date": "2 Mar 2022", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at AIESEC (Jakarta) in Jan 2020", "Interview Descriptions": "It has the personal block question, testing our knowledge regarding aiesec itself, and our general knowledge about the role (maybe you can add some ideas or innovations that you would like to implement)", "Interview Questions": "What do you know about XXX role?"}, {"date": "4 Apr 2023", "title": "Quality and Delivery Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AIESEC (Jakarta) in Sept 2019", "Interview Descriptions": "The interview was quite long and I mainly had to elaborate on various things because it was pretty detailed. I had a great time though having the interview. My interviewer was a very nice person", "Interview Questions": "They mainly asked about my past working and organizational experiences"}, {"date": "11 Jan 2023", "title": "Vice President Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at AIESEC (Jakarta) in Jun 2019", "Interview Descriptions": "AIESEC Interview process very details. It’s took about 1 hour to passed the process but I could help you for the future before apply the professional test. So, prepare yourself before take the interview", "Interview Questions": "Please mention 3 your strength and weakness?"}, {"date": "28 Jul 2018", "title": "Global Talent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at AIESEC (Surabaya, East Java) in May 2016", "Interview Descriptions": "The hiring process started with applying at AIESEC local chapter, after got reviews from AIESEC local chapter, then we are invited to the system.\r\n\r\nIn the system, there are a lot of job posts with requirements and benefits and we are encouraged to apply independently.  \r\n\r\nAfter applying, it is started with normal interview process, showing our portfolio, coding test, etc", "Interview Questions": "What are you going to do during your interview?"}, {"date": "9 Jan 2017", "title": "EXCHANGE PARTICIPANT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at AIESEC (Surabaya, East Java) in Dec 2015", "Interview Descriptions": "1. Face to Face interview with local committee\r\n-explanation of the program to be conducted\r\n-Agreement for choosing and paying for a matching project\r\n-Document screening\r\n\r\n2.Skype Interview with foreign team\r\n- AIESEC team from destination country will contact you via Skype to ask you some question regarding your readiness in the project\r\n- They will help you in getting Visa and other document needed when you get there.\r\n\r\n3. Notification via Email\r\n- Congrats, now you are ready for your exchange experience.", "Interview Questions": "how well you cope with cultural differences?"}], [{"date": "13 Oct 2014", "title": "OGCDP Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at AIESEC", "Interview Descriptions": "Filling application booklet filled with personal questions such as hobbies, favorite cultures, etc. and CV, passed. The next step is Interview, asking about organization experience and how we handle ourselves in some circumstances and in a teamwork and in organization, and things about the latest international issues that interests us and what the solution of the issue could be. And I was nervous", "Interview Questions": "How do you act when one of your team friends not working properly and why"}]]