[[{"date": "29 May 2019", "title": "Student Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ross University School of Medicine", "Interview Descriptions": "It was a long process, but they choose the right candidate for the position. They are thorough and you meet with all managers that you will report to. They do in person and phone interviews.", "Interview Questions": "What is your idea of student success?"}, {"date": "27 Oct 2017", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Ross University School of Medicine (New York, NY)", "Interview Descriptions": "Very detailed screening for this one looks only the one time interview I got this job and I had to relocate to the community for they required that I worked different shirts", "Interview Questions": "How fast can I learn new skills "}, {"date": "4 Apr 2017", "title": "Admissions Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ross University School of Medicine", "Interview Descriptions": "It was brief 30 minutes phone interview with a representative from Human Resources. \r\nThey just asked a few basic questions regarding my experience and skills and previous work. \r\nAnd then they explained the next steps", "Interview Questions": "How does this job align with your future career goals. "}, {"date": "3 Apr 2017", "title": "Student Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Ross University School of Medicine (Miramar, FL) in Mar 2017", "Interview Descriptions": "The interview went well I honestly thought that I was going to be offered the position. It was a panel interview of five and the hiring manager is included in the panel.", "Interview Questions": "what is a cartoon character that describes you? "}, {"date": "24 May 2018", "title": "Registrar Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Ross University School of Medicine (Miramar, FL) in Jan 2017", "Interview Descriptions": "Interview process of two days and meet with about 10 Different people. Very unprofessional, After being told I would receive  a call back. I emailing and called staff, no one responded to emails nor phone calls", "Interview Questions": "Basic questions, about experiences and interest. \r\nAlso asked what kitchen item would you be and why?"}, {"date": "6 Jul 2016", "title": "Registrar Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ross University School of Medicine (Miramar, FL) in Jun 2016", "Interview Descriptions": "The interview in my opinion went well. The panel appeared to be engaged with my responses. I was certain I would get a call back, but I never heard anything back from them. I followed-up with my \"Talent Recruiter\" but after an abundance of messages not return I'm going to conclude I did not get the position.\r\n\r\nThe panel was great. The opportunity appeared to a solid career move and the education seems to be a great incentive for prospective employees.", "Interview Questions": "The questions were behavioral/scenario based questions. The questions were very textbook and geared to anyone that is in the industry."}, {"date": "8 Jul 2016", "title": "Registrar Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ross University School of Medicine (Miramar, FL) in Jun 2016", "Interview Descriptions": "I filled out the online application and received a call a few days later to schedule a phone interview. After the phone interview, I received a call for an in-person interview about 24 hours later. A few days later, I did the panel interview, which was about four separate 20-30 minute interviews. \n\nI actually enjoyed the interviewing process, as you got to meet the people you were working for and working with. However, the order the panels kind of threw the whole interview off. I first met with the hiring manager,  a person who was previously in the position and someone who was a supervisor, then the supervisor if everyone in the department, before finally meeting with your potential coworkers. I think because of the order of the meetings, my interview ended a little awkward. I walked out unaware of anything afterwards and because of answering many questions back to back, my mind kind of went blank (I blame myself for that).\n\nI will say that everyone I met was very warm and welcoming. It was a group of people I felt like I would enjoy working with, especially the other advisors. I felt like I bombed my interview with the very first question I answered (I was nervous and I knew that the as soon as the words came out that they were horrible lol), but I pushed through until the end. My interview also started about 15 minutes late because the person who scheduled the email provided me with the wrong address (luckily, I knew exactly where the building was) and also the wrong area to meet (I arrived about 10 minutes earlier and went upstairs, only to find out they were waiting for me to check in downstairs. With some of the questions, I was able to see what the working environment would be like, which would most likely be dealing with students who get upset from time to time. It was great getting everyones perspective on their jobs, as well as how they saw the position being affective for the students.\n\nI too had not heard back from them and was not given an estimated timeline as to when, but I knew after unanswered calls and the removal and reposting of the job advertisement that I had more than likely not received the job. After then, I reached out again just for confirmation (as this was going to affect me moving) and received the e-mail from the talent recruiter. I only wish that I was notified much sooner.\n\nOverall, the team seemed fun and interesting and like a great set of people to work with. I would have loved the opportunity, as their method of advising seemed very unique and exciting. I wish them the best in finding their candidate!", "Interview Questions": "How would you deal with an upset student?"}, {"date": "5 Jan 2018", "title": "Registrar Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ross University School of Medicine (Miramar, FL) in May 2016", "Interview Descriptions": "It was a tedious interview process. First with HR person, then an annoying test online, then about 3 in-person interviews at the location. Around 2-3 month process. Interviewers are very friendly though, so that's good.", "Interview Questions": "How do you work under pressure."}, {"date": "21 May 2015", "title": "Professional Development Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ross University School of Medicine (Miramar, FL) in Dec 2014", "Interview Descriptions": "Similar to the other reviewer, who interviewed back in 2013, this interview went much the same. Applied online, was contacted by an HR rep, completed an online assessment, went to the on-site interview, and completed an on-site writing assessment. \r\n\r\nThe on-site interview process is strange. I was told the interview would last up to 4 hours, which is asking a lot for a job in the low 30s, but whatever..it's the market. I wouldn't have minded if I was treated better. They were very disorganized in the actual interview. Instead of having all 6 people meet with me at once, they had scheduled each person to meet with me individually for 30 minutes. Often, they didn't really ask any questions, but told me who they were and what they do and then left after 15-20 minutes. So, I was waiting to see the next interviewer for 20-30 minutes at least. Part of this might be because half of the people I was supposed to meet with were out of the office, so they were scrambling around last minute to find people to interview me. I was a bit befuddled to say the very least. Of the questions they did ask, it was more or less the same three over and over again: What's your dream job, where do you see yourself in 10 years, and do you plan on staying here for a long time. At the very end I was given a writing assessment. The assessment is to prove you can write and to see if you know how to write for a specific audience for a type of document -- nothing too crazy. Surprisingly, I was with the assessment longer than I was with any human being while at the campus.", "Interview Questions": "Where do you see yourself in 5-10 years? "}, {"date": "11 Oct 2013", "title": "Professional Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ross University School of Medicine (Miramar, FL)", "Interview Descriptions": "I applied online and then interviewed over the phone with an HR representative from Devry University, the parent company. I then completed an hour long online assessment and was invited for a three hour interview at the Miramar campus. It took approximately three weeks to get to the actual in-person interview stage.\r\n\r\nI was given a guide to walk me from interviewer to interviewer during the three hour long interview. The rationale for the length of the interview was that it was important to see how the candidate blends with all of the different departments; the emphasis being on maintaining a \"team\" feel. It was surprising to actually hear from one of the interviewers that they wanted to have similar personalities. I always thought diversity in perspectives and personalities is more productive in the end. I guess they just wanted clones of themselves.\r\n\r\nIronically, a team approach was not really evidenced since the interviewers basically had the same questions for me, so I just ended up repeating myself to the SAME questions for three hours! It was a little silly how much they championed and thought the world of this new interviewing process they had implemented, boasting about it, instead of deriving a more efficient interviewing format. If there had been a team approach in place, like all of the staff members were espousing, they would have communicated to each other to at least differ the questions. Or they could have simply had a panel, conference type interview for each candidate, with all of the staff members present and the respective questions being asked.\r\n\r\nI was even told that there would be a third interview (or rather interviewing day) at a later time. This seems overdone for a position in the low $30,000 bracket.\r\n\r\nOne particular manager had an extremely superior attitude. I am not sure why, it could be because she was rather young for her particular managerial role or felt she needed to prove herself in some way. I have never encountered such a unprofessional and argumentative attitude in my life. I am a good interviewee, having actual training in this, and yet she tried to post roadblock type questions in order to write something on her little notepad that is questionable or negative about me. Instead of allowing me to state my answers and explain my answer from my point of view, she put words in my mouth (from her perspective) and had a \"gotcha\" attitude. Even though I was poised, she was extremely argumentative and even raised her voice. I honestly thought she was about to unleash some type of anger or frustration she was experiencing on me. I think that having an \"I gotcha\" attitude at any point as a manager is not only giving a bad impression of oneself, but also makes the organization look unprofessional, incompetent and foolish.\r\n\r\nA lot of the questions during the entire interview process were focused on me divulging something negative about former employers or former colleagues, which I could not do but they kept on stressing and pushing with this question. It was not only a feeling of mistrust during the interview process but an overwhelming and odd focus on the negative. I was asked this question practically by eight or nine people throughout the day (AND related questions that dwelled on the negative) I am left wondering if a lot of their employees at Ross University bicker with one another or have high school type drama or cliques or clash with one another. This is what it seemed like from their obsession on negative interactions. Or if they have a high turnover and bitter employees or former employees.\r\n\r\n\r\nThis was, by far, the most unprofessional interviewing experience I have ever had and I have interviewed quite a bit. I am writing this to maybe save others the trouble and extensive time that I went though.\r\n\r\nAt this point, I really do think I did a fair job in the interview process OVERALL (aside from the unprofessional manager) and, who knows, maybe I do get a call back for the second tiring day of interviews, which I will happily decline.", "Interview Questions": "How can I be sure that you won't go back to work for your former employer?"}], [{"date": "19 Oct 2015", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ross University School of Medicine (Iselin, NJ) in Aug 2012", "Interview Descriptions": "You interview for about 4 hours with different managers and current employees. You get an agenda at the beginning of the interview day and see the layout of your day. People are really friendly and usually it is up to 2 people for each interview.", "Interview Questions": "Strengths/ Weaknesses/ Qualities/ Past experiences"}, {"date": "3 Sept 2012", "title": "Alumni Relations Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ross University School of Medicine (North Brunswick, NJ) in Aug 2012", "Interview Descriptions": "I applied the day this job was posted and was invited for a phone interview the next day. I definitely appreciated the swiftness from the start. I had a phone interview with the HR woman and she asked basic questions; this interview lasted about 40 minutes. Then I was invited to take an assessment test online. I found it to be easier than I thought. About a week later, I was invited for an in person interview with the hiring manager. The interview lasted about 1 hour and I was asked standard questions. There was no question out of the ordinary. The HR woman asked me to call her before and after this interview so I may give her  feedback. After the interview, she told me that the following week, I would be notified whether I made it to the next round. On that day, I found out that I did not make it. And when I spoke to the HR woman, that is when I found out they were interviewing internal candidates. If I had known that previously, I wouldn't have been the slightest bit optimistic. But I guess this is the game that companies play. So I know for next time to ask about the type of people who are interviewing. Overall experience was decent because the HR woman was pretty honest with me. I have been on many interviews and she was probably the most up front HR person.", "Interview Questions": "Please describe a time when you had to convince someone of an idea."}]]