[[{"date": "21 Apr 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Vincent's (Jacksonville, FL) in Sept 2022", "Interview Descriptions": "The interview was a panel interview with manager, charge RN, and seasoned RN. We sat in the conference room. It was fairly informal. It lasted about 30 minutes. They asked about my experience and explained the position. It ended with a tour of the unit", "Interview Questions": "Standard Interview questions: weakness,les, strengths, etc."}, {"date": "9 Aug 2020", "title": "New Grad RN Residency Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at St. Vincent's (Indianapolis, IN) in Aug 2020", "Interview Descriptions": "Friendly interviewer, explained program well and answered all questions thoroughly. Video interview meeting due to COVID-19. Interview scheduled 1 week after submitting application. Only negative thing was only given 1 week notice before deadline of scheduling interview. Overall positive experience.", "Interview Questions": "Why do you want to work here?"}, {"date": "7 Jun 2020", "title": "RN OR Orthosports Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Vincent's (Birmingham, AL) in May 2020", "Interview Descriptions": "HR was really great, helpful and prompt in setting things up but the same cannot be said about the department I interviewed for. Spent time preparing for a formal interview and was well prepared to answer just about any question they would think to ask. Actually the interview turned out not to be much of an interview at all. It was an online virtual interview and as soon as I connected to the chat I was advised that they could see me but I would not be able to see them. This was actually very awkward and a bit annoying straight out of the bag. Manager proceed to talk almost non stop for about 5 minutes without really asking me anything then she said she was going to leave and tend to something and let a couple of other people come in and talk with me. They came in and introduced themselves, although I could not see them. They also proceeded to talk and ramble about the position and then asked me If I had any questions. After that the manager came back and asked me the same thing, if I had any questions and that was basically it. All total it was about 30 minutes of rambling then they rushed me off the chat and I could tell they were ready to go and very vague at answering any questions.\r\n\r\nSynopsis: The whole interview felt rushed, awkward, and uninteresting from the very start. Within the first couple of sentences I could tell the manager was not interested and I knew right then it wasn't going anywhere. It actually crossed my mind to end the interview my self but I figured since I had came this far I might as well sit it out. I felt that they were simply just going through the motions since I had been selected as an interview candidate. Definitely more of a very rushed information session than an actual interview.", "Interview Questions": "How far away do you live. I mean seriously? Maybe I was planning to relocate for the job but this didn't seem to be considered at all on their part."}, {"date": "12 Sept 2019", "title": "Per Diem Social Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Vincent's in Sept 2019", "Interview Descriptions": "I applied online for the position of Social Worker (per diem). I received an email from their clinical director asking to choose a date and time from his calendar for a telephone interview. I received an email response on the day of the interview stating he was unavailable for the telephone interview, but he would be forwarding my application to the hiring committee to schedule a face to face interview. I received a second email about a week later stating my application wasn't selected to be a part of their continued recruitment process for the position.", "Interview Questions": "No interview questions were asked"}, {"date": "29 Aug 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at St. Vincent's (Bridgeport, CT) in Aug 2019", "Interview Descriptions": "The interview process went great. I felt so comfortable throughout the whole interview. The interviewer spoke about the company and asked me a few questions and we were done.", "Interview Questions": "One question I was asked was what are my future plans?"}, {"date": "20 May 2019", "title": "NICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Vincent's", "Interview Descriptions": "Interview with all the managers and an hour job shadow afterwards. What is your greatest weakness.  And scenarios and how you would respond to them. Just your common interview questions.", "Interview Questions": "Why you would make a good fit"}, {"date": "9 Dec 2019", "title": "Diet Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at St. Vincent's in May 2019", "Interview Descriptions": "Interview had two stages, one on one with the lead dietitian and then a group interview with other technicians. Everyone was very friendly and welcoming and they were good at making the interviewee feel comfortable.", "Interview Questions": "What experience or education do you have?"}, {"date": "8 Mar 2019", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Vincent's", "Interview Descriptions": "The interview process was good I was able to get in and out in under an hour and the people were very nice. My interview was a team interview and I was nervous", "Interview Questions": "When can I put two weeks in "}, {"date": "5 Feb 2019", "title": "Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Vincent's", "Interview Descriptions": "very easy interview process. A FEW QUESTIONS AND BRIEFLY DESCRIBED WHAT THE JOB IS ALL ABOUT. They ask about 3 to 6 questions. MOSTLY STAR QUESTIONS. Just goggle simple questions about interview questions and what to expect", "Interview Questions": "Tell me about yourself"}, {"date": "5 Feb 2019", "title": "Nursing Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at St. Vincent's (Erie, PA) in Feb 2019", "Interview Descriptions": "I filled out an online application, and attached my resume. Less than two weeks later I was then emailed by a recruiter to schedule a phone interview. The recruiter called almost fifteen minutes after the initial scheduled time. The entire interview lasted six minutes. They do call from a private number.", "Interview Questions": "The recruiter asked why I wanted to work at the hospital, then asked what I did at my previous job, followed by telling me I didn’t qualify because I don’t have previous hospital experience. It didn’t state that as a requirement when I applied, also they knew this prior to scheduling the interview. This is the second negative experience I’ve had interviewing with AHN, so this is not the place for me. Good luck to everyone else"}], [{"date": "30 Apr 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Vincent's (Little Rock, AR) in Feb 2019", "Interview Descriptions": "Interview by a team of 3. Was called in for a second interview by a team of 5. Time frame was only 30 minutes both interviews. everyone was very friendly and professional. It was serious and both light hearted. We were able to laugh and joke to make the process easy flowing.", "Interview Questions": "What did I know about the company? What have I read or been told."}, {"date": "12 May 2019", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Vincent's (Indianapolis, IN) in Jan 2019", "Interview Descriptions": "Quick.  They need Nurses desperately so questions not difficult. The interviewer was very anxious about the start date and wasn’t as selective as I anticipated.  There didn’t appear to know my knowledge base relevant to hospice", "Interview Questions": "When can I start work?"}, {"date": "26 Nov 2018", "title": "Customer Service Representative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Vincent's (Indianapolis, IN) in Aug 2018", "Interview Descriptions": "They use third party source for interviewing process.  After going thru a lengthy written application process you are then channeled to phone interviews.  Once you pass this level then you are actually connected to someone at St Vincents.", "Interview Questions": "Why are you applying for this position?"}, {"date": "2 Jul 2018", "title": "Human Resources Business Partner Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Vincent's (Indianapolis, IN) in May 2018", "Interview Descriptions": "Very quick interview process. Met with direct support teams and supervisor of the role. Professional process and very good communicators. The teams were very transparent about the role and what was required and needed. Great follow up from everyone.", "Interview Questions": "Behavioral based interviewing. "}, {"date": "18 May 2018", "title": "Certified Educator Candidate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at St. Vincent's (Indianapolis, IN) in May 2018", "Interview Descriptions": "This was an initial screening interview, conducted over the phone, likely intended to screen out the most incompatible candidates. After this, the process continues with submitting a portfolio of work to ACPE & St. Vincent, which will result in some candidates being interviewed at St. Vincent.", "Interview Questions": "Why are you interested in this Educator position?"}, {"date": "12 Jan 2019", "title": "Marketing Associate Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Vincent's (Jacksonville, FL) in May 2018", "Interview Descriptions": "Met with Department director, reviewed resume, talked about pain points and administrative support of marketing initiatives. Description of current programs, ad agency relationship, departmental dynamics. Discussed day-to-day responsibilities of position, opportunity for growth.", "Interview Questions": "Greatest skill?"}, {"date": "26 Mar 2018", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at St. Vincent's", "Interview Descriptions": "Applied and within a week was contacted by a recruiter, set up an interview time and had the interview within the next few days. Everyone was very nice and communication was great. At the time I applied there were limited open positions so it did take longer for my recruiter to find an open position for an interview but I was contacted immediately and from there the process was pretty quick. Still waiting to hear back", "Interview Questions": "Questions about teamwork, experience (clinicals in my case), why I chose to apply"}, {"date": "12 Mar 2018", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at St. Vincent's", "Interview Descriptions": "Applied online and it took a good 4-6 weeks to hear back. Scheduled a time for a phone interview.  Had a phone interview with basic questions. Was told about St Vincent’s mission statement and their core values. Was told I’d receive a call in a week to let me know if I was hired or not. Never heard back.", "Interview Questions": "Will you get a Flu Shot if you get a job offer here?"}, {"date": "7 Oct 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Vincent's (Indianapolis, IN) in Feb 2018", "Interview Descriptions": "Met with Director of unit. It was a very straightforward interview that lasted approx. 30 minutes reviewing past experience, likes and dislikes, why left previous position, how could I help their company.", "Interview Questions": "Questions included experience with various types of problems in previous positions and how did I correct them. "}, {"date": "30 Aug 2017", "title": "Licensed Practical Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Vincent's", "Interview Descriptions": "I applied for four different LPN positions, at various locations throughout the city. The first experience, included the recruiter calling me. There was a phone interview, and it sounding very promising. The recruiter said the doctor would contact me, if he was interested. Then, the recruiter told me that she would contact me in a couple days. I never heard back.  The second experience  was exactly the same. \n\nThey say they will contact you, but don't.  Applying for this company is a wast of time.", "Interview Questions": "tell me about your experience as a nurse"}], [{"date": "12 Sept 2017", "title": "Staff RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Vincent's in Aug 2017", "Interview Descriptions": "JCAHO had a surprise visit right when I arrived.  Had to change offices and one member had to arrive late.  They did a nice job regrouping and moving the interview to a new location.  The job though was misrepresented in the job description posted.", "Interview Questions": "Name one reason yo want to work here"}, {"date": "5 Jan 2018", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Vincent's (Indianapolis, IN) in Jul 2017", "Interview Descriptions": "I actually had two phone interviews, an interview with the office manager and an interview with the site manager and providers. Both live interviews were very warm and inviting more relaxed than most interviews.", "Interview Questions": "How did I feel about working downtown?"}, {"date": "16 May 2017", "title": "Planning and Research Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Vincent's (Indianapolis, IN)", "Interview Descriptions": "Phone interview took less than thirty minutes. Interviewer was very friendly. The majority of the questions that were asked were about skills and experience with certain things that would be used in the job, nothing too much about my personality specifically.", "Interview Questions": "Do you have experience with Access?"}, {"date": "2 May 2017", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Vincent's (Indianapolis, IN) in May 2017", "Interview Descriptions": "I applied online and a week later set up a phone interview with a recruiter. The next day I got a call to set up an on-site interview with a panel of 4 people for the following day.", "Interview Questions": "Describe a time when you went above and beyond. "}, {"date": "5 May 2017", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Vincent's (Carmel, IN) in Apr 2017", "Interview Descriptions": "Nice and quick. Had a phone interview first, then met with the Office Lead and did a conference call with the manager on the phone. I then was asked to do a 2nd interview but at a different location and I finally met with the manager to do it all again.", "Interview Questions": "Availability with hours."}, {"date": "3 Mar 2017", "title": "OT Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Vincent's", "Interview Descriptions": "I participated in a phone interview with a recruiter - they were very kind and thoughtful. The recruiter stayed in consistent contact with me for over 2 months during the hiring process, and was very helpful.", "Interview Questions": "Why did you choose to apply to St Vincent?"}, {"date": "7 Mar 2017", "title": "Patient Account Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St. Vincent's (Evansville, IN) in Feb 2017", "Interview Descriptions": "I applied for a patient access scheduler job. I didn't get a call until a little over a month later. During the interview I was told multiple positions in patient access departments were open. The interview was about 30 minutes and went well. I was asked a list of questions. I was ultimately offered a job (a week after the interview) in a different place than what I'd applied for.", "Interview Questions": "How do you handle a difficult customer/client?"}, {"date": "11 Nov 2016", "title": "Housekeeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at St. Vincent's (Erie, PA)", "Interview Descriptions": "Very friendly and engaging but starght to the point as to what they were looking for in an employee. plus went over the ins and outs of the hospital and their protocal.", "Interview Questions": "Why did you choose St. Vincent"}, {"date": "1 Mar 2019", "title": "Security Dispatcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at St. Vincent's (Indianapolis, IN) in Oct 2016", "Interview Descriptions": "Applied on line and in a few days had a call to set up an interview. Interview with the Security Manager and then had a chance to see what dispatching at the hospital would be link.", "Interview Questions": "Tell me about your self."}, {"date": "18 Jul 2016", "title": "RN Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at St. Vincent's in Jun 2016", "Interview Descriptions": "It was behavioral and how you plan to handle situations. The interviewer is very nice and makes you feel comfortable. All in all it was average but most probably there is somebody more qualified than me since I don't have any experience as a Case Manager.", "Interview Questions": "If I feel that I would fit in this role"}], [{"date": "15 Dec 2016", "title": "Practice Administrator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Vincent's (Carmel, IN) in Apr 2016", "Interview Descriptions": "First interview was with director. Went well. Scheduled within days for the second interview. Arrived and sat down the hallway where I could see other candidates interviewing for same position. My turn came and I interviewed with same director as before. Then, I interviewed with a group of other managers, who obviously already made their selection. The only questions asked were tell me about yourself and then what questions do you have. Over and over they asked me to ask them questions. Then, another manager knocks at the door and apologizes for being late. She asks what your strengths and weaknesses are and states she's late for another meeting. What they failed to realize, was that I was down the hallway and watched this play out THREE other times with the three other candidates. It was over a month before I was informed by automatic email that I had not been selected. I drove two hours there and back twice without reimbursement. The assistant to the director is a gem. She set up the interview via email. Sent me a map and even told me where to avoid driving due to construction. Very helpful.", "Interview Questions": "Director: Review this P & L and explain any items that need reviewed and if the practice made money that month. I explained extensively, as I know what I'm looking for and at. He made me stop after two statements. Seemed kind of angry. "}, {"date": "4 Aug 2017", "title": "Mental Health Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Vincent's (Anderson, IN) in Apr 2016", "Interview Descriptions": "initial interview was one on one and was supposed to last an hour but lasted two hours because the boss is chatty but nice, then shadowing opportunity, then second interview and hired.", "Interview Questions": "What kind of groups have you run?"}, {"date": "5 Feb 2016", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Vincent's", "Interview Descriptions": "I applied online and received an email the following week asking to set up an interview.  I interviewed with the unit manager and two charge nurses.  They asked basic behavioral questions.  Everyone was very friendly and it felt relaxed.  They were making decisions that day and HR would follow up in a week or two.  It's been one week and I am still waiting on HR.", "Interview Questions": "What does patient safety mean to your nursing practice?"}, {"date": "21 Oct 2015", "title": "Human Resources Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Vincent's (Indianapolis, IA) in Oct 2015", "Interview Descriptions": "HR manager called and went over position and asked questions on experience; I-9 and such. Set-up in person interview. I was told after interview I would hear from HR by the end of the week, one way or another. She never called or returned my calls or email. Unprofessional and indicative of how she treats her staff. I was warned this location and firm has changed and not for the better.", "Interview Questions": "Have you ever dropped the ball as far as your work?"}, {"date": "2 Oct 2015", "title": "Front Office Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Vincent's (Fishers, IN) in Sept 2015", "Interview Descriptions": "applied online, took online assessment test. Called to come in for interview. Was told I would hear back one way or another after all interviews were done and HR had reviewed.  3 weeks later no word.", "Interview Questions": "What makes you the best candidate for this job?"}, {"date": "20 Oct 2015", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at St. Vincent's (Indianapolis, IN) in Jun 2015", "Interview Descriptions": "Interview process was okay.  Very long interview.  Was interviewed by two people of management.  Asked very long and detailed questions for a entry level position.  Overall interview lasted almost 2 hours.", "Interview Questions": "What describes you, how do you do in stressful situations, etc.  Basic interview questions"}, {"date": "14 Jan 2015", "title": "Health Information Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at St. Vincent's", "Interview Descriptions": "Quick and to the point. Job related questions about medical records workflows and processes. St. Vincent wanted some experience but basically high school diploma and knowledge of medical records. Also, they were looking for someone who can be self managed and handle a great deal of responsibility.", "Interview Questions": "Describe a mistake you may have made on the job and how did you handle it? Did you go to a manager or fix it yourself?"}, {"date": "29 Jan 2016", "title": "Materials Handler Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 months. I interviewed at St. Vincent's in Sept 2014", "Interview Descriptions": "I was given the interview questions on a piece of paper. They highlighted a few and told me to answer them and return them and that they would be rewritten in the managers words.", "Interview Questions": "What makes you believe you will be able to do this job?"}, {"date": "20 Nov 2017", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St. Vincent's (Indianapolis, IN) in Jan 2014", "Interview Descriptions": "Applied online, 2 days later had an interview with the security manager and he asked me basic questions.  I told the manager I had done contract security for them in the past couple of months.  He basically offered me the job right then and there.  He had to submit his stuff to HR first.  They called me the very next day.", "Interview Questions": "Why would I like to work there."}, {"date": "17 Dec 2018", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at St. Vincent's in Jan 2014", "Interview Descriptions": "Applied online, got a call for interview the next week, went in to speak with someone from HR, then interviewed with unit managers, was shown around the unit and introduced to some staff members, they called with an offer within a couple of days", "Interview Questions": "How would you handle a dispute with a coworker "}], [{"date": "6 Mar 2014", "title": "Senior Buyer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at St. Vincent's (Indianapolis, IN) in Dec 2013", "Interview Descriptions": "Submitted resume, told hiring manager would contact me soon.", "Interview Questions": "Why do you want to take a position beneath your current pay grade?"}, {"date": "4 Feb 2017", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at St. Vincent's (Indianapolis, IN) in Jul 2013", "Interview Descriptions": "Standard customer service questions. Strengths and weaknesses, and are you capable of handling stress. Have you ever been fired, if so, why? It helps to have customer service experience as well.", "Interview Questions": "What are your strengths"}, {"date": "28 Aug 2016", "title": "Human Resources Generalist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at St. Vincent's (Indianapolis, IN) in Jul 2013", "Interview Descriptions": "Interviewer mapped out the interview process and began the interview by explaining history and details of the position. The interviewer was very knowledgable and put me at ease.  She asked me several questions.  Some were your typical interview questions and some were more behavioral.", "Interview Questions": "Tell me about a time you had an irate customer and what did you do to solve the customer's problem."}, {"date": "6 Jun 2013", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Vincent's", "Interview Descriptions": "I was called within about 3 weeks of applying online by the manager of that department who was very friendly and set up a face to face interview.  The interview was on the department and last about an hour.  She asked me to tell her about me and how I came into nursing. She was very accepting of my story and asked more questions when needed.  I felt very comfortable.  We concluded with a tour and she invited me to observe, which I am doing next week.  Coming from a very large organization into only a slightly smaller one, St Vs had a small hospital feel.  I really like that.", "Interview Questions": "Explain a time when you didnt agree with management and how you handled it."}, {"date": "30 Oct 2017", "title": "Coder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at St. Vincent's (Indianapolis, IN) in Mar 2013", "Interview Descriptions": "The hiring process was great!!  They were very thorough, the back ground check wasn't grueling .  The on-boarding was a little tedious, you have orientation, then you have to do a day as a serenity retreat.", "Interview Questions": "How long had a coded?"}, {"date": "24 Aug 2015", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at St. Vincent's (Indianapolis, IN) in Aug 2012", "Interview Descriptions": "When you apply to St. Vincent, your application will have to pass through a screening process, and if you don't have at least 1 year of jobs that deal with medical insurance, you probably won't pass to the next step. When you get an interview, you will be asked a lot of questions on customer service, how you would handle unruly patients and unruly co workers. You then have to wait and HR will call you with an offer.", "Interview Questions": "When did you go above and beyond, and what was the outcome?"}, {"date": "19 Jul 2015", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at St. Vincent's (Indianapolis, IN) in May 2012", "Interview Descriptions": "It was a very casual interview with normal interview questions. They wanted to make sure you were motivated and that you were going  to show up to work on time. They also wanted to know if you could handle multiple tasks.", "Interview Questions": "Tell me about a time you had a lot to do and how did you manage it?"}, {"date": "26 Mar 2014", "title": "Buyer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at St. Vincent's (Indianapolis, IN) in Jan 2011", "Interview Descriptions": "multi step, hard to get in", "Interview Questions": "Why do you want to work here"}, {"date": "28 Apr 2014", "title": "St Vincent Hospital Foundation Call Center Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at St. Vincent's (North Indianapolis, IN) in Aug 2010", "Interview Descriptions": "Two weeks after I applied on the computer, I received phone interview with Manager. It was easy, friendly and I felt like it was more to seek my telephone conversational skills than a series of questions. Very conversational. Four weeks later Director had me in for a one on one interview. The questions were prepared before interview. Low stress, talked about my experiences talking with others, and what I knew about the Hospital and the Hospital Foundation.", "Interview Questions": "There were no difficult or unexpected questions. Manager and Director were easy going. Very nice people."}]]