[[{"date": "11 Jan 2023", "title": "HIV Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Legacy Community Health Services", "Interview Descriptions": "Received a phone screen opportunity after about 5 weeks and networking with multiple people. Was told I would hear back within two weeks, I followed up and still never heard back", "Interview Questions": "How did you hear about Legacy? What are your salary expectations?"}, {"date": "18 Aug 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Legacy Community Health Services", "Interview Descriptions": "It was pretty smooth and easy. They were more looking for good conversation since it was just an internship. Got along with the interviewer and had a nice conversation. Don’t be nervous", "Interview Questions": "What makes you want to intern here? "}, {"date": "28 Jul 2022", "title": "Health/Patient Educator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Legacy Community Health Services", "Interview Descriptions": "It was very easy and the HR panel was very engaging with questions. The panel was 3 people. The interview was over zoom so that was very convenient. Overall, easy interview with reasonable questions.", "Interview Questions": "Do you have any experience with pregnant women or children?"}, {"date": "3 Dec 2021", "title": "Collection Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Legacy Community Health Services", "Interview Descriptions": "I waited for about 30mins from the time i was suppose to meet for my interview. They forgot they were interviewing I believe because they were unprepared and all over the place. The actual person I was supposed to interview with was not there. 3 different people came into the room to interview. Felt kind of unprofessional in comparison to other interviews I had", "Interview Questions": "do you know about the different insurance carriers\nwhat do you do when you get into a disagreement with a manager"}, {"date": "26 Oct 2021", "title": "Physician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Legacy Community Health Services (Houston, TX)", "Interview Descriptions": "Series of interviews and they gave me a verbal offer.  Then ghosted me for 2 weeks and said they hired someone else.  Wouldn’t recommend.  Poor communication and no respect for my time", "Interview Questions": "Behavioral questions regarding past experiences "}, {"date": "24 Aug 2021", "title": "Vice President - Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Legacy Community Health Services (Houston, TX) in Aug 2021", "Interview Descriptions": "I was ontacted to meet with the CHRO for an interview and asked for times that I would be available. I provided times and received an email thanking me for my quick response and letting me know she would be back in touch on a preferred time. I did not hear back. I waited as I know schedules can be difficult to work around. Instead a little more than a week since that communication, I received an email informing me that the position had been filled included below. This is not a great way to manage people's time or demonstrate respect. And, based on prior more personalized communication, this was not personalized at all. \n\nThank you for applying to the Vice President - Human Resources position at Legacy Community Health Services. We are writing to inform you that the position for which you applied has been filled. If there are other positions that open that fit your qualifications, we welcome you to apply.\n\nWe appreciate your interest in employment with Legacy.\n\nSincerely,\n\nLegacy Community Health Recruiting Team", "Interview Questions": "Not applicable because the interview was not scheduled."}, {"date": "6 Jul 2021", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Legacy Community Health Services in Jun 2021", "Interview Descriptions": "The interview was okay lots of reasonable questions, but no one has given me any progress on my interview or anything, not even “we’re considering other candidates” \r\nThey have failed to contact me back in any way.", "Interview Questions": "How would I handle certain scenarios "}, {"date": "8 Apr 2021", "title": "Public Health Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Legacy Community Health Services (Houston, TX) in Feb 2021", "Interview Descriptions": "It was great! Jennifer, the department head for Public Health, was kind and willing to hear out qualifications while simultaneously explaining facility expectations. She was very approachable and showed a passion for her work in this field. I would recommend applying!", "Interview Questions": "What experiences make you qualified to serve as Public Health specialist in a non-profit "}, {"date": "13 Jun 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Legacy Community Health Services (Houston, TX) in Jul 2020", "Interview Descriptions": "Very unorganized. The first interview went well but the second interview was pretty difficult. Seemed like the panel was more interested in grilling me with difficult questions back to back.", "Interview Questions": "Three Strengths and three weaknesses "}, {"date": "5 Apr 2022", "title": "Health Advocate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Legacy Community Health Services (Houston, TX) in Jun 2020", "Interview Descriptions": "Group interview with one another person. Very relaxed and two way dialogue. Interview started with a brief history of the clinic and the principle it was founded under. All of the questions asked were very general type questions", "Interview Questions": "What do you know about public health?"}], [{"date": "4 Jan 2020", "title": "Front Office Clerk Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Legacy Community Health Services (Houston, TX) in Dec 2019", "Interview Descriptions": "[Mapleridge] It didn't seem to take a long time. Maybe about two weeks to get a phone call inviting me to an  interview. Pretty straight forward at this point. When I arrived in the scheduled date I did had to wait about 10 minutes but that's okay it's a clinic. When I entered the room, I did see two of them taking a glance at my resume and I was relieved because other places do not even do that. They made sure to note that they saw I didn't have experience in my resume (no experience after college). I acknowledged that as being true. Then basically they just really just gave me the 'tell me about yourself' question and handed the interview to me because they didn't know how to do it. This was bad in my opinion because it showed that they weren't prepared to have me in and maybe were just trying to fill a quota. This is annoying because it's a waste of my time. My resume is pretty clear about my background to not waste time. I give them a rundown of my background and say that the requirements for the position were just a high school diploma and basic math etc. (This is what competency modelling is supposed to do.) From this point on they really didn't have questions, the questions you see in this comment were only brought up because I put great effort to try to create a conversation as they were clueless. I was the one asking the questions to them and interviewing them. I asked them about how they like to lead a team, clarification of job duties (no insurance verification, NO PHONE CALLS contrary to what the ad said, simply checking in patients),possible  areas they could improve on and the check-in process. You might wonder what type of questions  they could ask someone without experience, the answer is hypothetical questions. \r\n\r\nThey told me that in a week I would receive a response but I was left with no answer. This is expected in today's job market however, I did expect a little better from them since they talk about sympathy for patients. I had made sure to tell them that as a patient of Legacy I had first hand experience with what interactions were in the front desk. Oh well. I wouldn't encourage someone looking for a first job to apply here.", "Interview Questions": "Have you done customer service before?"}, {"date": "26 Aug 2018", "title": "Healhcare Recruiter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Legacy Community Health Services (Houston, TX) in Aug 2018", "Interview Descriptions": "Telephone interview with Recruiter from Insperity and if okay, then resume and notes from chat were referred to client's HR Manager who conducted a telephone interview which lasted about 30 minutes.", "Interview Questions": "1.\tWhat do you know about Legacy Community Health?\n2.\tWhat is your recruiting strategy?\n3.\tHow many requisitions are you accustomed to handling?\n4.\tAt what company, did you work on that number of requisitions?\n5.\tWhat were your most challenging positions for which you have recruited?\n6.\tWhat were your least challenging positions for which you have recruited?\n7.\tIn your current position, what do you like the most about it?\n8.\tIn your current position, what do you like the least about it?\n9.\tAre you familiar with conducting background checks and drug screen requests?\n10.\tWhat Applicant Tracking Systems have you used?\n11.\tWhat Applicant Tracking System are you currently using?\n"}, {"date": "2 Jun 2021", "title": "Health Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Legacy Community Health Services (Houston, TX) in Jan 2018", "Interview Descriptions": "Panel interview, took about 3 months for them to weed out the candidates and make a decision. I enjoyed my time but for PHS you will be placed on the spot. Be prepared to be asked to present something in a creative way!", "Interview Questions": "Standard questions, in the past how have you handled X."}, {"date": "5 Oct 2020", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Legacy Community Health Services (Houston, TX) in Jul 2017", "Interview Descriptions": "The process was easy. Straight forward questions and very nice people.  Interview took about 30 minutes with both the director and supervisor.  A tour of the call center was provided after the interview was completed. Received a call about a week after from the supervisor stating that I was being offered the position. Overall, the interview was average.", "Interview Questions": "Tell me why you applied to this position? "}, {"date": "8 Oct 2018", "title": "Marketing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2+ months. I interviewed at Legacy Community Health Services in Jan 2017", "Interview Descriptions": "There was an extremely slow response time frame after each interview round. After the final round it was close to six weeks before I was notified of a decision on the position.", "Interview Questions": "How I would deal with physicians."}, {"date": "18 Apr 2015", "title": "Quality Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Legacy Community Health Services (Houston, TX) in Mar 2015", "Interview Descriptions": "After applying for a new position within the company, it takes about three weeks before anyone gives you a call to arrange a meeting. When the first interview takes place, all goes well and then there is another formal interview. The candidate then waits until they hear back from the hiring team, but they usually have to keep asking or reminding someone that they are awaiting a response.", "Interview Questions": "How do you  like working with Legacy and what do you bring to the team?\r\nWhat do you like about Legacy?\r\nHow wold you access said patient file and account for all of their procedures for the grant funding?"}, {"date": "14 Feb 2014", "title": "Personal Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Legacy Community Health Services (Houston, TX) in Mar 2010", "Interview Descriptions": "The interview process was as follows: Someone called me and asked me to come in for an interview. They asked general questions about how strengths and weaknesses, how one would handle a situation, etc. If you show them you care and know what you're talking about, they'll give you a chance.", "Interview Questions": "How would you handle sexual harassment. "}]]