[[{"date": "23 Feb 2023", "title": "Recreational Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Fusion Lifestyle", "Interview Descriptions": "Needed proof of NPLQ , followed by interview with manager. Asking general questions (why do you want this job etc) then followed by swim test to see if fit to be a lifeguard.", "Interview Questions": "Why do you want this job? Do you have your NPLQ?"}, {"date": "15 Feb 2023", "title": "Customer Service Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fusion Lifestyle (Oxford, England) in Feb 2023", "Interview Descriptions": "I will write it: The meeting was conducted in a friendly, in-person manner. However, the recruiter stated that the company would respond within a week of that date. Turns out I never received a reply, I even tried to e-mail the recruiter, but I was ignored. I feel very frustrated, because you spend a lot of time going to an in-person interview and the recruiter just disappeared after that. At least they could have said thank you for your time, but we decided not continue with you from here. But silence, is unprofessional and disrespectful.", "Interview Questions": "Why do want to work here? Tell about one time that you have to go above for a customer."}, {"date": "19 Oct 2021", "title": "Customer Relations Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Fusion Lifestyle (London, England)", "Interview Descriptions": "Group interview.\nThey look to see if you can naturally get on with people as the role does involve sales.\nExperience doesn't really matter as long as u bring the passion and hard work.", "Interview Questions": "Asked to say something about yourself"}, {"date": "12 Oct 2020", "title": "Lifeguard Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Fusion Lifestyle", "Interview Descriptions": "It was okay. They asked me why you wanted to work there and normal interview questions. I had to do the wet side and dry side training as well also.", "Interview Questions": "they just asked me general interview questions."}, {"date": "5 Aug 2020", "title": "Recreational Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fusion Lifestyle", "Interview Descriptions": "Short sweet interview very standard questions, why you want to work here. What can you bring to the company. Went into the centre to have it and two people interviewed me. Organised some tests and started within the month", "Interview Questions": "Why do you want to join us"}, {"date": "9 Nov 2019", "title": "Recreation Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fusion Lifestyle (Loughborough, England) in Sept 2019", "Interview Descriptions": "I met with one of the managers after applying online. The time between applying and being invited to an interview was about 8 weeks. To begin with, the questions focused mainly on past experienced, explaining a bit about myself and giving further details of what was on my CV. This was followed by questions about the role and a few situational questions. The interview was led by the manager and there was a trainee manager present as well. Overall, the interview felt relaxed and I was able to be myself.", "Interview Questions": "What do you believe to be most important skill of a Recreational Assistant"}, {"date": "11 Jun 2019", "title": "Gym Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Fusion Lifestyle", "Interview Descriptions": "1 to 1 casual interview followed by a demonstration of  a fitness plan, this can be divided in two days. They may show you the environment you would work, by giving you a tour describing what is expected of you.", "Interview Questions": "Competencies of a fitness instructor (roles and responsibilities)"}, {"date": "4 Jul 2019", "title": "Recreation Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Fusion Lifestyle (London, England) in Dec 2018", "Interview Descriptions": "Got to Albany Leisure Centre where I waited in the lounge area before being called in. Was interviewed by the team leader and the head receptionist who asked standard questions e.g. Why do you want to work here? What do you think you can bring to the company? After the interview they said that they would be in touch with me soon - they took about a week.", "Interview Questions": "Why do you want to be a lifeguard?"}, {"date": "11 Sept 2018", "title": "Customer Relations Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Fusion Lifestyle", "Interview Descriptions": "QSimple questions - why do I want to work here \r\nWhat do I think I can bring to the company \r\nHow would I benefit the company\r\nWhat is the most difficult situation I have been in and how did I handle it", "Interview Questions": "Simple questions - why do I want to work here \r\nWhat do I think I can bring to the company \r\nHow would I benefit the company\r\nWhat is the most difficult situation I have been in and how did I handle it "}, {"date": "3 Apr 2018", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Fusion Lifestyle (London, England) in Jul 2017", "Interview Descriptions": "Standard interview with manager/ Wet Ops. I had to do a competency test and go on a few courses which were all paid for.  Interview was relatively informal. Discussed shifts and availability.", "Interview Questions": "What most motivated you to apply to this job."}], [{"date": "25 May 2017", "title": "Recreation Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Fusion Lifestyle", "Interview Descriptions": "A face to face interview that lasted around an hour. This was on site at one of the facilities with two managers - one was senior management and the other was middle management.", "Interview Questions": "What would you do if there was a spillage of some kind in a public area at the centre."}, {"date": "6 Jan 2021", "title": "Pool Lifeguard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Fusion Lifestyle (Bedford, England) in Jan 2017", "Interview Descriptions": "Applied online and they got in touch quickly. The interview was a standard interview for a lifeguard along with an competency check. This was good as it meant you could prepare.", "Interview Questions": "Why would you like to work for us "}, {"date": "28 Jan 2019", "title": "Lifeguard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Fusion Lifestyle (London, England) in Jun 2016", "Interview Descriptions": "Very casual just went over lifeguard training both practical and verbal. The practical element involved the basic lifeguard requirements, e.g. collecting mannequin from the bottom, safe entries and exits from the pool and other things which a typical lifeguard is required to do.", "Interview Questions": "What are the 3 priorities of first aid."}]]