[[{"date": "24 Jan 2023", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at San Francisco Health Plan", "Interview Descriptions": "Interview was not too nerve wracking nor intimidating- two people on the interview panel- RN and Case Manager. Interview process was smooth, inviting, and encouraging. Took about 30 minutes to interview me.", "Interview Questions": "strengths, weaknesses? if you were to choose 3 people to eat dinner with, who would it be and why? tell me about yourself."}, {"date": "22 Dec 2022", "title": "Customer Service Representative (CSR) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at San Francisco Health Plan", "Interview Descriptions": "the interview was a long process, and they take a while to reach out to you for an interview. you have to take some online tests first too. and then you get interviewed by a few people.", "Interview Questions": "i don't really rememeber the questions, but there was a lot"}, {"date": "12 Dec 2021", "title": "Customer Service Representative (CSR) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at San Francisco Health Plan", "Interview Descriptions": "My experience was from a few  years ago so things might be different now. The interview was pretty long. I got interviewed by four different people separately. And the office was kind of hidden, so I kind of got lost trying to find the entrance on a rainy day.", "Interview Questions": "Explain what communication means to you."}, {"date": "17 Feb 2021", "title": "Enrollment Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at San Francisco Health Plan", "Interview Descriptions": "Good communication throughout! I met with another enroller, our manager, and supervisor. The last conversation was with our director. They were very informative about the position.  I got to see the space as well.", "Interview Questions": "Why are you interested in this position?"}, {"date": "28 Dec 2019", "title": "Coordinator, SF City Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at San Francisco Health Plan (San Francisco, CA)", "Interview Descriptions": "Phone screening with recruiter (1st round) , phone interview with hiring manager (2nd round) , in-person interview with hiring manager, 1 team member, and Director in the same day (3rd round). Was asked to submit training slides (job was related to training) and writing sample. During 3rd round, took a timed Excel test and a timed writing prompt.  Although many parts to the process, it was efficient and HR was in constant contact.", "Interview Questions": "What projects are you working on \r\nMany \"standard\" questions like scenario based. "}, {"date": "21 Aug 2019", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at San Francisco Health Plan (San Francisco, CA)", "Interview Descriptions": "Bad interview process. First, met with the Director, she was very arrogant. Her first statement  was- \"I wouldn't have picked such resume for this role\". Why did you call me for an in-person interview after a recruiter call and phone screen with the lead then. It tuned me off right at the beginning of the interview.", "Interview Questions": "Organization structure at current company :|"}, {"date": "7 Aug 2019", "title": "Qnxt Configuration Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at San Francisco Health Plan in Jul 2019", "Interview Descriptions": "Interview process was very transparent throughout the process. HR was very approachable. Gave enough details regarding the benefits. Flexible with interview timings. Great benefits and flexible working hours including telecommute options for long timers.", "Interview Questions": "My expertise in various areas including domain, tools I worked and process followed."}, {"date": "22 Apr 2019", "title": "Care Management Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at San Francisco Health Plan (San Francisco, CA) in Mar 2019", "Interview Descriptions": "The interview process was refreshing. They were very organized and transparent from the start. The recruiter reached out to me after I submitted my application, we set up a time for a phone interview. We had a phone interview and they let me know I made it to the second round within a week.\r\n\r\nI had my in-person interview within two weeks and they were very organized, very nice, which helped me feel less nervous and perform my best in the interview. They actually called me back the next day to let me know they were interested in me and wanted to call my references. \r\n\r\nIt was refreshing and different from all the other interviews I have had with other organizations.", "Interview Questions": "If you could eat dinner with 3 people, dead or alive, who would it be? "}, {"date": "5 Apr 2019", "title": "Manager Health Services Product Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at San Francisco Health Plan (San Francisco, CA) in Mar 2019", "Interview Descriptions": "SFHP has a great culture, and great vibe working for a great cause. Most importantly great leadership and managers who are humble. Everything reflects genuinely and authentically as they mention.  They care about the employees progress in the career and professional development. Employees are very happy. SFHP has a great future. One of the best interviews and process I had. My best wishes to SFHP and it's future. \r\n\r\nI did not accept because I decided to move out of CA.", "Interview Questions": "Situational interview questions with SMART. "}, {"date": "21 Dec 2018", "title": "Population Health Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at San Francisco Health Plan", "Interview Descriptions": "The process was very smooth and during each step, the interviewers were very transparent and honest with me. The steps from initial application to acceptance of the offer went through without any issue. A lot of behavioral interview questions for this role specifically. I was phone interviewed twice, then brought in person for a 3 hour multiple-session interview.", "Interview Questions": "What was a time you worked with someone difficult, and how did you handle the situation?"}], [{"date": "18 Dec 2018", "title": "Population Health Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at San Francisco Health Plan", "Interview Descriptions": "I was interviewed via phone for another position, got rejected and then was asked if I was still interested in the Population Health role. This interview had three steps: phone screen with recruiter, phone interview with hiring manager and in-person interview with the panel.  The recruiter was very responsive throughout the process. I was't offered the role after the in-person interview and I followed up with the recruiter for feedback. I never heard from the recruiter again.", "Interview Questions": "Describe one of of your favorite public health projects? The next questions were be behavioral based on the project described (ex. team management, priorities, conflict management, describe a challenging situation etc)"}, {"date": "17 Jul 2019", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at San Francisco Health Plan (San Francisco, CA) in Dec 2018", "Interview Descriptions": "Applied through LinkedIn, and was given speedy response. Quick coordination and succinct info on what the job entails. Sat through two meetings -first with HR, then with team leaders for a panel interview. Questions were standard, and was very informative.", "Interview Questions": "What skills do you bring to this position?"}, {"date": "13 Nov 2018", "title": "Care Management Community Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at San Francisco Health Plan (San Francisco, CA) in Nov 2018", "Interview Descriptions": "I found out about the position through LinkedIn, and was reached out to by their Senior Recruiter. They quickly scheduled a phone screening that week. Following the phone screening I was offered an in person interview for two weeks later.", "Interview Questions": "Why are you leaving your current employer?"}, {"date": "21 Dec 2018", "title": "Provider Operations Network Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at San Francisco Health Plan (San Francisco, CA) in Nov 2018", "Interview Descriptions": "The interview process was very quick and efficient. Applied online and about two weeks later, received an email from HR to schedule telephone interview. This interview was scheduled the same week. The telephone interview was 30 minutes and consisted of simple questions about previous job and availability to start, general salary requirements, etc. \nEmail received the following week to come in for a team interview. This covered more in depth questions about work history, role at SFHP and personal goals.", "Interview Questions": "What is the most rewarding aspect of your job? "}, {"date": "23 Jan 2019", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at San Francisco Health Plan (San Francisco, CA) in Aug 2018", "Interview Descriptions": "I was interviewed over the phone through an agency prior to having a phone interview with HR. After, I was scheduled to do another phone interview with both managers prior to having a in person interview.", "Interview Questions": "Tell us about an experience where you were left unsupervised or when you didn’t have a manager around "}, {"date": "7 Jun 2018", "title": "Marketing Department Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at San Francisco Health Plan (San Francisco, CA)", "Interview Descriptions": "Phone screen, in-person interview with 6 different people, one final coffee interview. Process took about 3-4 weeks. It was pretty relaxed and pleasant. I felt extremely comfortable with all interviewers.", "Interview Questions": "What drove you to your current career field?"}, {"date": "12 Sept 2018", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at San Francisco Health Plan (San Francisco, CA) in May 2018", "Interview Descriptions": "Excellent process. Very clear about the expectations of the role and the steps needed to complete the interview process. Very prompt at responding  back to me about the role.", "Interview Questions": "Is work-life balance important to you?"}, {"date": "20 Feb 2018", "title": "Regulatory Affairs and Compliance Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at San Francisco Health Plan (San Francisco, CA) in Oct 2017", "Interview Descriptions": "The interview process consisted of a (1) phone screening interview with HR, (2) two sets of on-site interviews, and (3) a written task. The phone screening interview was pretty standard. During the  first on-site visit, I was interviewed by the members of the Compliance Department in two separate sessions and wrapped up the day by touching bases with HR. The second on-site interview was with the Officer of Compliance and Regulatory Affairs. Upon completing the on-site interviews, I was tasked with completing a written assignment that tested my ability to analyze and update a policy and procedure against a DHCS All Plan Letter. The entire process took approximately 5-6 weeks (including the background check before being officially offered the position).", "Interview Questions": "What is DHCS, and what is San Francisco Health Plan's relationship with DHCS?"}, {"date": "7 Aug 2017", "title": "Programmer Analyst/SQL Server Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at San Francisco Health Plan (Telephone, TX) in Jun 2017", "Interview Descriptions": "The interview process started with HR call, Manager call, 3 and half hr interview(3 panels) .Meeting entire team who interviewed. Then finally call with the Director. Basic SQL written test, then video conference phone interview and finally phone call.", "Interview Questions": "SQL server questions, write queries, know about health insurance process, ?"}, {"date": "10 Apr 2017", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at San Francisco Health Plan", "Interview Descriptions": "Spoke with the recruiter and then hiring manager. Recruiter was horrible with following up after each process and slow to respond. Pretty disappointing considering their website states that they want to make the candidate process great...", "Interview Questions": "How do you keep up with current health policy news?"}], [{"date": "29 Dec 2017", "title": "Program Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at San Francisco Health Plan (San Francisco, CA) in Mar 2017", "Interview Descriptions": "Process took overall about 3 weeks, and I was in touch with multiple people. It consisted of a phone screen with a recruiter, submitting a writing sample and a powerpoint of a training I had developed and presented at my current job, a phone call with the Hiring Manager, and then finally an in-person interview with the Hiring Manager and a member of the team in addition to the Program Officer (equivalent to the Department Director). The in-person interview was very long --- close to 4 hours because they also had me do a timed writing prompt in addition to an Excel test while I was there. \r\n\r\nOverall, I felt the process was very smooth, everyone extremely welcoming and friendly, and they were flexible with schedule as they understood I was working full time during the interview process.", "Interview Questions": "There was no difficult questions during the interview process for me. They were casual, conversational (which I enjoyed) with some behavioral-type questions. "}, {"date": "9 Nov 2017", "title": "Abstractor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at San Francisco Health Plan (San Francisco, CA) in Jan 2017", "Interview Descriptions": "It was by skype and went okay, however I was warned that the team I would be working with was ultra liberal and I should be aware since my resume seemed conservative", "Interview Questions": "If I was okay working with a liberal team"}, {"date": "21 Nov 2016", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at San Francisco Health Plan (San Francisco, CA)", "Interview Descriptions": "There was one interview at the agency, one interview with 2 HR people and one interview with the CS manager. I would say that last interview was the most important, first one was barely screening", "Interview Questions": "Why did you quit your previous job"}, {"date": "16 Nov 2016", "title": "Technical Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at San Francisco Health Plan (San Francisco, CA) in Oct 2016", "Interview Descriptions": "It was a lengthy interview process; Phone call with HR person (the best), then a phone call with the hiring manager, then on-site interview with the team, peers, and the hiring manager again. The whole thing spanned a little over a month.\r\n\r\nPros: Very thorough in who is interviewed. There's a heavy emphasis on whether the person will be good fit with the existing staff and environment.\r\n\r\nCons: Comes off as insecure about the boat being rocked too much. The nouveau/swanky furniture and colorful walls seem attractive at first, but then after the interview one can sense the insecurity and borderline suffocation.", "Interview Questions": "How would you deal with low performers? This seems to come up quite a bit, must a major pain point for the company."}, {"date": "9 Aug 2019", "title": "Member Eligibility Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at San Francisco Health Plan (San Francisco, CA) in Jul 2016", "Interview Descriptions": "It was easy. I did two rounds of interview. The manager asked basic questions and was super nice. Mainly talked about my experiences and skills. The manager gave a lot of scenarios and asked how would handle those situations. It wasn't too hard for me,", "Interview Questions": "Tell me about your experience in medical field."}, {"date": "18 Jan 2016", "title": "Recruiting Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at San Francisco Health Plan (San Francisco, CA)", "Interview Descriptions": "Applied online through a mutual friend who introduced the job. First round of interview was a phone interview with the recruiter. Second round was an onsite interview at the San Francisco office. Met with the recruiter as well as her manager. Was asked to come back for a final round to meet with two business partner (when this position doesn't even support them) and again with the recruiter and her manager. Total waste of time! I was told that they'd get back to me within next week and never heard back. How rude and unprofessional. The recruiter told me they were huge in candidate experience. Maybe you should learn how to get back to your candidates on time! We made the effort to come out to meet with the team. How disrespectful to not get back to the candidates with either a yes or no email.", "Interview Questions": "Can you give an example of what a great candidate experience is?"}, {"date": "22 Jan 2016", "title": "Operations Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at San Francisco Health Plan (San Francisco, CA)", "Interview Descriptions": "Very thorough - I felt like the team I met with and the woman in HR did a good job at explaining the entire role to me. I was able to ask questions and the team answered them all. I'm new to the Bay Area and I felt like they made me feel welcome.", "Interview Questions": "SQL questions, teamwork questions, general conversation (not too many those standard interview questions)"}, {"date": "5 Jan 2016", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at San Francisco Health Plan (San Francisco, CA)", "Interview Descriptions": "the interview process was way too long and i met with way too many people. feedback is slow. recruiters lie about your status. managers don't know what they want. you meet with practically the entire department", "Interview Questions": "N/A"}, {"date": "8 Dec 2015", "title": "Business Solution Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at San Francisco Health Plan", "Interview Descriptions": "Human resource phone interview. followed by 3 hours back to back group interview. Human resource seem proactive but interview panel people seems distracted and unprofessional  uninterested or yawning, watching clock.", "Interview Questions": "1.Describe  BRD/DFD? did you work on complete project? how did you do UAT? Test plan? what software did u use? how did u configure system? "}, {"date": "17 Mar 2016", "title": "Associate Process Improvement Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at San Francisco Health Plan in Dec 2015", "Interview Descriptions": "1st phone interview with HR, 2nd, a phone interview with the hiring manager. did not get an in person interview. Ask a lot of questions on lean 6 sigma even though job description say preferred to have someone to work toward the certification training", "Interview Questions": "what do you know about lean 6-sigma?\r\nwhat do you know about their company? why do you want to work there\r\ntell me about yourself"}], [{"date": "15 Jul 2015", "title": "Software Developer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at San Francisco Health Plan (San Francisco, CA)", "Interview Descriptions": "Technical phone screen with senior developer which took more then an hour.\r\nThen had to go in twice for face to face interview. \r\nFirst day the interview was with technical group/panel with 3 people from two different teams and then with the hiring manager.\r\nNext day the interview was with management plus HR.", "Interview Questions": "Mainly questions were around ASP.NET and SQL. Asked to write some queries based on the test data and model."}, {"date": "22 Jun 2015", "title": "Programmer Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at San Francisco Health Plan", "Interview Descriptions": "General questions about the company, their outlook and future growth opportunities. Questions on technical and analytical skills. I was also asked some scenario type questions and behavioral interview questions. Hiring Manager and team members were very friendly and answered all my questions on work life balance, responsibilities, expectation of this role etc. HR process was quick and easy.", "Interview Questions": "Why this company? Why should we hire you?"}, {"date": "16 Jul 2015", "title": "Business Solutions Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at San Francisco Health Plan (San Francisco, CA) in Jun 2015", "Interview Descriptions": "Phone screen with Hr Recruiter. 30 minute phone interview with hiring manager and another person. Then a 3 hour in person meeting that consisted of 4 different interviews, with 6 different people. I interviewed with HR, the Hiring Manager, and everyone on the team. Everyone was really nice, great interviews. But the questions were very redundant! Interview with HR was very intense to the point of almost rude at some points (kept cutting off answers to ask another question), but pretty straight forward. HR also mentioned there would be a 4th round interview if I made it passed this round.  Also, took HR 4 weeks after my interview to get back to me when they said they would get back to me the following Monday.", "Interview Questions": "Why are you leaving your current company? How good are you at SQL? What are your goals for the next two years?"}, {"date": "26 Nov 2015", "title": "Practice Improvement Specialist/Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at San Francisco Health Plan in Jun 2015", "Interview Descriptions": "Phone screen followed by an in person interview. The in person interview lasted a couple of hours and consisted of basic interview questions. There were several behavioral questions asked. I met with 3 people followed by the recruiter and was told that I would hear back in the next week if i was going to come in for the last month interview. Received an automatic email about a month later that I did not get it. \r\n\r\nOne odd thing I heard during the interview was that this was an entry level position. They said they only expected the person who got the job to stay in it for just a year since it was very entry level admin work. This job was advertised online as seeming like a lot more. They also requested 3-5 years of experience. How does this make sense? What is a person supposed to be doing for those 3-5 years when you are considering this position to be a \"first job\".", "Interview Questions": "Describe a time when you had to deal with competing deadlines"}, {"date": "10 Jul 2015", "title": "Care Support Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at San Francisco Health Plan (San Francisco, CA) in Jun 2015", "Interview Descriptions": "Applied online. Process took about 2 weeks. Went through a quick phone interview and was asked to come in for an in person interview within the same week. Interviewed with the supervisor of the program and the person I would be covering for. Mostly situational questions assessing how well you work in a team, as well as why you want to work at the company and why you think you would be a good fit for the position based on your background/experience.", "Interview Questions": "How does your background make you a good fit for this position? "}, {"date": "15 Apr 2015", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at San Francisco Health Plan (San Francisco, CA)", "Interview Descriptions": "Lengthy process but very thorough. Took a couple months start to finish. They want you to succeed and do well! The hiring managers and HR staff were very professional and kind. I was offered a position and happily accepted. It's a joy to work for an organization that does so much good for the people in SF!", "Interview Questions": "N/A"}, {"date": "21 Sept 2015", "title": "Business Solutions Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at San Francisco Health Plan (San Francisco, CA) in Jan 2015", "Interview Descriptions": "First contacted by internal recruiter. Initial interview went well, and my resume was sent to the hiring manager, but there was no followup. Later I called the recruiter again and he said the job was filled - but I noticed that it was still listed on the website and through various external recruiters. Very disappointing that there was no followup, especially since the need is \"urgent\" but the job has remained open for months.", "Interview Questions": "What about customer service?"}, {"date": "10 Dec 2014", "title": "Hedis Abstractor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at San Francisco Health Plan", "Interview Descriptions": "Interview 1: phone interview with HR\r\nInterview 2: in-person interview with a total of three women.\r\nThey were all very outgoing and energetic. They want you to do well in the interview- don't be afraid to interview, they are super sweet. \r\nAfter your interviews, they will contact your references and then, if you get the job, an offer will come! Best of luck!", "Interview Questions": "Explain a conflict with a peer/coworkers you had in the past and how you overcame it"}, {"date": "4 Nov 2014", "title": "Technology Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at San Francisco Health Plan (San Francisco, CA) in Oct 2014", "Interview Descriptions": "Initial phone screen with their own onsite sr. recruiter went very well and very professional. Surprised at how on the up & up the recruiter was and what he knew about the job. I then got another phone screen interview with the hiring manager that also went rather well. Recruiter contacted me back and eventually we set up an onsite interview for me to meet other managers and staff. I know it all went well as I touched base again at the interviews with hiring manager and recruiter. \r\n\r\nThey sound like they want me to come back and meet a few more people before the decision is made on to hire or not. However, the recruiter is late already in getting back to me. It's seemingly a great job opportunity too. I think they could offer slightly better feedback, esp. when I hear the time frame of the decision and them getting back to me seem to be at odds.\r\n\r\nI've recruited, interviewed, and hired several people in the past and never \"put people off\" like this or delayed them. High hopes still!", "Interview Questions": "\"Tell me two things you can really improve on (computer related)\"....  \"What is your mngt style?\"  \"Deal with difficult or low performers?\"  \"After all this and meeting everyone, you think you still want this job?\""}, {"date": "29 Aug 2014", "title": "Compliance Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at San Francisco Health Plan (San Francisco, CA) in Jul 2014", "Interview Descriptions": "Lasted about a month from initial phone screening till final round interview. Interviewers were positive and truly proud of what they do. I was asked behavioral questions and examples of complex situations from previous experience. They are looking for someone who knows/interested in health care industry.", "Interview Questions": "Explain step by step process of scheduling an urgent interview with external members/ agencies."}], [{"date": "12 Aug 2014", "title": "Specialist Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at San Francisco Health Plan (San Francisco, CA) in Jul 2014", "Interview Descriptions": "Phone screen lasted for about 15 minutes and was followed by two interviews back-to-back. Was told there would be three more interviews if I made it to the next round, and that I would hear back with an update regardless of if I made it to the next round. I never heard anything more.", "Interview Questions": "The most difficult and unexpected questions were ones that did not match the position as it was first explained to me. For example, on my phone screen, I explained my experience in calendaring interviews. I stated how many positions I currently recruit for and how often we interview. The person on the phone said, \"great!\" Once on-site, it was clear I was wasting their time because I didn't have experience coordinating hundreds of interviews with executive-level interviewers. "}, {"date": "9 Apr 2014", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at San Francisco Health Plan (San Francisco, CA) in Jun 2013", "Interview Descriptions": "Interview process includes:\r\n-internet resume submission\r\n-HR phone screen/ interview\r\n-interview sessions/style depends on department and job position\r\n-expect a minimum of three interview rounds\r\n-expect back to back/ same day interviews both panel and 1:1\r\n-typical format includes being interviewed by peers, management, HR\r\n-each interviewer has autonomy to use preferred interview style", "Interview Questions": "N/A"}, {"date": "30 Jul 2013", "title": "Provider Relations Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at San Francisco Health Plan (San Francisco, CA) in Jun 2013", "Interview Descriptions": "Phone Interview - HR \r\nOn-Site Interview - Met with Hiring Manager as well as 4 members of his team\r\n2nd Interview- Met with Director of Provider Relations. \r\nIt took some time to get me in for my first in person interview (a month after I spoke to the recruiter by phone) but overall the interview process was good and flowed well. The recruiter gave me a schedule of whom I would be meeting with as well as their titles within the company, and afterwards I met with the Director as a finalist for the position. Nice building and the group I met was extremely friendly. I left with an overall good impression of SFHP", "Interview Questions": "How would you finish a project and/or assignment if you didn't have the necessary information? How would you relay this to your Providers? "}, {"date": "18 Jul 2012", "title": "UM Nurse Care Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at San Francisco Health Plan (San Francisco, CA) in Apr 2011", "Interview Descriptions": "1. Screening interview by HR\r\n2. Meet w/ Hiring Manager and other UM RNs\r\n3. Meet w/ Medical Director, HR Manager", "Interview Questions": "Salary negotiation process was very odd.  The HR Manager stated that he didn't have the salary range w/ him.  "}]]