[[{"date": "3 Apr 2023", "title": "Programme policy officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at World Food Programme (Lagos)", "Interview Descriptions": "Quite straight forward with team of professional experts who created a very laxing environment to make the interview easy in my opinion or view. Questions were structured and many senarios to prove your points", "Interview Questions": "I tell me about yourself"}, {"date": "8 Feb 2023", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at World Food Programme", "Interview Descriptions": "Good experience and the questions where related to the job You must prepare very well, I applied in January and February I was invited for online test, I’m still waiting for my second interview. The process in very professional", "Interview Questions": "Questions related to the job"}, {"date": "22 Nov 2022", "title": "Business Support Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6+ months. I interviewed at World Food Programme (Maiduguri, Borno) in Nov 2022", "Interview Descriptions": "I saw the advert online and i apply. which i have been applying for position with WFP. I have not taken any interview yet but am looking forward to attend one. To know how good i can be.", "Interview Questions": "I have not taken any interview yet but am looking forward to attend one. To know how good i can be."}, {"date": "12 Sept 2022", "title": "Program Policy Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at World Food Programme (Abuja, Federal Capital Territory) in Oct 2021", "Interview Descriptions": "The recruitment process was in 2 stages, an exam and an interview. The exam was rigorous. It lasted for 3 hours and the questions were very tasking.\nThey tested my knowledge of excel and programme planning.\n", "Interview Questions": "Make a power point presentation on Home grown school feeding programme and the role of each stakeholder"}, {"date": "18 Feb 2021", "title": "Admin Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at World Food Programme", "Interview Descriptions": "the interview process was quite good, the interviewer was friendly, calm, that made me  to be more relaxed, focused and calculated , we were given enough time to answer the questions,", "Interview Questions": "How have you used computers in administrative or clerical work?"}, {"date": "2 Feb 2019", "title": "Programmer Policy - Risk and Compliance Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 months. I interviewed at World Food Programme (Abuja, Federal Capital Territory) in Oct 2018", "Interview Descriptions": "In the first instance a written test, the written test comprised questions relating to the job description/role. Where the outcome of the written test is successful, an oral interview follows.", "Interview Questions": "Competency-based interview with hypothetical questions relating to the role. Ice-breaking questions- Why do you want to work with WFP?"}, {"date": "4 Sept 2018", "title": "Business Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 10 months. I interviewed at World Food Programme (Maiduguri, Borno) in Jul 2018", "Interview Descriptions": "I applied in January 2018 \nI got invited for the written assessment  in June 2018 \nI got invited for an oral interview in July 2018 \nI got an offer in July 2018", "Interview Questions": "What was your motivation for applying to this role? "}, {"date": "22 Oct 2022", "title": "Logistics Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Food Programme (Lagos) in Apr 2018", "Interview Descriptions": "It was in two stages, written and Oral. The questions are based on the job and industry. so you have to familiarize yourself with all the relevant information and study the job description too.", "Interview Questions": "Meaning of some Terms used in shipping."}, {"date": "10 Jun 2017", "title": "Programmer Policy Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 2+ months. I interviewed at World Food Programme in Jun 2017", "Interview Descriptions": "This was a written test. Invitations were sent out about a month after application and just a few days before the test date. Staff were nice and welcoming. Venue was not set up on time so the test started a little behind schedule.", "Interview Questions": "As a Programme officer at wfp, what are some of the government policies that are relevant to wfp's emergency response and state briefly the elements of these policies."}, {"date": "17 Nov 2019", "title": "Business Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at World Food Programme (Port Harcourt) in Sept 2016", "Interview Descriptions": "The interview was in three stages, online objective questions, written and then oral interview.\r\nThe online interview was time for 45 minutes with 100  questions. The written interview comprised of 5 solid/technical questions to finish in 30 minutes. and the oral interview was conducted by a panel/group of 4 I guess, over the phone.", "Interview Questions": "What do you understand by Business Support"}]]