[[{"date": "17 Mar 2023", "title": "Clinical Psychology Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hazelden Betty Ford", "Interview Descriptions": "Typical psychology internship interview - rotated between several supervisors and previous interns, asked about clinical experiences including therapy and testing, gave clinical examples and asked for your impression, got good vibes from everyone that worked there,", "Interview Questions": "Where do you see yourself working in 5 years"}, {"date": "14 Feb 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hazelden Betty Ford", "Interview Descriptions": "Went fast and well. Very accommodating. One part was video. The human resources manager was extremely nice and very upfront. Salary was not negotiable. Be prepared to speak to your past jobs and give details of your history.", "Interview Questions": "Tell us about a time you worked with an employee you disagreed with."}, {"date": "27 Sept 2020", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hazelden Betty Ford (Santa Fe, NM) in Sept 2020", "Interview Descriptions": "Two interviews were conducted, about a week apart. One was with the supervisor, the other was with three peers.  Good thoughtful questions were asked.  Each interview took an hour.  Some standard interview questions and a few behavioral questions to see what you have done in certain scenarios.", "Interview Questions": "What 3 parts of the job are you most interested in?"}, {"date": "14 Dec 2020", "title": "Addiction Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Hazelden Betty Ford (Plymouth, MN) in Sept 2020", "Interview Descriptions": "I applied and received a phone interview request within 2 days. The supervisor I spoke with on the phone offered an in-person interview  at the conclusion of the phone call and we scheduled it about a week later. I was offered the job about a week after that. \r\n\r\nInterview is formal and structured. They expect an EAR (Example, Action, Result) response so it’s going to bode well for you if you familiarize yourself with this process ahead of both the phone and in-person interviews. Since it is a behavioral interview, come prepared with very specific examples as they will ask you to specify if you response is too general. The formal structure of the interview made it feel slightly impersonal which I did not like as I was also trying to determine if I were a good professional fit for the supervisors/peer—it was near impossible to determine personality of the team members in the interview given the rigid structure. You are able to ask questions at the conclusion of the interview!", "Interview Questions": "I can’t remember specifics! I do recall feeling unsatisfied with my responses in the moment because the interviewers, likely trained this way, do not offer follow-up questions, affirmative statements, or facial expression.  If you earn an interview, expect this and you’ll like not be as alarmed as me! "}, {"date": "10 Feb 2020", "title": "Sourcer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hazelden Betty Ford", "Interview Descriptions": "-Two phone interviews\r\n-In-person peer interview \r\nThe phone screen is very casual, they just want to know why you're looking, what your compensation requirements are etc. \r\nThe in-person peer interview is pretty involved but they make you feel comfortable.", "Interview Questions": "Behavioral style interview. They're looking for an EAR response: Example, Action, Response "}], [{"date": "22 Sept 2020", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Hazelden Betty Ford (Center City, MN) in Dec 2019", "Interview Descriptions": "I had a 30 minute call with the hiring manager. It was very conversational. It took a while to get the call set up but once we had it things moved quickly. I was told the next day they weren't moving forward with me which I thought was respectful.", "Interview Questions": "What my experience in the industry is."}, {"date": "9 Oct 2018", "title": "Admissions Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Hazelden Betty Ford", "Interview Descriptions": "Got a call 1 day after I applied. The strangest thing happened right off the bat after the initial greeting, she asked, \"I assume you just graduated?\" I paused for a moment because I had been out of college for many years and the position only required a HS Diploma. I've also never had anyone ask me about my education right away (or ever). I don't put the year I obtained my degree due to age discrimination and privacy concerns. So, I feel she was fishing to see how old I was.... I responded with a \"No...\" in a tone that was basically saying \"Why are you asking that?\" So yeah, that was odd and just a strange thing to say that you \"assume\" when no evidence suggests that. Also, I am very surprised in this day and age that people seem oblivious to the fact that people of ALL ages go back to school and get their degree. Trying to fish to see if someone is too young or too old based on what year they graduated, you are wasting your time and look foolish in the process. \r\n\r\nShe then went over the position and asked me a couple questions like why I applied and why I would be a good fit. Then,  she began out of nowhere to boast about her position and it was just again, odd. She told me it's 10-12 hour shifts but for 40 hours a week. After thinking about the position/the hours more and reading reviews on here, I decided that this position and company are not for me.", "Interview Questions": "Why this position?"}, {"date": "17 Jul 2018", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hazelden Betty Ford", "Interview Descriptions": "It is a nice setup The hiring processes have been recently updated to be more standardized I enjoyed ever minute of it. I highly recommend keeping the process. Keep up the good work", "Interview Questions": "N/A"}, {"date": "1 Nov 2018", "title": "Substance Abuse Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hazelden Betty Ford (Chicago, IL) in Jul 2018", "Interview Descriptions": "Phone call to invite you for interview, then you have an in-person interview with directors then peer interview. It took several weeks to find out. Seems that applications in system could get lost or may go through weeding out process", "Interview Questions": "Experience in the field, theoretical approach, strengths, weaknesses, why should we hire you, what do you see as the biggest challenge"}, {"date": "29 Nov 2018", "title": "Pac Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hazelden Betty Ford (Center City, MN) in Jan 2018", "Interview Descriptions": "3 interviews one phone and two face to face and there was two-three people in each interview. They were a lot of behavior questions involved about times when you did something", "Interview Questions": "what are two areas you would want to improve on for this job"}, {"date": "5 Jan 2018", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hazelden Betty Ford (Center City, MN) in Nov 2017", "Interview Descriptions": "4 separate interviews with different groups of people - online assessment and separate interview through management company. Drove up to Center City 3 separate times.  Staff seemed well prepared.  Overall difficult interview but good experience.", "Interview Questions": "Why do you want to work here? "}, {"date": "17 Jul 2017", "title": "Human Resources Business Partner Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "The process took 3 months. I interviewed at Hazelden Betty Ford", "Interview Descriptions": "Long with many steps, phone interview, hiring manager interview, references and a peer interview, then maybe an offer of employment.  Be prepared to come onsite at least twice and to meet many people like peers, stakeholders, leaders, etc.  The process can take up to 3 months or more depending on the hiring manager.", "Interview Questions": "Give us an example of...pick a topic like communication, integrity, interpersonal skill,  business acumen, team building, etc.  be prepare to provide specific examples."}, {"date": "15 Dec 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Hazelden Betty Ford (Rancho Mirage, CA) in Apr 2017", "Interview Descriptions": "non engaging, un-interactive, ran by the support staff, not impressed.  I have nothing else to say about this proces.  why do you need 30 words for this?.................... ..................... ........... ..............", "Interview Questions": "N/A"}, {"date": "28 Jun 2017", "title": "Clinical Informaticist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hazelden Betty Ford (Center City, MN) in Jan 2016", "Interview Descriptions": "I went through a phone interview and 3 person panel interview.  The process took about a month.  It was down to me and one other candidate.  The other candidate had a Master's Degree, even though that wasn't in the requirements.  I learned of positions via attending an Open House.", "Interview Questions": "Why do you want to work for this company?"}], [{"date": "4 Nov 2017", "title": "Housekeeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Hazelden Betty Ford (Center City, MN) in Nov 2015", "Interview Descriptions": "Manager calls for phone interview, \r\nMeet with Manager\r\n Peer interview \r\nUsing Chekster seek references and they must respond online\r\n HR adds percentages, or favorable references- the amount works in your favor\r\nComplete Background check, must be \r\nFingerprinted and photographed if working with patients directly\r\nAccept Job offer", "Interview Questions": "What are your strengths?\r\n"}, {"date": "21 Aug 2015", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Hazelden Betty Ford (Saint Paul, MN) in Jul 2015", "Interview Descriptions": "Typical behavior interview with a 4 on 1 interview panel.  Questions were decided in advanced by panel and they stayed to the questions.  45 minutes answering questions, then 20 minutes for them to answer my questions.", "Interview Questions": "What is your ability to challenge management and how successful are you."}, {"date": "2 Apr 2016", "title": "IT Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Hazelden Betty Ford (Center City, MN) in Jun 2015", "Interview Descriptions": "Group interview process - Set questions with all participating in asking at least two questions, but all would comment with additional clarifying questions related to the initial question.  Allowed me to ask questions at the end, that was helpful in determining culture and pulse of the day to day operations.", "Interview Questions": "Why do you want to work here?  What is your management style."}, {"date": "27 Feb 2015", "title": "Human Resources Business Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Hazelden Betty Ford (Center City, MN) in Oct 2014", "Interview Descriptions": "In-depth and encouraging.  Started with phone interview, then 1:1 with hiring manager, then peer interview (4 people, one virtual from Oregon), then a stakeholder interview (5 people from the business area I would be supporting).  The whole process took 2.5 months, but I learned a lot along the way and they learned a lot about me.", "Interview Questions": "Behavioral based - examples, specific situations, past behavior.  Questions based on competencies for the job and standards of behavior required for all staff members."}, {"date": "27 Apr 2017", "title": "Clinical Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Hazelden Betty Ford (Center City, MN) in Aug 2013", "Interview Descriptions": "Applied for the Hazelden Betty Ford Graduate School of Addiction Studies and Co-occurring Disorders online.  Was interviewed over the phone.  Once my application was accepted, I interviewed with a department head in the graduate school.", "Interview Questions": "My motivation for entering the counseling field."}, {"date": "17 Oct 2012", "title": "Executive Secretary Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 8 weeks. I interviewed at Hazelden Betty Ford (Palm Desert, CA) in Aug 2012", "Interview Descriptions": "As a temp with Office Team at the Foundation offsite. Going to be permanent after 8 weeks. The behaved as concerned, upwardly and genuinely caring staff. However it was condescending, rude and extremely stressful to work there. Salaried employees come and go as they please, arrive late, leave early.", "Interview Questions": "Asked to participate in interviews then told my opinion didn't count."}, {"date": "4 May 2016", "title": "Resource Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Hazelden Betty Ford (Center City, MN) in Jun 2012", "Interview Descriptions": "Phone, then in person. The interview process was not high pressure, it was very pleasant. The manager asked a list of pretty traditional questions and then went over the specifics of the position.", "Interview Questions": "How do I handle emergencies"}, {"date": "14 Sept 2012", "title": "Housekeeping Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hazelden Betty Ford (Portland, OR) in Apr 2012", "Interview Descriptions": "Interviewed and Background check took a long time (about 3 weeks). No UA's performed on any employees (I think this is a big mistake because of the nature of the business). Non profit organization.", "Interview Questions": "Previous experience."}]]