[[{"date": "13 Feb 2023", "title": "Customer Service Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MTF Biologics in Feb 2023", "Interview Descriptions": "The interview process was a phone screening with HR (about 20 min) and an interview with the manager of the department. The interview was TWO HOURS long. The manager assured me that I’d hear back from HR about next steps. I had reached out to them after days of hearing nothing. Short story, I did not receive an offer and I’m assuming because when the manager asked where I see myself in 5 years, I said a management position. The manager did not want to see growth because she said she didn’t want to “lose people”. 2 and 1/2 hours of my time WASTED.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "24 Dec 2020", "title": "Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MTF Biologics", "Interview Descriptions": "Background phone interview with HR.  Then interviewed with two department managers (is a matrix environment) and the director.  Was a fast turn around but that is not always the case.", "Interview Questions": "how did you hear about MTF?"}, {"date": "15 Oct 2021", "title": "IT Business Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at MTF Biologics (Edison, NJ) in Mar 2020", "Interview Descriptions": "HR Interview\nManager Interview\n\nShe was great, amazing, told me what she expected out of me and made sure that what she wanted me to expect out  of her and the guidance she would provide to make sure I do well.", "Interview Questions": "Tell me about a time you dealt with a tough client or customer. "}, {"date": "7 May 2020", "title": "Quality Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at MTF Biologics (Edison, NJ) in Jan 2020", "Interview Descriptions": "Applied on-line for a position in Edison, New Jersey and was contacted and pre-screened by a HR rep (via email and phone).  A second HR rep set up a phone sceen with a departmental manager.   Had a good phone screen with department manager.  Never heard again from MTF.   All 3 people will not return email or phone call follow-ups.   Very unprofessional reflection on the organization's Edison, NJ location (especially on the HR department).", "Interview Questions": "What attracted you to MTF and this specific role, what do you know about tissue banking, why are you looking at new opportunities and why do you want to leave your current employer.  Also - what base salary are you seeking (for this role in NJ) ?"}, {"date": "5 Dec 2019", "title": "QA Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at MTF Biologics in Oct 2019", "Interview Descriptions": "Phone interview was really easy. I was asked questions about my resume and how each contributed to my skills and experience. They said I'm well qualified for the position but later they went ahead with someone else.", "Interview Questions": "Why do you want to work here?"}, {"date": "4 Sept 2019", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at MTF Biologics", "Interview Descriptions": "HR set up phone screen interview via email and calendar and never called never answered followup email to reschedule. Extremely unprofessional and a VERY BAD impression of the organization and who they have initially meet prospective applicants", "Interview Questions": "N/A"}, {"date": "7 Nov 2019", "title": "Tissue Processing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at MTF Biologics (Edison, NJ) in Sept 2019", "Interview Descriptions": "I was ask standard questions .. I was told I was lime and well prepared. I didn’t hear nothing for a while ..a month later i received an offer letter .. start date next month", "Interview Questions": "Why should I pick u for this position? "}, {"date": "23 Jan 2023", "title": "Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MTF Biologics in Apr 2019", "Interview Descriptions": "Interviewed with HR. Then interviewed with the manager of the department. Shortly after I interviewed with both again to see if I was available for a job posting that was different than the original one I had applied for, which I was happy to be considered for.", "Interview Questions": "Design control experience, regulatory body interactions and work completed in the past, strengths/weaknesses, times that I needed to persuade people a certain way"}, {"date": "3 Oct 2018", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at MTF Biologics", "Interview Descriptions": "Applied online - was told I was qualified and considered and then no follow up was completed - called and left 3 messages for recruiting manager, was told I would get a call to set up phone interview then never heard from them again.", "Interview Questions": "N/A"}, {"date": "13 Dec 2020", "title": "Engineering Co-Op Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MTF Biologics (Edison, NJ) in Apr 2017", "Interview Descriptions": "I had a phone interview with HR and then in person with the manager of my department and the engineer I was reporting to for the duration of the role.", "Interview Questions": "Tell me about yourself and how you’re suited for this role. "}], [{"date": "10 Dec 2016", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MTF Biologics (New York, NY)", "Interview Descriptions": "Had an in person interview with approximately 4 people and spent about 4 hours there for what I expected to have been a final interview. Followed up with an email and never heard back either way. Not very impressive.", "Interview Questions": "Tell me about a time you disagreed with a colleague and what was the outcome? "}, {"date": "13 Jun 2016", "title": "Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MTF Biologics (Edison, NJ)", "Interview Descriptions": "Applied initially online at the MTF website. It took multiple follow-ups (via phone and email) to the HR manager/director to get the ball rolling and establish a phone screen with the hiring manager. The phone screen with the hiring manager seemed to go well.   Interviewed with MTF (Edison, NJ) on a Friday afternoon.  The on-site interview process that was put together by MTF was very uncomfortable and very disorganized.", "Interview Questions": "How was the commute and was it easy finding us the first time?"}, {"date": "17 Jun 2017", "title": "Process Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at MTF Biologics (Jessup, PA) in May 2016", "Interview Descriptions": "I was interviewed at 5pm for 2nd shift position. I was hired as a temp first, and after a 3 month temp position,  I was offered full time status. Some other employees did wait up to 6 months before a full time offer.", "Interview Questions": "What is something you feel you have that would benefit our company?"}, {"date": "19 Feb 2016", "title": "Customer Service Advocate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at MTF Biologics (Edison, NJ) in Feb 2016", "Interview Descriptions": "I had my 1st interview over a month ago and it went very well. Then last week I had my 2nd interview with 2 other people and I felt that went good to. I came on my lunch and was told it wouldn't take as long as the 1st interview. Once I was done with the side by side the Sup said you have to get back and I said yes. I now see the position was reposted.", "Interview Questions": "what do I like about my current job"}, {"date": "15 Mar 2017", "title": "Lab Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MTF Biologics (Jessup, PA) in Jun 2015", "Interview Descriptions": "Very standard questions. Strength's, weaknesses, how would you handle conflict, etc. The hiring supervisors were very polite and the interview was very causal. Some knowledge of dilutions and significant figures is required.", "Interview Questions": "what are your weaknesses?"}, {"date": "29 May 2019", "title": "Central Supply Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at MTF Biologics (Edison, NJ) in May 2015", "Interview Descriptions": "I applied for the job through my school and got a phone call within a few weeks. I was asked to come in for an interview and was taken on a tour of the facility.", "Interview Questions": "Tell me about yourself"}, {"date": "25 Nov 2014", "title": "Helpdesk Support Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at MTF Biologics (Edison, NJ) in Oct 2014", "Interview Descriptions": "I applied for the Helpdesk Support Administrator position on Oct 6th, 2014. I received a call requesting an interview, and I met with the employer on Oct 10th.  3 people, in this order:  The Help Desk Supervisor (Karen Turpin), and the Supervisor of Network Operations(Pio Egan), and the HR Rep in charge of hiring(Jennifer Shepard).  I interviewed with Karen for about 30 mins.  It went very well, Karen was impressed with my resume, and she even gave me a couple of hints and suggestions for my interview with the next Supervisor (Pio).  Met with Pio for about 10 mins because he had a meeting right after interviewing me.  I used the tips Karen recommended, and managed to make what seemed to be an impression.  I was supposed to meet with Karen once again, but she was nowhere to be found.  Pio left me in the cafeteria for about 10-15 where I waited for Karen.  She eventually came by, and informed me that Jennifer is in a different building than the one I was currently in.  She gave me directions and wished me luck on my interview.  I went to the location, met with Jennifer.  Jennifer proceeded to ask me cryptic questions about what I've done in high pressure situations and what not.  Sadly I can't remember word for word what those questions were.  She did ask me what my salary requirements were.  I asked how much is the job willing to pay.  She proceeded to use semantics to return to the question she originally asked, without answering mine.  I said 45,000.  She said they were looking to have a decision by November 11th as someone was leaving the company.  Eventually left.  Sent out a thank you email to Jennifer, and asked her to forward it to Pio and Karen as I didn't have their emails.  A couple days passed, and Jennifer asked me to fill out some more information on their website.  Took care of it instantly as I was looking to get the position.  It sounded very promising.  Waited about a week to follow up on the position.  Called, and got in contact with Jennifer.  I politely asked how the candidate search and decisions are coming along.  She informed me that they were unsure of whether or not they were going to interview more people.  Okay, probably wasn't the number one candidate.  Understood.  MTF (Muscoskeletal Transplant Foundation) has an career portal which shows where you are in the application process.  My application for the position has been listed as \"under review\" since Oct 6th.  On Nov 11th, I called and left a voicemail on both Jennifer and Karen's voicemails. - I politely inquired about my application status, and made sure to let them know that my interest in the position has not changed.  I never heard back from them.  I email Jennifer Shepard today inquiring about the position, as its been a couple of weeks past their projected hire date.  She sends me this:\r\n\r\nAt present time, we have decided not to further pursue your candidacy. I did return your voicemail last week. I apologize if you did not receive.\r\nThank you for your follow-up.\r\nThanks,\r\nJennifer\r\n\r\nWhich is very understandable answer, but I never received a call from her.  Everything was very very professional even though I had to sit in the cafeteria for a little while.  I'm surprised that things turned out the way it did.", "Interview Questions": "What was the most difficult situation you've dealt with in your career"}, {"date": "23 Sept 2016", "title": "Quality Assurance Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at MTF Biologics (Edison, NJ) in Jan 2014", "Interview Descriptions": "Basic easy questions. The ones you find online straight forward. They ask for examples of all you skills so be prepared.How are your multitasking skills and give an example.Also remember this is medical device company and you are working with really human tissue that is being implanted in human.", "Interview Questions": "How are your multitasking skills and give an example"}, {"date": "6 Feb 2014", "title": "R&D Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at MTF Biologics (Edison, NJ) in Nov 2013", "Interview Descriptions": "I was contacted by the HR department to set up the interview and given the agenda for the day's interview. The schedule was from 9am - 11:30am and I met with 5 different people. I was given a tour of the facilities and plenty of freedom for breaks. Everyone was pleasant to speak to but post-interview I had very little interaction. I followed up with HR but never heard an official response about my position. I eventually determined they must have hired someone else but I was surprised that I was never notified, given how professional the rest of the process was.", "Interview Questions": "A technical question about a current problem they were having with their packaging and I was asked how I would approach the problem. "}]]