[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "My favorite", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Mar 2023", "job_title": "Program Advisor and Admin Support in Sheffield, MA", "duration": "N/A", "pros": "As both a former and current employee, to my delight, daily I have the opportunity to make a difference in the lives of families that have someone special with autism. Once the head chef, (before covid-19) it was my most favorite place to cook for people from all over the world. I have since retired from that career. It is now the most amazing experience to show parents, care givers and some others how they can use The Son-Rise Program(R). I look forward the work and they wonderful, kind people that I work with and learn from every day.", "cons": "I personally like an earlier day, like 7-3:30, but 8:30 to 5 is okay too."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Wonderful mission, great people", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "25 Jul 2022", "job_title": "Son-Rise Program Senior Teacher in Hartford, CT", "duration": "N/A", "pros": "I have been working for the Option Institute for 18 years. The work we do here has such a huge impact in the lives of families touched by autism. This week I received a voice message from a child I worked with in 2011 (11 years ago) - this boy had come to our center with his parents when he was 4 years old. Now he is about to be 16, and wanted to tell us about how he and his mom are doing... Not only he has grown and learnt so much because of what we teach here, but he said that he has \"precious memories\" from his time here with us... If your mission is to help people in life, you enjoy human connection, and a loving environment - here is a place for you! \nI absolutely love my job, the people I work with, and especially the families we serve!!!", "cons": "We are in a rural area where it's difficult to find qualified employees."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great People/Great Programs", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "28 Apr 2021", "job_title": "Human Resources Coordinator in Reno, NV", "duration": "N/A", "pros": "I worked full-time at the OI for over 20 years in management; and now, due to the effects of the pandemic on our business, am working part-time on various projects and HR. The opportunities to grow in different areas and jump into new things has been abundant since I arrived so many years ago. The many wonderful staff, past and present, are my best friends today; along with amazing friends I have met through the programs. The greatest inspiration for working at the OI is hearing [daily] about the incredible impact our programs have had on the lives of so many people from around the world. And yes, we work hard, and sometimes we work long, because our goal is to make sure we can deliver said programs flawlessly and excellently for our participants. Working at the OI is not just about a job - I have always felt that my work has had a meaningful impact on helping people in the world, including myself.", "cons": "As with most non-profit organizations, there have been times when we wish we had more resources to create and expand our reach to more people; but overall, the OI does a great job maximizing their resources to do as much as possible."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Finding service and self awareness", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Apr 2021", "job_title": "General Manager in Phoenix, AZ", "duration": "N/A", "pros": "I resently read a review written by a former employee of the Option Institute titled “the worst Place on earth to work. This is very much 180 Degrees from my experience. This opportunity Can a front one The chance to review one’s beliefs one’s thoughts one’s values on who they are. The problem is someone being a victim to someone else i.e. the employer is ludicrous to me. So all the learnings I took after my position at the option institute headed incredible impact on my life and the way that I lived my life the goals that I sought the outcomes I got and the happiness and even deeper the fulfillment I received. If you are ready to look yourself in the mirror and apply your skills and services, this is it", "cons": "There’s always room to grow for any organization or individual so cons really don’t apply here. What matters is your outlook and review on yourself or no one causes your pain except you."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Good place", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "24 May 2021", "job_title": "Guest Services in Sheffield, MA", "duration": "N/A", "pros": "Great place to work at", "cons": "It’s over cause the pandemic"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good place for the right fit", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Mar 2021", "job_title": "Human Resources Manager in Sheffield, MA", "duration": "N/A", "pros": "Friendly people and beautiful campus. Is a good place for the right \"fit\" of people.", "cons": "Pay is low. Expectations of work output are high."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Opportunity After Opportunity to Grow", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Dec 2015", "job_title": "Program Advisor and Client Support Coordinator in Sheffield, MA", "duration": "N/A", "pros": "At the Option Institute and Autism Treatment Center of America I've had the opportunity to work as both a Child Facilitator and Program Advisor.   After injuring my back, I was offered a full time position in the Program Enrollment Department as I was unable to go back into the playroom.  I became a Son-Rise Program Advisor working with Parents of children with Autism.  I also have had such great experiences working with the clients who come and attend our programs as a Client Support Coordinator.  I am currently training to become an Option Institute Program Advisor to work with our Adult Clients seeking personal growth.  I feel supported by my supervisors whenever I have a challenge and acknowledged for the excellent work that I do.  I am so thankful to the Option Institute for providing me the tools to lead a happier and more comfortable life as well as the numerous opportunities to grow within our organization.", "cons": "Communication between departments is the biggest challenge I've experienced while working here.  I've definitely seen a shift in this, and from a personal standpoint as the conduit between the Program Enrollment Department and the Marketing Department which has definitely helped in keeping the people in both departments informed.  I still see it as a challenge, however, it's a work in progress and has definitely been improving in the past 6 months.  \r\nAdditionally, I've seen many people come and go on staff in my time here, and I would love for us to have a higher employee retention rate."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "My love for the Option Institute continues to grow", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "17 Dec 2015", "job_title": "Program Advisor in Sheffield, MA", "duration": "N/A", "pros": "I have been with the Option Institute Autism Treatment Center of Americafor more than 7 years and my current job title is Senior Program Advisor. Basically I am much like a guidance counselor for people who are interested in our Adult Personal Growth Programs or parents who want help with their Autistic Children. From the first point of phone contact, we establish a lasting relationship with each and every one of our participants so they feel heard and cared for.  I absolutely love what I do and feel so grateful to work in a supportive and loving work environment where standards of excellence are high and integrity is vital. If there are challenges that come along with my job, I am encouraged to bring those challenges forward and work toward a resolution versus letting them fester.  We have regular departmental meetings where I have never felt unheard or undermined.  The founders of the organization frequently reach out to me and ask for my thoughts and opinions making it clear their first mission is to improve the services we offer our participants and our staff. They are devoted and gentle, with an eagerness to get to know every single person on staff.", "cons": "Cons- As with any organization, there can be challenges with interdepartmental communication; however this has begun to strengthen for us and I look forward to increased communication."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Unusual but Inspiring", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Jan 2014", "job_title": "Administrative in Sheffield, MA", "duration": "N/A", "pros": "I enjoyed the work I did, loved my team and left work most Friday afternoons feeling content that I was a part of an organization that is changing lives. Option and Son-Rise do amazing work. I knew nothing about the Option Process or Son-Rise Program going into my interview, and was very surprised by the atmosphere I stumbled into. I chose to apply some but not all of the Option precepts to my life, and never felt judged for how much or how little of the Process I took part in. 75% of the staff were extremely motivated and friendly, and I made some life-long friends among my colleagues. I would, and have, recommended OI to my friends.", "cons": "People have and will continue to call it a cult, and while I dispute that claim, I will say that some of the guests do worship Bears and Samahria to an unhealthy degree. As an employee in the service industry, it's just something you need to put up with. It's a small non-profit organization that is not rapidly expanding, so I saw little opportunity to scurry up the corporate ladder. That being said, I was content with the position I was at, while knowing that it wouldn't be a career. I left because I got a better offer, not because I disliked my job. If you walk into the interview thinking it's a cult or pre-judging the Option Process/Son-Rise Program, then you'll find what you're looking for."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "When you love what you do it does not seem like work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "10 Sept 2016", "job_title": "Program Manager in Sheffield, MA", "duration": "N/A", "pros": "I am so thankful that I said YES!! 4 years ago to an amazing opportunity to work here at the Option Institute and Autism Treatment Center of America. I have been given so many opportunities to grow and learn so much about myself. This has been one of the most fantastic benefits of being an employee of the Option institute! Having a job that has stretched and helped me grow into a much happier person and a more productive employee. I love the people I work with and have felt supported and appreciated. The classes have helped so many people become more loving towards themselves and therefore are more loving in their own world! I was given the opportunity to support the teachers and participants as we travel all over the world teaching about The Son-Rise Program(R). I love what I do and what is taught here. I look forward to every program and event I help coordinate. I have made friends with people I have met from all over the world!", "cons": "It did take a little while for this city girl to get used to the sounds of nature vs traffic,,, now I would not have it any other way!"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "A company with a great mission...", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "18 Sept 2020", "job_title": "Financial Controller in Sheffield, MA", "duration": "N/A", "pros": "I’ve been employed by the Option Institute since 2014. I choose to take the position with OI, over another larger for-profit company because I felt that working with a smaller non-profit would allow me the opportunity to be recognized for my work. I started at the entry level position in my department and quickly advanced my role and responsibilities. I’ve worked both directly for and with so many amazing people. People who are very knowledgably and kind. This company tries to foster a “family feeling” towards all its employees. They care about you and your wellbeing. They want you to be able to excel in your role and they help give you the tools and guidance to do so. They also understand that you have a life outside of work that can be just as demanding. The Option Institute’s acceptance and flexibility toward work/life balance is very positive. I’m valued for the work I do and my opinions matter. I’m challenged both professionally and personally, which allows me to grow in every part of my life. The work we do here is meaningful and touches so many people from around the globe. I’m glad to be a part of it and enjoy working here.", "cons": "Like most non-profits, salary is not vey completive for the level of work and amount of responsibilities you need to accomplish to effectively do your job."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "It’s a Gift to be able to work here at The Option Institute", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Oct 2012", "job_title": "Family Counselor in Sheffield, MA", "duration": "N/A", "pros": "I have been at The Option Institute for 4 years and each and every experience has been amazing for me. Not only do I work for brilliant people, but I work for an organization that is passionate about the philosophy they teach.  The Option Institute has helped 1000’s of people around the world lead happier, healthier lives, and they teach and train their staff using the same philosophy by helping them also become happier healthier people. I know, I was near suicide after my father suddenly died, and using principles taught here and supported by a wonderful staff I was able to find peace.\r\nThis organization runs like a well oiled machine. If there is a challenge, they give you spot on feedback so that you can learn your job to your highest potential; not to mention the amazing opportunities for growth and development in the job and in your personal life. The Option Institute has a standard of excellence higher than any company or organization that I have ever worked for. I feel impassioned to want to live up to that standard of excellence. It’s easy to do so with such stellar training and caring support.", "cons": "n my experience there are no cons to working here at The Option Institute."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "property/kitchen(floater)", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Aug 2017", "job_title": "Property/Kitchen(Floater) in Sheffield, MA", "duration": "N/A", "pros": "Thank you Bears for allowing me to attend your class. It was a pleasure to \r\n finally see you in action. I'm a big believer in the miracles that happen here at the Option, having witnessed the change in the participants from the moment they arrive to just the next night is simply amazing. And then there is the affect that these classes has on me personally. At HOW weekend I was given tools to implement to live a happier life. I now hold myself accountable in situations where I use to let others dictate how I felt. In Radical Authenticity I realized just how much I lied to myself and to others. At the end of the class I raised my hand\r\n and said \"I'm not going to lie for the rest of the day!\" Within 5 minutes\r\nthere I was lying again. So  I'm not  going to lie starting TODAY... I also\r\n learned a valuable lesson about going  after what I want in life instead of\r\n focusing on what \"I don't want\". \"I don't want\" is a negative thought and\r\n I've lived my whole life thinking negative thoughts with no results. As I\r\n mentioned before, HOW gave me the tools to live a happier life but the Option\r\n Institute has given me the tools to  be a better person. And that, is what I am eternally grateful for. So, thank you again Bears!", "cons": "Non to mention thus far."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Philanthropy Associate", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Feb 2018", "job_title": "Philanthropy Associate in Sheffield, MA", "duration": "N/A", "pros": "Every one that I work with is dedicated to helping children, families and individuals with autism and life challenges and I love this about my work at the Option Institute and Autism Treatment Center of America.      Never in the past have I worked for an organization, where the work that we do, changes lives all over the world.    I love reading the letters from our Son-Rise Program® moms and dads as they write about their child saying they made first words or made eye contact for the first time and more.  I love being a part of this non-profit.    I work in the Philanthropy Department and it is awesome to see human kindness and compassion towards others, every day.   All management and co-workers are a super group of people to work with, we are a team, and the environment we work in is a serene and beautiful.", "cons": "As in every job, there are deadlines and challenges in order to accomplish the mission and not enough hours in the day.    Our Philanthropy department is expanding and we are working to have additional, dedicated people join us.      Also, another thing is that the weather is somewhat unpredictable and winter travel can be interesting."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Intensive Coordinator", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Aug 2017", "job_title": "Administrative Supervisor in Sheffield, MA", "duration": "N/A", "pros": "I don't even know where to begin! Option is by far the best place I have ever worked-I've had other jobs that I liked, and the employers were good but I have never had a job where I have felt so supported, and cared for by my employer. The services that Option and the Autism Treatment Center of America offer are wonderful and I feel honored to be a part of delivering it. It's clear that the company cares about the services they offer and they know that taking care of their employees is one way to ensure they continue to be able to offer them.  I've been given the opportunity to participate in programs that people come from all over the world to attend. I've gained tools that have enabled me to become a better person in all aspects of my life, not just work work life. A great benefit Option offers is a perfect attendance bonus-something not many employers do offer.  I've also been very impressed with how this employer cares about my personal life and making sure that I am able to attend milestone events with my family.", "cons": "I can't really think of any cons-except that since we don't wear shoes in the buildings here at Option I've had to start paying attention to the condition of my socks!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Your employment has an expiration date", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 Nov 2018", "job_title": "Anonymous Employee in Sheffield, MA", "duration": "N/A", "pros": "Beautiful campus, some very nice coworkers and a great dining hall", "cons": "Managment does not listen to employees or really care what they have to say. They demand the best and if they think of an idea before you do then you are asked why you didn't do it already. Everyone seems to be in fear of losing their job every day except for a select few who are so tightly woven into the fabric of the place and so close to the CEO that they don't seem to see the issues the rest face. Every day feels like a test and as an employee I was constantly on edge. They teach a no judgment approach and claim they are giving criticism with love but an incredibly rude statement,  sometimes about a person's looks or character, even when followed by \"with sincere love and gratitude\" is still rude. Also low pay for the work and stress."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A wonderful organization", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Nov 2017", "job_title": "Art Director/Production Supervisor in Sheffield, MA", "duration": "N/A", "pros": "I have been working for the Option Institute/Autism Treatment Center of America for a little more than a year. I love my job! It is creative, challenging, and never a dull moment. I am offered support and constructive criticism, as well as, a work atmosphere where I feel more than comfortable expressing my opinions.\r\n\r\nMeetings are filled with intellectual discussions and laughter. Great atmosphere and a positive work environment. People are genuinly interested in their employees' well being, growth and success within the organization.\r\n\r\nMy co-workers are a really fun group of people and we have a mutual respect for what each other contribute to the organization. We work in an open office atmosphere, and we are continuously brainstorming and collaborating with each other.\r\n\r\nThe Kaufman‘s are the principals of the organization and are all extremely passionate about their mission. They have been very sweet to me and they appreciate my work ethic, creative talent and what I bring to the organization.\r\n\r\nThe mission of the organization is positive, and the fact that we are actually changing the lives of children, families and also individuals with personal growth programs makes you feel like your work is really life changing for people.", "cons": "Sometimes direction from the different parts of the organization can be conflicting with each other."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Place to Work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "17 Aug 2016", "job_title": "Anonymous Employee in Sheffield, MA", "duration": "N/A", "pros": "I have been working at The Option Institute for 16 years and I love it! I have had many opportunities to grow and learn new skills. Every time I drive on to the property, I smile because it is so beautiful. The people who work here are warm and friendly from the CEO to part-timers. The standards are high and the training is terrific. There is a general attitude of optimism, possibility, and enthusiasm. The mission is exciting. We serve people and help change lives. I see this all the time and I love knowing that I help to make a difference in the world. \r\n\r\nOver the years I have been involved with Public Relations, Marketing, Videography, Video Editing, Audio Editing, Counseling, Scheduling, Social Media, Teaching, and Special Projects. I have always enjoyed working closely with the CEO, the Directors and other Management who take the time to support and train thoroughly and with patience. I feel respected and encouraged to share my ideas. I am very happy working at The Option Institute and plan to stay.", "cons": "Some people may not want to be in such a rural area. It works well for me but not for everyone."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Teacher", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "17 May 2017", "job_title": "Teacher in Salisbury, CT", "duration": "N/A", "pros": "I have been working at the Option Institute for 13 years. It is a place that I love and that I feel very happy to be a part of. Some of the main things that I love about working for this company: \r\n1)\tI work with a staff that is honest, caring and truly good people who want to help others.\r\n2)\tWe work with clients from all over the world and we help them deeply change their lives for the better. Every week I witness amazing transformation - children learning to say their first words, parents forgiving themselves and learning to love each other again, parents enjoying and accepting their children….\r\n3)\tWhat I have learned here I also apply to myself and this has made me a better mother, wife, daughter and in general a better human being.\r\n4)\tI love our campus (gorgeous), the staff and our clients – what else could I ask for?\r\nI would like to add that the Option Institute is a place for people, who want to be honest, who want to make a difference in the world and who are open and excited about connecting and caring for others!\r\nIt’s a great place to work for!!!", "cons": "We are in a beautiful location, surrounded by mountains, woods, waterfall,  but sometimes it’s hard to find dedicated, open, good hearted people to fill the open positions."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Working at the Option Institute was one my greatest experiences", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "20 Jan 2014", "job_title": "Receptionist/Administrative Assistant in Sheffield, MA", "duration": "N/A", "pros": "The management staff was extremely understanding when I transitioned from full-time to part-time due to outside circumstances. They were extremely flexible in allowing for multiple schedule changes. The staff as a whole is amazing, the kindness and caring qualities of the staff members are unlike any other workplace I have been employed. Co-workers as well as management staff are always encouraging and looking for feedback, as well as give feedback to help everyone improve themselves as an employee as well as a person. These qualities in a staff team are amazing because it creates a comfortability as well as an almost family style dynamic.", "cons": "Although the staff is great and the work fulfilling, it can be difficult sometimes due to lack of inter-department communication. The communication within a department is clear, although when it comes to working with other departments, there can be lack of or mis-communication."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Wonderful, highly supportive work place", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "29 Nov 2018", "job_title": "Senior Program Advisor in Sheffield, MA", "duration": "N/A", "pros": "I have been working with the Option Institute for more than 10 years helping people all over the work.  One of the things I love most about our organization is that the founders meet with you personally to get your feedback and ask for your thoughts and opinions on what is effective and what is not. They want each one of their employees to feel heard and take personal “ownership” in the organization. This kind of model creates a deep sense of community from department to department. What distinguishes the Option Institute from most organizations, is that most of the employees have been here for 10 years – some, more than 25. I love that I am part of an organization where our work has longevity and sustainability, and where the people I work with have become my extended family, built on the foundation of many years working together, hand in hand, side by side.", "cons": "It’s difficult to find dedicated senior management in the Berkshires to fill important managerial positions."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "An Excellent Common Vision", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Oct 2016", "job_title": "Child Facilitator in Sheffield, MA", "duration": "N/A", "pros": ". I have worked in many corporate organizations and the Option Institute is truly a breath of fresh air. My supervisors actually care about me and my advancement, versus just the work i complete. I am constantly met with respect but also strong direction from my leaders. My favorite thing about working here that is so different from the other corporate jobs I've had is that EVERYONE including the CEO are on the same level. Everyone gets respect, everyone gets the chance to grow and everyone is invited to share there honest feelings and experiences. No one is \"better\" than anyone else.", "cons": "I would love if this company had more opportunities for the different departments to get together. To create an even bigger team connection. Also, with it being a non-profit organization, the staff comes here to change the world, not collect a big pay check."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "An organization always willing to help me with my own personal needs", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "6 Jun 2013", "job_title": "Son-Rise Program Advisor in Sheffield, MA", "duration": "N/A", "pros": "I came to The Option Institute to work in an administrative position, but after 6 months I realized I wanted to work in another area within the organization. Because of the management’s flexibility and openness to my wants, I was allowed the opportunity to complete a twelve month training course to become a Son-Rise Program Child Facilitator. Due to some health challenges making it difficult to continue working with children using The Son-Rise Program, I asked my employers if I could once again change roles and be trained as a Son-Rise Program Advisor. They willingly accommodated my request affording me the opportunity to continue to do what I love to do. I am blesses to have an employer who was able to help me take care of myself and keep my job!!", "cons": "As a smaller non-profit organization, we don't always have the resources we would like to help more people."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Beautiful View, Club like Management", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Nov 2018", "job_title": "Anonymous Employee in Sheffield, MA", "duration": "N/A", "pros": "The View, The Environment is welcoming (nature wise) The Clients are wonderful, as are the intensive families.", "cons": "Departments are fragmented, Do not communicate well. Management has a very \"cliquish\" atmosphere. Everyone seems to be afraid to lose their job every day. Stress is thrown down to the newest employee who is usually under trained and anxious. The open door policy is essentially a joke. Management does not want you \" in the know\" for some unknown fear of losing their spot. Certain Narcissistic behaviours are allowed to run rampant around the property, which vastly contributes to their turn over rate. Housekeeping and Property are treated like garbage.  You will be asked to drive there during a snow storm to shovel, only be to be stranded there or risk your life to go home."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "I clean all day, and it doesn't bother me what so ever.", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "18 Feb 2016", "job_title": "Guest Services in Sheffield, MA", "duration": "N/A", "pros": "It is one of the most beautiful places I've ever worked. I am a college student bouncing back and forth from home to school. They have let me come back to work for them during breaks to make money for school. The staff there is like a family, I feel like I could walk in having a bad day and walk out having a good one.", "cons": "Working on the Guest Services team meant cleaning all day, but that didn't matter at all. The work environment is amazing and my coworkers are my friends. Even though we were working hard, it had it's many moments of fun. I hope I can go back on my next break and work for them again!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "The worst place on earth", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Feb 2015", "job_title": "Volunteer in Sheffield, MA", "duration": "N/A", "pros": "Encouraging colleagues to get some confidence and self respect enough to leave and enjoy real world employment", "cons": "Management systematically breaks down your free will and optimism under the guise of helpful critique. They want only to appease the insatiable ego of Barry Kaufman often at any and every expense. To disagree (even politely and professionally) with management ensures you to endure certain mental torture and ridicule. Thoughts and ideas cannot be freely verbalized without fear of evil reprisal. This is most certainly true in my experience as well as others before me.  All of these negative reviews cannot be false, made up, plagiarized, or exaggerated. Stop trying to explain them all away and own the demented and cruel environment you have created. Please."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Simply Put: I love The Option Institute!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "12 Sept 2018", "job_title": "Project Coordinator in Sheffield, MA", "duration": "N/A", "pros": "I have been working here full time and then part time for 18 years. During that time, I have learned to deliver excellence bar none, gotten smarter and more resourceful, and learned that what might seem impossible is usually doable with a positive attitude. Plus I've gotten to work on so many interesting projects! I believe deeply in the work we do and have benefitted greatly from the Institute's personal development programs myself. In addition, the staff are more than just fellow coworkers, they have become a second family. I feel cared for and supported here, and am so grateful to be a part of this special organization.", "cons": "I don't have any cons to share."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Has been and continues to be a nurturing, full-filling, challenging and inspiring experience for the past 10 years.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "14 Jan 2014", "job_title": "Teacher in Sheffield, MA", "duration": "N/A", "pros": "What is taught (how to choose happiness and be more loving and accepting) is also modeled and implemented with staff and throughout the organization, so it feels like a family community.  It's a loving, open and honest place to work.", "cons": "Because it is a non-profit organizations, grand plans can be made and then not followed though with due to lack or resources and high staff turnover.  So the direction The Institute is taking can be changed on a regular basis and large projects take a long time."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Unique & Amazing Opportunity!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Sept 2018", "job_title": "Anonymous Employee in Lee, MA", "duration": "N/A", "pros": "Working here has been a truly unique and positive experience for me. The services they provide have such a positive and profound impact on the individuals and families they help, which makes working here very fulfilling for me. I always feel like I'm helping to make a real difference in the world everyday i come to work. The leadership is also very passionate about providing an honest and and healthy atmosphere for everyone that works here. I have never worked anywhere that provided their staff so many personal growth opportunities.", "cons": "No significant cons that i can think of. Winters in the Berkshires can be difficult if your not used to living in the area."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "AR Clerk", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Dec 2015", "job_title": "Ar Clerk in Sheffield, MA", "duration": "N/A", "pros": "It's a small organization, so you end up interacting with staff from various departments.  The small size allows interaction with the CEO, so individual job performance is recongnized by all levels of management.  Co-workers and management are very friendly.  It is a relaxed work environment in a beautiful location.  You have the option of observing the opening day of the programs that are taught here.  This is a great way to see firsthand what we do and who we're helping.", "cons": "Since it is a small organization, the departments are small, which does not leave much opportunity for career advancement."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "rewarding work in the beautiful Berkshires", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "8 Jan 2014", "job_title": "Manager in Sheffield, MA", "duration": "N/A", "pros": "my work at The Option Institute is extremely rewarding -- I see on a daily basis how our non-profit transforms and improves the lives of families with children challenged by autism as well as individuals seeking happier more fulfilling lives. I work with people I like and know that what I do makes a difference. I love that we work very internationally even though we're really in the country!", "cons": "at times the workload is very challenging which I am accustomed to from my expereince in both the for profit and non-profit world"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Child Facilitator", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "4 Jan 2016", "job_title": "Child Facilitator in Sheffield, MA", "duration": "N/A", "pros": "I have been a Child Facilitator at The Son-Rise Program for over 5 years, working with children with autism and their parents,  and I cannot say enough good things about this organization and the work that we do. The amount of dedication and love that we share with the families and children we work with is a privilege to be a part of. I believe this organization is best suited for individuals who are hard working, dedicated, and passionate about helping others. If a person is looking to \"float\" through a job, this is not the place for them. This organization is for action takers, for people who believe they have something to offer the world and are excited about it. If you are truly wanting to contribute to the world in a profound way, this is the place for you. \r\nSpecifically to my job as a Child Facilitator-- We are trained to work with children in a way that truly helps them do things they have never done before, such as, look people in they eye, speak, play in new ways, connect, have fun! By learning the techniques and attitude of the Son-Rise Program, you will learn to help children with autism in a way that no other organization does. It is very rewarding and fun work!", "cons": "There are some misconceptions out there about this organization that can be a challenge to overcome when attracting new staff or helping new people. \r\nThere have been people who have accused us of being a cult, which could not be further from the truth. (A cult tells you what to think. We, on the other hand, empower people to think for themselves in any way they choose. So basically we are the exact opposite of a cult). \r\nThere have been people who claim management expects too much from them. In my observation over the years, those are the people who most lack work ethic and passion.\r\nBasically, I feel the negative attitudes of a few people have sometimes been a barrier to others seeing what we are really all about. It's a shame that sometimes the loudest people are the least informed."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Miracles Abound! (Even for a profound cynic)", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Mar 2017", "job_title": "Program Delivery Associate in Sheffield, MA", "duration": "N/A", "pros": "Finding myself looking for a new adventure in employment, my interest was piqued by what sounded to be almost ‘too good to be true’ in the form of the Option Institute; a non-profit just down the road which, quite literally, changed people’s lives on a daily basis in actual, quantifiable measures.  I did my due diligence, read all available literature at my disposal, and then applied.  \r\n\r\nUpon being hired I found my desk at the epicenter of activity, the essential heart of the Son-Rise Program®.  To be honest, I wasn’t quite sure what to expect. Do these people really have this magical power to be able to bring children out of autism? Was it just once, with their son Raun, and then you know, the promise of a future for parents with no hope? Come on, this really can’t be happening over and over again…..and then….I watched…and I continue to watch.\r\n\r\nI watch through my window…I watch each Monday morning as the parents arrive. I watch their body language, it says it all; utter despair, desperation, despondency. I watch on Tuesdays as they start to stand a little straighter, smile a little bit. I watch on Wednesdays, parents relaxing, turning their faces towards the sun, as if to the future, basking in the light of a new world revealed. I watch on Thursdays as parents play carefree in the snow with their gift of a child, the weight of the world unburdened, the horizons of hope endless, their lives transformed. And it happens week after week after week….And it’s the most beautiful thing I have ever seen.", "cons": "For me, there are none. Unusually for a more corporate-functioning non-profit, the workplace environment is nurturing, compassionate and understanding, with a focus on development of its team members to enable personal and professional growth. Both of the founders are kind, compassionate, fair and understanding. Their love for what they do emanates throughout the campus and through team members who execute the mission. Having experienced a personal crisis, no less than 3 weeks after I started, the love and kindness that was shown to me by Samahria and all involved with the Son-Rise Program® was exceptionally unexpected, but gratefully received. The support I receive from both of my direct superiors surpasses none and inspires me to excellence in all of the work that I do daily. We should all be so fortunate to find ourselves in an organization such as this along the paths of our careers."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A Unique, Inspiring Work Community", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "25 Aug 2017", "job_title": "Son-Rise Program Instructor/Mentor-Counselor in Sheffield, MA", "duration": "N/A", "pros": "A gorgeous, mountainside property with clean air and water.  I first came to the Option Institute for 2 months as a volunteer (when Massachusetts had volunteer programs) in 1992 because I wanted to learn from the programs offered.   I went from mowing lawns to training and becoming certified both as a Son-Rise Program Instructor and Option Process Mentor-Counselor.  These positions are unique to this company - these services are not offered anywhere else in the world.  The training is phenomenal and the work inspires me every day.  A huge bonus is that I'm working with others who feel the same:  it is a joy to be in a work community where our work is fun, meaningful, exciting and profound.  My first career was in hair/makeup/tv which was artistically satisfying.  What it lacked, which is universally common, is a work environment that was supportive, respectful, and nourishing.  Over the 25 years as an employee, I love how there is no 'political' game at work, no back-stabbing, no need to disconnect from my co-workers.  I enjoy the relaxed,  lively and mission-driven environment.  I enjoy that I can be myself and this environment supports us to be the best version of that.  I have worked in many environments around the world and have never been in any work environment where each person is deeply respected and honored for their work.", "cons": "If you don't want plain straight talk as the communication style ... If you don't prioritize respecting others, both the clients from around the world as well as each staff member no matter what department ... If you don't resonate with what is taught in the educational programs to help others live happier, healthier lives ... if you don't want to be part of supporting and participating in people creating miraculous personal experiences ... this is not a place you will want to work."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "An experience worth sharing", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 May 2018", "job_title": "Executive Assistant in Sheffield, MA", "duration": "N/A", "pros": "I’ve had the opportunity of working at the Option Institute as the Executive Assistant to the CEO. I came to the Option Institute enticed by the beautiful campus nestled in the Berkshire Mountains and the idea of being able to be part of an organization that helps countless people around the world. I have been here just over a year and my experience thus far has been nothing short of incredible. I’ve had many amazing opportunities to grow not only in a professional sense but also as an individual and a parent. One of the benefits we receive from working at the Option Institute is the opportunity to observe classes of the programs offered here on campus. After observing one of the classes of Son-Rise Maximum Impact, I wrote an e-mail to Bears Kaufman (CEO/ Co-Founder ) and Samahria Kaufman (Co-Founder ). I wanted to share this e-mail here as I thought it would give some insight to opportunities and growth I’ve experienced during my time here. \r\n\r\nTo: Bears Kaufman; Samahria Kaufman  \r\nGood morning to my favorite people. I’m so excited about my experience this morning, I just wanted to take a moment to share it with you. \r\nToday I had a doctor appointment with my son for his annual check-up. In the past, these annual check-ups were a sure nightmare. My son would kick, scream, and was always noncompliant. He would fuss about the littlest thing—even trying to get him to stand on the scale would cause a major melt down. As I’ve shared with you, my son, though amazing and beautiful, was a very challenging child in certain situations, but man – during these doctor visits he really just would just go all out to the point where I felt completely embarrassed and like I had no control of the situation. \r\nWell today was quite the opposite. This was probably the longest doctor visit of our lives and it went soooo amazing. My son was sweet and curious. He asked lots of questions to the doctors and even got to listen to his own heart beat for being so well behaved. The doctors were so impressed by his behavior and maturity level. My son had such a great attitude—in lulls of the appointment when I had to fill out paper work (it was our first time doing a physical there) he was just sooo pleasant. We giggled and talked about the fish in the waiting room and Jacob showed me some of his latest dance moves—it was the best morning. \r\nWhen it came time to get the shot I was so excited at how cool and collective my son remained. “It just a little pinch, no big deal”, he said as he rolled up his sleeve. (Rewind back a year or two and this kid would start screaming just at the word shot). I held his hand as he got his shot and he laughed when it was done and shared one of his stickers with me. \r\nAll this to say, I am sooo soo thankful for all your love and guidance. I really have the most amazing relationship with Jacob now and I attribute it to all the wisdom I’ve received from both of you. My life has forever been changed and I am just so grateful. I love you both to the moon and back!", "cons": "As the Option Institute is located in the heart of the Berkshires, there are occasional staffing challenges for certain positions."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Son-Rise Program Teacher", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "20 Nov 2018", "job_title": "Anonymous Employee in Sheffield, MA", "duration": "N/A", "pros": "Working at The Option Institute has been and continues to be one of the most rewarding experiences of my life. It is a fantastic experience to be able to help families *regain hope* and learn the tools to help their children with special needs.  I have always wanted to help people feel more comfortable and happier in life, but nowhere had I found a really effective way of doing it, until I trained here.\r\nThe changes that I see *every week* in children and their families is profound and something that I have not witnessed anywhere else.  I have worked with families that came to us as their last resort,  because all the other professionals didn’t believe that their children could learn and grow any more. But as we work with those children here, we watch them grow and learn completely new skills.  Not only that, we see families come together and relax and smile again at long last.\r\nParents call us “Angels” but we are no angels, we purely believe in every human being’s ability to learn and grow when given the right chance. We give them a chance and they respond. However, it *does* feel pretty magical to be a part of this experience.\r\nI have learned here the tools to help people and have watched over and over and over again people who had been depressed, devastated, hopeless become empowered individuals who can happily face their lives and can happily help their children. It’s all I ever wanted, what else can I say…\r\nI love the Son-Rise Program and here is where I can teach it. So I love it.", "cons": "We are way too far from cities and it’s hard to find individuals who are mature and responsible professionals who want to have a career that is meaningful. We don’t have a lot of qualified people to recruit from…  In addition, as any non-for profit organization, there are some financial constraints and tight budgets. It would be amazing if we could just help even more families and more people could learn what we teach here. The Autism world would HUGELY benefit from it!"}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Working at The Option Institute", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "9 Jan 2014", "job_title": "Manager in Sheffield, MA", "duration": "N/A", "pros": "I get to work in a place that I know is making a big difference in the world.\r\nI love that my day is varied.\r\nI have many opportunities to grow and learn new things.\r\nMany opportunities to advance within the company\r\nI feel respected by my colleagues\r\nI have a good wage.\r\nI work in a beautiful environment.\r\nI have a great vacation benefit package", "cons": "Although I get a lot of vacation time which is a benefit I love, I am restricted as to when I can take it due to my job responsibilities."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Excellent company with an Excellent mission", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Nov 2015", "job_title": " in Sheffield, MA", "duration": "N/A", "pros": "Caring management team and owners who truly believe they are making the world a better place. Sometimes its hard for people to believe that someone else can really believe that big but these people really do believe it and they are actually doing it.", "cons": "Some management issues regarding communication between departments and a lack of true onboard training"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Here's to the past, the present, and the future.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Dec 2018", "job_title": "Anonymous Employee in Sheffield, MA", "duration": "N/A", "pros": "The considerable latitude allotted to me in my position allows for the expansion of the horizons of capability for new methods and mediums for helping parents, professionals and children around the world.  In my professional experience never have I continually experienced an organization so inspiring and invigorating, enabling myself to achieve the limitless possibility of my own potential.", "cons": "None.\r\nOur team is comprised of dedicated and committed talent."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Love, love, love", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Aug 2015", "job_title": "Anonymous Employee in Sheffield, MA", "duration": "N/A", "pros": "This company celebrates employee's more than anywhere that I've ever heard of. Hard work and effort is recognized and acknowledged by management, and more importantly, the CEO's. This recognition is often shared with all staff (even participants sometimes), and feels more incredible than anything.", "cons": "Not the highest paying company - but there's always room for growth (:"}], [{"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A Wonderful Place to be", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "9 Dec 2015", "job_title": "Teacher in Sheffield, MA", "duration": "N/A", "pros": "I am a senior teacher who has been on staff for  the past 11 years, I'm very proud to work for this non-profit organization.The mission to help as many families reach their children with autism is loving and powerful. The management take great care of their staff and there are some fantastic benefits and incentives.", "cons": "I would love the organization to be able to not have to rely on donations for future sustainability"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "DO NOT WORK HERE!!", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Aug 2010", "job_title": " in Sheffield, MA", "duration": "N/A", "pros": "Beautiful location.  That's basically it.", "cons": "\"Supervisors\" that supervise \"after the fact\".  Guests are treated like royalty and employees are treated like crap.  Communication between departments (and supervisors and their charges) is non-existent.  Founder is extremely narcissistic.  Double standards for employees/management abound.  If you are not \"one of them\", you are ostracized."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "90% of \"good reviews\" are requested by the CEO", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Nov 2016", "job_title": "Anonymous Employee in Sheffield, MA", "duration": "N/A", "pros": "Not many. I met a lot of wonderful people who are over-worked and under-paid.", "cons": "Barry Neil Kaufman is a verbally abusive narccist who doesn't trust any employee who isn't related to him. Most employees are expected to complete the workload of an entire department for a minuscule salary. Constant criticism of your personal character and child-like attitudes all around."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great job- great people", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "13 Feb 2017", "job_title": "Teacher/Counselor in Sheffield, MA", "duration": "N/A", "pros": "I've worked at the Option Institute for over twenty years and it is the best job I've ever had, We help children with Autism develop and become happy people and help their parents as well. The staff is excellent. A great use of my life over these last two decades.", "cons": "There are no cons to this type of work."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Over worked and underpaid", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Dec 2014", "job_title": "Child Facilitator in Sheffield, MA", "duration": "N/A", "pros": "If you  lack a purpose in life you well might find one here. A masochistic paradise.", "cons": "Few jobs if any require such devotion.  I've heard of attention to detail but options wants attention to minutia. The details of details are scrutinized with great voracity. I would not recommend this job for individuals with families or individuals that have lives of their own."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Working at the Option Institute has helped me grow so much professionally and personally.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "29 Jan 2014", "job_title": "Sales Team in Sheffield, MA", "duration": "N/A", "pros": "Caring staff, great learning environment, able to make a difference in people's lifes.", "cons": "Salary is low and does not increase w/ advancements."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "This has been the most supportive environment I have ever worked in.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "18 Jan 2014", "job_title": "Director in Sheffield, MA", "duration": "N/A", "pros": "The services provided to children with Autism and their families is truly inspiring, the staff is upbeat and supportive", "cons": "There are so many families in need there is often so much to be done"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Inspiring and supportive work community.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "28 Sept 2020", "job_title": "Program Advisor in Detroit, MI", "duration": "N/A", "pros": "caring environment & accomodating to personal challenges/requests", "cons": "Nature of non-profit organization- many task but small staff. large work loads"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Inspiring and Stimulating", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "10 Sept 2020", "job_title": "Son-Rise Program Teacher in Sheffield, MA", "duration": "N/A", "pros": "Great vision, heartfelt work, opportunities for growth. Amazing health care coverage, wonderful family atmosphere", "cons": "Location is isolated, hard to fill and keep management positions"}]]