[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company with progressive policies", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Mar 2023", "job_title": "Team Leader in High Wycombe, England", "duration": "N/A", "pros": "Strong values and clear reason for being in business. Great people across teh organisation that will always go the extra mile to help you. Focussed on customers. Wants to do the right thing.", "cons": "Because thre is a strong values set, there is an expectation that you will live up to the, and this means being self motivated, honest and transparent, and work hard for he local community. If this is not you, then I would stay clear."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Some departments better than others", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Sept 2022", "job_title": "Anonymous Employee in High Wycombe, England", "duration": "N/A", "pros": "Generous holiday allowance\r\nNice office\r\nTeam days \r\nWork closely with tenants \r\nGood pay", "cons": "Some managers micro-manage people\r\nSome teams forced back into office much sooner than others"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A great place to spend 5 days a week", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Nov 2016", "job_title": "Relationship Specialist in High Wycombe, England", "duration": "N/A", "pros": "Red Kite is great at giving their staff the opportunity to put their ideas forward and help shape the services that we deliver; this helps to promote an environment where I feel that voices are heard and where we have the chance to progress upwards within the organisation. There's a genuine effort to put tenants at the heart of everything that we do and to continuously improve. Having worked in office environments that stifle creativity and are happy to do the same things day in day out regardless of how effective they are, it is a breath of fresh air to know that if I see a way to improve a process, I have the freedom to try it. The staff as a whole work well together and there's a real sense of fun at work, which is important as I spend a lot of my time here.", "cons": "There really aren't that many that I can think of. Any concerns that I have had over the past two years of working here have all been or are being addressed in really positive ways, so I wouldn't want to put them down as cons. I'd say the only thing that I can think of is that sometimes there's so many ideas that some of them get put to one side while others are pursued; so maybe just a little more focus. That's hardly a criticism though."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great Place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "14 Jan 2019", "job_title": "Development in Loudwater, England", "duration": "N/A", "pros": "Dynamic business totally committed to its tenants \r\nStrong and visionary management team focused on improvement and fairness\r\nGreat offices with time for individuals to personally develop and grow.\r\nFriendly culture and a strong sense of purpose\r\nStaff (where possible) are allowed to work flexibly and are trusted to do a good job\r\nValue for money is very strong and as such it is a challenging culture, waste is frowned upon and not accepted\r\nStrong Board who understand the business and are friendly, polite and interact with staff\r\ninspiring and challenging place to work\r\nDon't apply to work for this great organisation if you want an easy life or are not good at what you do \r\nThis is an organisation for the motivated, non stereotypical housing  professional", "cons": "Some less capable  find it difficult to match the high standards expected \r\nPlenty of staff benefits \r\nGreat opportunists if you have the right attitude and will to deliver great service"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Genuinely a great place to work - strong values", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "10 Nov 2016", "job_title": "Anonymous Employee in High Wycombe, England", "duration": "N/A", "pros": "Red Kite is a very different place to work than your average office environment in that they try to be creative and unique but for all the right reasons. It's not just for the sake of it. I really do think that the management and leadership are genuine and provide good leadership, always trying to be innovative in a sector that is quite traditional normally. The environment is great, a professional yet casual and friendly atmosphere and people are in the main all really approachable. I have found that it's the kind of place that if you apply yourself and have a positive attitude, you will go places, but if you don't then you'll soon be found out.  They're strong on their values and it's definitely a great place to work.", "cons": "Not too many really.  I'd say like everywhere there are some areas for improvement (less emails for example) but it's the kind of place that if people bothered to speak up about things, they would genuinely do what they can about those issues. One thing I would say is a bit of a downer that can't be helped is that parking at the office isn't great, but that's fairly common most places these days I think.  Another would be that I've never worked anywhere else where I've had as much opportunity or empowerment given to me as there is at Red Kite, but sadly some staff don't take up that opportunity, which is a real shame."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "A lot needs to change", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Oct 2016", "job_title": " in High Wycombe, England", "duration": "N/A", "pros": "The offices are presentable, clean and very inviting. \r\n\r\nPeople who do the ground work are approachable, work hand and are not afraid to go an extra mile to help. \r\n\r\nAttempting a modern approach on Social Housing. \r\n\r\nGood balance of young and mature employees.", "cons": "Parking facilities leave a lot to be desired. And office favourites only will get to park on-site. \r\n\r\nWorking from the top down: \r\nThe CEO is rarely there, and his presence is so insignificant that an involved tenant was mistaken for the CEO on several occasions. In my time at Red Kite the CEO didn't demonstrate a great deal of leadership, an ability to empower staff, charisma or \"people skills\" and it felt like he was severely bossed around by the Chairman which didn't give the staff a lot of faith in our values. \r\n\r\nThere has been too much of micro-management which did nothing good for the company and it's progress.\r\n\r\nPeople who work \"hand-on\" are often treated dismissively and there is a severe lack of communication between people who run projects and people who the projects will actually affect. \r\n\r\nRecruitment is often set up with people in mind already and the fact that jobs go out to advert is just a cover up for that.  People who just turn up out of the blue seem to get very far very quickly simply because they \"know people\" \r\n\r\nAnd finally the money is being wasted on things/ projects that were not thought out well enough to even start them."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Review of Red Kite Community Housing", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Nov 2016", "job_title": "Relationship Specialist in High Wycombe, England", "duration": "N/A", "pros": "Had great values as a company and strives to ensure these are consistently being met. \r\nThe organisation involves tenants every step of the journey and continues to be focused as tenant led so that their decisions in shaping the organisation is fulfilled. \r\nRed Kite is friendly and enjoyable place to work.", "cons": "Need more parking spaces on site available to staff."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Honest feedback", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "4 Sept 2018", "job_title": "Project Manager in High Wycombe, England", "duration": "N/A", "pros": "Magnificent head office office and flexibility working remotely in various satalite offices. Very keen and good quality  front line staff. Strong financially. Property stock very heavily invested in.", "cons": "Senior management and executive teams do not lead by example on the values they set. Over the past 2 years they have tried to implement to many many system based projects at a time, this has lead to the majority of them failing and not producing the outcomes they promised. Many departments stretched due to this and its very evident that this has lead to a blame culture around the organisation. The board are very influenced by certain exec team members without the realisation of what is going on, on the ground. Very high turnover of staff approx 220 in 5 years. A lot of recruiting agencies are aware of the negative culture Red Kite now has and find it difficult to put forward proven/loyal candidates without miss-selling them. HR are arms length and do not have the qualities or experience to deal with basic issues which turn into problems. Very inconsistent on policies and Procedures which makes your daily working more difficult than it needs to be.\r\nSMT management need to work with each other and not against - this has proven to be the case leading to unnecessary pressures which eventually filter down to staff."}], []]