[[{"date": "17 Apr 2023", "title": "Clinical Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "Was during covid so was an over the phone process. Two separate general question based interview. One interview was with the manager of the department and the other was with the nurse director.", "Interview Questions": "Why do I want to work here? Future plans?"}, {"date": "16 Feb 2023", "title": "CCTV Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "Great! It was so easy and good people to help you through the process. They are professional and courteous. They truly care to find the right person for the job", "Interview Questions": "What will you bring to the hospiatl"}, {"date": "17 Jan 2023", "title": "Certified Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "The interview process was easy The interview was attended by both the team lead and supervisor of phlebotomy . A Drug test back ,A round check and a physical were done also at the hospital employee center", "Interview Questions": "Back round .skills demonstrated . Schooling . Run down of day to day"}, {"date": "3 Jan 2023", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "It was a phone call interview process. They asked a few basic questions. The interviewer wanted me to introduce myself. The call only lasted 5 minutes. It was a very simple and easy process.", "Interview Questions": "Introduce yourself to me ?"}, {"date": "13 Oct 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "It was a great process and experience! The questions consisted of previous experience, goals, and anticipated salary. It was easy to communicate with recruiters and scheduling was easy with managers.", "Interview Questions": "Name an experience in school or work when you were challenged and how to overcame that challenge."}, {"date": "3 Nov 2022", "title": "Marketing and Public Relations Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Robert Wood Johnson University Hospital in Oct 2022", "Interview Descriptions": "I submitted an application and a month later heard from a recruiter who is not even based out of the state. I asked questions about the position, none of which could really be answered by her. We scheduled a second interview with the hiring manager. It was cancelled 5 minutes before it was set to begin. I rescheduled. The morning of I messaged to confirm the interview time. ONLY THEN was I told the hiring manager needed to cancel on me again and reschedule. At this point I decided not to move forward. I am not sure if the hiring manager doesn’t care about interviewees’ time, if this recruiter was just a scam, or if they don’t even want the position filled. In any case, you don’t want to work for a company who can’t handle scheduling an interview and being disrespectful of your time.", "Interview Questions": "Recruiter interview was just discussing your resume. Never made it to the hiring manager interview because I kept being cancelled on."}, {"date": "15 Jun 2022", "title": "Registered Nurse (BSN - RN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Robert Wood Johnson University Hospital (Edison, NJ) in May 2022", "Interview Descriptions": "New graduate RN here! In-person hiring event at a restaurant. The interview was held with 3 interviewers and 3 interviewees at one time. I thought that was fun to bounce off of someone's story or just feel people out. I interviewed with a nurse educator, VP, etc. I thought that was really important. I was nervous, but being in a group interview definitely helped. Just be yourself and show them you are ready to learn!", "Interview Questions": "Why do you want to work in the ER?"}, {"date": "21 Jan 2022", "title": "Market Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "The process was very casual, with a doctor who was asking questions about my interests, passions, and desires in the medical industry (particularly in regards to research). There was no real test or pressure, as the conversation was very informal.", "Interview Questions": "Why do you want to research here?"}, {"date": "19 Jul 2022", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Dec 2021", "Interview Descriptions": "I applied online (internal apply since I was already working at the hospital) and got a call from the manager. Scheduled me to come in for an interview within the next few days.", "Interview Questions": "What are some strengths of yours?"}, {"date": "12 Nov 2021", "title": "Patient Access Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Robert Wood Johnson University Hospital in Nov 2021", "Interview Descriptions": "I applied and got an interview through a referral. It was a group interview with two other people which lasted about 30-40 minutes.  There were three people who interviewed us.", "Interview Questions": "Tell me more about yourself and why RWJ. "}], [{"date": "24 Oct 2021", "title": "Clinical Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Robert Wood Johnson University Hospital (Somerset, NJ)", "Interview Descriptions": "Pre COVID, interview was held in person. Nurse manager plus an experienced CCT were both in a conference room asking questions and answering any questions I had. Toured the unit with me also.", "Interview Questions": "Why do you want to be a CCT?"}, {"date": "12 Oct 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "I had multiple interviews with different managers and all declined me by ghosting. I didn't get any response back until I kept emailing and calling HR for some sort of update. Instead I just got a \"sorry, we had vacations and forgot\" as an answer. For months I kept going back for another interview in their system and kept getting the same type of rejections. It would be a lot nicer if they actually emailed me a rejection letter in a timely manner instead of ignoring me. They also kept posting the same listings I interviewed for which makes me a bit upset that I wasn't deemed good enough for a mannerly rejection letter despite having the qualifications asked for.", "Interview Questions": "Tell me more about yourself."}, {"date": "23 Oct 2021", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Oct 2021", "Interview Descriptions": "Amazing amazing amazing amazing amazing amazing amazing amazing amazing amazing people I would love to work with, great communication and attention skills, I love how they are always in top of my interview set up appointments as well.", "Interview Questions": "Tell me about yourself. \r\nDo you know anything about our company ?\r\nTell me your past experience. "}, {"date": "29 Nov 2021", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Robert Wood Johnson University Hospital in Oct 2021", "Interview Descriptions": "I did not have a great first impression of this well-known Hospital network.  The recruiter put me on hold for 5 minutes during 20-minute interview in addition to no follow-up even though they said they would.", "Interview Questions": "List your job responsibilities in your previous role "}, {"date": "24 Jul 2021", "title": "Clinical Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "I was first offered to join a group interview virtually, then got invited to interview with the department in person. I met with the nurse director who interviewed me solo and then was introduced to the staff on the floor. I was also given a brief tour of the department and learned more about the position.", "Interview Questions": "What has been your previous work experience? "}, {"date": "6 Jul 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "It was easy and transparent, heard back very quickly which was helpful. The whole process took about a month and I started onboarding right away. I sent resume and cover letter to the head of the department, had a meeting with someone to discuss openings, which then lead to me scheduling an interview with the person who had the internship I was most interested in.", "Interview Questions": "Why do you want to work here? "}, {"date": "25 Jun 2021", "title": "Clinical Care Technician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "Group interview with about 3 other people. We were all asked about a time we made a difference in patient care then was told more about the role. Interviewer was very nice and welcoming.", "Interview Questions": "When did you make a difference in patient care"}, {"date": "2 Feb 2022", "title": "Nurse Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Robert Wood Johnson University Hospital (Rahway, NJ) in Jun 2021", "Interview Descriptions": "Take vital signs, chart vital signs, help the nurses with cleaning patients, help patients eat, and assist in ADLs, help nurses wth turning patients, Covid unit, stock PPE such as gowns, gloves and wipe down blood pressure machines, take blood glucose tests", "Interview Questions": "Where do you see yourself in 5 years? How often have you called out of work in the past 2 years?"}, {"date": "13 May 2021", "title": "Warehouse Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "great interview process very productive session and helpful guidance. seems like a great spot and area to further yourself in your career choices in life that are ahead of you.", "Interview Questions": "where do you see youself in 5 years"}, {"date": "26 Apr 2021", "title": "Patient Care Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Robert Wood Johnson University Hospital (Newark, NJ) in Apr 2021", "Interview Descriptions": "I was interviewed with 5 students like me and one HR manager. She told us to introduce ourselves and then ask one question. After that, she went over the position and what it is. Gave us information on how this position works and etc.", "Interview Questions": "What is your safety protocol? "}], [{"date": "19 Feb 2021", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "Very quick took about 20-30 minutes. Friendly interviewer. Asks about availability and why you want to volunteer.  Additionally, they ask bout the class schedule and previous experiences.  Furthermore, after accepting the position they make you attend an orientation seminar", "Interview Questions": "Tell me a little about yourself"}, {"date": "20 Feb 2021", "title": "Graduate RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Robert Wood Johnson University Hospital (Somerset, NJ) in Feb 2021", "Interview Descriptions": "We had a group interview first online. Very basic. They told us the benefits/pay/etc. and asked 3 questions. 1. Tell me about yourself. 2. Why did you want to be a nurse? 3. 2 adjectives that describe a nurse \nIf you get through, you have to go to the hospital itself and go for a sit-down interview with the nurse manager/nurse educator, etc. This is a more personal interview, but still pretty basic. They basically asked me how was my experience working at __ etc., the most challenging situation I've been in.", "Interview Questions": "Why do you want to be a nurse?\n2 adjectives that describe nurses?\nTell me about yourself.\nI saw you worked at ___, how was it?"}, {"date": "31 Jan 2021", "title": "Clinical Care Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "I applied and it took a week for them to schedule a group interview. There were 10 other people who interviewed with me. You introduce yourself and the interviewer asks general questions. After a day, they requested for me to come to the hospital and interview with the floor manager nurse.", "Interview Questions": "Why do you want to work at RWJ? "}, {"date": "23 Dec 2020", "title": "Nurse Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "We did a Group interview via virtual platform. 7 of us . It went well. We each went around and they asked us all a few questions. It was short. It was about 30 mins.", "Interview Questions": "Why do you want to work here?"}, {"date": "15 Jan 2023", "title": "CCTV Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Robert Wood Johnson University Hospital (Edison, NJ) in Dec 2020", "Interview Descriptions": "Group interview that split off into individual ones with the floor you applied for manager. Group portion involved interacting with a board of hr reps and other candidates and was scenario based", "Interview Questions": "Why you would be a good addition"}, {"date": "24 Feb 2021", "title": "Clinical Data Analyst I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Robert Wood Johnson University Hospital (New York, NY) in Nov 2020", "Interview Descriptions": "It was a brief phone call with HR. Started with \"Why do you want to work here? \". Talked about my experiences and projects. \nIn the end, when they asked about my visa status. which I shared -international student on F1 stem opt. They directly told me they don't hire international students they prefer US citizens.", "Interview Questions": " Why do you want to work here? \nTell me about your experiences and projects. "}, {"date": "12 Aug 2020", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "Mutliple interview encounters where performed. Some group interviews were done as well. The interview can be done at the site of where you want to be hired or off site.", "Interview Questions": "How do you handle stress?"}, {"date": "9 Jun 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "I was given a tour to the hospital first and then I proceeded to meet staff members. I learned about the company culture and then we went to a room to conduct the interview. It was simple conversational questions about my interests and passions.", "Interview Questions": "What is your biggest weakness and how have you worked to improve yourself?"}, {"date": "18 May 2020", "title": "EMT-B Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Robert Wood Johnson University Hospital in Apr 2020", "Interview Descriptions": "Casual interview with some personality questions and clinical scenarios. The interviewers were friendly and the questions were straightforward. Online accommodations were made due to COVID 19. The hiring process was also very smooth, and only lasted 2 weeks from the time I applied to when I heard back.", "Interview Questions": "Why do you want to work at RWJUH?\r\nTell me a little about yourself."}, {"date": "11 Feb 2020", "title": "Patient Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "Open Interview: you come into the building between 11-3pm but I made sure I was the first one there because I really wanted the job. \r\nThey asked a few background questions while looking at your resume.", "Interview Questions": "Why did you apply for this job?"}], [{"date": "27 Feb 2021", "title": "Dietary Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Feb 2020", "Interview Descriptions": "They send you an email scheduling your interview. It’s gonna be a group interview then you go to another group interview and if they pick you you get to go orientation.", "Interview Questions": "Do you have any experience cleaning"}, {"date": "21 Mar 2022", "title": "Team Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Robert Wood Johnson University Hospital (Hamilton, NJ) in Jan 2020", "Interview Descriptions": "I was already working as a registrar and due to my experience I was chosen as a candidate. It was pretty simple. Questions were what one would expect from your typical interview.  No second interview required.", "Interview Questions": "Are you prepared to stay for the long run?"}, {"date": "5 Nov 2019", "title": "Clinical Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "I applied online and then they offered me an interview. I came in several weeks later and they directed me to a room with a nurse, a nurse manager and the assistant directer of the unit. They asked me about 10 questions and later that day I was offered the job.", "Interview Questions": "Why I wanted to work for Robert Wood Johnson. "}, {"date": "21 Nov 2020", "title": "RN Full Time Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Nov 2019", "Interview Descriptions": "Easy interview once you are able to break past HR. HR is incredibly slow and selective. Once with the director everything seems to go smoothly.   Asked the typical questions like how you deal with conflict etc.", "Interview Questions": "How do you deal with conflict in the workplace. "}, {"date": "4 Mar 2021", "title": "Clinical Care Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Robert Wood Johnson University Hospital in Oct 2019", "Interview Descriptions": "Took a while to get a call. Then took several months for the hiring process. Intense physical that impacted my hiring process/affected my start date multiple times. Ended up not taking the job.", "Interview Questions": "How do you deal with stress/difficult situations?"}, {"date": "23 Aug 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "Questions were direct and relevant which I really liked. I was interviewed by 3 people and they all asked questions for about 15 minutes. A lot of them were scenario questions. Overall a position experience.", "Interview Questions": "Different Scenario questions which they made up as we went along"}, {"date": "15 Jul 2019", "title": "Unit Clerk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "Interview process was quick and easy. It took about 15 to 20 minutes. Human resources department will get back to me by the end of the week if I am selected.", "Interview Questions": "How did you deal with an unhappy patient?"}, {"date": "7 May 2019", "title": "Patient Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Mar 2019", "Interview Descriptions": "Applied online then went in for a group interview where we answered questions about ourselves, past job experiences and our interest in the job at hand. Afterwards we were able to ask questions that we had and discuss availability with the hiring manager.", "Interview Questions": "What was one time where you went above and beyond what was expected of you."}, {"date": "1 Feb 2021", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Mar 2019", "Interview Descriptions": "very straightforward, focused on getting to know me as a person rather than skills. very friendly and more casual. it was the lead technician and one of the pharmacists interviewing me", "Interview Questions": "How will you be able to balance your time?"}, {"date": "25 Feb 2019", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "Phone call then in person with the department. The interview was easy for this department. Non-Clinical. Show motivation. Hiring process may have changed due to the merger. Overall the process wasn't bad and they were communicative.", "Interview Questions": "Experience in the healthcare field. What type of experience do you have in the project management department. What do you know about the healthcare system."}], [{"date": "14 Sept 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "Thorough Interview Process.  Panel interview consisting of Staff nurse, director, nurse educator, charge nurse.  Everyone was welcoming and very kind. I felt very comfortable during the interview. Overall good experience!", "Interview Questions": "Why do you want to work here? "}, {"date": "18 Feb 2020", "title": "Nutrition Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Sept 2018", "Interview Descriptions": "They sit you down in an office and ask you questions, pretty straight forward. They ask you your basic interview questions such as what experience do you have, what do you plan to do once you have this job, etc.", "Interview Questions": "What are you planning to do in 5 years."}, {"date": "13 Sept 2018", "title": "Compliance Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Aug 2018", "Interview Descriptions": ". I went to a total of 6 interviews and a ride along. It was an extensive process but, you will really know what it is like to work at RWJ by the end of it.", "Interview Questions": "What are your strengths?"}, {"date": "2 Sept 2020", "title": "Clinical Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Robert Wood Johnson University Hospital in Jun 2018", "Interview Descriptions": "The interview process was a two step process if you do not work for the company already. One interview with HR and then an interview with the manager of the specific floor you are applying to.", "Interview Questions": "Name a time you went above and beyond to provide care for a patient. How do you manage stress? Tell me about yourself. "}, {"date": "24 Jun 2018", "title": "Nutrition Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1+ week. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Jun 2018", "Interview Descriptions": "Very smooth and easy managers are lovely really looking forward in starting. Cons would be that my shift is variable hopefully in the future I can upgrade to a fixed shift.", "Interview Questions": "How would you handle a angry patient?"}, {"date": "17 May 2018", "title": "RN Critical Care 101 Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Robert Wood Johnson University Hospital (Somerville, NJ) in May 2018", "Interview Descriptions": "Group interview with a panel of HR. If you're called back for another interview, once again panel interview but now with the director of the floor. If your lucky enough to be called once again, the third and last interview is with  Director and floor RN", "Interview Questions": "Why you chose this profession"}, {"date": "16 Mar 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Mar 2018", "Interview Descriptions": "The interview process came in 2 parts which were both pretty easy. The 1st interview was a panel interview where there was about 7 of us applicants being interviews at the same time by 7-8 members of the team. They asked questions and we had to answer one right after the other.  The 2nd was the face 1:1 interview which is when who ever liked you called you back and interviewed you to get to know you better. They were very personable and made me feel comfortable which helped me in the long run.", "Interview Questions": "Why do you want to work at RWJ? Describe a challenge at work and how you dealt with it. How do you handle stress? Describe a time when you assembled something with only instructions."}, {"date": "6 Jun 2018", "title": "Access Management Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Robert Wood Johnson University Hospital (Somerville, NJ) in Mar 2018", "Interview Descriptions": "The process really wasn't that bad. Unfortunately the person I was supposed to be interviewing was out sick, but the two people interviewed were more than capable. They asked the usual question, and altogether it felt more like a conversation.", "Interview Questions": "What do you do on your free time?"}, {"date": "22 Mar 2019", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Feb 2018", "Interview Descriptions": "Group interview conducted the first time with a group of people. If you are selected then you would come in for another round of interview and then a phone call from HR if you are granted the position.", "Interview Questions": "What is your weaknesses?"}, {"date": "19 Mar 2018", "title": "Registered Nurse, Critical Care Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Feb 2018", "Interview Descriptions": "The interview process was 3 rounds. The first and second rounds were group interviews while the third and final round was a one on one  interview with the directors of the units. HR and the directors are lovely, which made the interview process feel like a breeze.", "Interview Questions": "Why do you want to work at RWJ?"}], [{"date": "25 Jan 2018", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Robert Wood Johnson University Hospital (Somerset, NJ) in Jan 2018", "Interview Descriptions": "Group interview with other future new hires. It was short and simple. They have 3 interviews, you must get accepted to move forward with each interview. In the first they asked 2 questions. The recruiters were very friendly and make you feel comfortable.", "Interview Questions": "Tell me what you know about RWJ and what made you want to work with us?"}, {"date": "10 Feb 2018", "title": "Staff RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Robert Wood Johnson University Hospital (Somerset, NJ) in Jan 2018", "Interview Descriptions": "applied online, it took about 3 days and  i received a call for an interview. the interview was very informal. one on one with the unit manager. the manager was very nice, she spent about 30 minute with me. she had my resume infront of her and looked at it while asking me questions.", "Interview Questions": "tell me why you want to work with us?"}, {"date": "16 Feb 2018", "title": "Biomedical Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Jan 2018", "Interview Descriptions": "I applied online and got an interview call 2 months later. My first interview took around one hour, which i did really well and was asked to come for the second round a week later. The second interview was with the director and had a technical round , which i think i didn't do well enough. Its been 3 weeks and i have not got a response about hiring.", "Interview Questions": "More about your past work experience "}, {"date": "4 Jun 2019", "title": "Clinical Care Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Jan 2018", "Interview Descriptions": "Interview was conducted in a loud office. The questions the interviewers asked lacked eye contact. Very uptight. Unprofessional. Uncomfortable. I did not feel at ease. I felt like I was being rushed. I have never sat down during an interview in a loud office space.", "Interview Questions": "*Why do you want to work here?\r\n*What skills can you bring to the table?\r\n*If I were to ask another employer about you: what would they say that’s negative and positive?"}, {"date": "26 Sept 2018", "title": "Regulatory Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Jan 2018", "Interview Descriptions": "It was a thorough interview with the department director followed by the person leaving the position. The nature of the job was explained and the culture of the group i will be working with.  The interviewer asked specific questions as to  what i currently do and situational questions to grasp what i can offer. I thought it went well especially when i was introduced to the entire group and given a tour of the department.", "Interview Questions": "What made you decide to apply for this position?"}, {"date": "28 Nov 2017", "title": "Unit Clerk Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Robert Wood Johnson University Hospital (Somerset, NJ) in Nov 2017", "Interview Descriptions": "It was a group interview, of about 8 people. Only two questions asked. Recruiter was very nice and friendly. A few of the other applicants were a little long winded when answering questions which made the interview very long. Besides that everyone was friendly, knowledgeable and courteous. The recruiter was very informative and easy going!", "Interview Questions": "Introduce yourself, your education level, and employment background. "}, {"date": "22 Sept 2017", "title": "Paramedic Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "Takes 1-2 months to get an interview, then another 2 to hear back from HR. Employee panel interview with HR guided questions. There was a written exam, but not anymore.", "Interview Questions": "Ask mostly HR personality questions not related to job."}, {"date": "30 Jun 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Robert Wood Johnson University Hospital (Long Branch, NJ) in May 2017", "Interview Descriptions": "Simple and easy. Basic questions on background and work experience. They asked why I want to work for them. HR was extremely friendly. After interview with HR, met the manager of ER administration and spoke about salary and scheduling.", "Interview Questions": "What is one of your strengths"}, {"date": "10 Aug 2020", "title": "Laboratory Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Dec 2016", "Interview Descriptions": "Interview process was smooth, phone then in person interview.. There was a delay from HR but overall a positive experience.  Interview consisted of questions about my previous research and meeting with other lab members", "Interview Questions": "Tell me about your previous research."}, {"date": "14 Jan 2018", "title": "Nutrition Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Aug 2016", "Interview Descriptions": "Easy straightforward. Asks for personal experience handling customers. Checks to see if your s team player. Basic nutritional questions. Runs a mock dialogue with a customer. When in doubt always double check with co workers and/or your boss.", "Interview Questions": "If a customer complains about the food how do you respond?"}], [{"date": "11 Feb 2016", "title": "Patient Care Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "Went through two rounds of interviews. First was in a group interview with a about 18 people at a large table. It was a little intimidating sitting with a group of people talking about yourself when everyone there is applying for same kind of job if not the same exact one. Second interview was one on one and actually more informal. I had to decline offer because I wasn't able to miss school for the required 2 weeks 9-5 training session they have only at certain times during the year.", "Interview Questions": "Tell me about yourself. Describe a situation where you went above and beyond for a patient."}, {"date": "23 Feb 2016", "title": "CCT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Feb 2016", "Interview Descriptions": "The First interview was Different they interviewed us as a group i would say about 15 of us. the interviewer would ask a question then go around one at a time answering the question. Very easy to tell if your the top prospect. Then they inform you that there is no need to reapply at this point. if they find a spot they will contact you and it may take up to several month till a opening arrives. I was called with in 7 days and was setup for a second interview. This was with the nursing manager and other support staff.", "Interview Questions": "They asked about a time i went above and beyond"}, {"date": "27 Oct 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Jan 2016", "Interview Descriptions": "Interview process was medium level difficult. I had completed the internship for school credit , and applied through Rutgers.  Overall professional, and no more than 20 minutes. Make sure to brush up on institution mission.", "Interview Questions": "Tell me something about yourself"}, {"date": "10 Aug 2017", "title": "X-ray Tech Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Aug 2015", "Interview Descriptions": "Very brief interview, had clinic at the hospital for a year before this point so they knew me pretty well. Had more of a conversation then a formal interview. But overall it was ver comfortable", "Interview Questions": "What would you do in this situation"}, {"date": "21 Jul 2015", "title": "Anonymous Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "First was group interview. We went around the room and everyone briefly gave a background about their work history. We then filled out a sheet to determine our shift and location preference which was immediately followed by second interview with manager.", "Interview Questions": "Group interview asked each of us to describe a time when we went the extra mile in our work experience."}, {"date": "9 Oct 2018", "title": "Outreach Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Jun 2015", "Interview Descriptions": "Applied online through the hospital website. Within 2 weeks, I was called for an in-person interview with the department. Very friendly interview and pretty formal but still causal enough to throw in some conversation between/after questions.", "Interview Questions": "Any experience with public health/education/community outreach?"}, {"date": "19 Aug 2015", "title": "Speech Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in May 2015", "Interview Descriptions": "I was not informed it would be a panel interview, therefore I felt unprepared on the day of. They asked basic questions and described job duties. They told me they were not interested in taking CFs at the moment but liked my resume- thus the interview. The HR process was very lengthy and although i sent various follow-up emails, I never received a response until 3 months after stating they found a better candidate to fill the position.", "Interview Questions": "Where do you see yourself as a therapist in five years?"}, {"date": "18 Mar 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Mar 2015", "Interview Descriptions": "Amazing. They listened and were very nice. I did not feel uncomfortable at all. They really wanted to get to know me. They explained the unit in detail and definitely a place I would want to work!", "Interview Questions": "Tell me about yourself"}, {"date": "11 Feb 2015", "title": "Pharmacy Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Feb 2015", "Interview Descriptions": "I applied for the job on the rwj website and was contacted a week later for an interview which took place the next day. People were extremely friendly and it seems like a great place to work. I have received a start date and look forward to my new job!", "Interview Questions": "A lot of questions of what my routine was at my previous hospital and why I want to work at rwj."}, {"date": "27 Jan 2015", "title": "Appeals Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "Process was long after 2 interviews. 2 months later on New Years eve received a no.. Wow not good . When very qualified for positions . What I didn't like no response from management after several thank you laters", "Interview Questions": "Basic questions after meeting with the whole department .. Be aware good ole boys are still judgmental "}], [{"date": "23 Dec 2014", "title": "Unit Clerk Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 6 months. I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "Went to the HR department and was met by an unprofessional young woman who told me to fill out an application. I submitted an application in the HR waiting room and waited. Got called in for an interview about a few months later. I never had a group interview which that was unexpected. The group interview seemed more like orientation than an interview. I did prefer when I met with the department head and was interviewed by them instead.", "Interview Questions": "None. It was a joke really."}, {"date": "10 Apr 2015", "title": "Clinical Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Nov 2014", "Interview Descriptions": "First I was in a group interview with individuals from different jobs. We all had chances to answer generic interview questions and to introduce ourselves. After I completed this interview, I was called the next day for a 1:1 interview on my floor. There, I met the director, charge nurse, and several CCT's. It was a little overwhelming to have 6 individuals asking me questions, but they already made me feel like I was in a safe environment.", "Interview Questions": "How I would be good for this job, how would I show that I value the patients and visitors."}, {"date": "10 Mar 2017", "title": "Physical Therapy Aide Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Robert Wood Johnson University Hospital (Hillsborough, NJ) in Oct 2014", "Interview Descriptions": "Phone interview first. Then you set an appointment to meet the site supervisor. After some time they call you to notify you that you are hired. Then you have to go to employee health and get all the required shots and tests done. After that, you have to sign up for a 2-day orientation. Once that is completed, you can start.", "Interview Questions": "Personality questions are asked. What your hobbies and things you are involved in. Experience questions are followed by that."}, {"date": "30 Jul 2014", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "I was selected for an interview as a new grad shortly after I put in an application; however I was so disappointed by the process, I will never apply for a job here again. I interviewed with the nurse recruiter on the phone, and then was called in to interview with the nurse manager and staff. I was called in for an interview weeks after graduating nursing school. I was lined up with other interviewers outside of the manager's office. When they asked me to describe myself, that's where I started. Their immediate response was \"....oh\" - as if they had not reviewed my information and did not know I was a new graduate. After a nerve-racking interview, they never called me back. I left messages with the nurse recruiter and NEVER received any further contact.", "Interview Questions": "Typical interview questions"}, {"date": "24 Oct 2014", "title": "Student Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Aug 2014", "Interview Descriptions": "Applied online, they got back to me within 6 or so weeks. The interviewer was a doctor involved in an addiction lab. She was very impersonal the interview took about 10 minutes, very quick, I felt as though she had already hired someone but decided to give me an interview anyway.", "Interview Questions": "Tell me about yourself. "}, {"date": "5 Dec 2018", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Jul 2014", "Interview Descriptions": "typical interview. Go to HR and wait to be called. 1 on 1. Very easy and took me around the hospital to show the areas. She had probably decided within a few minutes to hire me.", "Interview Questions": "what are your strengths"}, {"date": "5 Jul 2016", "title": "Clinical Care Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Jan 2014", "Interview Descriptions": "Once I applied, I heard back from HR about a week later. I was scheduled to do a group interview with at least 10 other applicants. They asked questions and we went around the room. After the group interview I did not hear back from them for 4+ months and then was offered to move onto the one on one interview with the department manager. I accepted the job offer.", "Interview Questions": "Describe an experience where you were under duress and how were you able to overcome that situation"}, {"date": "24 Sept 2013", "title": "Clinical Care Technician Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Robert Wood Johnson University Hospital", "Interview Descriptions": "The hiring and interview process was very professional, in the interview I was able to answer the questions that I wanted to know about the job that I was interesting in.", "Interview Questions": "What salary range was I looking for"}, {"date": "7 Dec 2016", "title": "Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Robert Wood Johnson University Hospital in Oct 2012", "Interview Descriptions": "Applied for the position in house because a co-worker felt that I was a good fit for the position. I had to take a personality test to complete my application. The interview iself was easy. I was already an employee for the company and was familiar with the hospital culture. I was interviewed by the head nurse and a potential peer. They asked me questions regarding multi-tasking and if I was able to handle a stressful environment.", "Interview Questions": "How did you handle a difficult situation on your current floor?"}, {"date": "4 Jun 2015", "title": "Unit Clerk Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Jul 2012", "Interview Descriptions": "This interview will happen in a group setting, and is very competitive; seeing that tons of adults/college-students seek to take ANY FORM of employment with this company in hopes of the position progressing to a higher one over time. IMPORTANT: Come to this interview dressed formally, dressy-casual at the LEAST. Be prepared to fight for recognition, and make sure to try to stand out from the group in a positive light.\r\n\r\nTHE INITIAL INTERVIEW LEADS TO 2 OTHER INTERVIEWS (AT LATER DATES), WHERE ADDITIONAL EVALUATIONS TAKE PLACE BY HIGH-RANK COMPANY EMPLOYEES.", "Interview Questions": "Why RWJ? What skills can you offer the company? Do you have any past experience in the field? What is your availability/schedule?"}], [{"date": "12 Dec 2016", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Robert Wood Johnson University Hospital (Somerville, NJ) in Jan 2012", "Interview Descriptions": "It started off as a group interview then the next portion was individual with the manager. It was pretty laid back, nothing out of the ordinary. The individual interview was to discuss what the job entailed and salary. Can get hired on the spot.", "Interview Questions": "Tell us about yourself"}, {"date": "14 Oct 2013", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Oct 2010", "Interview Descriptions": "One interview. One phone call. You meet with the Director and/or Head Nurse and they will interview you.", "Interview Questions": "Why should we hire you?"}, {"date": "8 May 2013", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Robert Wood Johnson University Hospital (New Brunswick, NJ) in Sept 2009", "Interview Descriptions": "Hiring and interview was a breeze since I was a student/intern there. They basically had me trained before I got hired.", "Interview Questions": "No difficult or unexpected question as I was already an intern there, they knew me and my work ethic. "}]]