[[{"date": "11 May 2023", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "First interview with someone from HR with basic questions to make sure I met the basic requirement for the position (ability to travel extensively in the country), what I knew about the organization, which values of the organization do I identify with, what attributes from the job posting do I have personal examples of. After the interview, I was sent an exercise to complete with an Excel spreadsheet to complete, a powerpoint presentation to make and an official memo to write. They say it should only take 3 hours, but it took me about twice as long, so figure a whole day (5-6hrs) working on it. I was given 48 hours to complete the exercise. After I sent it in, I head back almost immediately to schedule an interview with the project manager. During that interview, we discussed the role more in depth, I was asked to present myself, asked to give examples of times I worked alone and worked with large amounts of data to analyze. After the interview, I was told that the person from HR would be in contact with the next steps, which would include more interviews with the country manager and other members of the team, however I never heard back (this was over a month ago). I knew I didn't quite meet the ideal candidate profile so I wasn't too surprised that I was not offered the position, however after spending several days preparing for and having interviews along with doing an (unpaid) exercise which took pretty much all day, I would expect the organization to at least let candidates know that they have not been chosen rather than just dropping off the map.", "Interview Questions": "Tell me about your experience with data analysis."}, {"date": "30 Apr 2023", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative (New Delhi)", "Interview Descriptions": "I only had the first round of interviews, which was a basic intro, case study and guesstimate. I have not heard back for the last few weeks, and the recruiters are also not replying.", "Interview Questions": "Questions were introduction related, and guesstimate, case-study?"}, {"date": "3 Apr 2023", "title": "Statistical Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Clinton Health Access Initiative (Panamá)", "Interview Descriptions": "1st interview with someone in the US who assigned an excel assignment and the follow up interview in Panama. The 1st interview was a normal into to find who qualified and the following was job specific.", "Interview Questions": "Normal questions and then the excel assignment"}, {"date": "31 Mar 2023", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Clinton Health Access Initiative (Panamá)", "Interview Descriptions": "first a screening interview availabilty to travel across the country and explaining the benefits and salary, them tecnical test and finally a panel interview with regional and country management and regional techs", "Interview Questions": "how do you resolve a inmmediatte problem related with a breakdown with your counterparts?"}, {"date": "28 Mar 2023", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "Lengthy recruitment process but helpful in assessing organisational. There are three different stages, one with the recruiter, two with the hiring manager(s) and third with the most senior director in the team.", "Interview Questions": "Competency test Skill based interview"}, {"date": "28 Mar 2023", "title": "Independent Contractor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "Long processes since I had the second interview after a month. But the first phone call interview was easy and straight to the point then the second interview was more technical and behavioural.", "Interview Questions": "Why are you interested in this company and position?"}, {"date": "14 Mar 2023", "title": "Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "Interview process is long with multiple interview rounds. In my experience, the key important interviews were the first twos interviews -- i) case study, and ii) behavioral interview with the hiring manger. The other rounds were more introductions to the rest of the team.", "Interview Questions": "Case study on working with a minister and figuring out the possible problem"}, {"date": "16 Mar 2023", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "Six to seven rounds with one case study. They mostly do 360-degree interviews with all functions including project team members, the hiring manager, and HR. There case study is pretty straight forword.", "Interview Questions": "General strategy and project management"}, {"date": "13 Mar 2023", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "Started with a technical exercise then moved to in-person interviews with a panel, and then eventually met the senior management who were responsible for carrying out the final round of interviews", "Interview Questions": "Why should we hire you?"}, {"date": "2 Apr 2023", "title": "Senior Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Clinton Health Access Initiative (London, England) in Mar 2023", "Interview Descriptions": "Initial interview with talent aquisition. Very friendly and informative about expected salary. Skills and experience based questions. Technical execise following first interview requiring candidate to read and use information and use that to do some simple calculations and then use the resulting numbers to create a short presentation and also write a memo. Three more interviews, each very different and targeted different aspects of the role. Varying background of managers associated with the role. Skills and experience based questions and also questions about the project that the role was advertised for. Final interview presented with a business strategy to solve during the call.", "Interview Questions": "What do you think will be the biggest challenge for you in this role? How do you deal with disagreements and stakeholder management? What interests you about this role and about working with CHAI? Tell me about a time you encoutered an unexpected challenge and how you dealt with that?"}], [{"date": "12 Dec 2022", "title": "Maintenance Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "Walked through doors and was greeted very kindly. Was a very straightfoward process. Everyone was super kind. It was exceptional. Good engagement and very thorough. Kind people. Amazing. Wondeful. Objective.", "Interview Questions": "What was your biggest challenge?"}, {"date": "31 May 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Clinton Health Access Initiative (Boston, MA) in Dec 2022", "Interview Descriptions": "Can be long but eventually it gets concluded, with constant feedback along the way. The process can vary from 3-6 months based off my experience. Unfortunately for me i did not get the offer at the last stage", "Interview Questions": "Interests, why the role, vision for the next 10 years, why CHAI"}, {"date": "13 Nov 2022", "title": "Customer Success Manager (CSM) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "Great company and opportunities . Many offices globally to get varied experience over several years and great relationships through network. Interacted with many different cultures and national programs globally, offering critical insights to how various geographies tackle infectious diseases elimination", "Interview Questions": "Do you have Language skills for this country office"}, {"date": "12 Oct 2022", "title": "Health Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "There were many competency-based questions. It tested my knowledge regarding Designing Disease Control Programmes and also my experience of working on them. Brief questions were asked on stakeholder management and advocacy.", "Interview Questions": "Can you describe a time when you had to take a leadership role?"}, {"date": "21 Feb 2023", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Clinton Health Access Initiative in Oct 2022", "Interview Descriptions": "However, the Clinton Health Initiative is a global health organization, and typical interview processes often involve screening resumes, conducting phone or video interviews, and in-person interviews with multiple rounds of interviews for various positions.", "Interview Questions": "What motivates you CHAI care alot about values"}, {"date": "23 Sept 2022", "title": "Technical Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "Consisted of multiple rounds with various different people, starting with a conversation with a recruiter. There was part case, part personality interview and ample room for questions from my end. Ended up speaking to the hiring manager as well as a peer.", "Interview Questions": "How would you solve a given issue or problem and why?"}, {"date": "22 Aug 2022", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "An in person interview took place after an initial discussion over the phone. Overall it seemed like a great working environment. The interviewing team displayed a courteous and professional outlook.", "Interview Questions": "Knowledge of  the regional language. "}, {"date": "13 Jul 2022", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "The talent team reached out for an intial interview. The individual said they would get information from the hiring team before proceeding with the technical assessment. I didn't hear back for over a month. When they finally reached out they said they went with someone else.", "Interview Questions": "Tell us about your interest in this position\r\n"}, {"date": "2 Jul 2022", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "The entire interview and hiring process took 4-5 weeks. There were 4 rounds of interviews in total (HR, Program Manager/Country Director, Technical Supervisor, Global/Regional Directors) plus a technical exercise after the initial HR interview. The technical exercise is supposed to take no more than 3 hours, but takes 6-7 to do it well. The exercise is fairly straightforward, involving cleaning an excel spreadsheet, writing a 1-page memo, and putting the findings in a PowerPoint presentation.", "Interview Questions": "The first two interviews were a mix of behavioral and experience questions, while the final rounds focused more on your ability to apply experience and technical knowledge to relevant hypothetical scenarios. All interviewers were kind and professional."}, {"date": "11 Apr 2023", "title": "Engagement Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative (New Delhi) in Jul 2022", "Interview Descriptions": "Multiple rounds, case study on epidemiology that needs to be worked out and submitted within 24 hrs. Need to have overall knowledge of programs for interviews alongside understanding of your profile", "Interview Questions": "How do you think you will contribute to the the success of the program?"}], [{"date": "28 Jun 2022", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Clinton Health Access Initiative in Jun 2022", "Interview Descriptions": "They gave an overview of the process in the beginning and what to expect and the timelines. It was brief and followed by questions after question. Lastly, they gave me an opportunity to ask questions.", "Interview Questions": "What do you know about CHAI?"}, {"date": "29 Mar 2022", "title": "Senior Program Operations Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "Very quick turnaround if you can get your foot in the door and HR is quick to follow-up following your initial interview. Then intereviwed with hiring manager followed by director of the program", "Interview Questions": "What CHAI value do you resonate with"}, {"date": "22 Mar 2022", "title": "Regional Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "2 months process: 4 interviews + 1 exercise. Intense interviews: they make you feel like you have to provide the right answers. Many questions addressed in a checklist format (and you have to tick each box). Not so much time to think and structure the answers as the interviews are very fast paced. It is not a discussion but an interrogation even thought the interviewers are nice. The coordination by the HR representative is good and efficient and the updates are provided on timely manners.", "Interview Questions": "What do you know about CHAI\nMotivation\nScenario based questions (many)\n"}, {"date": "12 Feb 2022", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative (Ondal) in Feb 2022", "Interview Descriptions": "Three rounds of interview - one case study. one casual interview for screening conducted by HR team in Harare, Zimbabwe. POst interview they ask you when they can send you. a case study to be compelted in three hours,", "Interview Questions": "How do you develop relations with external stakeholders? Why do you want to wokr with CHAI? What do you know about this organisation? "}, {"date": "21 Mar 2022", "title": "Senior Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Clinton Health Access Initiative (Abuja, Federal Capital Territory) in Feb 2022", "Interview Descriptions": "Systematic On-line Interview  with  Validity Checks on every responses to the respective  questions to ensure standard that stands the test of time in the quest to strengthening the Health system of the specific  mentioned cluster", "Interview Questions": "Apart from the bio-data information asked  the interview focused on the   good practices & Weakness of my current employer and how to make the system better in the nearest future."}, {"date": "9 Jan 2022", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "competency-based interview technique with many questions asking based on your past experience. You will be asked to briefly provide a context, then focus the majority of the time on your actions and then explain how the situation resulted.", "Interview Questions": "Describe a time you influenced without Authority"}, {"date": "28 Oct 2022", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 months. I interviewed at Clinton Health Access Initiative (New York, NY) in Jan 2022", "Interview Descriptions": "Long process with 5 interviews. First an HR screening followed by interviews with the hiring manager, their manager and the head of the unit. Finally another conversation with the HR manager.", "Interview Questions": "How are you value aligned with the organisation value?"}, {"date": "8 Feb 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Clinton Health Access Initiative (Lusaka, Lusaka) in Sept 2021", "Interview Descriptions": "I had a general interview first then a very exciting assessment. I then had about three interviews with different team members from the office I was applying to - to the global team.", "Interview Questions": "How did I handle a challenging situation "}, {"date": "23 Jan 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative (Gurgaon, Haryana) in Aug 2021", "Interview Descriptions": "Started with a case study, then another case study, then guesstimate, then a frank call(they call it) in which they ask you what are you planning to do next, basis the aspirations they reject at this stage.", "Interview Questions": "Q: Estimate the number of petrol pumps in Delhi"}, {"date": "29 Jul 2021", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Clinton Health Access Initiative (Abuja, Federal Capital Territory) in Jul 2021", "Interview Descriptions": "I was contacted a month after submitting my cv online. I was interviewed by an international talent acquisition team member. I was later sent a case study to solve in 3hrs using excel, word and ppt a day later. Three weeks later I received an invitation to interview with the Director, Program Manager and team lead. Two weeks later I was sent an offer and asked when I would like to resume", "Interview Questions": "Why public health?\nWould I share company resources without permission?\nWhat I know about the particular program\nA CHAI value that resonates with me with a personal experience\nAn example of a time I solved a problem"}], [{"date": "17 Oct 2022", "title": "Program Volunteer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Clinton Health Access Initiative (Lagos) in Jul 2021", "Interview Descriptions": "Straightforward process , applied and received interview invite approximately one month after. HR interview wasn't terrible, then technical exercise and then team interview. Didn't appreciate the team interview - unnecessarily felt like a thesis defense.", "Interview Questions": "Vision, and mission of CHAI"}, {"date": "2 Jul 2021", "title": "Case Management Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Clinton Health Access Initiative in Jun 2021", "Interview Descriptions": "The interview process was very straightforward. I applied online and received an initial interview request a couple of weeks later by email. The initial interview was by phone and was very direct. The interviewer and I exchanged pleasantries and then they immediately began the questioning. After the 45 min interview they sent a skills assessment which evaluates your Microsoft Excel, Word, and PowerPoint skills, They say it takes about three hours to complete, but this could not be farther from the truth. Expect to take longer as it is an incredibly detailed assessment. After sending in the skills assessment I was told I would hear from them soon. After about two weeks I received an email saying I had not progressed to the next round.", "Interview Questions": "What do you know about CHAI? "}, {"date": "19 Aug 2021", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Clinton Health Access Initiative (Harare) in Jun 2021", "Interview Descriptions": "2 interviews, 1st chai fitness with case study, 2nd technical with the hiring team. 1st was with HR person, 2nd was with hiring manager, technical advisor and hr person. process was over 2 weeks", "Interview Questions": "how do your qualifications and experience fit with the role?\r\nwhich chai values speak to you the most\r\nwhat do you know about chai"}, {"date": "6 Apr 2021", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "Apply online, first phone interview with globa hiring HR manager, online assessment with excel, powerpoint and word, two more online interviews with managers and regional directors for the program focus.", "Interview Questions": "Why CHAI? Why international development? "}, {"date": "17 Jun 2021", "title": "Manager, New Vaccine Introductions & Immunization Service Delivery Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Clinton Health Access Initiative in Apr 2021", "Interview Descriptions": "Got an interview request from the talent acquisition department, the interview process lasted about an hour via zoom. after that I was sent a case study to answer and submit within 48 hours, and then they got back to me the following week with a rejection", "Interview Questions": "Tell me about yourself and your previous experience"}, {"date": "28 May 2021", "title": "Epidemiologist/Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative in Mar 2021", "Interview Descriptions": "I interviewed for an epidemiologist research position with an in-country team. From application to end of process, it took 5 weeks.\r\n\r\nOne week after application I heard from HR to schedule a phone interview. I was then scheduled to complete a technical exercise in 48 hours. It took me 5-7 hours, but I'm pretty detail oriented.\r\n\r\nThe next week, I was contacted for a Skype interview with the in-country program manager. It took about an hour, and one question was asked in the host country language. \r\n\r\nLater the same week I was scheduled for an interview with the regional technical advisor, also via Skype, which took another hour. Interview was all in English.\r\n\r\nIf I moved on, I would have had one final interview with the in-country manager. However, I heard back two weeks later that they were not advancing my candidacy. When asked, they also told me that it was against policy to disclose reasoning or feedback. \r\n\r\nOverall I was satisfied with the professionalism of the correspondence.", "Interview Questions": "HR - basic personality and job requirement questions\r\n\r\nProgram Manager - I was asked more specific questions which spoke to fit on the team and ability to manage projects/interact with partners, etc.\r\n\r\nTechnical Advisor - Questions revolved around technical experience and expertise, but were more applied than specific."}, {"date": "13 Apr 2021", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative in Mar 2021", "Interview Descriptions": "Submitted application on internal job portal, recruiter reached out, first round interview with them, second round interview with program manager, never heard back from them again. Gave me homework which takes 8 hours or more to complete (they say 4) but it takes longer and its unpaid.", "Interview Questions": "Behavioral questions\nCase work on how to position new drug in a developing country"}, {"date": "23 Feb 2021", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Clinton Health Access Initiative (Hartford, CT) in Feb 2021", "Interview Descriptions": "I was contacted via email by a member of the talent acquisition team at CHAI. It was followed up with a 30 minute preliminary phone call interview with the staff member.  I was told more on the background of the organization from a macro perspective.", "Interview Questions": "What do you know about CHAI/what they do? Why are you interested in the organization? What specific skills do you bring to the position? How would you characterize yourself as a worker, in professional settings? What do you look for in a work environment and what do you prefer not to be in a work environment?"}, {"date": "11 Feb 2021", "title": "Senior Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative in Feb 2021", "Interview Descriptions": "First a 40-50min Skype interview talking about role fit, salary expectations, and availability to commence work.\r\n\r\nThen a technical assessment in thé form of a case study.\r\n\r\nOnce successful on both, interviews are staged with the project team, immediate supervisor, and country/regional director.", "Interview Questions": "Can you describe a situation where you had to solve a problem?"}, {"date": "29 Apr 2021", "title": "Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Clinton Health Access Initiative (Boston, MA) in Feb 2021", "Interview Descriptions": "Met with HR. Then did a 3 hour exercise which included data analysis using excel, writing a 1 page communication letter and preparing a PowerPoint presentation. I then met with a technical advisor and program manager who asked questions based on previous experience. My last meeting was with the security team for a country safety debrief.", "Interview Questions": "Share lessons learnt from a previous project that you managed?"}], [{"date": "30 Sept 2021", "title": "Field Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Clinton Health Access Initiative (Nairobi) in Feb 2021", "Interview Descriptions": "It was conducted online and in a very professional manner. The panel consisted of two ladies both of who were kind and respectful. They gave a clear overview of the expectations from the position and then proceeded to the questions for the interview. The questions were not very technical, just general questions.", "Interview Questions": "Q: What are your core strengths?"}, {"date": "24 Feb 2021", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative (Freetown) in Jan 2021", "Interview Descriptions": "Interviewed for the role in January 2021. 4 stage process. First one with HR/international recruiter. Recruiter was nice and warm,explained the whole process including salary and other benefits.  2nd step was a written test ,3 hrs long (case scenario and used to access your excel,word and PowerPoint skills). 3rd stage was with one of the line managers of the role and interview was more technical/ program specific.", "Interview Questions": "\nDifficult Stakeholder management case scenario "}, {"date": "30 Nov 2020", "title": "Country Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative (New York, NY)", "Interview Descriptions": "The interview process was quite long, and took 4 months, However, I enjoyed how each interviewer made me grow even more interested in the organization. Especially, the HR person overseeing the process was very communicative troughout the interview process.", "Interview Questions": "What are your reflections on CHAI's values?"}, {"date": "22 Dec 2020", "title": "Vaccine Distribution Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative in Nov 2020", "Interview Descriptions": "Had a call with a HR person. 30 mins call. General question. Interesting questions were about the location. I tried to relocated and the HR asked me what do I know about the country and region. HR also was upfront about the salary and disclosed it during the interview without me asking.", "Interview Questions": "What do you know about the country (that you’ll work in for the position)\r\nIs this salary meet your expectation?\r\nWhy applied for CHAI?\r\nWhat do you expect in working for a nonprofit?"}, {"date": "11 Oct 2020", "title": "Program Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative (New Delhi) in Oct 2020", "Interview Descriptions": "Two rounds: one HR and other technical. Know your previous work and be confident. Friendly interviewers. Technical exercise for 3 hours. Should be done before the interview. Will be easy if you have prior idea. But all will be well.", "Interview Questions": "Previous experience, one technical exercise"}, {"date": "13 Dec 2020", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative (Harare) in Oct 2020", "Interview Descriptions": "it was ok, first was an oral interview 30minutes long,with the human resources then after that i was given a case study 3hrs long but to be submitted after 48hours.They called after a week and i was interviewed by 3 people, interview was 1 hour long and they said they would communicate in a couple of weeks and im still waiting.", "Interview Questions": "How do you handle conflict among stakeholders"}, {"date": "20 Jan 2021", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative (Nairobi) in Oct 2020", "Interview Descriptions": "Was contacted on a Tuesday morning interview was scheduled for Thursday.  \nPhone interview lasted 20 minutes. \nWas asked to complete a  technical exercise and send in 48 hours which I did. \nDid not hear back from them. Sent a follow up email which they responded a week later that the position had been filled. \nChecked on LinkedIn turns out they ended up promoting internally then advertising for that position instead.", "Interview Questions": "1. Why CHAI? \n2. Tell me about yourself "}, {"date": "2 Jul 2022", "title": "Senior Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Clinton Health Access Initiative (Addis Ababa) in Oct 2020", "Interview Descriptions": "The interview process was technical and a bit rigid. The interviewers were more focused on the technical component of the work and were less focused on assessing the candidate's fit for the team.", "Interview Questions": "How do you expect to handle government engagement should you get an offer?"}, {"date": "18 Sept 2020", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "Case study + a general HR conversation. Considering the time and effort put into the process, would've appreciated a call about the results. Never heard back. Does not paint a good picture about how the organization works and treats its employees.", "Interview Questions": "Why CHAI, why this role, why are you leaving your firm, etc"}, {"date": "2 Sept 2020", "title": "Senior Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "not hard, the process is quite straight forward, the teams are quite interested in learning about you and how you can fit into the institution - they are very, very flexible, offering a relaxed atmosphere for interviewing, mine was online", "Interview Questions": "easy,  somewhat nuanced but they can come easy to understand once you do your home work"}], [{"date": "25 Jan 2022", "title": "Malaria Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative (Harare) in Sept 2020", "Interview Descriptions": "The interview process was ok. The hunan resources manager interviews you on your 1st interview which lasts about 30-45 minutes. Then if u succeed a team of 4 people will interview you after which you will continue to the 3rd interview upon being successful during interview 2.", "Interview Questions": "Tell us about yourself and what you know about the organization "}, {"date": "2 Feb 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Clinton Health Access Initiative (London, England) in Sept 2020", "Interview Descriptions": "I had an initial phone screen with the recruiter, followed by a written assignment, another screening call with a Senior Associate Team Member, and then a 1:1 interview with a Manager on the team", "Interview Questions": "Walk me through your resume"}, {"date": "5 Aug 2020", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Clinton Health Access Initiative (New York, NY) in Aug 2020", "Interview Descriptions": "3-hour case study followed by 3 round interviews. I was not sure whether the second or third round was more difficult because the interviewer was very easy going. Received the offer at last.", "Interview Questions": "Describe a situation when you were misunderstood by other people. "}, {"date": "5 Aug 2020", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "First step is personal interview\nSecond step will be skill assessment test\nIt will take about 3 hour for skill assessment test.\nIt include 2 parts .It is easy to answer with Microsoft Excel and PowerPoint software.", "Interview Questions": "About experience relating to job."}, {"date": "30 Jul 2020", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "About 3 weeks after applying, I was contacted by their talent acquisition team for a phone screening. They were very transparent about what they were looking for and willing to pay for the position. Questions were pretty general, why CHAI, why this position, etc with a couple behavioral questions mixed in. A day or two later I was asked to complete a technical exercise involving a powerpoint, brief, and excel spreadsheet. About a week after submitting, the recruiter reached out and said they were going to go with other candidates. Overall, I was happy by how communicative the talent acquisition team was!", "Interview Questions": "How do you break down cross-cultural barriers?"}, {"date": "9 Sept 2020", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative (New York, NY) in Jul 2020", "Interview Descriptions": "June 2020 - I applied online. \n\nJuly 2020 (early) - I was contacted by a CHAI talent acquisition team member to schedule a Skype phone interview. Upon passing the phone interview, I received a case study to complete in 3 hours or less and was given 72 hours to submit via email.\n\nJuly 2020 (mid) - I advanced to the next stage for a one-sided video panel interview with three hiring managers. Was told if I passed this stage, I would advance to the last step which is an interview with the director.\n\nAugust 2020 (early) - I learned that I did not advance to the last stage. \n\n\nAs my first interview after completing my graduate program, I was at first nervous but overall it was a positive interview experience. After the hiring team completed their interviewing, one of the managers gave me really great positive feedback regarding how well interviewed and that said she recommended me for other future CHAI positions.\n\nThe key things that helped me prepare for this interview were:\n- reviewing interview questions shared on Glasssdoor and preparation my answers. \n- BEING MYSELF\n- asked questions at the end \n\nP.S. I heard from a friend of a friend that they internally hired someone from a different CHAI office for that position.", "Interview Questions": "Mix of HR and Group Panel\n\n1. Why CHAI?\n\n2. What is the most challenging thing you ever experienced while working in your field?\n\n3. Describe a time you had to take the initiative in the work setting. \n\n4. What kind of challenges, if any, have you experienced  when working with people from different cultural backgrounds? And how did you overcome those challenges?\n\n5. If you had a lot of work to do, how would you prioritize?"}, {"date": "22 Jul 2020", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "It was quite good. Pretty straight to the point. It was facilitated by one of the HR department. She started with the usual questions around my educational background, professional background, and then moved to competency-based questions.", "Interview Questions": "Why do you want to work for CHAI?"}, {"date": "13 Dec 2020", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative in Jul 2020", "Interview Descriptions": "Had an interview with HR, then a technical test that I was asked to spend 7 hours over 2 days doing, then an interview with two of the hiring managers.", "Interview Questions": "What do you know about CHAI?\n"}, {"date": "25 Jul 2020", "title": "Senior Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Clinton Health Access Initiative in Jun 2020", "Interview Descriptions": "Since there was an urgent requirement in the team, the process was pretty expedited. All senior members of the team interviewed me as well as the Global HR followed by interviews with the Associate Director and the India MD. I also had to do a Written case round which involved providing solutions for a Public Health case on Word, Excel and Powerpoint. Everyone was super nice and supportive, overall a good learning experience.", "Interview Questions": "Round 1- Interview with the Program Manager of the Global team\r\nThis was conversational and focused more on explaining the team and the role to me and answering my queries. There were questions revolving around my past work experience, my motivation behind applying, problem-solving approach and my ability to deal with multiple stakeholders especially government stakeholders. There were some common sense based public health questions as well, specific to the role I was applying for."}, {"date": "10 Jun 2020", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "First you interview with HR. You will be asked about the 'values' of the company. If successful, you will be given a test to complete, involving writing a  memo and run an analysis and prepare a presentation on a case study. Finally, you will have an interview with your future boss based in the contry you applied for.", "Interview Questions": "Who is the person that you consider most highly and why?"}], [{"date": "18 Apr 2020", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Clinton Health Access Initiative (New York, NY)", "Interview Descriptions": "HR interview was simple. The interview with the assoc. Director was for an hour. 45 min professional experience question and 15 interviewee questions.  I think the interviewer had already predetermined  his decision which was negative.  Got a response after 34 weeks from second interview and after 4 emails to HR for the outcome  .", "Interview Questions": "normal HR questions . pretty straight forward"}, {"date": "18 Jun 2020", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Clinton Health Access Initiative in Mar 2020", "Interview Descriptions": "About a month after applying, I was contacted for a phone screening which was conducted by someone on the recruitment team. It took about a half hour and consisted of standard questions about my interest in the role, likes/dislikes in an employer, communication skills, etc. A week later I was contacted again to schedule an interview with the hiring manager. This interview was focused on the role and my relevant experience- if you are well informed on the scope of the position none of the questions would be surprising. This took about an hour. About five weeks later, after following up several times with few insights being shared about the status of my candidacy, I was notified that I was not selected. If I had not followed up, it seemed like the recruiter had no intention of providing me with an update on the status of the recruit, neither timeline/next steps nor my candidacy.", "Interview Questions": "Why are you interested in this position?"}, {"date": "17 Feb 2021", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative in Mar 2020", "Interview Descriptions": "Basic screening followed by a case study. Then a written for skill assessment and then the team and organizational fit.  The process was lengthy, people were friendly. Knowing an outcome of a round can take some time.", "Interview Questions": "Basic fit questions and organisational fit"}, {"date": "17 Jul 2021", "title": "M&E Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Clinton Health Access Initiative in Feb 2020", "Interview Descriptions": "The first round of this interview was with HR. HR is friendly and asked some basic interview questions. The second round of interview was with M&E team in the country that I applied for. They asked me a lot of behavior questions and required me to answer those questions with practical examples. This interview lasted an hour.", "Interview Questions": "HR\n1. Introduce yourself?\n2.  Why do you want to apply for this job?\n3.  and other basic interview questions\n\nM&E team\n- Most of interview questions are behavior questions"}, {"date": "13 Aug 2021", "title": "Vaccines Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Clinton Health Access Initiative (Boston, MA) in Feb 2020", "Interview Descriptions": "Applied online. Contacted by HR. Interview with associate for 40 minutes. A week later had a phone interview with the vaccine team's director. Few days after that was offered the position. I ultimately declined.", "Interview Questions": "What was my previous experience? Asked to analyze a case related to vaccine supply chains."}, {"date": "12 Feb 2020", "title": "Associate Supply Chain Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative (Abuja, Federal Capital Territory) in Jan 2020", "Interview Descriptions": "First stage was a phone conversation with someone from the talent acquisition team, Next was a case assignment and Next now is another phone interview with a technical staff from the hiring team", "Interview Questions": "Why do you want to work with CHAI, Where do you see yourself in 5 years"}, {"date": "1 Apr 2021", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Clinton Health Access Initiative (Abuja, Federal Capital Territory) in Jan 2020", "Interview Descriptions": "There was initial CHAI fit test, conducted over the phone. The questions here are around introductions, your values, your strengths, weaknesses, tolerance of other cultures, adaptability and problem solving ability.\n\nThe next phase is an aptitude test which is in 3 parts: a PowerPoint presentation, an Excel analysis and a memo development on Word.\n\nThe final step is a physical interview with the Director and relevant people to the program you're being interviewed for.", "Interview Questions": "Why did you choose to pivot to public health?"}, {"date": "31 Mar 2023", "title": "Senior Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative (Harare) in Jan 2020", "Interview Descriptions": "The interview is comprised of 4 stages, with the first stage being a screening call to establish fit. This is followed by a a written technical case and if successful you will then proceed to be interviewed by the hiring manager in a panel interview with at least 3 members. Finally if successful you will then interview with the Country Director.", "Interview Questions": "The screening call focuses on how you fit within the CHAI values and how got to know about the organization and why interested in joining."}, {"date": "28 Feb 2020", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Clinton Health Access Initiative (Washington, DC) in Dec 2019", "Interview Descriptions": "The HR person was very helpful and communicative throughout the process. I had a phone screen, then I had to do a technical exercise on Excel, then I was contacted for a panel Skype interview. It was overall a great experience.", "Interview Questions": "What sort of team do you want to work with?"}, {"date": "10 Dec 2021", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative in Dec 2019", "Interview Descriptions": "1. HR Interview (with one HR recruiter)\n2. Technical Test (excel and Power Point) takes 3 hours\n3. Country Team Interview (panel technique)\nInterview process pretty fluid don't take more than 1 month if the position are required with urgency", "Interview Questions": "why do you prefer work with us?"}], [{"date": "8 Jan 2020", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Clinton Health Access Initiative in Dec 2019", "Interview Descriptions": "Initial interview is with staff at HQ to determine if you are a good fit with CHAI. This person will also coordinate the assessment, which is a 3-hour assignment that uses Excel, Word, and PowerPoint. A week after submitting the assessment I was asked to interview with country team staff, with three interviews over three days. The final interview was with the country director.\r\n\r\nBenefits info: health insurance with no employee contribution begins immediately, as does a 401(k) with a 6% match.", "Interview Questions": "Why are you interested in working at CHAI/ this position/ in this country?"}, {"date": "22 Nov 2019", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "HR never confirmed with me that I have an interview with the hiring manager and thus I was not prepared. This was a waste of my time and the time of the Hiring Manager. HR must be pro-active with confirming the times and dates. Obviously, the hiring manager was not pleased with the interview process and I did say I was not ready because HR never confirmed the time and date with me. I was embarrassed, to be honest.\r\nI would expect more from such organization like CHAI. I do not think I will be interested in working here. PLEASE always send a confirmation follow-up email!!!!", "Interview Questions": "regular interview questions"}, {"date": "16 Oct 2022", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Clinton Health Access Initiative (Johannesburg) in Nov 2019", "Interview Descriptions": "Telephonic interview first with only one person speaking in the background followed by application tasks for Microsoft word, PowerPoint and excel based on a fictional scenario. You’re required to do various calculations on excel. This is how they test your competency", "Interview Questions": "Could you Tell us about yourself"}, {"date": "6 Nov 2019", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Clinton Health Access Initiative (Boston, MA) in Oct 2019", "Interview Descriptions": "Super positive and timely. Applied with an employee referral and got an HR interview screening request about a week or so later. It lasted about 40 minutes. The HR rep was really knowledgeable and made me feel super comfortable. The HR screening was on a Friday so then I was given until Monday morning to complete a 3 hour assessment where I had to look at a 5-page case study and synthesize information and summarize into a 5-slide PPT and a one-page email memo. Then about a week later I was contacted for a next interview with the hiring manager who would be my supervisor if given the position. This was about an hour long interview and involved some pretty involved questions relating to the job description and past experiences as well as a simulation that test my ability to ask and anticipate the right questions to ask during a would-be strategizing conference call. I was told they wanted to make an offer by Wednesday the following week but then I didn't hear for about 2 weeks. I was not offered the position but the hiring manager sent me a really awesome e-mail describing why they went with a different candidate and that I was a really strong next choice for them.", "Interview Questions": "Tell me a work scenario where you had to use Excel, how you used it and what the outcome was"}, {"date": "10 Feb 2021", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Clinton Health Access Initiative (Abuja, Federal Capital Territory) in Oct 2019", "Interview Descriptions": "Had just one interview with the senior management. They took turns in asking questions in their various programs as regards my experience. How i ventured into public health from the social Sciences field and if i had intentions of pursuing a career in the public health sector.", "Interview Questions": "Previous work experience and why I’d like to work there"}, {"date": "10 Dec 2019", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Clinton Health Access Initiative in Oct 2019", "Interview Descriptions": "Interview process was professional and efficient. The first interview was an hour long phone call with a recruiter and I was asked a mixture of behavioral and task related questions. Shortly after that I received a case report to complete in 48 hours. After I submitted it, I did not hear from them for 2 weeks. And then I received the news they went with someone with more experience.", "Interview Questions": "Why do you want to work for CHAI?"}, {"date": "5 Sept 2019", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "I completed three interviews:\r\n1) Initial interview with an HR rep about your background and interest in the position\r\n2) Interview with a program manager \r\n3) Interview with a senior manager, with many similar questions to the second interview", "Interview Questions": "Tell me about a time you addressed a complex problem."}, {"date": "12 Aug 2021", "title": "Program Manager, Health Financing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Clinton Health Access Initiative (Kigali, Kigali) in Sept 2019", "Interview Descriptions": "Long process, several stages, the first being with HR about your fit with the organization, then it gets technical. An excel test was shared to be completed within  specified time and then phone interview with the Director of programs", "Interview Questions": "More behavioural and competency type questions"}, {"date": "13 Dec 2021", "title": "Technical Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Clinton Health Access Initiative (New York, NY) in Aug 2019", "Interview Descriptions": "Rigorous multiple part interview process conducted online via skype. After the actual online interview, was given a case scenario to interpret and analyse data in a Word and Excel document. Then short listed", "Interview Questions": "How do I fit into this position"}, {"date": "15 Jun 2019", "title": "EMTCT and Pediatric HIV Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "Phone Screen with HR, Skills Assessment which consisted of cost analysis, memo and PowerPoint presentation, Interview with Hiring Manager, and Interview with Team\r\nVery long process\r\nPhone screen was basically a fit interview", "Interview Questions": "Describe a time you had a disagreement at work and how did you handle it?"}], [{"date": "19 Apr 2019", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Clinton Health Access Initiative (New Delhi)", "Interview Descriptions": "It took some time ~one month to complete the interview process. All team members (about 4) interviewed me. It wasn't very hard. They checked for my analytical and structuring ability. Overall, it was a good experience.", "Interview Questions": "Case Study on a health technology intervention, my thesis work"}, {"date": "14 Apr 2019", "title": "Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "I was called to have a technical writing test. Then when I got there, they gave me a 3-hour test with figures about some places. Then, they asked me to find the false figures and explained. They also asked to do some calculation to make my own report, assessment about the figures and asked me to give own ideas to solve the problems I could see from the figures given by the test.\r\nAfter finishing the test, I asked the executive officer if I failed, would I be noticed and she said Yes, they would send email to every candidate. But in fact, I haven't received any mails from them.", "Interview Questions": "What's wrong with this report?"}, {"date": "20 Jul 2021", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Clinton Health Access Initiative in Apr 2019", "Interview Descriptions": "4 stage interview process:\nStage 1: virtual interview with HR, general behavioural interviewing and company fit questions\nStage 2: take-home case study to complete over a limited time period\nStage 3: invited back for an in-person panel interview with HR and program managers, in addition to behavioural interviewing, there are role specific and team specific questions\nStage 4: invited back for the final in-person interview with the country director or deputy country director", "Interview Questions": "Behavioural interviewing questions focused on STAR stories.\nRole specific questions unpacked the job description, for example, questions about specific health policies relevant to the role you are interviewing for."}, {"date": "27 Jan 2021", "title": "Senior Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Clinton Health Access Initiative (London, England) in Apr 2019", "Interview Descriptions": "HR interview followed by multiple rounds of technical interviews with the hiring manager and the group leader. Communication from the HR during the interview process requires a lot of follow ups. The technical interview was well organised and included some difficult but relevant questions for the job.", "Interview Questions": "Most of the technical questions were case studies related to the job description."}, {"date": "21 Mar 2019", "title": "Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "Standard phone screen interview format. One hour Skype interview. All questions that others posted here were asked. Interviewer had a pleasant manner and allowed me to ask several questions. Salary range was disclosured straight away.  interview outcome communicated in a timely manner.", "Interview Questions": "What do you know about CHAI? "}, {"date": "12 Feb 2019", "title": "Technical Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "Standard screening interview, followed by more in-depth phone interview with HR, then technical assignment, followed by program interview with team.  The HR interview was fairly standard though very thorough. The technical assignment was challenging. They seek to be very transparent in the interview process and in the first HR interview, they cover salary and employment expectations.", "Interview Questions": "Why do you want to work at CHAI? "}, {"date": "25 Jan 2019", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Clinton Health Access Initiative in Jan 2019", "Interview Descriptions": "They do an introduction interview with an HR officer/Admin, then they send you a case study (Not to be taken for granted) which proves your Excel, word and power point skills, then you're interviewed by the Hiring Manager, however, with me they sent me another case study to complete since it was two different programmes. They said if i pass, i would also be interviewed by the country director.", "Interview Questions": "Why do you want to work for chai"}, {"date": "23 Jan 2019", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Clinton Health Access Initiative in Dec 2018", "Interview Descriptions": "Started off the phone interview with basic questions about my background and past experience. Went in-depth to understand some of the projects I had worked on and led independently. Leading projects and working independently was a focus throughout the interview. However, they never got back with a yes or no.", "Interview Questions": "Why CHAI"}, {"date": "23 Oct 2018", "title": "Volunteer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "Interviewed with 2 different people of the same team. First call was lengthier with technical and HR questions. next call was shorter with them mainly trying to know me personally. then gave me a case study on excel. The interviewers were very nice.", "Interview Questions": "Why CHAI? Why this position? Why past internships?"}, {"date": "2 Oct 2018", "title": "Country Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Clinton Health Access Initiative (Harare) in Sept 2018", "Interview Descriptions": "Phone interview, pretty standard questions.  Via skype with HR person stationed in Zimbabwe. Interview was nice, despite technical problems. The interview was 10 days ago, and I have not heard back since.", "Interview Questions": "What do people misunderstand about you? "}], [{"date": "20 Aug 2018", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "The process took 1+ week. I interviewed at Clinton Health Access Initiative (New York, NY)", "Interview Descriptions": "2 rounds. 1st round is an 3-hour written test. There are 3 questions relating to specific tasks that you have to do if you get the job. 2nd round is interview with the Program Manager and Technical Director. They ask many actual cases need to be solved.", "Interview Questions": "What do you see you in 3 year later?"}, {"date": "28 Aug 2018", "title": "Senior Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Clinton Health Access Initiative (Nairobi) in Aug 2018", "Interview Descriptions": "Initial call was with HR recruiter, included brief discussion on what the position would typically pay. After HR a data analysis exercise using excel, submission of the exercise was online and included a PPT presentation and writing a memo to a ministry of health. Following the exercise three interviews with individuals on the hiring team, behavioral questions and technical exercises.", "Interview Questions": "Walk me through the planning process to engage the country stakeholders  prior to introduction of a new initiative "}, {"date": "11 Jul 2018", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Clinton Health Access Initiative (New Delhi) in Jul 2018", "Interview Descriptions": "I was contacted for the first time about two months after I applied. \r\nfirst a round of test: excel, ppt and word document exercise\r\nThe test was to gauge the analystical, communication and presentations skills. \r\nsecond round: telephonic interview \r\nthird round: panel interview", "Interview Questions": "About the organisation and past experience"}, {"date": "11 Oct 2018", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative (Harare) in Jun 2018", "Interview Descriptions": "Sent in an application, response after 3 months. Interview had simple mundane questions.The interviewers seemed not interested on the get go. It was less than 30 min. On the get go they were predjuced against me saying my skills are not transferable to the position.", "Interview Questions": "What are strengths?"}, {"date": "25 May 2018", "title": "Grants Administrator, Budgeting & Reporting Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "I applied online and was contacted to do a phone interview with the HR rep a few days later. The first interview was about 20 minutes long with HR rep. Afterwards I was email an excel exam to take within 48 hours (only takes like 1-2 to finish) then send it back. Once they received and reviewed that, I was contacted to have a second interview with someone in a similar position to the one I would be in. That phone interview lasted about 30-40 minutes and asked more specific/behavioral questions. A few days later I had the third and final interview with the director of budgeting. He asked very specific questions to my budgeting skills and phone interview lasted about 30 minutes. 3 days later I was offered the job.", "Interview Questions": "-How confident do you feel with excel? What things do you know about excel?\r\n-How much money did you manage in your last role? What was it used for?\r\n-How do you maintain communication with staff around the world?\r\n-What is one challenge you overcame in your last role and what did you learn from it?"}, {"date": "14 May 2018", "title": "Associate, Pediatric HIV Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Clinton Health Access Initiative (New York, NY) in Mar 2018", "Interview Descriptions": "Interview process was very bumpy. The interviewer missed our first 7am Skype call, which she attributed to a timezone mistake in an email, 4 days later at which time she asked me to reschedule for the following morning. When we connected, the screening call was in 3 parts:  behavior questions, discussion of the job description, next steps. The pay-range was substantially lower than other similar organizations pay but perhaps this is part of the philosophy of equity with the national staff. I was then asked to complete a technical exercise. The email instructions indicated \"you have 48 hours to send back to us for review\". I acknowledge this by saying \"thank you, I'll return this in 48 hours\" to which I was told \"no, you have 72 hours\". The exercise also had conflicting instructions so I detailed which instructions I followed in my answer sheet.  Three weeks after submission I received an email saying CHAI was pursuing other candidates who \"better fit this role\". I found the interaction rather strange for an organization hurrying to fill a role.", "Interview Questions": "How do you handle stress?"}, {"date": "23 Mar 2018", "title": "Analyst, Vaccines Program Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Clinton Health Access Initiative (Lagos) in Feb 2018", "Interview Descriptions": "Sent my CV via a referral and got a call from the Country Director that they would like to interview me. About a month later, had a phone interview with a program manager (Cancer) then a few days after was called for a Skills Test that involved analyzing a case study in Excel, writing a presentation and one page memo in Powerpoint and Word respectively. Was then flown for an onsite panel interview with the Country Direct, his deputy and all six directors. The country manager kept saying I was proud because I gestured a lot.", "Interview Questions": "How good are you in Excel"}, {"date": "4 Feb 2018", "title": "Supply Chain Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "First Interview with HR was very brief. The second interview as more in depth and they asked a 2 case interiviews, the 3rd interview was the same. it wasn't a Mckinsey type case interivew, they gave a scenario (health and supply chain scenario and asked how you would solve it).", "Interview Questions": "tell me about yourself\r\nwhat do you know about CHAI\r\nThen she scheduled another interview with the project team"}, {"date": "22 Feb 2018", "title": "Senior Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative in Feb 2018", "Interview Descriptions": "Applied online but my application was flagged to HR by an existing employee (I think this is the only way to get looked at).\r\nI have had the generic HR interview and completed a case study, waiting for the next stage which is a panel interview which I will have this week.", "Interview Questions": "Describe a situation when you were in conflict with a colleague and what you did to resolve it?"}, {"date": "23 Oct 2020", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Clinton Health Access Initiative in Feb 2018", "Interview Descriptions": "Generally a good experience but was initially a bit intimidating. I interviewed with all members of senior management present. They asked questions about my CV and also asked about my perspective on the most glaring development challenges. I generally found it quite easy once I became comfortable and did a lot of research about the organization and program area before hand", "Interview Questions": "Tell us about your research experience \r\nHave you ever been in  a position where you have influenced decision making\r\nWhy CHAI?\r\nWhat transferable skills do you have that can be applied to the role "}], [{"date": "7 Oct 2019", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative (Nairobi) in Feb 2018", "Interview Descriptions": "It all started with a phone call from a recruiter 3 weeks after I applied online inviting me for a one on one interview, the recruiter was so friendly and asked me to choose a flexible time for myself. On the interview day I met two interviewers who asked fair questions and after another 3 weeks I was asked to attend a second interview which to me asked almost the same questions like the first one though with a different person this time.", "Interview Questions": "What is your favorite MS Excel function?"}, {"date": "21 Jan 2018", "title": "Program Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "The initial interview was taken by HR consultant, the second step is case study. \r\nThe last step is an interview with leadership, but I am waiting for the result of second step.", "Interview Questions": "qualification, problem solving skills"}, {"date": "20 Feb 2018", "title": "Deputy Country Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative in Nov 2017", "Interview Descriptions": "There was preliminary interview followed by two interviews with HR and project office.  Both were phone interviews as the project location was overseas.  The first one with the HR people was very general.", "Interview Questions": "What is your managerial style?"}, {"date": "30 Nov 2017", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Clinton Health Access Initiative in Oct 2017", "Interview Descriptions": "Applied online. 1 month later, received an email to set up a phone interview.  Short (half hr) phone interview with standard HR questions.  Received a case study the next day.  Completed the case study within the 48 hour allotted time.  Did not hear back.  Followed up at 2, 3 and 4 week interval.  Did not receive response to followup until 4 weeks after interview saying I was still in consideration.  Nearly 2 months before rejection was received.  Was told that location preference would not bias interview process, but suspect it definitely did.  My advice is that you won't get any where with this company without networking with teams directly.", "Interview Questions": "What interested you specifically about CHAI?"}, {"date": "14 Nov 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative (Abuja, Federal Capital Territory) in Oct 2017", "Interview Descriptions": "Initially i go a mail informing me that i was considered for the position. I was scheduled for a Skype call with one of the HR officials. I was asked to send some sample of work i have done. The call lasted for almost an hour.  I was sent an practical work to do. I await further information", "Interview Questions": "Ho to manage a small team, prioritize, meet deadlines and handle streess"}, {"date": "8 Jan 2018", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Clinton Health Access Initiative in Jul 2017", "Interview Descriptions": "Applied online after speaking with members of the team. A few days later received an email to set up a phone interview.  Phone interview with standard HR questions (company fit) and information regarding position pay and benefits.  Then received case study due within the 48 hour allotted time (but only intended for applicants to spend 3 hours on).  After completing  the case study received email regarding next interview, held over skype.  Interview was 1-1.5 hours and a mix of behavioral interviewing with some more case type questions that apply to the nature of the role.  Proceeded through 4 separate interviews in this manner, approximately a week or 1.5 weeks apart, slowly progressing through members of the team (from the Associate level to Director of the team). In the final interview was informed that final candidate interviews were all being conducted that same day, and therefore notice should be received in the next week. \r\n\r\n\r\nDid not hear back. Followed up at 2, 4, 5 and 6-week interval. Received vague response follow up saying I was still in consideration.  2+ months before rejection was received. \r\n\r\nGenerally found that if they are interested your HR contact will get back to you within 2-3 days after each step. If not, they'll just go radio silent-- at which point you can assume you are not in consideration for the role, even if HR will not respond with an email to notify you of that.", "Interview Questions": "Walk me through the approach and steps you would take given the task of developing a multi-stakeholder national plan for ___(insert priority health issue)__."}, {"date": "15 Jul 2017", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "Interview was standard behavioral interview via phone. The phone line was very patchy and it was at times difficult to hear the question being asked. Interviewer was nice and professional. Questions were often very specific.", "Interview Questions": "Describe how you work"}, {"date": "12 Oct 2021", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Clinton Health Access Initiative (Monrovia) in Jul 2017", "Interview Descriptions": "Quick turnaround, prompt response times, and great communication. Overall it was a positive experience. The interview was technically based but also seemed to get an idea of candidates fit culturally for the team and the environment.", "Interview Questions": "Tell me about a time you didn't meet expectations and bounced back. "}, {"date": "19 Jun 2017", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Clinton Health Access Initiative in Jun 2017", "Interview Descriptions": "An HR representative outside of my country emailed me to book a telephone interview. The telephone interview lasted about 30 minutes and went really well. The next day she sent me the technical exercise which included a case study that you have to do excel, PowerPoint and Word tasks. After I had sent it back she told me it was well received and that she would contact me shortly for next steps. After 3 days of no response I emailed her for feedback. Needless to say I didn't get any response further from them.", "Interview Questions": "What is your ideal work environment?"}, {"date": "26 Jun 2017", "title": "Program Manager, Health Financing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative (Lilongwe) in May 2017", "Interview Descriptions": "I have so far undergone 3 interviews. The first is an introductory interview conducted by someone in Global Acquisition where they want to know about your motivation for the position, what you know about CHAI, your management style, how you relate with others, your key skills. The second interview is to test your knowledge and grasp of MS Excel, presentation and communication skills. They give you a case study and require you to submit within 48 hours; however, you aren't supposed to exceed 3 hours working on the case study. Third interview was supposed to be conducted by one person but ended up being interviewed by 2 people from global team. Here, they asked about your understanding of the position, hypothetical cases, your management style, your understanding about key issues in health financing.", "Interview Questions": "What do you know about CHAI?"}], [{"date": "19 Jul 2021", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Clinton Health Access Initiative in Apr 2017", "Interview Descriptions": "Starts with an HR screener to ensure you are a team player who's own career interests meet the company's mission, followed by an Excel Exercise. Then  you begin to meet with different levels of the team you would join. There were five separate interviews and it took 2 months. Expect a dragged out process with multiple levels. The interview themselves weren't hard, it was more about the endurance and patience required.", "Interview Questions": "Scenario: You are working on a national health policy and your local World Health Organization partner says something you know isn't true in a room with other partners present. How do you go about dealing with this situation?"}, {"date": "4 Jul 2017", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative in Apr 2017", "Interview Descriptions": "Process involved basic interview with Human Resource person, asking about experiences, past jobs, and how one went about scenarios; then an assignment on a scenario of a fictitious Country with data which had to be analysed and results of analysis presented in specified time then another interview", "Interview Questions": "Why are you interested in CHAI?"}, {"date": "1 Mar 2017", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Clinton Health Access Initiative in Feb 2017", "Interview Descriptions": "A screening phone call with HR, a 3-part case to evaluate your Excel & communication skills, and 3 additional Skype interviews (manager, country manager, and director-level) about 1 hour long each. If you are progressing, expect quick turnaround in emails, if not, you actually have to reach out to find out. A good group of interview panel that really dives deep into whether you'd do well in the role or not.", "Interview Questions": "How do you deal work with someone who resists change?"}, {"date": "13 Jan 2017", "title": "Research Study Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative (New York, NY)", "Interview Descriptions": "I was contacted by a member of HR and had an initial interview. I completed a technical exercise. The same HR member got back to me and said she would set up an interview with the project team. After not hearing from her for two weeks, I followed up and she responded that the position had been filled.", "Interview Questions": "What interested you specifically about this position?"}, {"date": "2 Apr 2017", "title": "Associate Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Clinton Health Access Initiative (Harare) in Jan 2017", "Interview Descriptions": "Contacted by HR to set up an interview via email. I sent an email back accepting the suggested time but no email was sent saying that the interview was confirmed. But still received a Skype call on the day of the suggested interview.", "Interview Questions": "Why CHAI? "}, {"date": "3 May 2021", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Clinton Health Access Initiative (Abuja Nigeria) in Jan 2017", "Interview Descriptions": "The interview was multiple fold.  Involved both practical and oral. The oral interview had about five interviewers asking diverse questions as regards health care interventions and also my academic background.  The practical was more of data analysis and visualization using excel . At the end of the process I passed both stages . I was later called upon after a week to resume duty .", "Interview Questions": "What do you know about family planning , what do you know about health training ?  Etc "}, {"date": "1 Dec 2016", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Clinton Health Access Initiative (New York, NY)", "Interview Descriptions": "First interview was over skype  with general HR rep. Basic questions on history of the organization and biggest achievements. Was invited for second interview 2-3 days later with group of managers on skype. Second interview was more detailed about the role. If you do well on both interviews HR will send about 5 analytical / practice work scenario exercises to complete in 48 hours.", "Interview Questions": "What are health challenges in the country you are applying for and how would you improve them?"}, {"date": "8 Dec 2016", "title": "Associate, Health Financing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Clinton Health Access Initiative (New York, NY) in Nov 2016", "Interview Descriptions": "After applying online I was sent a 3hr case study to do some analyses followed by creating a presentation and summary memo. This was followed up with a brief phone interview that involved the usual HR type questions. \r\n\r\nAfter the initial HR interview there are more interviews; one with the supervisor in the job location as well as with the global supervisor for that area.", "Interview Questions": "How do you create relationships/network with the relevant stakeholders that you'll be working with?"}, {"date": "19 Aug 2016", "title": "Talent Acquisition Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Clinton Health Access Initiative (Kampala) in Aug 2016", "Interview Descriptions": "The interview interaction with HR was okay. I had applied for position in Zimbabwe but there was an opening in East Africa for which I was considered. Focus of interview was to obtain a general picture of candidates skills, experience and match with the job. Feedback from the interview was given after 4 days which is a good time for waiting.", "Interview Questions": "How well would you work with a virtual team?"}, {"date": "26 Jul 2016", "title": "Senior Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "The process was straight-forward for a phone interview.  The interviewer did not have specific answers to job-specific questions. At the end of the interview, the interviewer indicated a follow-up meeting would be arranged- but no follow up was completed by the interviewer.", "Interview Questions": "Could you provide an example of how you dealt with an unexpected situation?"}], [{"date": "25 Jun 2016", "title": "Diagnostics Market Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Clinton Health Access Initiative in Jun 2016", "Interview Descriptions": "My interview with HR started from self-introduction and why I chose CHAI. This global recruiter is well experienced as her manner and speaking tone was just right and enjoyable. It was a happy interview. I don't know how they choose ideal candidate", "Interview Questions": "Tech question was about how well I could handle Excel. Behavior questions included: 1) how well I can work with different stakeholders and how I can accomondate different opinions 2) how well I can work with team members remotely 3) how well I am attentive to details"}, {"date": "13 Jun 2016", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Clinton Health Access Initiative (New York, NY) in May 2016", "Interview Descriptions": "First was an HR phone interview and then a take home case assignment, after which I had another phone interview. After the last interview, I didn't hear from them at all and it was only after I followed up that they told me that I wasn't selected. Maybe a bit more professionalism is the need of the hour at CHAI. Though I was warned about this by multiple people.", "Interview Questions": "Why CHAI?"}, {"date": "6 May 2016", "title": "Associate, Program Operations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "I went through five one-hour interviews with five different people spanning a month and half, one HR rep, one person i was replacing, and three management-level individuals. I was also given two exercises/activities to do between the second and third interviews, and between the fourth and fifth, with each taking at least 4 hours to do. I made it to the final round of interviews, after which the interviewer told me they would get back to me with the team's decision in the near future, and more than three weeks later, never heard anything back.", "Interview Questions": "Why CHAI and not other comparable organizations? Are you willing to work a minimum of 50 hours a week? "}, {"date": "13 Mar 2016", "title": "Senior Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "HR screening followed by 3hours assignment basically testing Excel, word and ppt skills. Heard back three weeks later and was asked to interview with the country Director. Stalemate and they’ve been unable to say what’s going on.", "Interview Questions": "Most behavioral and teamwork related!"}, {"date": "1 Mar 2016", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "I had to complete a 3 hour assignment before the interview, interview time was flexible, given several slots to choose from. The process was smooth, was made to feel at ease right at the beginning. Overall, four interviews to be done.", "Interview Questions": "A lot of behavioural questions"}, {"date": "22 Mar 2016", "title": "Senior Program Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative (Harare) in Feb 2016", "Interview Descriptions": "Initial phone interview took place with East Africa recruitment centre. Interview was pleasant & clear. A technical excercise was completed following that an interview with the Country Director took place.  It was communicated that they would like for me to move on to the next step of meeting with some of the team for another more technically focused interview.  Still have heard no follow through on that -with no response to follow up email - a month later.", "Interview Questions": "Typical questions were asked as well as questions regarding how one would respond to or approach various scenarios relevant to the position.  A very good combination of questions & information was present."}, {"date": "22 Jan 2016", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Clinton Health Access Initiative (Boston, MA) in Jan 2016", "Interview Descriptions": "I was contacted a week after submitting my application. I was informed the interview would last approximately 30 min and they were very transparent with salaries and explained other benefits upfront which I appreciated. Next, I was given a technical exercise which would need to be completed within 3 hours. It consisted of analyzing quantitative and qualitative information using Excel, and then presenting the information on Word and Memo. I found it was challenging as the instructions are ambiguous. It's been 3 weeks and I haven't heard back so I'm not sure if I did well.", "Interview Questions": "They asked the basic interview questions such as \"Why do you want to work for CHAI? Tell me about a time when you deal with someone who was difficult and how did you handle it?\""}, {"date": "22 Nov 2016", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Clinton Health Access Initiative in Jan 2016", "Interview Descriptions": "I have an initial Skype call with someone from the HR department. They followed up with me within the week, asking a writing example. Then, I have a second Skype call with the hiring manager from the department of the internship. She was really nice. I didn't get the internship, but she gave me feedback afterwards.", "Interview Questions": "N/A"}, {"date": "20 Jun 2016", "title": "Technical Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Clinton Health Access Initiative in Jan 2016", "Interview Descriptions": "I applied the position online in Nov 2015 and was shortlisted in Dec. The first Interview call was with HR, asked personal and professional questions related to job profile and CV and then they gave an excel sheet task which was submitted within the period asked for.", "Interview Questions": "Background and CV"}, {"date": "30 Jan 2017", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Clinton Health Access Initiative (New Delhi) in Jan 2016", "Interview Descriptions": "4 rounds \r\n1 Mini Case on phone\r\n1 Behavioral Interview \r\n1 HR Interview\r\n1 Interview with Country Director\r\nIt won't be hard for people with a passion for and background in healthcare. You have to demonstrate the ability to work with public sector officials.", "Interview Questions": "Why CHAI? This is very important for them"}], [{"date": "19 Feb 2016", "title": "Senior Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Clinton Health Access Initiative (Boston, MA) in Jan 2016", "Interview Descriptions": "I responded to the job posting online and was contacted via email by an HR representative located abroad. We arranged for a phone interview. Following the phone interview I was asked to conduct a case study (3 hours timed) and submit it within 48 hours of completion of the phone interview. I have yet to be contacted. That was 1 month ago.", "Interview Questions": "How do you handle a situation when multiple stakeholders disagree about how to evaluate a program?"}, {"date": "18 May 2016", "title": "Technical Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Clinton Health Access Initiative (Brooklyn, NY) in Nov 2015", "Interview Descriptions": "First, general HR interview (character fit, work style, how you heard of CHAI, etc.)\r\nThen, skills test (case study with analysis and presentation) -- Very basic\r\nThen, interview with senior associate (1:1) -- More work-style questions\r\nThen, interview with senior manager (1:1) - More work-style questions with very basic technical questions\r\nFinally, interview with directors (group) -- All work-style questions", "Interview Questions": "How does the job description align with previous experiences? How do you deal with stress? Describe your thought process while working through case study. Describe your organization style. Describe your analytical competencies. How do you see your future? What do you want to get out of this? How do you manage conflicting views between colleagues with different roles?"}, {"date": "7 Jul 2015", "title": "Technical Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "At least 3 interviews for any position. The first was with HR, the second was with the overall program manager, and the third was with the in-country team. The HR served a s a screening and was quite simple; the second served as a position-specific interview that looked more at my background. The third was the most difficult and lasted nearly an hour. It examined my ability to work with the in-country team.", "Interview Questions": "Time management, ability to work independently."}, {"date": "27 Jun 2018", "title": "Technical Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative in Mar 2015", "Interview Descriptions": "The three times I got interviewed I had applied  online.  Always have the first interview by a recruiter/HR and two out of three I had a overall good experience. Being questioned things like \"how to deal with multicultural issues in a team\" or \"why working for CHAI\". They inform you about CHAI worldwide and about payment. Only in the first time I got to the subsequent interviews (a technical one, which was in a very nice way, like discussing the technical needs and asking me how I could collaborate and participate on that) and after that, an interview with the regional coordinator, regarding  project management and international funding.", "Interview Questions": "Why working for CHAI?"}, {"date": "26 Jan 2015", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Clinton Health Access Initiative in Dec 2014", "Interview Descriptions": "I completed 5 interviews and one technical exercise for CHAI. The first interview, with HR, gauged fit with the organizational culture and asked general behavioral questions, etc. I then was asked to complete a timed technical exercise comprising a case with quantitative and qualitative analysis (deliverables were an Excel workbook, PPT, and memo in Word). About one month lapsed after I submitted the technical exercise before I was contacted again to do interviews with the team. One of the 4 team interviews involved an oral case component. Some team members were local, others were abroad, at varying levels in the organization. Three of the team interviews were by phone and one in person.", "Interview Questions": "What would you do if the donor for this project asked CHAI to prove the impact their funding has had but we didn't have the data to quantify their impact on their preferred indicator?"}, {"date": "26 Jan 2015", "title": "Programmer Officer In Africa Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "Pretty hard as different people in the organisations will interview you, where as they have different views on who is needed for the job. Incompetent HR I should say, organisation quite uninformed about development projects. Young managers with Ivy League pedigree who have never been to Africa.", "Interview Questions": "Quantitative questions"}, {"date": "20 Jan 2015", "title": "Senior Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "The interview was largely behavioral questions. In particular, it helped to know current employees at the company who can put in a good word. Other applicants are typically asked to analyze data and prepare a powerpoint presentation. You will be asked to discuss similar work experience, which is standard practice. Applicants with past consulting experience is a plus.", "Interview Questions": "Case question related to international health"}, {"date": "15 Nov 2014", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "I was interviewed by phone first after I had applied online, this lasted about 45 minutes. I received a call for a face to face interview after about a week, the panel consisted of 3 people and I was asked competence based questions this lasted about an hour, and the questions were very detailed and demanded a lot of detail in the answers. Two weeks after the interview I was called in to be interviewed by the Country Director this was short and informal.", "Interview Questions": "How do you maintain professional relationships"}, {"date": "12 Nov 2014", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "Interview over skype with a regional HR officer based in Africa. I received an interview invitation a few weeks later after I applied online. Skype connection was not as bad as imagined but I felt awkward to ask to repeat questions again and again. The interview lasted about an hour followed by a technical written assignment (excel, ppt, word) which I was asked to submit within two days after the interview. After the written assignment, the HR officer told me that he would give a feedback /result in a week but he never did.", "Interview Questions": "Interview questions were normal; what I know about the organization, some of my experiences picked up from resume, behavioral case question, salary requirement, visa status etc. A written assignment was rather difficult as I was not familiar with quantitative analysis."}, {"date": "27 Jun 2015", "title": "Senior Program Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative (Harare) in Nov 2014", "Interview Descriptions": "Applied online was called after a month for a Skype screening talk. After that I got a case study to do and heard from the office in about 2 weeks. Went for an interview with some of the team members and was called again after a month with an invite to meet the country rep.", "Interview Questions": "Why CHAI.\r\nWhy me etc"}], [{"date": "16 Sept 2014", "title": "Public Health Professional Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Clinton Health Access Initiative in Aug 2014", "Interview Descriptions": "Contacted following referral for a blanket first round interview. Asked general resume questions about previous experience, then asked a few \"tell us about a time when...you showed leadership/caused a change in culture/etc.\"", "Interview Questions": "Tell us about a time when you worked in a resource-poor setting."}, {"date": "13 Jun 2016", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Clinton Health Access Initiative (Boston, MA) in Jun 2014", "Interview Descriptions": "3 stage interview, CHAI fit interview; Questions include \r\nCareer background, Personal Statements and Future plans.\r\n MS excel test, \r\nTeam panel interview; this was more role focused interview, the panel had existing team members, a lot of the questions targeted meeting the advertised role.", "Interview Questions": "Give a brief career history? Do you understand the advertised role? How do you fit into the role?"}, {"date": "9 Oct 2016", "title": "Senior Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Clinton Health Access Initiative (Abuja, Federal Capital Territory) in May 2014", "Interview Descriptions": "4 stage interview. Initial HR interview to determine eligibility, followed by test of excel skills in which a case study is presented and results are expected to be summarized in excel format. A memo is also expected to be written and submitted based on the excel result. 3rd stage is a technical program interview. Final interview was with senior management", "Interview Questions": "Describe yourself and why you are appropriate for this job\r\nYou move around a lot,can you stay on a job?\r\nWhat do you know about under 5 mortality in Nigeria?"}, {"date": "9 Dec 2014", "title": "Country Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Clinton Health Access Initiative (Washington, DC) in Apr 2014", "Interview Descriptions": "There were three interviews in total, the last one being in-person. The first one was a telephone interview with general HR staff; second one (telephone) was with a technical person working overseas. I was then asked to complete a task in 48 hours about a hypothetical country that would demonstrate my ability to use Microsoft Word, Excel, and PowerPoint. The final one was in Washington D.C. with another technical person. They paid the airfare and hotel stay. The whole process took about 4-6 weeks.", "Interview Questions": "\"If you are working in country X and you need to do a surveillance study on Y and need to incorporate GIS in your findings, how would you go about it?\""}, {"date": "25 Jan 2014", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Clinton Health Access Initiative in Nov 2013", "Interview Descriptions": "I was first contacted by a HQ based hiring manager, we set up a phone interview and discussed a few points about the organization and the position and then was asked about my specific work history and experience as well as behavioral interview style questions. I was given a timed technical exercise to complete (data analysis with MS Excel, one page report and 5 PPT slides). This was followed by a panel interview with people from the country office and regional/international posts.", "Interview Questions": "I was asked what I know/like about the organization, I had a short answer but was pressed to continue and talk more about the organization"}, {"date": "28 Oct 2013", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "They gave me a case to solve over the phone because most of the senior managers were McKinsey alums. Then I interviewed via phone with the country director and the regional director.", "Interview Questions": "The case was difficult - but the interview questions were behavioral based."}, {"date": "20 May 2013", "title": "Associate Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "After applying online the initial phone interview occurred in a timely manner. It took about 30 minutes and questions were fairly standard. However they did ask what my favorite function in excel was. I was told there would be 3 additional interviews/case studies. However no further communications have been received from CHAI.", "Interview Questions": "What is your favorite excel function."}, {"date": "21 May 2015", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Clinton Health Access Initiative (New York, NY) in May 2013", "Interview Descriptions": "The process begins with a phone screen with an HR rep. The next step is a case study in which you are required to conduct an analysis and prepare a presentation of your findings to a tailored audience.  The purpose of the case study is to assess your familiarity with excel and communication. The last step is conversation(s) 1:1 with your manager(s).  Some teams require that you also speak with the director.", "Interview Questions": "Why public health?\r\nWhy Clinton Health Access Initiative?\r\nWhat are your greatest strengths/weaknesses working in teams?"}, {"date": "22 Feb 2016", "title": "Senior Health Financing Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clinton Health Access Initiative (Addis Ababa) in Mar 2013", "Interview Descriptions": "Three interviews with  a recruitment agency, program manager and deputy country director.average level, not well organized it took 8 months. There was an online quez question before the interview which was tough.", "Interview Questions": "If your boss gave  you an assignment about something that you have no idea but has a short dedline,  what would you do?"}, {"date": "4 Oct 2017", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Clinton Health Access Initiative in Feb 2013", "Interview Descriptions": "Applied for a position advertised online. I was later emailed asking if I would be interested in a different position that they were hiring for and , if so, to provide college transcripts. Interview with program staff and HR followed by second interview with HR Manager.", "Interview Questions": "Questions surrounded ability to cultivate and nurture good working relationships"}], [{"date": "25 Nov 2012", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Clinton Health Access Initiative", "Interview Descriptions": "I applied through the online site (although most people I now know within the organization got their jobs through an internal contact).  About 2 months after submitting my application online, I was contacted by HR, who conducted a ~30minute phone screen.  She established the salary range that I could expect right away, and then proceeded to ask me behavioral questions and questions based on my resume.\r\n\r\nShe set up a time for me to do a timed Excel test, which was very simple if you are well versed in Excel.  ~2 weeks after that, I did a McKinsey type case interview with a current employee to assess my strategic thinking.  After this, I did 3 more interviews with others who were on my team.  Most of the questions were about my experience and motivation.", "Interview Questions": "I was surprised that they sent an Excel test.  It took about 1-2 hours to complete because there are several parts to the question, but it's not a challenging exercise."}]]