[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Amazing", "rating": "5.0", "reviewer_affiliation": "KEY NOT FOUND: jobLine.seasonal-former, more than 3 years", "job_date": "15 Sept 2021", "job_title": "Site Manager in Edinburgh, Scotland", "duration": "N/A", "pros": "Fun, active and allows for growth and promotion.", "cons": "no allocated breaks for management or staff"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great for students", "rating": "5.0", "reviewer_affiliation": "KEY NOT FOUND: jobLine.seasonal-current", "job_date": "29 Nov 2020", "job_title": "KEY NOT FOUND: reviews.seasonal-anonymous in Loughborough, England", "duration": "N/A", "pros": "Active, fun, lot of freedom", "cons": "Intense, long hours, lots of responsibility"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Can you force a smile for ten hours a day?", "rating": "2.0", "reviewer_affiliation": "Former Contractor, more than 1 year", "job_date": "12 Jul 2017", "job_title": "Multi Sports Coach in Aberdeen, Scotland", "duration": "N/A", "pros": "Ok, so great hours since many students need work during holiday periods only.", "cons": "Working 10 hour days five days a week doesn't seem so bad,right? BUT add in the fact that during your 30 minute unpaid break you must remain in the camp amongst the children to stay in ratio; the measly pay of £5.75 an hour that includes holiday pay (under 21) for being usually a coach to around 16 children; wet Wednesday where the staff are joined outdoors (in what seems to be no matter what the weather) by the kids for a massive one sided water fight because the kids can't get too wet; the fact that you're almost only ever assigned a group the night before meaning your timetable comes to you a night before and therefore you are only able to plan your following day then, and it stops looking so appealing."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Great seasonal employer", "rating": "3.0", "reviewer_affiliation": "Former Contractor, more than 8 years", "job_date": "11 Feb 2018", "job_title": "Multi-Sport Coach Assistant Manager Then Site Manager in Glasgow, Scotland", "duration": "N/A", "pros": "It is the most rewarding experience that I will ever have, just being present and watching children celebrating for meeting or exceeding their own expectations is phenomenal and one which I will always treasure. A further advantage of this role is that it assists with confidence building and teamwork as the venue can only operate if the entire staff contingent was contributing to assisting the Manager and therefore each staff member was contributing to the success of the venue. There are multiple venues around Scotland the U.K which are located in the major University cities and the facilities they offer such as swimming pools and cavernous sports halls plus rock climbing in one venue. As a coach is seen as a role model for the children they persistently desire to challenge themselves by beating them in the games so being magnanimous in defeat helps to see that they are developing in their progression in a sport and encourages children to continue this outside of their time in Kings. Should a coach be seen to possess what is regarded as the \"Kings Factor\" they are offered leadership training and phased promotion to lead their own staff and venue which suggests recognition for their ability and dedication to the company, however non-financial awards are distributed weekly to the best staff member recognised by the Area Manager.  The CEO of the charity Richard Holmes was one of the original founders and currently still is heavily involved with the operations of it which is a testament to belief of the business model and is held in high esteem by current and former members of staff for his Leadership Style and personal involvement with its operation. He makes it a personal mission to visit each and every venue during the Summer operations to ensure that the staff and venue conform to the expectations that he expects from his staff base. This charity employs a system were trainee coaches or Rookies are trained by experienced members of staff till they are old enough to be given their own group upon their successful graduation. As these children then become the next generation of coaches over time this leadership programme gives those children an insight into the role of a sports coach should they wish to pursue a career of this over time.", "cons": "As much as this job has many positive aspects there are ones which I think that are negative. Although this is a sports camp the hours can be quite long working from 8-6 at some days playing sport continuously while having to multi-task for other operations. This role is contract based to each year and there is no guarantee of continued sustained work from season after season with no valid reason as so why a coach or manager will be dismissed apart from simply being told so retention of experienced staff can be an issue.  Those who fit a certain criteria are given immediate promotion to Site Manager which has lead to problems of inexperience disrupting the operation of the venue and resentment of experienced staff being overlooked for promotion."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Best job I have had in years!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Aug 2018", "job_title": "Head Office Employee in Sheffield, England", "duration": "N/A", "pros": "The people in the office, working along such friendly and helpful people. Fast pace and never a dull day always busy :)also anything your not clear on there is someone to show you.", "cons": "Not been here long enough to see any, but have nothing bad to say about Kings as whole they look after you."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "An amazing place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Aug 2018", "job_title": "Head Office Employee in Sheffield, England", "duration": "N/A", "pros": "The office culture is amazing - everyone is so friendly and welcoming. I look forward to coming into work each day.", "cons": "The benefits of working for Kings far outweighs any cons."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Good if you can get the work", "rating": "2.0", "reviewer_affiliation": "Current Contractor, less than 1 year", "job_date": "26 Apr 2018", "job_title": "Multi Sports Coach in Stirling, Scotland", "duration": "N/A", "pros": "Well structured and established set-up", "cons": "Poor communication between high up and staff."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Poor Working Environment", "rating": "1.0", "reviewer_affiliation": "Former Contractor, more than 1 year", "job_date": "2 Jan 2019", "job_title": "Swim Teacher in Bradford, Yorkshire and the Humber, England", "duration": "N/A", "pros": "Well structured work, nice colleagues", "cons": "Management are not helpful\r\nTerrible zero hours contract, make it sound like you are doing great work but it is highly exploitative with terrible pay in comparison to 95% of other swim teaching jobs"}], []]