[[{"date": "30 May 2023", "title": "Behavior Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Phoebe Putney (Albany, GA)", "Interview Descriptions": "Oversee mental health patients , check in admissions, discharges, meals and classes plus resources for the patients for discharge. Social work, living assistance benefits, medication management, transportation, services, and more", "Interview Questions": "It was a panel interview"}, {"date": "25 Jan 2023", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Phoebe Putney", "Interview Descriptions": "The interview process was a group interview it was fairly easy. Everyone has an opportunity to speak and answer the questions. I’m not usually good with interviews but i did well", "Interview Questions": "How do you work under pressure?"}, {"date": "19 Jan 2023", "title": "Behavior Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Phoebe Putney in Jan 2023", "Interview Descriptions": "Be prepared and dress appropriately. Know why you want to sell yourself to this facility. Be honest about any past experiences. Highlight on your values and why you would be an asset to this team.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "16 Jun 2023", "title": "Certified Surgical Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Phoebe Putney (Albany, GA) in Jan 2023", "Interview Descriptions": "Interview process was very easy I was called a couple of days after filling out application hr was very easy to commicqte with & managers were always a call away if I needed an answer", "Interview Questions": "Tell us about yourself please"}, {"date": "15 Nov 2022", "title": "Critical Care Intensivist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Phoebe Putney", "Interview Descriptions": "Multiple meetings, organized, people were good. They invited for site visit, were very responsible. Also gave community tour to get the feeling of the place. Overall had a good experience with the interview process.", "Interview Questions": "Open interview. Just normal conversation"}, {"date": "13 Jun 2022", "title": "PT/PTA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Phoebe Putney", "Interview Descriptions": "It was more about getting to know me as a person and a good opportunity to meet the team. I had an interview with a screener and then with the supervisors.", "Interview Questions": "What are your biggest strengths and weaknesses."}, {"date": "30 May 2021", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Phoebe Putney", "Interview Descriptions": "Interview was well but during a pandemic they should not be pulling off their masks.  That made me uneasy and decided to not take their offer otherwise I would have accepted.  Perhaps now that more people are vaccinated I would accept an offer.", "Interview Questions": "A lot about how to handle difficult people"}, {"date": "8 Jun 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Phoebe Putney (Albany, GA) in Apr 2021", "Interview Descriptions": "Welcoming. It is a panel interview and they will make an applicant feels that he/she is only hanging out with some friends. Random questions, just anything that you would not expect.", "Interview Questions": "Are you a friendly person? "}, {"date": "24 Jan 2023", "title": "Supply Chain Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Phoebe Putney (Albany, GA) in Mar 2021", "Interview Descriptions": "I interviewed for a supply chain analyst role for Phoebe Putney. The interview was in person. It started w/ a panel of colleagues asking a few questions. That took 30-45 minutes. Nothing out of the ordinary there. Then they handed me a laptop and gave me a spreadsheet, with no context, and asked me to see what I could do with the data. That took another 30 minutes. I built a pivot table and showed them some filters, but it was challenging without any context as to what I should be looking for. I then talked with a manager. Total in and out was well over two hours, which seemed excessive for the role.", "Interview Questions": "Are you familiar with excel? Can you make a pivot table in excel?"}, {"date": "28 Jan 2021", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Phoebe Putney (Albany, GA) in Jan 2021", "Interview Descriptions": "The process of this interview was good and well organized. We met in front of the Starbucks and went over everything pertaining to the job. The questions were pretty simple and a overall good connection between the interviewer and myself was present.", "Interview Questions": "Tell me a little about yourself?"}], [{"date": "15 Jan 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Phoebe Putney (Albany, GA) in Jan 2021", "Interview Descriptions": "The nursing manager was a sweetheart! She interviewed me and provided a tour of the floor. She always introduced me to all of the staff, which I really appreciated.  The floor is a mixed unit of all types of patients due to the COVID 19", "Interview Questions": "Behavior questions \nSchedule \nTasks \nVital signs\n"}, {"date": "7 May 2020", "title": "Lpn Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Phoebe Putney (Albany, GA) in Apr 2020", "Interview Descriptions": "It was very efficient and timely. Pleasant and painless. Easy process. Very informative. Questions were appropriate for the job I was applying for. Interviewer was very polite and nice.", "Interview Questions": "What would I do if in a situation where the physician was being ugly to a patient?"}, {"date": "23 Oct 2019", "title": "Accounts Payable Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Phoebe Putney in Oct 2019", "Interview Descriptions": "Very easy, got an email to schedule phone interview, they called we talked for about 15 min or less. Very up beat interview.  He should get back to me in a few days to schedule face to face interview.", "Interview Questions": "Why Phoebe? \r\n"}, {"date": "4 Jun 2019", "title": "Medical Center Representative I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 5 days. I interviewed at Phoebe Putney", "Interview Descriptions": "The interview process was very fast and easy. I applied on Indeed and was instructed to complete a phone interview and survey, after I was finished, a few days later, I was contacted for an interview.", "Interview Questions": "Internet Survey"}, {"date": "6 Dec 2018", "title": "Safety Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Phoebe Putney (Albany, GA) in Aug 2018", "Interview Descriptions": "Spoke with manager of my department. It was a well interview and straight to the point. I spoke to the manager and asked all the questions I need to ask and she was able to answer everything directly.", "Interview Questions": "Are you willing to work 12 hour shift?"}, {"date": "18 Apr 2018", "title": "Supply Chain Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Phoebe Putney (Albany, GA)", "Interview Descriptions": "phone interview then panel interview. the brought the entire leadership team in to talk with me. it was a very engaging and fun conversation. This is a very fun place to work and they have a great team", "Interview Questions": "what is your 5 year plan"}, {"date": "22 Aug 2017", "title": "Leadership Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Phoebe Putney", "Interview Descriptions": "Was a very lengthy process where several illegal questions were asked. Maybe because the town is so small and they have a \"good ole boy\" system in place. Being from a city out of state and knowing that the things they were doing were illegal, I knew this was not the place for me.", "Interview Questions": "A lot of behavior-based questions"}, {"date": "19 Jul 2017", "title": "Executive Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Phoebe Putney", "Interview Descriptions": "I applied online and received an email the next day to schedule a phone interview. From the link, I selected the first available date which was 2 weeks away.  On the day of the interview, I received the phone call on time.  The process took about 20 minutes.  Casual conversation interview.", "Interview Questions": "What prior experience do you have that makes your qualified for this job?\r\nHow would one of your co workers describe you?"}, {"date": "29 Jan 2020", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Phoebe Putney in Jan 2017", "Interview Descriptions": "Two interviews. One over the phone, and the other in person. Very quick takes 10 minutes over the phone. In person was 20 minutes. She never read my resume. They only tell you good things, they never tell you how disrespectful the nurses are to their techs. There is no teamwork. Management will ask the same question, “what can we do to improve nurse and techs relationship”. You tell them and they do nothing. Worse hospital to work for. Turn over rate high, everyone quits like 3-6 months in.", "Interview Questions": "What was my strength?"}, {"date": "14 Oct 2016", "title": "Patient Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Phoebe Putney", "Interview Descriptions": "He was very easy he asked me questions I already have a direct answer to because I done this type of work.  It was a phone interview and if you fit for the job they would send you a email telling you what the next process of the interview and hiring process. But for what I hear it sound like a great company to be part of", "Interview Questions": "Why u want to work for this company"}], [{"date": "14 Apr 2020", "title": "Senior Internal Auditor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Phoebe Putney (Albany, GA) in May 2016", "Interview Descriptions": "Interview was pleasant, professional, about one hour. I have had dozens of interviews over the years. Lots of experience in this process. I have worked over 45 years in business, finance, auditing, tax, inventory etc.", "Interview Questions": "How many years auditing (25)"}, {"date": "13 Nov 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Phoebe Putney", "Interview Descriptions": "Online application then wait FOREVER to hear anything either way.  If you are \"over qualified\" you should \"dumb down\" your application to meet their requirements or you won't be considered.  It is more in WHO you know rather than WHAT you know.", "Interview Questions": "Typical questions about strengths and weakness, how to you handle problems with patients/co-workers, management, etc."}, {"date": "7 Oct 2015", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Phoebe Putney", "Interview Descriptions": "I was interviewed by the potential managers, nice enough. An offer was made, offer accepted, then offer rescinded due to a hiring freeze AFTER I had put in my notice at my other job, purchased uniforms, done my drug test.", "Interview Questions": "Can you handle multiple priorities?"}, {"date": "15 Sept 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Phoebe Putney (Albany, GA) in Mar 2015", "Interview Descriptions": "After applying for the job, I was promptly sent an email requesting I set up a phone interview with a recruiter. It is about 30 minutes in length, and was easy to do. Very low key and the recruiter was able to answer lots of questions right away. This is important if you want to find out what all the job entails if you are on the fence deciding if this position would even fit into your personal needs.", "Interview Questions": "Give me an example of a time you went above and beyond for a patient?"}, {"date": "5 Nov 2014", "title": "RPH Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Phoebe Putney", "Interview Descriptions": "Very laid back.  Interviewed with several people and the process took about 6 hours.  The questions were not hard, just basic get to know you information.  The people were nice and friendly.  HR person went over all the benefits right after interview was over.", "Interview Questions": "What is your interest?"}, {"date": "21 Jun 2015", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Phoebe Putney in Feb 2014", "Interview Descriptions": "Behavioral questions after survey taken over the internet. Next they \r\nCalled in for interview. Took about 30 minutes only one person in interview. recruiter called a week later with offer. Negotiations took place and eventually got the salary I needed to leave current job. I was satisfied with it.", "Interview Questions": "How many times were you late in the last 3 months."}, {"date": "21 Nov 2015", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Phoebe Putney (Albany, GA) in May 2013", "Interview Descriptions": "There was a nice group that participated in the interview. The staff seemed nice and the interview process was fairly straightforward. The team seemed to be very interested in how well I could help with managing productivity, and seemed very uptight about the financial management aspects of the role.", "Interview Questions": "What kind of performance improvements was I participating in currently."}, {"date": "16 Aug 2015", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Phoebe Putney (Albany, GA) in Nov 2011", "Interview Descriptions": "Talked with manager about employment history, filled out paperwork! I met staff on unit. Took drug calculation test. Talked with human resources. Wendo nursing residency classes. Went perinatal classes. Met with preceptor. Worked secretary for admission information.?", "Interview Questions": "Experience"}, {"date": "1 Oct 2015", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Phoebe Putney (Albany, GA) in Jan 2011", "Interview Descriptions": "Received call from recruiter.  Scheduled an onsite interview.  Met with Department Head initially.  Later in the day met with the team of analysts. The questions were hypothetical what ifs for things that did not apply to the actual position.  There was no clarification for the questions so you had no indication you were answering it they way it should be answered.", "Interview Questions": "If you had a doctors appointment but a crisis arose right before you were supposed to leave, what would you do?"}, {"date": "27 Jul 2014", "title": "Patient Safety Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Phoebe Putney (Albany, GA) in Jun 2010", "Interview Descriptions": "The interview process is somewhat drawn out. From the time a resume is submitted the process typically takes about 6 to 8 weeks. In my case it was 10 weeks. There is an initial phone interview with the recruiter. This was followed by group interviews with the Chief Operating Officer, Chief Nursing Officer and Chief Medical Officer. A week later I was scheduled  interviews with hospital directors of nursing, followed by a group interview with 4 members from the Risk Management team, followed by Quality, and frontline staff. The culture is interesting - Patient Safety is promoted from the CEO, COO, & CMO, the CNO is less concerned and focused on productivity.", "Interview Questions": "Aside from conducting the typical organizational survey, please identify specific steps you would take to improve the culture of safety, for inpatients, outpatients, visitors, and staff."}]]