[[{"date": "22 Jul 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bayfront Health", "Interview Descriptions": "I signed up to interview at their job fair and it was very organized and set up well. I was able to tell them what department I was interested in interviewing with and left with a job offer.", "Interview Questions": "Asked about my background in nursing "}, {"date": "6 Oct 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bayfront Health", "Interview Descriptions": "A Nurse Recruiter contacted me for a phone interview.  Discussed areas of experience and my interest.  Discussed pay rate that I was looking for also.  Second interview was with Unit Director.", "Interview Questions": "Please tell me about your clinical experience."}, {"date": "28 Apr 2021", "title": "Medical Laboratory Scientist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bayfront Health", "Interview Descriptions": "The interviewer was a 2nd shift manager and asked the basic questions- where do you see yourself in 5 years, etc. It was basically a shoo-in. We sat in her office and it was fairly informal/not stressful. The interviewer wasn't the most personable but wasn't overbearing.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "9 Feb 2021", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bayfront Health (Saint Petersburg, FL) in Feb 2021", "Interview Descriptions": "I applied for the position over indeed. I received a call from the supervisor 2 months later to set up a date and time that I could interview. The interview took place in person and it was a panel style with three people. I had a chance to ask question as well as answer some.", "Interview Questions": "What made you choose Bayfront hospital?"}, {"date": "22 Jul 2021", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Bayfront Health (Punta Gorda, FL) in Feb 2021", "Interview Descriptions": "Interview initially was on the phone, then led to an in person interview, it bought It went well, but it took almost 2 no this from initial interview to actually being in orientation, but they’re so understaffed and are trying to hire people quickly, yet it took 6 weeks to get someone even just into orientation?", "Interview Questions": "Just average “tell me about yourself and education” questions"}, {"date": "4 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bayfront Health", "Interview Descriptions": "the interview process was fairly easy, long but easy. there was a lot of onboarding paperwork to fill out and tests but they're passable. Make sure you are dressed appropriately and look very presentable.", "Interview Questions": "why do you want to work for this hospital?"}, {"date": "13 May 2020", "title": "Monitor Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Bayfront Health (Spring Hill, FL) in May 2020", "Interview Descriptions": "I was called by a recruiter as well as the manager.  Our contact went back n forth for more than 1month(due to COVID19). Finally I had an interview by phone. It was a standard interview.", "Interview Questions": "I was asked rather specific questions.  'Describe a situation where you had conflict w another employee ' ' Reveal a time of professional success & also a disappointment ' "}, {"date": "23 Nov 2019", "title": "Phlebotomist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bayfront Health (Port Charlotte, FL) in Nov 2019", "Interview Descriptions": "The interview process went through the basic qualifications for the job and a questionnaire to check to make sure that I knew what information I need to know about phlebotomy already without training. And my interview is done by Cynthia who is very professional and very informative and make sure that she answered every question that I have.", "Interview Questions": "How do you handle a difficult patient?"}, {"date": "21 May 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Bayfront Health (Tampa, FL)", "Interview Descriptions": "First interview in on the phone with a recruiter, then in person with the director of nursing and final one with CNO. Overall experience was good, one of the better interviews I have had.", "Interview Questions": "What was your clinical experience like?"}, {"date": "28 Jan 2019", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Bayfront Health (Punta Gorda, FL)", "Interview Descriptions": "Initially spoke with recruiter. Scheduled of onsite interview. Interview was normal nursing interview with floor manager, behavioral questions, no clinical questions. Interview was not the most professional. HR extended offer but I declined.", "Interview Questions": "Describe what you can do to make patient experience better"}], [{"date": "16 Sept 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bayfront Health (Brooksville, FL)", "Interview Descriptions": "interviewed by the director of the floor, not a panel of 3 or more like I’ve had at other interviews so it was much more comfortable for me. Got a call the same afternoon from HR offering me a position.", "Interview Questions": "Did you ever have a coworker you didn’t get along with and how did you handle it."}, {"date": "19 Sept 2018", "title": "Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Bayfront Health in Jan 2018", "Interview Descriptions": "1st round by phone. 1st interview was positive, almost leading in a positive sense. 2nd round in person with multiple managers/executives. Agenda for the second round included several physicians who “no showed” for their portion. Left sitting in a conference room waiting for over an hour before someone could say they wouldn’t be coming. Obviously not a good fit.", "Interview Questions": "What is your leadership style?"}, {"date": "30 Dec 2017", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bayfront Health (New York, NY)", "Interview Descriptions": "I met with  human resource personal, then I met with the department director. I was able to meet with additional staff to see the process and personality of the department.", "Interview Questions": "Typical experience questions based on experience and skills."}, {"date": "17 Jan 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Bayfront Health", "Interview Descriptions": "I was accepted into the residency program prior to officially being hired to a floor. The interview process was first a phone interview, then a group interview. They asked the typical interview questions and where I see myself in 5 years. Also to answer basic RN critical thinking questions.", "Interview Questions": "What are your 5 year goals?"}, {"date": "29 Aug 2016", "title": "MHT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Bayfront Health", "Interview Descriptions": "I had applied in May of 2014 and was interviewed in July of 2014. Interview was fairly laid back and relaxed. Was interviewed by Director of Nursing. Interview process was quick and easy and I was hired on the spot. Going through HR took the longest, nearly a month, and then it was followed by a week long orientation as well as precepting on the unit. Overall I was pleased with the process!", "Interview Questions": "Why do you want to work for Bayfront?"}, {"date": "7 Aug 2018", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Bayfront Health in Feb 2016", "Interview Descriptions": "Receive call from hiring manager.  Brief telephone conversation, set-up time and date for face-to-face interview.  Met with manager, clinical manager and physician.  Tour of facility and expectations of job.", "Interview Questions": "Explain a difficult work situation and how you handled it."}, {"date": "1 Oct 2015", "title": "Clinical Nurse Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at Bayfront Health", "Interview Descriptions": "I'm an out of state applicant. Applied online at night and called by the nurse recruiter the next morning. I was asked with few questions which I thought was already a short interview then I was told to wait for another call from the HR within that day but I was emailed by the HR the next morning. I was then asked to have a phone interview 4 days later. After that, I was asked to have a face to face interview with the nurse managers after a week. During my interview there were like 8-10 interviewers, mostly nurse managers. Since I was an out of state applicant, the HR called and told me about the positive feedback and was offered the job the day after my interview.", "Interview Questions": "Why did you choose Florida?"}, {"date": "17 Feb 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bayfront Health (Saint Petersburg, FL) in Jun 2015", "Interview Descriptions": "it was a group interview where 5 manager formulate questions. the questions where the typical questions you find in the internet. the long of the interview was around a hour. the total of question where around 6 or 7 questions. the last question was a clinical scenario where they give 4 different options and you have to select them in order of importance. ex: what pt you will see first, and why.", "Interview Questions": "why do you want to work here?"}, {"date": "31 May 2015", "title": "Cath Lab Technologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Bayfront Health (Charlottesville, VA) in May 2015", "Interview Descriptions": "Phone interview then a personal come to department talk to manager .Then supervisor then staff .Then back to managers office talk some more about there were there going as a hospital and a department, aked about strenghs and weakness , what responsibly did I have before.WHat I thought of there department did I like it or not.", "Interview Questions": "How would you handle a stressful situation."}, {"date": "7 Jun 2014", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Bayfront Health", "Interview Descriptions": "First, an HR representative contacts you and you go through a phone interview. Next, a face to face interview, followed by orientation. Overall, the hiring process is very easy and not stressful. HR employees are very friendly and answer any questions you may have about the company, compensation, advancement, requirements, etc.", "Interview Questions": "N/A"}], [{"date": "19 May 2016", "title": "Per Deim RRT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Bayfront Health (Spring Hill, FL) in Mar 2014", "Interview Descriptions": "Met with day shift supervisor, director and two staff members, had an open discussion about experiences, my work history, job expectations and questions regarding hospital. Answered several questions regarding skills without difficulty", "Interview Questions": "What type of experience do you have? Do you like working in ICU, ER and NICU. Describe your experience in areas, communication style, work ethic."}, {"date": "18 Feb 2014", "title": "Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Bayfront Health (Saint Petersburg, FL) in Jan 2014", "Interview Descriptions": "applied online. called one week later. phone interview at 7am ~45min, offered a face to face for one week later. told to bring 7 resume packets:  resume, recommendation letter,unofficial transcripts. small semi-tour on the wat to the conference room. 6 person panel at a small rectangle table (intimidating!!!)", "Interview Questions": "Priority: who would you tx 1st? pt. w/ BG 60, pt. w/ RR 26,or pt. w/ HR 120?"}, {"date": "13 Apr 2016", "title": "Clinical Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Bayfront Health (Port Charlotte, FL) in Sept 2013", "Interview Descriptions": "this was an internal transfer. I filled out the transfer request and accepted an interview. The interview was with 5 staff members, 3 of which we used Skype.  Every person had different questions to ask. I was given an opportunity to ask questions as well. The interview was somewhat intimidating since it was with 4 corporate employees.", "Interview Questions": "How do you handle multiple things that need completed."}, {"date": "3 Mar 2013", "title": "School of Medical Technology Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Bayfront Health (Saint Petersburg, FL) in Jan 2013", "Interview Descriptions": "Application and school transcripts were due to the hospital by December 31. I received an e-mail stating the application was complete 2-3 days later. During the first or second week of January I received an e-mail inviting me to interview and giving me a choice of interview time. I replied within 30 minutes and was given my second choice of times. \r\n\r\nThe interview included a lab tour (that took up 90% of the time I was at the hospital). I met the director of the lab, who gave the tour, and three of the instructors (that conducted the one on one interview). I was also sent over to All Children's lab where I took a tour and answered some questions from their lab director. The BayFront director was not overly inquisitive (I suppose she left the question asking to the instructors) and the questions asked at the sit down interview were typical. I felt like I adequately answered the questions and I made it clear that I would love to work with them to further my education. \r\n\r\nThe deadline to let applicants know of their acceptance was March 1st and I was e-mailed at 7:34am that morning offering me a spot in the upcoming medical technology school class. \r\n\r\nA close friend at the affiliated University we both attend was e-mailed at approximately 11am, informing her that she was an alternate for the school. \r\n\r\nThe staff at the School of Medical Technology are professional and organized. They do what they say they will, when they say they will.", "Interview Questions": "I was asked \"what am I not going to like about you\". It was a completely honest question but one that threw me for a loop as it is bluntly honest and pretty unexpected. "}, {"date": "1 Jun 2014", "title": "RN II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Bayfront Health (Saint Petersburg, FL) in Feb 2010", "Interview Descriptions": "Met with nurse manager and we spoke about my previous experience in oncology both adult and pediatric. She ask me why I was wanting to make a change. The interview process was very relaxed and I felt we both were very comfortable taking with one another. At the end of the interview she made me an offer to come work for her along with a salary quote that was to good to turn down and I accepted on the spot.", "Interview Questions": "There were no awkward or unexpected questions that I encountered. I had a good vibe and a excellent interview process."}]]