[[{"date": "28 May 2023", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Middlebury College (Middlebury, VT) in Apr 2023", "Interview Descriptions": "I applied online and was called for a screening interview a few weeks later. The interview was easy and I thought it went well, but I did not receive any follow up. I emailed the hiring manager for an update and she responded with a rejection.", "Interview Questions": "How would you convince a prospective student that the Middlebury programs are unique?"}, {"date": "23 Sept 2021", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Middlebury College", "Interview Descriptions": "Great learning opportunity, helpful colleagues for onboarding, flexible scheduling to prioritize school, great for IEM students to gain practical work experience alongside relevant coursework.  Was interviewed first with directors and was then asked to meet director and one associate informally for a second meeting", "Interview Questions": "tell me about your interest in..."}, {"date": "20 Feb 2022", "title": "ITS Help Desk Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Middlebury College (Monterey, CA) in Aug 2021", "Interview Descriptions": "After sending over the application to work on campus, I was contacted to go through an interview with my supervisor. He was happy with my performance, and we started to process for hiring.", "Interview Questions": "I was sent a Google Form with some questions that usually come up at the ITS Helpdesk and I tried to reply how I would have solved the issues or researched about them during the interview."}, {"date": "26 May 2021", "title": "Athletics Operations Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Middlebury College", "Interview Descriptions": "Interview process was not too difficult - met with several members of team before finally meeting with team leads. Discussed position, discussed my background, discussed what options are available in the  future.", "Interview Questions": "Please describe your background and how that realtes to the position"}, {"date": "29 Apr 2023", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Middlebury College (Middlebury, VT) in Feb 2021", "Interview Descriptions": "Fair, easy work. The interviewer was very nice and we were able to find hours that worked around my busy schedule and classes. Good experience, would do again! Thanks midd, yay!", "Interview Questions": "What classes are you taking"}, {"date": "14 Jan 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Middlebury College", "Interview Descriptions": "questions about level of understanding w software and experience in the field. why are you interested in this position. talk about levels of detail. they gave you open questions where you could talk about a variety of experiences and why they might have applied or will be beneficial to the job", "Interview Questions": "what experience do you have with GIS software"}, {"date": "19 Feb 2021", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Middlebury College (San Francisco, CA) in Jan 2020", "Interview Descriptions": "Alumni interview was thought-provoking and difficult—interviewer asked me how I would solve homeless problem in San Francisco. Had a fantastic talk about urban sustainability and climate change. Interviewer seemed to be looking for creativity, ability to communicate, and swiftness in thinking.", "Interview Questions": "How would you approach the homeless crisis in San Francisco?"}, {"date": "28 Dec 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Middlebury College", "Interview Descriptions": "There was basically no interview process beyond talking to professors and reaching out. Developing a strong relationship with professors is key. By early Spring semester I knew I had a job.", "Interview Questions": "When can you work?"}, {"date": "9 Apr 2018", "title": "MA Student and Student Employee Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Middlebury College (Monterey, CA)", "Interview Descriptions": "It was advertised as a 30 minute interview, but consisted of an official 10 minute 2-question part and a Q & A, where the interviewed could ask questions. The interviewer was taking notes throughout to consequently share with the rest of Admissions office. In some cases, I was asked to restate my answer to be more clear.", "Interview Questions": "Tell me about the three experiences and connect them to a skill you learnt from each one."}, {"date": "22 Jan 2018", "title": "Film Department Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Middlebury College", "Interview Descriptions": "There was no formal interview. My professor offered the job and I got the job through staff referral. It would be really helpful if you have internal connection to the college and you would get to the latest updates about available positions", "Interview Questions": "Are you interested in working for FMMC?"}], [{"date": "11 Nov 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Middlebury College (Monterey, CA) in Jan 2018", "Interview Descriptions": "I submitted required documents, and waited for the result. There were 20 people in the candidate pool. It was a fair and straightforward process. Did not took too much time.", "Interview Questions": "No questions at all."}, {"date": "28 Jan 2019", "title": "Stockroom Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Middlebury College (Middlebury, VT) in Sept 2017", "Interview Descriptions": "Applied through the student Middlebury job page. Submitted a resume and cover letter. I met with Betsy Nesbitt who was initially the stockroom head and hygiene officer. I then talked with her and had a casual interview then we decided on hours and I began training and working.", "Interview Questions": "Met with head of the stockroom and chemical hygiene. Was asked questions about my resume and how those past jobs would help me in my current position. Why I care to have this job and what it would mean to have this job"}, {"date": "2 Jun 2017", "title": "Assistant Director of Annual Giving Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Middlebury College (Middlebury, VT)", "Interview Descriptions": "One on one interview with the director, then a group interview with the whole team (8-10 people). Finally, brief one on one interviews with AVPs. Everything was quite informal and comfortable. I got the sense that they treated all applicants who made it to the interview process with the utmost respect.", "Interview Questions": "Describe an obstacle you've overcome and what that taught you.."}, {"date": "20 Apr 2017", "title": "Assistant Director of Annual Giving Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Middlebury College", "Interview Descriptions": "Met with the entire advancement staff. I was given an inside view of the school and the expectations of the job. The half day interview gave me plenty of opportunities to ask questions as week as express my thoughts and viewpoint on important fundraising issues.", "Interview Questions": "What do you see as one of the most important characteristics of a successful fundraiser?"}, {"date": "23 May 2021", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Middlebury College (Middlebury, VT) in Mar 2017", "Interview Descriptions": "Began with a online panel of interviewers from the department. Questions were fair, focusing on teaching philosophy and style. On a campus visit, there wasn't a meeting with the committee, instead, a series of visits to the dean, other faculty, etc. They did ask for a 30-60 min teaching demo which was wide open in terms of topic.", "Interview Questions": "What are your thoughts on the future of your field? "}, {"date": "28 Mar 2017", "title": "Summer ESL Program Activity Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Middlebury College (Monterey, CA) in Mar 2017", "Interview Descriptions": "I had a 30 mins, in-person interview two weeks after I summited the application. The interview went very well. \r\n\r\nThe interviewer was friendly. No hard questions. I started by a short introduction about myself and the interviewer asked questions based on my backgrounds. \r\n\r\nAt the end of the interview, the interviewer spared 5 mins to answer my questions about the position. \r\n(Prepare 1-3 questions before hand!)", "Interview Questions": "What makes you qualify for this position? "}, {"date": "10 Jan 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Middlebury College (Monterey, CA) in Feb 2017", "Interview Descriptions": "I received a n auto-reply after submitting my application. A schedule of interview dates came a week later detailing the steps and requirements. It was a  3-man panel which lasted for about 30 to 45 minutes. I got an email a week later with  the news of being hired.", "Interview Questions": "Why do you want to work with us?"}, {"date": "5 Feb 2017", "title": "Graduate Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Middlebury College (Monterey, CA) in Jan 2017", "Interview Descriptions": "There's a screening process after the application email (cover letter & resume). Based on that screening process they will follow-up with an e-mail and decision regarding status of invitations to interview. Then there's an interview where you expect four nice interviewers.", "Interview Questions": "1. self-intro and why you're interested in working for DLC? \r\n2. Describe your strengths and weaknesses. \r\n3. How do you know about DLC? \r\n4. Have you ever encountered a situation where someone ask you questions to which you don't have a clear answer? How do you deal with that? \r\n5. Have you ever initiated a project and how did you work it out? \r\n6. Imagine there's a 5-minute workshop where you're supposed to teach us something, pick whatever subject you want to teach and start when you're ready (you can use whiteboard or the screen). \r\n7. What challenge do you think MiddCreate is confronted with and do you have any plan to overcome it? \r\n8. What do you want to learn from us?"}, {"date": "16 Dec 2018", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Middlebury College (Middlebury, VT) in Jan 2017", "Interview Descriptions": "Phone and in person. Meetings with members of the team. Very conversational. Looking for good fit within the team. The interview process is not intense, although you are in pool of highly  qualified candidates.", "Interview Questions": "Personality and experience.  What you hope to gain from the role and why you want to participate in the team and in the role in general.  What you bring to the table. How  you are a dynamic problem solver. How you will contribute to the community, "}, {"date": "31 Jul 2016", "title": "Media Services Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Middlebury College in Apr 2016", "Interview Descriptions": "I was contacted within two weeks of applying. First with a phone interview, which consisted of some quizzing on technical vocabulary, problem-solving, and personality-based questions. This was followed by an in-person interview with several members of the team. This stage mostly consisted of dozens (!) of rapid-fire problem solving questions designed to see how a candidate handles stressful situations, might teach a somewhat complex topic to a layperson with nothing more than a laptop and whiteboard, and (I think) to gauge how their overall personality matches the Middlebury culture.\r\n\r\nThe in-person interviews were concluded quickly, and within a week of the second interview I was offered the position.", "Interview Questions": "A professor wants to sit at the back of a large classroom while giving a presentation from his laptop, using a single long HDMI cable to connect to the podium at the front of the room. He calls you, complaining that he can't get 1080p to output from his laptop to the projector. How do you solve the issue?"}], [{"date": "16 Nov 2015", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Middlebury College (Monterey, CA)", "Interview Descriptions": "The interview was a meeting with three professors to answer a list of pre-approved questions and also a few additional questions selected by the interviewers. The interviewers were professional and friendly. It also seemed that the interviewers really knew their subject matter - like it would be great to work with them.", "Interview Questions": "What is a challenge you've previously had to overcome in teaching a difficult course?"}, {"date": "4 Feb 2016", "title": "Research Associate/Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Middlebury College (Middlebury, VT) in Nov 2015", "Interview Descriptions": "I applied online. Received a callback within two weeks. Set up an interview the following week. The usual questions: Strengths/Weaknesses, experience, hypothetical situations etc. Overall the interview was relaxed. I was told the interview shouldn't be more than 30 minutes, but we went an hour. I met with two department heads, both asked questions and were very nice and professional.", "Interview Questions": "You've worked for yourself for a number of years.  How would you do having a boss?"}, {"date": "22 Jul 2015", "title": "Middlebury Dining Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Middlebury College", "Interview Descriptions": "I wasn't really interviewed. I friend brought me in to her manager and introduced us. The manager asked how old I was when I would be available to work. Then he simply told me to fill out an application online that night so he could call me the next day and discuss when I could start.", "Interview Questions": "How old are you?"}, {"date": "24 Mar 2016", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Middlebury College (Monterey, CA) in Mar 2015", "Interview Descriptions": "It was a decent arrangement, starting with meetings with peers and then went through the whole nine yards: discussing with the dean, chatting with faculty members individually and as a group, then discussing with the administrative personnel. Of course, Monterey style lunch is a must have which was nice. Feelings and the altitude are very friendly.", "Interview Questions": "What is your response to the teaching challenges facing the new generation students who pursue the international job opportunities?"}, {"date": "23 Sept 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Middlebury College (Middlebury, VT) in Mar 2015", "Interview Descriptions": "Set up a meeting with professor and talked over what I could bring to a project, submitted a copy of my resume and did some prior research on the project I was applying to work on.", "Interview Questions": "What relevant research experience do have?"}, {"date": "20 Feb 2014", "title": "Graduate Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Middlebury College", "Interview Descriptions": "One one-on-one interview asking about my leadership skills and how I handle deadlines and pressure.", "Interview Questions": "N/A"}, {"date": "5 Jan 2016", "title": "Circulation Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Middlebury College (Middlebury, VT) in Jan 2014", "Interview Descriptions": "It was really relaxed and comfortable. Didn't need much experience in customer service to work at the libraries. The employer was also very kind and friendly. We had an easy conversation about the responsibilities and what to expect. The job doesn't demand much and is very flexible. The entire workplace is very inviting.", "Interview Questions": "What is your experience in customer service?"}, {"date": "25 Oct 2013", "title": "University Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Middlebury College (Middlebury, VT)", "Interview Descriptions": "Very nicely organized yet informal and friendly.", "Interview Questions": "Workplace challenges"}, {"date": "11 Aug 2013", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Middlebury College (Middlebury, VT)", "Interview Descriptions": "It was a great straight forward experience that  lasted 48 hs on campus with different committees conformed of staff, students and faculty.", "Interview Questions": "How do you design an interesting literature class for students that lack the language skills?"}, {"date": "15 Jan 2016", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Middlebury College (Middlebury, VT) in Sept 2012", "Interview Descriptions": "I submitted my resume and sat down for a formal interview with the director and associate director. The questions were mostly focused around what my academic and professional interests were and what I thought I could contribute to the team.", "Interview Questions": "What are your research interests? "}], [{"date": "20 Jun 2011", "title": "Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Middlebury College (Monterey, CA) in Mar 2011", "Interview Descriptions": "Great process - excellent planning and good interview process. All team members were involved in interview. It seemed that the organization knew what it was looking for and sought out specific qualities in candidates. I felt welcomed at all levels and was eventually offered the job. The package was excellent and required no negotiating - that is the first time that has happened to me. I believe that this employer is very competitive with salary and other benefits. No hesitation about accepting this great position.", "Interview Questions": "After working at X large university, why do you want to come here?"}]]