[[{"date": "22 Jun 2023", "title": "Sr Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellstar Health System (Atlanta, GA)", "Interview Descriptions": "Several 1:1 along with panel interviews. Interviews were structured but welcoming and positive team and interview experience overall. Description of the job and day-to-day were somewhat vague but that may be a result of the broad scope of the role.", "Interview Questions": "What is the one 'superpower' you bring to a team?"}, {"date": "1 Jun 2023", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Wellstar Health System (Kennesaw, GA)", "Interview Descriptions": "Was quick and didn’t take much time at all. Talked to all the providers that I would be working with and the job process was explained thoroughly. The process was easy", "Interview Questions": "Previous work experience and what if situations"}, {"date": "7 Jun 2023", "title": "Sr Consumer Voice Research Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in Jun 2023", "Interview Descriptions": "Applied through the WellStar careers website on a Monday. By the next day, a recruiter reached out to schedule a screener. Did the screener a few days later, then was invited to a second interview with the hiring manager & another Sr Research Analyst. I felt that interview went extremely well, and I seemed to have a rapport with both people. Was invited to a third interview about 2 weeks later, and that was with 2 C-Level members of the Catalyst venture. Had the interview on a Monday, and it was very difficult. Received questions that had nothing to do with the job or role, but rather were to assess critical thinking. See some of the sample questions below. I definitely struggled and was outmatched in the third interview - it was not what expected, and it was impossible to prepare for. Found out yesterday (a day later) that I was not selected to move on. It's a shame because the role would have been prefect for me.", "Interview Questions": "Q: \"We are going to give you a scenario. We've had feedback that our ER is overflowing with people. How would you go about redesigning an ER flow model to make it more efficient?\""}, {"date": "23 May 2023", "title": "Certified Nurse Aide Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "Fairly easy . The interviewer only asked questions pertaining to my medical background. She was nice and very attentive . I was told after the interview that I had a job", "Interview Questions": "Basic info about past work experience"}, {"date": "9 May 2023", "title": "RRT/RCP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wellstar Health System (Austell, GA)", "Interview Descriptions": "There was no interview. I was transferred due to closing of Wellstar AMC back in 2022. I had the option to choose another location, so I chose Austell as it is the closet to home.", "Interview Questions": "Transferred due to AMC closure"}, {"date": "3 May 2023", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Wellstar Health System", "Interview Descriptions": "The interview process was pretty lengthy until I found a contact to help push my application forward. Be sure to find out who hiring manager is and send a brief email to express your interest.", "Interview Questions": "Can you handle high volume?"}, {"date": "9 Jun 2023", "title": "Liaison Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Wellstar Health System (Marietta, GA) in May 2023", "Interview Descriptions": "The interview was very good overall. The manager gave me all the details about the company and the job which was required of me. She also asked me about what would make me a great employee l", "Interview Questions": "How do I deal with conflict"}, {"date": "25 Apr 2023", "title": "Contracts Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System (Marietta, GA)", "Interview Descriptions": "Quick and easy. Two interviews, the first one was better than the second. The first interview was with one person and the second one was with two or three people. Both interviews were ok, but I never heard back from them.", "Interview Questions": "Standard questions. They kept asking about volume."}, {"date": "17 Apr 2023", "title": "Medical Technologist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Wellstar Health System (Atlanta, GA)", "Interview Descriptions": "The interview was very impersonal. You usually go through 2 short interviews. They asked about very basic questions, like where you live, how you commute, and what your availability is. One question they asked was what you think good healthcare is all about.", "Interview Questions": "My experience in the different place I have worked."}, {"date": "14 Jun 2023", "title": "Cerified Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Birmingham, AL) in Apr 2023", "Interview Descriptions": "Very Smoot and simple. After your first interview they set you up with a second interview which is on a teams meeting panel style after that if they select you you’ll know in about 3-4 days.", "Interview Questions": "What purple color tube is used for"}], [{"date": "20 Mar 2023", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Wellstar Health System", "Interview Descriptions": "I waited in the waiting room for about 5-10 minutes and then was brought back to the manager's office. She went over my resume and asked me typical interview questions.", "Interview Questions": "Why do you want to work for Wellstar? Why do you want to be a medical assistant? What are your strengths/weaknesses?"}, {"date": "18 Mar 2023", "title": "Strategy Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "Phone interview with recruiter that was very one-sided. It was basically a verbal application for the position where you simply confirmed the answers you had on your submitted application. This was followed up by an zoom interview with one of the VPs from the department.", "Interview Questions": "Tell me about how you've developed / executed long-term growth plans."}, {"date": "1 Mar 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System", "Interview Descriptions": "Interview process was fair and fairly quick! Heard back the same week after one round of interviews. Also was able to negotiate, so new grads don’t be ashamed or afraid to negotiate!", "Interview Questions": "Tell me why you chose nursing? How would you describe or teach something to a patient ?"}, {"date": "20 Mar 2023", "title": "Certified Medical Assistant (CMA) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Wellstar Health System in Mar 2023", "Interview Descriptions": "Two Zoom interviews, call with coworkers, wait on Talent Requisition. No call, found out I was not selected through their dashboard. The manager was very engaging and nice. Connected with one of the coworkers over the phone, the other sounded like she was in a hurry to get off of the phone. I miss in person connection.", "Interview Questions": "Would I be flexible to work in the other clinics offered"}, {"date": "13 Feb 2023", "title": "Customer Service Representative (CSR) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "Wasn’t good at all. Felt like the person interviewing me was rushing and wasn’t really paying attention to anything I was saying. Never putting another app in for wellstar ever", "Interview Questions": "Why I wanted to work for wellstar"}, {"date": "21 Mar 2023", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Wellstar Health System in Jan 2023", "Interview Descriptions": "Received an email initially stating that I was selected to be interviewed for the position. After I received the email I was then called and interviewed. I was asked basic interview question and then was told that I would receive a call back if they wanted to move forward.", "Interview Questions": "Tell me a little about yourself"}, {"date": "29 Nov 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "The interview process was unlike anything I have ever experienced. There were 5 hiring managers, 3 floors or units represented. Each person took turns asking questions and then I was allotted time to ask questions. It was interesting process and I worked there for many years.", "Interview Questions": "Why did you become a nurse?"}, {"date": "10 Nov 2022", "title": "Front Office Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Wellstar Health System (Marietta, GA) in Nov 2022", "Interview Descriptions": "In my opinion Fast, friendly, & efficient turn around time from the first interview to start date. Clear communication & expectations. Time between first interview to second interview happened pretty quickly.", "Interview Questions": "Are you a team player? What is customer service to you?"}, {"date": "18 Oct 2022", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "The interview process was very easy and the office manager was very easy to speak with. I can honestly say I would apply again if I could. I think all office managers should take a small lesson from her.", "Interview Questions": "What are some good points about yourself?"}, {"date": "11 Sept 2022", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "Tour, clinical questions, contact the recruiter, spoke with them and they set up an interview, met team lead, received a call a week later. Overall it was a standard interview process Glad I got to work for them", "Interview Questions": "Clinical questions, scenarios, I was a new grad"}], [{"date": "9 Sept 2022", "title": "Lab support Phlebotomist  Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System", "Interview Descriptions": "Zoom style interview. A lot of questions about your experience as a Phlebotomist. Fast interview. Only lasted about 30 mins. I had three lab managers interviewing me. A bit overwhelming but manageable.", "Interview Questions": "Tube order of draw. Detailed blood culture collections."}, {"date": "4 Oct 2022", "title": "Medical Laboratory Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Wellstar Health System (Atlanta, GA) in Sept 2022", "Interview Descriptions": "The interview process was not difficult. The professionals that I interviewed with were knowledgeable and friendly. They had great questions and it felt more like a conversation. It lasted less than 1 hour.", "Interview Questions": "Tell me about yourself. Explain how your experience fits with the position."}, {"date": "15 Aug 2022", "title": "Patient Safety Sitter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System in Aug 2022", "Interview Descriptions": "Interview was short direct and to the point. No intimidating question while also being very thorough. Everything was explained about the role and the culture and environment of the work place.", "Interview Questions": "What experience do you have relating to the offered position?"}, {"date": "25 Aug 2022", "title": "Ekg Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System (Austell, GA) in Aug 2022", "Interview Descriptions": "Interview process was easy… wasn’t asked many questions… only went over the things on my resume and talked about the position. Gave me a tour of the unit, met everyone on the team. Acted as if I had the position during the interview and told me they would me calling me by next week once they get a actual start date situated and never heard back.", "Interview Questions": "Tell me about yourself? Have you ever used Epic?"}, {"date": "28 Jan 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Wellstar Health System in Aug 2022", "Interview Descriptions": "Easy. Complete the personality questionnaire during the application process then wait to hear from a recruiter. The recruiter will do a phone screen and match either to the position you applied for or another available position they have. The final step is the interview with the hiring manager and/or team. If they decide to offer you the position, the recruiter reaches out with the offer letter within 1 week and if/when you accept, you get an onboarding team to walk you through the next steps.", "Interview Questions": "Relevant, recent experience and willingness to do the job."}, {"date": "24 Oct 2022", "title": "Front Office Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellstar Health System in Aug 2022", "Interview Descriptions": "It Is A Timely Process Waiting To Onboard. But Recruitment Officials Are Nice. Over All It Seems Like A Really Great Place To Work. The Staff Was Kind Tge Supervisors I Met Were Very Helpful.", "Interview Questions": "Experience In The Field And Customer Custody Questions."}, {"date": "30 Jul 2022", "title": "Certified Medical Assistant (CMA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System", "Interview Descriptions": "The interview was virtual and very professional. I was very impressed by how organized wellstar was. The talent hr representative was in constant communication through phone and email to make sure my forms were completed.", "Interview Questions": "What is the reason you want to be a MA at wellstar. "}, {"date": "25 Jul 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System", "Interview Descriptions": "First step was a phone screen and then you were invited for a interview via webex. Interview consisted of “Tell me when” and why are you interested in the position. If hired, you would pick a day to come in and have a tour of the office.", "Interview Questions": "Tell me a time when you dealt with a difficult coworker and how did you handle it? "}, {"date": "11 Jun 2022", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "Everythinh was Easy and very quick. He didn't ask very much, just about hours and told me a little about the job.After that  he talked about orientation. and how to being working", "Interview Questions": "Asked about my availability and if i has questions"}, {"date": "6 Jun 2022", "title": "Home Health Aide Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "Like any other process it was an in person interview and screening process that require you to share about yourself and how your experience can be used in the job", "Interview Questions": "Tell me about your self "}], [{"date": "8 Sept 2022", "title": "Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Wellstar Health System (Marietta, GA) in Jun 2022", "Interview Descriptions": "Via zoom, pretty casual. I met or exceeded her requirements for the role. Even topics that she assumed I wouldn't be aware of, I explained that I had knowledge of and was currently gaining more experience. I was told I was be excellent for the role. I even went on to interview with the Director then same day.", "Interview Questions": "What do you believe makes you qualified?\nHave you ever had to deal with a difficult situation on your own?\nWould you feel comfortable reprimanding an employee without assistance or supervision? "}, {"date": "23 Jun 2023", "title": "Principal Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System in Jun 2022", "Interview Descriptions": "The interview was pretty intuitive. As long as you are aware of your skill set you should be fine. The interview consisted of verifiable Epic Trainer and MST build skill requirements.", "Interview Questions": "Most difficult situation in MST build."}, {"date": "12 May 2022", "title": "Student Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System in May 2022", "Interview Descriptions": "The interview process was really simple and easy. The interviewer just asked simple questions like why did choose nursing and which field do you want to work in future as a nurse.", "Interview Questions": "Why did you choose to be a nurse?"}, {"date": "29 May 2022", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in May 2022", "Interview Descriptions": "I interview with 3 managers on team’s. They asked alot of questions about customer service, interaction with patients.  They look for flexibility, they were super nice. Interview lasted about 30 minutes.", "Interview Questions": "Explain a time where a patient was up set about an issue with the company "}, {"date": "13 May 2022", "title": "Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Wellstar Health System in Apr 2022", "Interview Descriptions": "I submitted an application on careers.wellstar.org, and received a call from a Talent Acquisition Consultant (recruiter) who asked me about my qualifications, why I wanted to work at Wellstar, my availability, etc. She scheduled me for an interview to take place two days later. In the interview, I met with the unit's nurse manager, who asked me a few questions about my experience, how I handle situations, and more. After discussing the role and it's qualifications, we finished the interview. I received notice that I would be hired, got my offer letter the next day, and started about a week and a half later.", "Interview Questions": "Q: How do you handle difficult interactions with patients?\r\nQ: How do you think past experience will translate into this job?"}, {"date": "10 Mar 2022", "title": "Certified Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "Simple and easy. Asked the expected questions about scenarios.  I was able to get notified of the time and place (online program) in a timely manner so I could prepare. Everyone I encountered was kind and answered all the questions I had about the expected job tasks, work environment, salary and PTO questions. \r\nEnjoyed who they chose to interview me.", "Interview Questions": "What would you do in the situation if a nurse asked you to start an IV?"}, {"date": "17 Jan 2023", "title": "Occupational Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System in Mar 2022", "Interview Descriptions": "They emailed me with a time for a zoom interview. It was ~30 minutes and with the director. She told me about the hospital, how many therapists, etc. Then asked me a lot of questions.", "Interview Questions": "How do you deal with difficult patients?"}, {"date": "15 Feb 2022", "title": "Vice President Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "Many people involved - interviewed with 13 different people. More \"get to know you\" style interview and a good way to get a feel for the people and culture.\nDid not interview with anyone that would eventually be on my team, which I think was a \"miss\" -", "Interview Questions": "Why Wellstar?\nWhere would you begin to build out a strategy?"}, {"date": "25 Apr 2022", "title": "Senior Software Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in Feb 2022", "Interview Descriptions": "Went through a recruiter but was still required to fill out an online application on WellStar's website. You can upload your resume for the application to parse it but it does a poor job of parsing it in the right chronological order. The online application makes it very unclear as to some values are not acceptable and some unrequired fields are required. They require 5 references.\r\n\r\nThis is just a precursor to how bad their interview process is. They expect candidates who can know languages as well as the creators of those languages.", "Interview Questions": "What is the difference between Java and C#?\r\nWhat is the difference between .Net  Core and .Net?"}, {"date": "26 Jan 2022", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "I applied online after filling out the profile. Then I received a call from the recruiter to screen for qualifications. Once qualified I interviewed on the phone with the hiring manager. If you get past this stage, there is a face to face with hiring manger. Should the hiring manager move forward, then a team interview or panel interview with other managers. Once this is complete, then an offer is made.", "Interview Questions": "Why do you want this role?"}], [{"date": "25 Jan 2022", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "Easy enough to do. Some phone call round some in person rounds and finally an offer or decline was made. I didn't get the position but it was an overall decent rxperience", "Interview Questions": "Why do you want to work here"}, {"date": "14 Dec 2021", "title": "Front Office Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "Spoke with a recruiter and she stayed with me until I got an offer and constantly reassured me she wouldn’t give up because there was a spot for me somewhere and we were going to fine it.", "Interview Questions": "Why did you choose to work for wellstar? "}, {"date": "12 May 2023", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Wellstar Health System (Marietta, GA) in Dec 2021", "Interview Descriptions": "Super easy & s t r a i g h t forward interview process. I didn't have any discrepancies. They got me in quick for the intrlerview, but the on boarding process was a little lengthy. It took a whole month to be official.", "Interview Questions": "What are the most common Immunization?"}, {"date": "5 Feb 2022", "title": "Digital Strategist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Wellstar Health System (Marietta, GA) in Dec 2021", "Interview Descriptions": "it was really long and I interviewed with a bunch of people who no longer work there, and then it was another few months before I was brought onto the company", "Interview Questions": "Can you develop in sitecore"}, {"date": "7 Nov 2021", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "It was very laid back. They just wanted to know the basics about you. It was an easy interview. I knew I had the job at the end of it.", "Interview Questions": "How do you handle conflict in the workplace? "}, {"date": "9 Jan 2022", "title": "Customer Service/Collections Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System in Nov 2021", "Interview Descriptions": "Absolutely terrible!!!!! The initial phone screening was ok she was very nice. However, the first interview was set for 11/9/21 at 2pm with Jessica McBride and Julia Jacob. I entered the Microsoft teams chat ready for my interview at 1:30 (if you’re early you’re on time) just for me to sit there until 2:16pm and no one ever showed up. \r\nI immediately send an email apologizing if there was something that I misunderstood or did wrong and got no email response.\r\n\r\n However, the next day someone calls me and sets me up for another interview with Ashley Smith on 11/12/21. I enter the Microsoft teams chat at 2:33pm ready for my 3:00pm interview; no one shows up…again!! So I email Ted Lebeau right away letting them know about the inconvenience and that this was my 2nd time not only showing up early, but being stood up for yet another interview in the same week all by different people! \r\n\r\nTo add icing on the cake, I get a random email after not hearing back from anyone, to fill out my references as a part of the hiring process. So I did that all in a time span of 24-48hours. I follow up with Ted Lebeau again after completing my references just to be ignored and tossed aside like I was through this entire interview process. \r\n\r\nFor someone that actually goes to Wellstar and admired their customer service whenever I do go, this was absolutely the worst interview experience I’ve ever encountered. The lack of communication and professionalism displayed from this team is utterly disgusting and unacceptable. Definitely would not recommend.", "Interview Questions": "There were no questions asked because no one ever showed up to the interview. "}, {"date": "28 Nov 2021", "title": "Trauma Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in Nov 2021", "Interview Descriptions": "1st interview with recruiter, next interviewed with the Director and final interview was a team interview (panel style) I was asked STAR questions by different members of the team. The overall interview process was very comfortable.", "Interview Questions": "Name a time type questions. "}, {"date": "9 Nov 2021", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Wellstar Health System (Atlanta, GA) in Oct 2021", "Interview Descriptions": "The overall hiring process was really quick and to the point…I applied on a Sunday, got a callback on Monday and had an interview and offer on Tuesday. The position details were clearly explained as far as scheduling and pay.", "Interview Questions": "Was I comfortable dealing with COVID positive patients?"}, {"date": "30 Nov 2021", "title": "Not Applicable Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Wellstar Health System (Atlanta, GA) in Oct 2021", "Interview Descriptions": "Interviewed by two Supervisors. Both were very nice and supportive. Wanted to explain a lot about their views and company changes. Explained that the position I was applying for was more of an administrative position rather than a hands-on position.", "Interview Questions": "How did I handle a difficult situation in the past or How would I handle a difficult situation if faced with one?\n"}, {"date": "24 Dec 2021", "title": "Administrative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Wellstar Health System in Oct 2021", "Interview Descriptions": "Multiple mix ups from the HR. After 4 interviews there was zero communication for several weeks. Not able to reach anyone in that department via phone or email. Very little transparency during the process. After all that, they was sent a generic e-mail saying I was not chosen. No details as to even what position they were referring to in that e-mail.", "Interview Questions": "How you handle working with difficult people?"}], [{"date": "15 Sept 2021", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "The interview was fair and I was given  a lot of information about the position during the interview. I was encouraged  to ask lots of questions and my questions were answered. The recruiter was very informative about the interview process and communicated what to expect. I thought the interview process was fairly smooth.", "Interview Questions": "When was a time you experience a conflict with another staff member and how did you handle the situation?"}, {"date": "2 Dec 2021", "title": "Educator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in Sept 2021", "Interview Descriptions": "Many interviews over a span of a couple of weeks. Poor contact  with Human  resources. Range not listed in job description. All this effort and time to find they can’t pay me what I want! Very frustrating experience.", "Interview Questions": "What attracted you to this position?"}, {"date": "22 Apr 2022", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in Sept 2021", "Interview Descriptions": "Their process moves along quickly. Not intimidating at all. I interviewed with AVP and VP and they were very straight forward in their needs. I would enjoy working for either anytime.", "Interview Questions": "Why would you like to work for Wellstar?"}, {"date": "20 Aug 2021", "title": "Certified Medical Assistant (CMA) Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "Do you work better independently or as part of a team? How would your friends and/or coworkers describe you in three words?. What’s one skill you have that sets you apart from other candidates for this job?", "Interview Questions": "why do you want this job. "}, {"date": "18 Aug 2021", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Woodstock, GA) in Aug 2021", "Interview Descriptions": "I was contacted by Jason, a Talent Acquisition Consultant- he was very polite, professoinal, informative, and helpful in setting up my interveiw with Michelle the manager of the department I was interviewing for. The interview went great, I could tell from the beginning that she knew and loved her job, wanted to help make sure all parties involved were a good match for each other, and was extremly polite and professional. I knew WellStar and Michelle was who I wanted to work for! After I was offered the position, Jason stayed in contact, and went above and beyound to get all things squared away for me to make the deadline to be in the very next next round of employee orientation.", "Interview Questions": "Tell about an instance where I had to collaborate with co-workers at a previous job."}, {"date": "20 Jul 2021", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Wellstar Health System", "Interview Descriptions": "There is a phone interview with the recruiter, a Gallup survey and then the final interview. It was an easy process to navigate. They did not ask many questions. None were trick questions.", "Interview Questions": "What made you decide to get into this speciality?"}, {"date": "3 Aug 2021", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System in Jul 2021", "Interview Descriptions": "Hiring process was quick. Applied online, heard something back from HR next day. HR contacted me and asked basic questions regarding my application. Then scheduled an interview with nurse manager. That interview lasted about 15 mins, asking behavior questions.", "Interview Questions": "When was a time you had to make a quick decision and what was the outcome? \r\n\r\nHave you ever disagreed with your manager? How did you handle that? "}, {"date": "21 Jul 2021", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wellstar Health System (Atlanta, GA) in Jul 2021", "Interview Descriptions": "Everyone i spoke to during the interview was very pleasant and made me want to be part of their team. The hiring recruiter was also very nice. Everyone answered the questions I had and extended the offer to reach out if I had more questions.", "Interview Questions": "What is your greatest strength. "}, {"date": "14 Jul 2021", "title": "Patient Service Representative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Wellstar Health System (Atlanta, GA) in Jul 2021", "Interview Descriptions": "I applied for the position online and received a call back the next day to schedule the interview. It was virtual and there were 3 Wellstar employees on the call. The interview took about 30 mins.", "Interview Questions": "The basic interview questions. \r\nTell me about yourself. \r\nWhy should he choose you. \r\nDo you have a problem asking ask sick people for money. \r\nHow do you deal with stress. \r\nHow do you deal with working with different personalities. "}, {"date": "21 May 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "everyone was very kind, but the interviewing process was a bit short. However, they did give us enough time to talk about ourselves, and I was able to talk to the nursing managers.", "Interview Questions": "tell me about a time... "}], [{"date": "16 May 2021", "title": "Medical Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "Pretty cool, usual questions like what do you bring to this organization? What would you do in a conflict with a coworker. How would you handle stressful situations? Interviewed with one person.", "Interview Questions": "Pretty cool, usual questions like what do you bring to this organization? What would you do in a conflict with a coworker. How would you handle stressful situations? Interviewed with one person. "}, {"date": "24 Apr 2021", "title": "Digital Performance Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Atlanta, GA) in Apr 2021", "Interview Descriptions": "Filled out an application online on the Wellstar site and was sent an assessment, which I completed the next day, then the recruiter called to setup a phone screen two days later. Phone screen was pretty standard and non technical. I told them I was about 10 days further in the process with some other companies (which I was) but was very interested in this position, so if we could compress the timeline, that would be awesome! Spoke to the hiring manager for an hour, who was a really smart guy and someone I would have got along with very well it seems. About a week later I spoke with the VP for an hour, who I was flattered took the time to interview me even though she was on vacation that week. I notified them I had another offer but I was certainly interested in discussions if they wanted to make one as well. That was the last I heard from them. There were some concerning answers to some of the questions I had about the department strategy and makeup, so it was probably a good pass for all parties. \r\n\r\nHR Pros, please make sure you don't leave your candidates twisting in the wind. Most of us understand that at the 10-14 day mark you've passed but if you do a phone screen, at least send out an e-mail to say \"thanks but no thanks.\"", "Interview Questions": "What is your favorite ad campaign running right now? "}, {"date": "6 Mar 2021", "title": "Executive Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "Unprofessional, I felt that they only wanted a certain type in the organization. They had their mind made up before the interview. I hope upper management and HR take a look into hiring practices.", "Interview Questions": "Not many questions asked. They already had in mind what they wanted. "}, {"date": "7 Apr 2021", "title": "RN New Grad Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Wellstar Health System (Kennesaw, GA) in Mar 2021", "Interview Descriptions": "The interview process was very smooth! After you apply to their residency program, they will send you an email and a text for you to sign up for an interview time. They used sign-up genius for our convenience and they also contact you even if you don't get the job.", "Interview Questions": "1. What is one difficulty you faced during clinical and how did you deal with it? "}, {"date": "25 Mar 2021", "title": "New Grad RN Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Atlanta, GA) in Mar 2021", "Interview Descriptions": "Very straight forward! I was so nervous but the interviewer was nice and didn’t come off as intimidating so that helped me relax a bit. I was sent an offer the following week.", "Interview Questions": "Explain why teamwork is so important. \r\nWhy wellstar?\r\n"}, {"date": "27 Mar 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Atlanta, GA) in Mar 2021", "Interview Descriptions": "The interview process was very quick. I interviewed via the virtual job fair on a Saturday and heard back with an off by the following Wednesday . Since then I have received my Orientation start date and the required information I need to complete prior to attending orientation", "Interview Questions": "Describe a situation where you experienced conflict and how did you handle it?"}, {"date": "22 Jun 2021", "title": "Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wellstar Health System (Marietta, GA) in Mar 2021", "Interview Descriptions": "Pretty simple. One quick interview with a recruiter. “This is the position, this is the schedule, these are the requirements. Does that work for you?” And then another interview with the nurse manager.", "Interview Questions": "Tell me about a time when you had to handle a difficult situation."}, {"date": "5 Jan 2022", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at Wellstar Health System (Atlanta, GA) in Mar 2021", "Interview Descriptions": "Lengthy - the focus of the position changed several times and there were long periods of no engagement. I went through an evaluation and 5 interview rounds.  The department seemed to have changed their direction several times on the position and its direction.", "Interview Questions": "A presentation was asked for "}, {"date": "22 Feb 2021", "title": "Director of Nursing Implementation and Research Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "The process was very well-organized and and timely. The recruiter kept me informed in every step of the process. Very professional with all communication. Provided sufficient information regarding the position.", "Interview Questions": "Describe an example of your research results were implemented in the clinical practice."}, {"date": "8 Feb 2021", "title": "Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System", "Interview Descriptions": "The interview process was average. I had mostly Behavioral questions and patient care experience questions.  It was less than 20 minutes long over the phone due to the pandemic and social distancing.", "Interview Questions": "Why do you want to work at this hospital?"}], [{"date": "8 Mar 2021", "title": "Senior Human Resources Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Wellstar Health System (Marietta, GA) in Feb 2021", "Interview Descriptions": "Absolute disaster. The recruiter was phenomenal, but the hiring manager and team members were terrible. The hiring manager said I had the position but had to do a panel interview with the team. One team member (another consultant) was rude, condescending, and offensive throughout the whole interview. It felt like an attack instead of a professional interview. It was clear that they did not want a person of color on their team.", "Interview Questions": "How much experience did I have in Human Resources?"}, {"date": "26 Mar 2021", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System in Feb 2021", "Interview Descriptions": "It was quick and easy and the people who interview was so nice and informal of the job. U get two interview because of Covid they are virtual. And the process was quick.", "Interview Questions": "What should we pick u? "}, {"date": "27 Apr 2021", "title": "Student Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Atlanta, GA) in Feb 2021", "Interview Descriptions": "Good, 15 min interview. Asked me a few questions and then gave me time after to add questions. Explained job role and expectations. Sends offer email a week or two after", "Interview Questions": "Describe a time you went above and beyond for a patient or client "}, {"date": "8 Jan 2021", "title": "Med history tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System", "Interview Descriptions": "The interview was friendly and quick and straight to the point.  answered all of my questions during interview.  felt confident about the position and company once the interview was over", "Interview Questions": "One of the general questions What are your strengths?"}, {"date": "27 Dec 2020", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Austell, GA) in Dec 2020", "Interview Descriptions": "Super easy and informative. I got to see the different departments and meet the managers and shift leaders. I felt very welcome and comfortable. I was asked your typical interview questions and was given time to ask all the questions I had.", "Interview Questions": "Where do you see yourself in 5 years? "}, {"date": "2 Nov 2020", "title": "Pre-boarding Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellstar Health System (Kennesaw, GA)", "Interview Descriptions": "Worked with two recruiters. The first recruiter was wonderful and explained several positions I was qualified for. She was timely with follow-up and extremely pleasant to work with. She sent my information to another recruiter for a job that we agreed was a good fit. That recruiter scheduled me for an interview with the managers but never made the effort to call me to explain the position details, compensation, interview process, etc. I made it to final interviews with the team and never heard from my recruiter after that. I understand recruiters are busy but the lack of communication and inability to close the loop with a candidate put a very poor taste in my mouth.", "Interview Questions": "Tell me about a mistake you made in the workplace and what you learned from it."}, {"date": "18 Jan 2021", "title": "Billing Claims Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellstar Health System in Nov 2020", "Interview Descriptions": "Interviewed with HR and second interview with Manager. All interviews were virtual. First interview was 30 mins and second interview was about an hour. I was asked about my experience, availability , my strengths and weaknesses.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "27 Oct 2020", "title": "New Grad Nurse Residency Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "brief interview; no longer than 15 minutes; asked about personal and nursing related questions. They were easy to talk to and extremely nice. One of the interviews was one woman and my second interview was with 3 different nursing leaders.", "Interview Questions": "Why do you want to be a nurse?"}, {"date": "21 Oct 2020", "title": "Registered Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "1st a recruiter contacts you reviews your resume a interview is arranged and the department head interviews you and there is also a pear interview. If they like you, they will offer you a position and work out pay and days", "Interview Questions": "They ask a lot of questions about team work and experience "}, {"date": "9 Oct 2020", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Wellstar Health System (Kennesaw, GA)", "Interview Descriptions": "A recruiter reached out to me asking would I be interested in a job fair. I agreed and interviewed virtually through zoom. The interview was quick and with three people. They gave me two tell me a time when questions, explained the job and role and that’s it. It took 2 weeks to hear back with a offer.", "Interview Questions": "Tell me a time when you received bad customer service... how did you handle it?"}], [{"date": "29 Oct 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System in Oct 2020", "Interview Descriptions": "It was a virtual hiring expo day. I was able to choose 4 different locations/units to interview with in a 15 min time slot. The process was long but all of the interviewers at Wellstar were beyond welcoming and kind.", "Interview Questions": "Describe a time when you had a conflict with a patient. What did you do and how did you resolve it?"}, {"date": "4 May 2022", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wellstar Health System (Marietta, GA) in Oct 2020", "Interview Descriptions": "The interview process was normal question that are based on personality, how you handle situations, and it you are the correct  Fit for the job. The question are based on how you deal with customers, your ability to deal with staff and customers that are upset and to convince the customers that you are capable of providing what they need when they need it.", "Interview Questions": "Tell me about a time when you provided exceptional customer service."}, {"date": "18 Oct 2020", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System in Oct 2020", "Interview Descriptions": "Once you apply you should hear from the recruitment team via email within a month, depending on the time between submitting your application and the program start date. The next step is an invitation to interview, my interview was online due to COVID precautions. The interview is about 20minutes, and you should have a decision or contingent offer in a week.", "Interview Questions": "Why do you want to work at this specific Wellstar location?\nWhere do you see yourself in 5 years?"}, {"date": "21 Sept 2020", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "Interview with recruiter about 3 weeks after applying online. She asked a few general questions then scheduled me for an interview with the department manager. She asked general questions as well but more specific to my experience.", "Interview Questions": "What made you want to become a PT?"}, {"date": "14 Oct 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System in Aug 2020", "Interview Descriptions": "The interview process was very structured and professional. Interview was via Microsoft Teams and it was a virtual hiring event. 15 minute interview slots, but sometimes it went over, but it was short, sweet and to the point.", "Interview Questions": "Why did you choose Wellstar?"}, {"date": "4 Oct 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in May 2020", "Interview Descriptions": "Online, fifteen minute interview with the charge nurse or nurse manager. They accept and train newly graduated nurses. They ask questions like, \"why did you choose wellstar?\" If accepted, they quickly send an offer, which you have 48 hours to make a decision.", "Interview Questions": "Why did you choose wellstar?"}, {"date": "25 Sept 2020", "title": "Student Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in Apr 2020", "Interview Descriptions": "The hiring and interview process was fairly easy! I filled out the application for their nurse extern and received a call back one week later. The interview went very well and I received my offer letter by email days later!", "Interview Questions": "Why did you choose to apply for Wellstar?"}, {"date": "14 Apr 2020", "title": "Social Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wellstar Health System", "Interview Descriptions": "Pretty straight forward. No behavioral questions just going over related experience. It was a pretty easy interview so I believe they had already chosen a candidate by the time I interviewed. The experience was negative because I literally never heard anything back. There was no communication from the recruiter. I emailed the hiring manager no response. It was strange to get no feedback.", "Interview Questions": "Why this position? "}, {"date": "13 Apr 2021", "title": "Internship Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Atlanta, GA) in Apr 2020", "Interview Descriptions": "It was a bit unprofessional with the whole process. They made me wait several months for one interview due to the manager being out of town. I would constantly have to email them for a follow up and receive short replies that didn't answer any questions.", "Interview Questions": "Tell me about yourself and why should we hire you for this position?"}, {"date": "26 Mar 2020", "title": "Sitter Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "The easiest interview ever, they make you feel like you’re already a team member. from the beginning. They do require all employees pass a background check and drug test.", "Interview Questions": "Availability and if I minded working overtime? "}], [{"date": "14 Sept 2020", "title": "Lead Claims Followup Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Atlanta, GA) in Feb 2020", "Interview Descriptions": "Fairly normal. It was a panel interview with 4 interviewers, Director, manager and two supervisors. It was kind of relaxed. The questions asked were related to the position  and my leadership style.", "Interview Questions": "What are you looking for out of an employer? "}, {"date": "23 Jan 2021", "title": "Admin Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Atlanta, GA) in Nov 2019", "Interview Descriptions": "Recruiter contacts you quick 15 min review\r\nSchedule In person interview\r\nDirections and instructions are emailed for interview\r\nResponse after interview takes about 1-3 days.\r\nOffer letter emailed to you with offer.\r\nRecruiter calls and made offer\r\nYou are directed to link in email to accept or decline offer", "Interview Questions": "Tell me a little about yourself?"}, {"date": "28 Nov 2019", "title": "MRI Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. I interviewed at Wellstar Health System (Atlanta, GA) in Nov 2019", "Interview Descriptions": "I am currently in the process of relocating to GA. I had an interview on a Monday. I flew to GA specifically for the interview. I was told I would interview with the supervisor but when I arrived 15 minutes early I was told he wasn’t available and I would do a peer interview instead. I was put in a clustered room with a chief tech and peer. They didn’t have my resume nor did they seem prepared. They printed off the peer interview questions and that was it. I was showed around the department and then left. Interview was 22mins. Very unprofessional.", "Interview Questions": "Tell me why we should give you the job over other candidates? "}, {"date": "7 Apr 2020", "title": "Clinical Nurse Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wellstar Health System (Marietta, GA) in Nov 2019", "Interview Descriptions": "HR was friendly and professional. However my interview with the hiring manager was one of the strangest experience I've had and would keep me from seeking care at the facility.\r\n\r\nThe hiring manager was 30 minutes late to the interview. I'm using the word interview lightly. She literally did not ask me one question throughout the one hour I was there. No \"tell me about yourself,\" no \"what interests you about the position,\" nothing.\r\n\r\nThey were hiring a nurse manager for a new clinic they were opening. Without coming up for air,  hiring manager told me about the clinic and position. Sensing she was not going to ask me any questions, I occasionally tried to interject to highlight my experience or ask thoughtful questions about the role and how I might contribute to the mission of starting a new clinic.\r\n\r\nShe did answered my questions in a superficial manner that, to me, indicated they were ill-prepared to open a clinic and might not even understand the role of a nurse manager. She never asked a follow up question. Really weird.\r\n\r\nA few weeks later, I got an email from HR saying they had decided to move forward with other candidates. I could do anything but laugh because I have no idea how they could possibly decide between candidates when the hiring manager is such an incompetent interviewer.", "Interview Questions": "I was not asked and questions."}, {"date": "9 Sept 2019", "title": "Social Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wellstar Health System", "Interview Descriptions": "Received phone call from recruiter asking if I would like to interview for position and a few basic questions in reference to salary expectations, etc. Scheduled face to face interview about a week later. Felt like the interview went great but have not heard back from the company in reference to hiring.", "Interview Questions": "Why work for Wellstar?"}, {"date": "13 Aug 2019", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 8 weeks. I interviewed at Wellstar Health System (Stockbridge, GA)", "Interview Descriptions": "A complete waste of time.... very long and never organized. No call back nor update. I had a tour of the facility. The interview lasted 2-3 hours. I met many people. Panel interview. I’ve been on several interviews at different locations within the organization. I believe you have to know someone or that these are ghost jobs. New positions posted daily. Again, no call, e-mail update, nor response to your email.", "Interview Questions": "Why Wellstar?"}, {"date": "5 Jun 2021", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System in Aug 2019", "Interview Descriptions": "The process was swift and I had two interviews. HR process was a bit difficult due to lack of communication. Took over a month to get onboarded. cc ccccc    ccc ccc cc vvvv vvvv vvv", "Interview Questions": "What I know about the company."}, {"date": "20 Aug 2019", "title": "Staffing Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Marietta, GA) in Aug 2019", "Interview Descriptions": "I applied online. Was required to do a personality test online. A few days later, I got a call from a talent acquisition employee for a brief phone call. Said she will refer me to the hiring manager for an interview because she felt I was a fit.  A week later I got a call from another recruiter to schedule a phone interview with the hiring manger.  The phone interview was mostly about them telling me about the position and then they asked me about excel pivot table and vlook ups.  A week later got invited for a face to face interview.   All questions were behaviorist and situational. Nothing about me, my skills or background. Very pleasant. I thought I did well. Still waiting for confirmation if I will receive an offer or not.", "Interview Questions": "Tell me about a time you were assertive"}, {"date": "10 Jul 2019", "title": "Nurse Resident Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System", "Interview Descriptions": "I went to the hiring event of Wellstar. Got multiple interviews with acute care units of AMC, Kennestone and Cobb. The line for AMC was the longest. They offered food and drink during the event.", "Interview Questions": "Describe a time you have to explain a complex issue to the patient and evaluate the outcome?\r\nWhy Wellstar? Why Acute care? "}, {"date": "31 Jul 2019", "title": "Sterile Processing Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Wellstar Health System (Marietta, GA) in Jul 2019", "Interview Descriptions": "It was a very easy going interview. Pretty basic question nothing to be nervous about. Both supervisors was very nice and help me become at ease. The hiring process from start to finish was about 4 weeks which is normal when dealing with hospitals", "Interview Questions": "Name a time where you handled conflict well"}], [{"date": "25 Jun 2019", "title": "Maintenance Mechanic Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Wellstar Health System (Marietta, GA)", "Interview Descriptions": "Mostly done on line today. When I originally got my job I had to fill out a paper application. So today’s job world is much different than when I originally was hired", "Interview Questions": "Are you an honest hard worker "}, {"date": "7 Jul 2019", "title": "Construction Project Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wellstar Health System (Marietta, GA) in Jun 2019", "Interview Descriptions": "Initial phone interview with HR was well-organized and thorough.  Was called in for an in-person interview shortly after the phone interview.   Interviewed with two people from the construction department.  One was late, both spent a good deal of time talking, asking me few questions.  Both interviewers seemed to not be that familiar with my resume or my experience.  Apparently there were two positions open, and they spent a good bit of time trying to pigeonhole me into a job for which I was overqualified.", "Interview Questions": "Tell me about your experience with healthcare architecture."}, {"date": "16 May 2019", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System", "Interview Descriptions": "Interview was short and sweet. They went over the job functions well and made sure you fully understood the job. They did ask a lot of epic questions like How to do this and that. But that is probably because I have epic experience in registration. They did ask other questions about the job process such as how to verify insurance, which I did not know how to do at the time.", "Interview Questions": "How many years of experience with Registration do you have?"}, {"date": "18 Jul 2019", "title": "Compliance Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Wellstar Health System in May 2019", "Interview Descriptions": "Once I applied, I received an email for a personality test about 2 days later. I guess I “passed” that part because a few days later I received an email from the Recuiter for a phone interview. She was very nice and very responsive at first. The day of phone interview she called a little late but I was able to talk with her and the conversation was great and I was excited. Afterwards she sent me two emails for references and another personality test, which I think is ridiculous since there was already one and these have nothing to do with the job. After hunting down all my old bosses and peers I got 7 completed references and I did the 2 hour personality test. I missed her call one day and Called back a few hours later and after that NOTHING. My emails and phone calls went ignored and status simply changed to “not selected.” So I did all of that for absolutely nothing and I never even spoke to a manager. Definitely turned off by the process.", "Interview Questions": "How do you handle difficult doctors?"}, {"date": "8 Apr 2019", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "No interview required for my position as it was for a clinical education experience and not a paid job opportunity. Paid positions were interviews by multiple members of the rehab unity", "Interview Questions": "No interview required for my position as it was for a clinical educational experience "}, {"date": "4 Mar 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "Terrible! Very long and drawn out. Competing with hundreds of other applicants to stand in line for hours and then speak with someone for 2 minutes. I would have preferred a more personal interview, not mass interview.", "Interview Questions": "What is your top choice for department?"}, {"date": "12 Jan 2020", "title": "Patient Access Specialist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Wellstar Health System (Marietta, GA) in Mar 2019", "Interview Descriptions": "It was a panel interview with three people. I was nervous at first but when they started answering the questions I came up with the correct answers. They asked if I had questions for them and I asked and they were able to answer them.", "Interview Questions": "How do you handle conflict? "}, {"date": "27 Apr 2023", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in Jan 2019", "Interview Descriptions": "The interview process was very easy. I would suggest finding common interview questions online and practice. Make sure you know how to use the STAR method. Overall, it was a good experience.", "Interview Questions": "Typical; plan for 5 for years"}, {"date": "9 Jul 2021", "title": "Patient Safety Sitter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System in Jan 2019", "Interview Descriptions": "Applied online, received a call from a manger on the unit, scheduled an in person interview. Arrived to the interview which lasted approximately 30 mins. The manager said we would be in touch. I was sent an offer letter the next business day.", "Interview Questions": "Given 4 patient conditions which one would you treat first?"}, {"date": "9 Jan 2019", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Wellstar Health System (Atlanta, GA) in Nov 2018", "Interview Descriptions": "The interview process was very smooth and very direct, very friendly and conversational . Only interviewed with the area I wanted to work in. I went to the job fair and got hired", "Interview Questions": "Can I work holidays"}], [{"date": "9 Oct 2018", "title": "Nurse Extern II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "Quick interview. Gave the reasons what I wanted to get out of the experience and the top 3 areas I wanted to work in. Was immediately offered a position afterwards.", "Interview Questions": "What do you want to get out of this experience?"}, {"date": "25 Oct 2018", "title": "New Grad Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in Oct 2018", "Interview Descriptions": "I applied online and I got a phone call about a week after applying. The phone interview was quick and easy- they asked what specialties I was interested in and my clinical experiences. I set up an interview to meet with the nursing managers for various WellStar locations. I met with them two weeks later. It was a panel interview, but it was very relaxed! There were several behavioral questions and then they gave me a list of medical conditions and I had to pick one to describe the pt presentation, meds that would be ordered, diagnostics, and patient teaching. I got a phone call with an offer the same day!", "Interview Questions": "Why did you choose nursing as a career?"}, {"date": "26 Dec 2018", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wellstar Health System (Marietta, GA) in Oct 2018", "Interview Descriptions": "Very thorough. Reviewed my resume and acknowledged my job history. Stayed in contact throughout the process. Seemed to have an organized interview process.  I was made to feel comfortable. The interview questions were a mix of behavior and skill.  The interview was geared toward the position i was applying for and not a generic interview.", "Interview Questions": "How would your coworkers describe you?"}, {"date": "4 Dec 2018", "title": "Certified Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System (Smyrna, GA) in Oct 2018", "Interview Descriptions": "I was called by interviewee followed by a email confirming the interview. Interviewed by two people who promised they would get back to me about a decision a week later and still have not heard anything.", "Interview Questions": "Why should we hire you?"}, {"date": "6 May 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellstar Health System (Marietta, GA) in Sept 2018", "Interview Descriptions": "It was a three part process, the first was with the floor manager and the second was with a few team members and the floor assistant manager.  I was question and process and skill level.", "Interview Questions": "What Has been the the biggest challenge in life < and how has that helped you in your professional life. "}, {"date": "22 Oct 2018", "title": "RN Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Wellstar Health System (Marietta, GA) in Sept 2018", "Interview Descriptions": "Did application online, they sent me a link to do a online questionaire that took like 30 minutes tops to review just about how you interact and how you see yourself. Then the recruiter reached out to me to figure out my fields of interest and connect me with a floor I would be interested in. The interview itself was super laid back I interviewed with manager and nurse leader in manager's office on the floor I was applying for. Really more of a conversation and showed me around!", "Interview Questions": "Why did you want to become a nurse.\r\nDescribe what you've done in your practicum. "}, {"date": "10 Oct 2018", "title": "Patient Transporter Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Atlanta, GA) in Sept 2018", "Interview Descriptions": "I applied online and was called to for interview that same week. The interview was good and more relaxed. Meet few people in the department and was shown around the facility and also described the daily activities.", "Interview Questions": "What’s your idea about customer satisfaction. And my current availability for work and was shown around the facility."}, {"date": "18 Jul 2018", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System (Smyrna, GA) in Jul 2018", "Interview Descriptions": "Pretty short and simple probably won’t be interviewing with them anymore seems like they already had who they wanted in mind. Seems like a waste for outsiders not with the company.", "Interview Questions": "Where do you see yourself in 3-5 years"}, {"date": "27 Mar 2019", "title": "Nutrition Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Wellstar Health System (Marietta, GA) in Jul 2018", "Interview Descriptions": "I attended a job fair held at Kennestone. Many supervisors were present and available for interviews. Mostly they were very friendly, interviews took less than 5 minutes each. Standard questions, nothing to make you uncomfortable or out of left field.", "Interview Questions": "How do you feel about various shifts around the clock"}, {"date": "5 Sept 2018", "title": "Senior Medical Coder Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in Jul 2018", "Interview Descriptions": "There is a phone interview, in person interview, reference check, background check, drug screen, pre employment health check, and then finally orientation. It takes about a month. The position sounded like my dream job until pay was discussed. The pay offered was very low for a certified coder so I declined.", "Interview Questions": "Describe yourself in one word."}], [{"date": "11 Jun 2018", "title": "Monitor Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Wellstar Health System (Hiram, GA) in Jun 2018", "Interview Descriptions": "I was told to wait for my interviewer for a full time Monitor Tech position. My interviewer did not come until an hour later, and even then, the interview only lasted about 7 minutes.", "Interview Questions": "One of your greatest strengths?"}, {"date": "8 Jul 2018", "title": "Front Office Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "The process took 2 weeks. I interviewed at Wellstar Health System (Smyrna, GA) in Jun 2018", "Interview Descriptions": "I applied online and a week later I received a called from HR asking if I was still interested. A week after that I received an email from the hiring manager that I was invited for an interview. I interviewed with the hiring manager and the supervisor which was a great experience. The next day I received another call but from the hiring manager asking if I could come in for a second interview to meet with the lead physician. After the second interview about 4 days later I received an email saying I was offered the position.", "Interview Questions": "How many years of experience do you have in customer service?"}, {"date": "23 Jun 2020", "title": "Cardiac Rehabilitation Exercise Physiologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Wellstar Health System (Atlanta, GA) in Jun 2018", "Interview Descriptions": "I sat down with the director of the branch as well as the district manager for my interview. They asked me several questions pertaining to the job (I was interning with them at the time). The interview took about 20 minutes.", "Interview Questions": "They asked me to describe a time where I helped someone achieve their goals/helped someone with an issue that they had"}, {"date": "27 Jun 2018", "title": "Professional Nurse Educator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Wellstar Health System (Smyrna, GA) in May 2018", "Interview Descriptions": "The interview process was fine but the interaction with Talent Acquisition was unprofessional. The TA specialist had not reviewed my application until after I had two interviews. Therefore she stated she was surprised by my salary requirements and needed to go to her hiring manager to find out if she could move forward. She told me I was currently earning more than the top of their range for the position I interviewed for and that unless I was willing to take a pay cut I would not be offered the position. This  was an unprofessional process and wasted the time of the interviewers and myself.", "Interview Questions": "N/A"}, {"date": "25 Jul 2018", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wellstar Health System (Marietta, GA) in May 2018", "Interview Descriptions": "I applied and got a call within a week. My interview was scheduled fairly quickly. The facility was easy to find , but I had to pay for parking. However, the interview wasn’t painful at all. Straight to the point and left knowing I would get the job.", "Interview Questions": "Tell me about yourself"}, {"date": "9 Aug 2018", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wellstar Health System (Marietta, GA) in May 2018", "Interview Descriptions": "Got a phone call to interview\r\nI interviewed the next week\r\nGot a call for another interview \r\nGot the job start working 3 weeks later\r\nI was very excited\r\nIt was short to me\r\nI knew I was getting the job", "Interview Questions": "Why do u wanna work here"}, {"date": "16 Nov 2021", "title": "Front Office Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Marietta, GA) in May 2018", "Interview Descriptions": "First they start with a telephone call then a face to face interview. Pretty standard just like most facilities. With this being a basic position there is no room to negotiate wage.", "Interview Questions": "How would you handle a difficult patient?"}, {"date": "10 Jun 2018", "title": "Applications Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in Apr 2018", "Interview Descriptions": "The interview process was horrible! Very discouraged once I spoke with the recruiter. I received what I thought was a spam email, after researching the domain name I found that it was in fact sent from the hiring manager. I responded with my times available. Interview went great from what I perceived. The hiring manager seemed interested and asked that I contact her directly if I had any questions. I then received a call from the recruiter asking for my references. 2 hiring managers were REQUIRED and 3 remaining were normal business references. I found this to be quite difficult as my previous managers were no longer with my old employment I was fortunate enough to have a great rapport with a few old colleagues and was able to gain contact. \nOnce completed I insisted on following up to get more information on what to expect, however when I spoke with the recruiter she just told me that they are still reviewing at that time. What caught me by surprise is when she asked about my expected salary range. When I confirmed she replied \"oh they are not going to pay you that much for this position!\" I was highly offended by this especially after doing my research and my 8 years of experience it was reasonable. I asked if she could tell me what the projected salary would be? She stated that the compensation department would review and provide she wouldn't know. At this point I truly was no longer enthused. After the call I heard nothing from both the manager or recruiter for almost 3 1/2 weeks.\n I sent a follow up email to both and received out of office replies. After another weekend had passed, I then received a call from the recruiter stating that she had received my email and that I was still a finalist and that she was waiting to hear back from the hiring manager. The next day I received an email stating that I was no longer a finalist for the position. What a waste of time! Recruiters should follow up with candidates as they expect us to follow-up with them! Simple...", "Interview Questions": "how would you handle multiple tasks a day, where you would have to follow up with providers, you may also have to drive on site to assist, also respond to emails..etc."}, {"date": "18 Aug 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Wellstar Health System (Atlanta, GA) in Apr 2018", "Interview Descriptions": "The process is slow and tedious. It is very difficult to get in touch with the recruiters or get any updates.  Once hired, they rush you get things done.", "Interview Questions": "Most of the questions were behavioral style questions."}, {"date": "31 May 2018", "title": "New Grad Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Wellstar Health System in Apr 2018", "Interview Descriptions": "I applied online and was called back two days later. I had a phone interview and never heard back from wellstar. I had to call the recruiter to find out if an offer was extended or not.", "Interview Questions": "What you 2 strengths and 2 weaknesses?"}], [{"date": "15 Mar 2018", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Wellstar Health System", "Interview Descriptions": "Very lengthy with a lot of background checks. Very professional. It lasted about a week. I had to get a drug test and wait for those results. It helped that I knew someone in a supervisory position at Wellstar and it helps to know an employee so they can vouch for you.", "Interview Questions": "Who referred you to this company? "}, {"date": "9 Apr 2018", "title": "New Grad Registered Nurse Residency Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in Mar 2018", "Interview Descriptions": "I applied online on March 14 and took the Gallup assessment on March 16, 2018. A recruiter called to schedule an interview with me, the interview took place on April 30. Five references were asked to review my nursing skills which was completed last week. I am waiting on the next step.", "Interview Questions": "How did you deal with a critical patient?"}, {"date": "19 Mar 2022", "title": "Kitchen Team Member Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in Mar 2018", "Interview Descriptions": "Phone interview for fifteen minutes, than second face to face interview. Meet people. They ask questions about previous job. Why did you pick this job. Expectations for new job, staff and team.", "Interview Questions": "What is your current salary."}, {"date": "15 Apr 2018", "title": "Patient Care Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wellstar Health System in Mar 2018", "Interview Descriptions": "I met with a panel of three. they asked questions ranging from my background up to why i wanted the position. this came after having a personality test done online. After making it to this level, i was then called in for a panel review", "Interview Questions": "Was I interested in full time or part time work"}, {"date": "24 Mar 2018", "title": "Environmental Services Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wellstar Health System (Marietta, GA) in Feb 2018", "Interview Descriptions": "It wasn't long at all, however I felt like it was rushed. I felt it was rushed because the manager kept getting interrupted by calls, and so we didn't really get to talk much. He was nice, and gave me a date and time to observe. Also he was nice, because even though I didn't have my resume with me, he still gave me a chance to observe.", "Interview Questions": "Have you had any experience with housekeeping?"}, {"date": "14 Feb 2018", "title": "Supervisor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Wellstar Health System (Atlanta, GA) in Feb 2018", "Interview Descriptions": "Job transfer then got a phone call, then set up interview.. hr took 3 days just to call me in to set an appointment to see the hiring manager", "Interview Questions": "Tell me about yourself and why you want to work for the company "}, {"date": "5 Mar 2018", "title": "Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Wellstar Health System (New York, NY) in Feb 2018", "Interview Descriptions": "Great 3 different people ask questions...\nReally all questions were frank and to the point. They ask a lot of questions related to the job that you applying to. So you have to be on point with your answers", "Interview Questions": "Give me a time when?"}, {"date": "30 Mar 2018", "title": "Generalist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in Jan 2018", "Interview Descriptions": "Had to call them to find out the outcome. The reason for not getting the job was not true. This left a negative impression on the company. You must pass the personality/IQ assessment to be considered.", "Interview Questions": "Asked  behavior based questions."}, {"date": "1 Mar 2018", "title": "Senior Manager Recruiting Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Wellstar Health System (Atlanta, GA) in Jan 2018", "Interview Descriptions": "The Recruiter left a vm, never followed up,  I left several,vm, two weeks later they claimed had a personal issue and would call me next week, then never followed up.  I left vm with the HR VP, TA VP, HR managers, HR admin.  No one responded, apologized, followed up.  Worst and rudest experience ever.  And I was interviewing to the the recruiting manager!", "Interview Questions": "N/A"}, {"date": "9 Mar 2018", "title": "Front Office Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Roswell, GA) in Jan 2018", "Interview Descriptions": "Several interviews, all give you the impression they are interested, go back into the profile and it shows interviewed, not selected. It's very irritating and I will not go on anymore interviews with Wellstar. I guess it's true gotta know someone to get in. I've been well qualified at all interviews, easy questions and to the point. Very disappointing. I'm still being contacted very from different offices.", "Interview Questions": "Describe myself!"}], [{"date": "10 Oct 2018", "title": "Family Nurse Practitioner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Wellstar Health System (Atlanta, GA) in Jan 2018", "Interview Descriptions": "I was screened out after 5 minutes for having less than 1 year of experience, but my resume clearly stated I was a new graduate. They did not take into account how much other experience I had before my FNP degree, such as RN experience or previous work experience applicable to the position including FNP rotations.", "Interview Questions": "1. How many years of experience do you have?"}, {"date": "22 Jan 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Wellstar Health System (Austell, GA) in Dec 2017", "Interview Descriptions": "My interview was Ridiculous...the hiring process is unbelievable rigid and when you're on board all you find yourself surrounded with is  ...incompetent...judgmental...condescending...arrogant...shallow...superficial,unqualified,  scandalous,did I mention ridiculous  people.", "Interview Questions": "Where did I last work"}, {"date": "5 Nov 2018", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Wellstar Health System (Roswell, GA) in Nov 2017", "Interview Descriptions": "the interview was 30-45 minutes long, they stated what they were looking for, asked about previous experience and how I can contribute to the role. I was interviewed by 2 people at one time. I got a tour around all 3 units and was told HR would contact me if I was chosen. HR contacted me about 2 weeks later", "Interview Questions": "what previous experience do you have in healthcare"}, {"date": "15 Apr 2018", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Wellstar Health System (Atlanta, GA) in Nov 2017", "Interview Descriptions": "Leadership and informal peer interviews.  There were no behavioral interview questions. There were no job duty specific questions.   It was a slow process. Even though there were vacancies and apparently qualified applicants, it didn’t seem like hiring was a priority. I almost accepted another offer only because the hiring process was so slow.", "Interview Questions": "Why do you want to work here?"}, {"date": "19 Oct 2017", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System", "Interview Descriptions": "The interview was very laid back. There were two people in the interview who took turns asking a set of question, most of which related to patient care from clinicals. The questions were simple and mostly focused on customer satisfaction, problem solving, and conflict management in which you would than give examples from past experience. They manager does ask for your top 3 choices once you graduate and get ready for nursing, and is looking for externs who would want to be retained within WellStar.", "Interview Questions": "Give an example of a time where you provided excellent customer service. "}, {"date": "13 Aug 2019", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Wellstar Health System (Marietta, GA) in Oct 2017", "Interview Descriptions": "The interview process what very easy. I first applied online and was contacted by the hiring staff to complete a talent acquisition and personality quiz online. After completing those I was contact by the office manager and asked to come in for a one on one interview. It was very personable and I did not feel uncomfortable or nervous about it. I was offered the job on the spot.", "Interview Questions": "Why did you decide to choose to apply to Wellstar?"}, {"date": "14 Nov 2017", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Wellstar Health System (Atlanta, GA) in Oct 2017", "Interview Descriptions": "Not difficult at all. I applied online and received a call back three days later. The phone interview was pretty routine and not difficult.  The interviewers asked basic questions and seemed interested in my replies.", "Interview Questions": "Describe a time that you made a mistake."}, {"date": "17 Nov 2017", "title": "Travel Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Wellstar Health System (Atlanta, GA) in Oct 2017", "Interview Descriptions": "very friendly, open discussion about the career aspects. talk about how to handle the conflict on the unit and patients. How to take care of difficult patients and patient's family members.", "Interview Questions": "How do you manage the difficult patients? "}, {"date": "18 Sept 2017", "title": "Mobility Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Douglasville, GA) in Sept 2017", "Interview Descriptions": "Very short straight forward interview. Lasted around 15 mins. Asked a lot of questions about who I am and future plans. Went over the job description very thoroughly. Asked about my volunteer work", "Interview Questions": "Tell me about yourself"}, {"date": "31 Aug 2017", "title": "Executive Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Wellstar Health System in Aug 2017", "Interview Descriptions": "Recruiter with WellStar had reached out to me  via email (and left me a voice message) to set up an over-the-phone interview. I responded within the hour with a couple of days and times that were good for me. The recruiter then sent me a meeting notice for one of the dates/times I had mentioned, and said she would call me and confirmed my phone number. The day and time of the interview came and went without the recruiter having called me. I sent the recruiter an email inquiring if I had confused the date/time, and I also left a voice message for this person. At first I chalked it up to a mix-up in dates/time, or that the recruiter was out sick (or had an emergency.) To date, I've not had a follow-up phone call or email explaining the missed interview. I'm wondering if this is any indication of the type of organization they are. Very disappointing in the lack of common courtesy.", "Interview Questions": "N/A"}], [{"date": "3 Sept 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Wellstar Health System (Marietta, GA) in Aug 2017", "Interview Descriptions": "I applied to the New Grad Residency Program 8/04/2017. I received a phone call on 8/07/2017 to schedule an interview. I interviewed on 8/11/2017 and received an offer that same day. The interview consisted of 3 cardiac unit managers from different locations and one lady that facilitated the interview. It was a laid back environment, we sat around a big square table. You need to bring 5 copies of your resume (I printed mine out on resume paper and they appreciated it) and have questions for the interviewers prepared. The questions they asked were pretty basic, and they want you to pull from your clinical experience. They also give you nursing diagnoses to choose from and ask you what treatment would you expect to be ordered. By the time my interview was over, I had all 3 managers ready to offer me a position.", "Interview Questions": "Why did you choose nursing?"}, {"date": "19 Sept 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System in Aug 2017", "Interview Descriptions": "I am absolutely appalled and disgusted by this company. On the day of the phone interview, the recruiter called me an hour after the scheduled time. The actual interview went very well, and I was offered several positions about a week later. I was incredibly excited and called the recruiter back the same day to accept a position. After 2 weeks, I hadn't heard back from Wellstar about the offer letter or paperwork. I decided to call them a few times to see what was going on. Since nobody would pick up the phone, I left a polite message inquiring about the status of my offer. Two more weeks go by and still nothing, not even a call back. This morning, I called them back again and FINALLY the recruiter picked up the phone. When I asked what happened to my \"offer\", she had the nerve to tell me that the positions that I accepted were actually not available and that I may be able to work at another hospital. HOW ON EARTH do you offer someone a job that does not exist. HOW?! And WHY?! couldn't they have the decency to tell me what happened?! This is the most unprofessional experience I have ever had in my life.", "Interview Questions": "How would you treat a patient with renal failure"}, {"date": "30 Mar 2018", "title": "Insurance Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Wellstar Health System (Lagrange, GA) in Aug 2017", "Interview Descriptions": "Was emailed by management and asked to come in for an interview. During that time discussed my experience and was told about the company and the job itself, was told they would be in touch and heard back a few weeks later, was sent for drug screen and started two weeks after that, orientation was at the hospital and was sent to atlanta for emr training", "Interview Questions": "They asked my experience."}, {"date": "21 Jul 2017", "title": "Staffing Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Wellstar Health System (Marietta, GA)", "Interview Descriptions": "Just you're typical interview. Asked the same general questions. Took about 30 minutes. Overall it was a great interview, learned about the position. Was told there is lots of room for growth.", "Interview Questions": "Explain a time where you had to be a assertive"}, {"date": "21 Jul 2017", "title": "PSA Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System in Jul 2017", "Interview Descriptions": "I received a call from someone in Hr asking me to come in for an interview 2 days later. She didn't give her name and she spoke really fast lol. I got to my interview, and met the supervisor and manager who seemed pretty nice. Then the manager took me on a tour like others have said. The interview was short, so it wasn't much of an interview to me. They were interviewing A LOT of ppl for one position, so I think they already had someone in mind by the time my interview came around.", "Interview Questions": "How's your flexibility with the schedule?"}, {"date": "11 Oct 2017", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Wellstar Health System in May 2017", "Interview Descriptions": "Interview was simple. Basic questions. I was told things about the job that wasn't really true. I was told there would be opportunities for overtime and there isn't. I applied for the night shift and I ended up on days to be an \"assistant\" to the nurse manager.", "Interview Questions": "Why do you want to work for WellStar?"}, {"date": "2 Jun 2017", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System (Austell, GA) in May 2017", "Interview Descriptions": "Five panel interview with directors  of different departments. Everyone was friendly and welcoming. Total process took 20-25 minutes.  Asked multiple questions relating to patient access and customer service.  Talked about advancement opportunities.", "Interview Questions": "Strengths and weaknesses"}, {"date": "18 May 2017", "title": "Talent Acquisition Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wellstar Health System (Atlanta, GA) in May 2017", "Interview Descriptions": "I filled the application out online and I say within a week I got a call for to come in for an interview. It has been about three weeks and I haven't heard anything, so I guess I didn't get it. Oh yeah, It was for an internship. The talent Acquisition Manager was nice and it seemed like I might have been a shoe in, but I guess I read that wrong.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "18 May 2017", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Marietta, GA) in May 2017", "Interview Descriptions": "Applied online and got a call back from a recruiter.  Not a lot of information was given however I was told that it would be a group or panel interview with multiple departments. They asked a lot of med surg questions in my interview.  I was a little thrown off honestly but if you can maintain yourself you will likely receive an offer.", "Interview Questions": "Talk about a patient from clinical... and then they ask specific questions about the patient based on your answer"}, {"date": "2 Aug 2017", "title": "Medication History Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Lagrange, GA) in May 2017", "Interview Descriptions": "The face to face interview was pleasant but the pre hire process was a nightmare.  You get a call back telling you that you are hired on contingency, in other words don't put in your two week notice. I was also asked some very personal question from a public records profile online. Not an official background check simply invalid, unverifiable, false, misleading public records. Google or people finder.", "Interview Questions": "How do you react to working with difficult coworkers? Please give us a specific example of how you worked through the situation. "}], [{"date": "16 Apr 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Wellstar Health System (Lagrange, GA)", "Interview Descriptions": "I applied online several times and was contacted about a month later by phone. I was asked to come in for a interview scheduled approx. a month after that with management. After this I had a peer interview with nurses who already worked in the particular unit I had applied for. I was contacted by phone about a week later and sent an official offer letter shortly after.", "Interview Questions": "3 best and 3 worst qualities. a time you showed leadership. most difficult decision you have ever had to make."}, {"date": "7 Apr 2017", "title": "Retail Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wellstar Health System (Austell, GA)", "Interview Descriptions": "I received my initial email to meet with the Talent Acquisition Manager, during which we discussed the job, the pay, etc etc...We then went to the Dept and I interviewed with the Manager​ and Assistant Manager. Following that I received a contingency offer of employment, pending drug and background check. It is imperative​ that you move quickly, as you can end up waiting 30 days to start if you miss orientation.", "Interview Questions": "What kind of management style do I have, and how do I prefer to managed."}, {"date": "31 May 2017", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in Apr 2017", "Interview Descriptions": "The interview process was rather rigorous, but worth it if you have an ambition to work in a Wellstar hospital. Initially, my interview was in person with 2 nurses (a nurse manager and staff RN). I did not feel overwhelmed or nervous in the interview because of their welcoming demeanor and the style of questions that were asked. I was able to be myself and provide real, honest answers as if I was having a conversation with colleagues.", "Interview Questions": "Why do you want to work for us?"}, {"date": "3 May 2017", "title": "Social Media Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Marietta, GA) in Apr 2017", "Interview Descriptions": "They got right to the point. The interviewer was very direct, had done his research on me and asked good, insightful questions. He was very enthusiastic about the organization and his team.", "Interview Questions": "They asked me if I knew HTML coding. "}, {"date": "15 Feb 2020", "title": "Surgical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Atlanta, GA) in Apr 2017", "Interview Descriptions": "Phone interview. I submitted an application online. one week later I received an email from the recruiter after I submitted my application. I actually thought that my application will not be considered but I am glad it was. The recruiter had a few general questions with me. She then told me I will hear back for the next step.", "Interview Questions": "Why are you interested in working at WellStar Health System? "}, {"date": "14 Jan 2018", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wellstar Health System (Atlanta, GA) in Apr 2017", "Interview Descriptions": "Interview was fairly standard. Was asked about experience and why would I want the job. Questions like how do I react in certain situations and was asked about my future career goals. I interviewed with the doctor and hiring manager. And they both asked me questions about myself and why did I choose the medical field. Those types of standard questions. They definitely wanted to know my skill level and if I was able to do certain medical field related things.", "Interview Questions": "Why did I choose the medical field?"}, {"date": "12 Jul 2017", "title": "Project Management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Wellstar Health System (Marietta, GA) in Mar 2017", "Interview Descriptions": "Interview was average. Never heard back from recruiter after interview in spite of several follow up attempts. Received a generic email 4 months after the interview saying I didn't get the job. You can tell a lot by a company's culture with how they treat job applicants during the interview as well as after the interview. Not good at all!", "Interview Questions": "What are your project management skills?"}, {"date": "4 Mar 2017", "title": "Nurse Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System", "Interview Descriptions": "I applied for the nurse residency program via WellStar Careers site. I received a call about 2 weeks later for an interview. The feedback was quick. I made sure to submit all proper documentation and references in a timely manner.", "Interview Questions": "Chose a patient scenario (stroke, respiratory acidosis, seizure, or sepsis) and tell me how you will treat this patient?"}, {"date": "8 Jun 2017", "title": "Med Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Atlanta, GA) in Mar 2017", "Interview Descriptions": "The interview had a few job related questions and a great number of behavioral questions. The conversation was very pleasant and to the point. The Human Resource person was helpful and professional as well. Very good experience overall.", "Interview Questions": "Think of a case when you are under lots of stress. "}, {"date": "19 Dec 2018", "title": "Lifestyle Instructor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Wellstar Health System in Mar 2017", "Interview Descriptions": "went to office to interview. they asked typical interview questions. very friendly staff! lasted 30 minutes. I got a call back pretty quickly. good questions asked (strengths/ weaknesses) what would you do under stress...", "Interview Questions": "list strengths and weaknesses "}], [{"date": "15 Feb 2017", "title": "Clinical Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wellstar Health System (Marietta, GA) in Feb 2017", "Interview Descriptions": "My interview process with Wellstar was like a rollercoaster. I applied to about 10 different positions for Cobb General and Kennestone . I never received a callback until I submitted a cover letter and instantly I receive 4 interviews . Every one of them was a different experiences . I had two at Cobb General and two at Kennestone. I was contacted by HR and was prompted to fill out a professional reference form . Its important to fill this out or you won't be offer the job . All the interviews were panel interviews with the lead nurse in charge and sometimes other Care partners . All of the interviews was more than 30 mins long and I was ask a series of general question . 3/4 of the interviews were a positive experience. The other one I felt very discourage after I left . The Manager was rude and had a attitude . My advice is always become prepared and do some research prior to interview.", "Interview Questions": "Where do you see yourself in 5 years "}, {"date": "24 Oct 2017", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wellstar Health System (Marietta, GA) in Jan 2017", "Interview Descriptions": "Easy but all lies, it was a group interview the people were nice but they feed you a bunch of lies they over work there staff and the pay is horrible!!", "Interview Questions": "N/A"}, {"date": "21 Feb 2017", "title": "Security Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Marietta, GA) in Jan 2017", "Interview Descriptions": "The Interview was with shift supervisor & security director. They were o.k. but came to the interview late. We performed the interview in the security office and they asked several questions pertaining to the position and explained the position in depth.", "Interview Questions": "Level of experience, jobs worked, tell a little about yourself, etc."}, {"date": "26 Dec 2016", "title": "Central Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at Wellstar Health System in Dec 2016", "Interview Descriptions": "Very light and easy going\r\nQuestions were to the point \r\nHuman Resources was very helpful \r\nHiring process kinda long\r\nThe overall experience was kinda long but through\r\nI was offered the job \r\nThis is a good entry level position to build upon", "Interview Questions": "How long do you expect to work for WellStar and why?"}, {"date": "23 Apr 2017", "title": "Care Partner & Emergency Department Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System in Dec 2016", "Interview Descriptions": "I applied online for several care partner positions in  Dec.2016 at 2 Wellstar locations. I got 2 emails inviting me for interviews in less than a week. I was interviewed by 4 nurse managers at 1 location who were quite nice and personable. Then 3 managers at the other location; they were nice enough. From my application process to interviews to finally getting 3 job offers, it all took about 2 weeks.", "Interview Questions": "Why do you want to work for Wellstar?"}, {"date": "18 Dec 2016", "title": "Imaging Scheduler Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Wellstar Health System (Marietta, GA) in Nov 2016", "Interview Descriptions": "It took several phone calls and follow up to get an interview scheduled. Very awkward. Not much in the way of preperation either. Told it would be two people interviewing me and got their to find four people. Imagine my surprise.", "Interview Questions": "What was my weakness?"}, {"date": "15 Oct 2016", "title": "Unit Support Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Wellstar Health System (Marietta, GA) in Oct 2016", "Interview Descriptions": "I applied one day then the next I got a call about an interview. The interview went great they were super nice! They told me what shifts I might would be working, and talked to me about training. The next day I got a call about an offer.", "Interview Questions": "What is one thing your afraid of while transporting a patient?"}, {"date": "20 Dec 2016", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System (Marietta, GA) in Oct 2016", "Interview Descriptions": "The interview wasn't in my opinion an interview. At least it didn't seem like such. The atmosphere was laid back. I was interviewed by a supervisor and manager of the department. They both seemed happy to work at Wellstar. Interview was very smooth. I was interviewed in October 2016 and got an offer December 2016.", "Interview Questions": "How long I have been in nursing?"}, {"date": "12 May 2017", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Wellstar Health System (Marietta, GA) in Oct 2016", "Interview Descriptions": "Very brief and to the point. I met with the head of the Medical Dept and the Nurse Manager. They asked the standard questions about my background. They asked me what I would do in certain scenarios. They gave me a description of a typical day and asked how I would like it.", "Interview Questions": "If you have various tasks to complete before your shift ends, would you do all of your work quickly and be done, or would you space of the assignments over the duration of your shift?"}, {"date": "11 Nov 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 5 weeks. I interviewed at Wellstar Health System (Cobb, GA) in Oct 2016", "Interview Descriptions": "The waiting game was definitely the hardest part. It took a while for HR to pull my application. Once I was called to interview it was a round  table interview with several nurses that work on the floor. We met in an open room on the floor and discussed several patient/staff scenarios.", "Interview Questions": "What would I do if there was confrontation with another employee?"}], [{"date": "22 Mar 2017", "title": "Nutrition Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wellstar Health System (Austell, GA) in Oct 2016", "Interview Descriptions": "It was just simple answers, See if you're availability was good, and to see if you have any records on you. Later on they'll ask you for a drug test and thats about it.", "Interview Questions": "Do you have any experience in this job."}, {"date": "9 Sept 2016", "title": "Purchasing and Receiving Clerk Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System (Marietta, GA)", "Interview Descriptions": "Got a call from HR for a phone interview then face to face interview.  Interview was easy and simple.  More of a conversation than a STAR method interview.  He didn't tell me I would be going in the freezer to do a job.  I wish he was upfront with me on that.  But I was desperate and needed a job.  I got a call with an offer took it because HR said they give out great raises.  She was lying. Been here 6 months only got a .10 raise.", "Interview Questions": "Are you a hard worker?"}, {"date": "13 Oct 2016", "title": "Rehab Aide Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System (Kennesaw, GA) in Sept 2016", "Interview Descriptions": "Applied online and was contacted for an interview 2 weeks later. Simple interview. Lasted about 15 minutes with the Clinic Director. It was very laid back and professional. I wish I could of received an email saying the position was filled.", "Interview Questions": "Tell me about yourself"}, {"date": "28 Jun 2020", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System (Kennesaw, GA) in Sept 2016", "Interview Descriptions": "Amazing! Took awhile to get through HR though. Had to have a friend who was already employed give a referral. Manager very knowledgeable and pleasant. Received phone call with job offer otw home", "Interview Questions": "Clinical scenarios, why Wellstar, etc"}, {"date": "13 Aug 2016", "title": "Clinical Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System", "Interview Descriptions": "Very professional. All the people that took the time to interview me were passionate about the Wellstar system. I first talked to a representative in HR, and she did an excellent job giving me a review of the interview process, and the job details. She then walked me over to the interviewers. It was a group panel, and they asked me about my experience, and why I wanted to work for Wellstar specifically. I really enjoyed the interview with them.", "Interview Questions": "What are your experience?"}, {"date": "4 Aug 2016", "title": "Rrt Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Wellstar Health System in Aug 2016", "Interview Descriptions": "There were 3 people during the interview. 2 were not attentive. Their phones kept ringing and disturbing the interview. They really didn't know what type of questions to ask me. It was about a 20 minute interview. I think it could have been better.", "Interview Questions": "what did I know about wellstar"}, {"date": "24 Aug 2016", "title": "Environmental Service Tech Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Wellstar Health System in Aug 2016", "Interview Descriptions": "Applied on Wellstar website. Had a quick phone interview where she asked my availability and then invited me to come in for an interview. It was a panel interview with the director, hiring manager, and team leader.", "Interview Questions": "Describe a time where you gave excellent customer service."}, {"date": "31 Aug 2016", "title": "Clinical Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Wellstar Health System (Atlanta, GA) in Aug 2016", "Interview Descriptions": "I first met with an HR Recruiter after posting a online application. She called exactly 10 minutes after I sent my resume' through Wellstar.org!  She then sent me emails with the things I needed to finish such as the assessment and scheduled a interview for two days later! She was so nice and helpful we started to talk like old friends! She then took me down to meet with three other department heads and manager in a board room format, I was asked several question by two and one looked like he was totally lost! But I enjoyed talking with the two ladies and they were informative and kind!", "Interview Questions": "Name a time when you had to deal with a difficult patient?"}, {"date": "28 Nov 2017", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Wellstar Health System (Atlanta, GA) in Aug 2016", "Interview Descriptions": "I walked into the facility from an interview directly across the street in a private Dr. office and was able to speak with a hiring manager on the spot.  The talent counselor called the Head Nurse for an on spot interview and I was able to ask all the questions and get the details on the new renovations happening at the North Fulton Hospital facility in the near future.", "Interview Questions": "I looked to polish for the position.  How would I feel about cleaning feces from sick people?"}, {"date": "16 Aug 2016", "title": "Registered Nurse (RN) Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Wellstar Health System (Marietta, GA) in Jul 2016", "Interview Descriptions": "The interview process was unprofessional.  I was engaged by a recruiter and treated fairly well In the beginning. During the interview the leaders were not prepared and unorganized. Following my interview it took over a week a year back recruiter or the hiring manager.", "Interview Questions": "I was not asked that many questions.  Instead I was told more about the program. "}], [{"date": "22 Jul 2016", "title": "Front Office Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Atlanta, GA) in Jul 2016", "Interview Descriptions": "After submitting my resume online, I was called for a telephone interview. This was followed by a call to set up a face to face interview. Interview lasted approximately 30 minutes. After interview I was contacted by a Talent Acquisition Specialist by email to submit my references online and to provide information and approval for a background check. Once these were completed, I was telephoned within 12 hours and offered a job position.", "Interview Questions": "They simply asked me about my previous position and why I had left and asked if I had any questions and then we simply chatted about these things. Very easy interview. Were very focused on whether I would be a good fit for their office and that I had the proper experience."}, {"date": "29 Jul 2016", "title": "Medical Laboratory Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wellstar Health System in Jul 2016", "Interview Descriptions": "I interviewed with both the Laboratory Director and the Laboratory Manager. The interview was easy going and comfortable.   They asked about previous jobs positions and my ability to do routine task as a Medical Laboratory Technician.", "Interview Questions": "What made you choose to work at Wellstar Health System."}, {"date": "8 Aug 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Wellstar Health System (Atlanta, GA) in Jul 2016", "Interview Descriptions": "I came to one of the open interview days with HR. They asked me what unit I was interested in and then called up to the floor for me to meet with the nurse manager of the unit. On the floor, they showed me around and the process was more of getting to know me than a formal interview. This was a Thursday. She let me know the next step was shadowing, which I did on Monday night. And I got the offer Friday morning.", "Interview Questions": "Why are you leaving your last position?"}, {"date": "16 Jun 2016", "title": "Registration Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "The hiring process didn't take long. I interviewed with one manager during a job fair. Then a week or 2 later I got a call for another interview with another manager. Then after a couple of weeks I got offered the position. I went through the process of background and reference checks, drug screening etc. The had orientation that told me what I needed to know.", "Interview Questions": "What are your strengths and weaknesses? "}, {"date": "9 Feb 2019", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System (Marietta, GA) in Jun 2016", "Interview Descriptions": "Met with the VP of Compensation and was offered the job a couple of days later. There were several people in the lobby waiting to meet with her so that was rewarding to speak to some of them. The interview took about 25 mins and she was very passionate about her job which made me want to work there even more.", "Interview Questions": "Tell me about your self"}, {"date": "27 Jun 2016", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System (Austell, GA) in May 2016", "Interview Descriptions": "Interviewed in a panel setting, everyone was very nice and welcoming. Everyone seemed very down to earth and understanding of weaknesses and have a training period to assess that and work with you to improve that area. For a new graduate, that meant a lot! They explained the interview process and job requirements up front. Everyone took turns asking questions. Very smooth and professional interview!", "Interview Questions": "Typical interview questions, What are your strengths/weaknesses/qualities that stand out above the rest, etc."}, {"date": "17 Jun 2016", "title": "RN Staff Nurse, Labor & Delivery Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wellstar Health System (Griffin, GA) in May 2016", "Interview Descriptions": "Very informal and comfortable. Met with the department manager, who was a delight, and just discussed the position that was available. They were pretty quick to get back to me with an offer, but unfortunately their offer wasn't anywhere close to the salary I have been making. They were unwilling to negotiate, I kind of felt they did not want to pay for my experiences and knew they could hire a new nurse for a much lower price. Very sad as I loved meeting with the manager and I saw myself bringing a new future to the department as it grew under its new name of Wellstar Spalding.", "Interview Questions": "Why I applied for the position?"}, {"date": "2 Feb 2017", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wellstar Health System (Marietta, GA) in May 2016", "Interview Descriptions": "Very brief. Asked a few questions about my background and experience and told me a little about the company.  I had a feeling i didn't have the experience they were looking for. I plan on reapplying. They are a great company to work for from what I have heard", "Interview Questions": "How much experience i have"}, {"date": "15 Apr 2016", "title": "New Grad Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wellstar Health System", "Interview Descriptions": "Completed online profile and application received call for interview within 2 weeks or so. It was a panel. Interview consisted of many nurse managers from different hospitals with a teleconference included.", "Interview Questions": "Why wellstar"}, {"date": "22 Apr 2016", "title": "Account Resolution Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "Long and lengthy process so do not expect an call back quickly. And be prepared to know about the position you apply for. Go in confidence and be very approachable", "Interview Questions": "What do you know about AR?"}], [{"date": "22 Jun 2016", "title": "Registered Nurse (RN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Wellstar Health System (Atlanta, GA) in Apr 2016", "Interview Descriptions": "Everyone in the front office was very friendly. They made me feel much more relaxed before I went in for my interview. I interviewed with five different nurse managers. They were all very relaxed and made it a very comfortable interview.", "Interview Questions": "One time you had a disagreement with an employee and how did you handle it"}, {"date": "19 Mar 2016", "title": "BI Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System", "Interview Descriptions": "1st call by the HR- asked about my background, walk through of my resume, 3 strengths and weaknesses. what is difference between where clause and having clause. what is SELECT in SQL. different parts of a SELECT statement.Differences between Tableau and Qlikview. \r\n2nd call is in person interview- Asked about normalization, full join and UNION,how to create dashboards in tableau, what are the difficulties in tableau. compare and contrast Tableau,Qlikview and SSRS.", "Interview Questions": "Describe about a difficult situation you had with your co-worker"}, {"date": "25 Mar 2016", "title": "Clinical Care Partner Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Wellstar Health System (Austell, GA) in Mar 2016", "Interview Descriptions": "I applied about 20 times before getting a callback. Interview was with a panel of about 7 nurse managers. Fairly easy and informal. Simple and quick process after interview. I don't have anything else to say but I have a 50 word minim quota to reach", "Interview Questions": "The usual scenario about handling an angry customer"}, {"date": "28 Sept 2016", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Wellstar Health System (Atlanta, GA) in Mar 2016", "Interview Descriptions": "It's a panel style interview heald at the WellStar Development Center. My panel consisted of the head of the residency program, a clinical nurse educator, and the assistant nurse manager of the unit to which I would be hired.", "Interview Questions": "Explain a time you provided excellent customer service."}, {"date": "31 Oct 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (North Atlanta, GA) in Mar 2016", "Interview Descriptions": "Submitted application via website and was required to complete online personality assessment (like Myers-Briggs). Telephone interview, then F2F interview. Personality assessment took a while- plan on being in a quiet environment and stay focused. Streamline process that was timely.", "Interview Questions": "How do you handle demanding clients in a stressful setting?"}, {"date": "15 Sept 2017", "title": "ED Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Wellstar Health System (Marietta, GA) in Mar 2016", "Interview Descriptions": "It is a lot g process, everything about you is examined and looked at with a fine tooth comb. Your skills must be up to date. You are taught third way and you do everything thier way. Every job has to be verified and positive responses, references are a must and they are called and sent a letter with question to answer about you.", "Interview Questions": "How do you provide care to an upset patient and family?"}, {"date": "10 Feb 2020", "title": "Nurse Educator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wellstar Health System (Marietta, GA) in Mar 2016", "Interview Descriptions": "Meet with Human Resources then departmental manager, complete a background check, drug testing. Process took about 3 weeks prior to onboarding. Orientation lasted about 2 weeks, then floor orientation roughly about 8 weeks.", "Interview Questions": "Tell me about yourself"}, {"date": "9 Feb 2016", "title": "Full-time Employee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Wellstar Health System", "Interview Descriptions": "The hiring managers were very welcoming and made the interviewee comfortable. The interview was thorough as I expected it to be and was more casual than formal. I have always appreciated interviews that were more conversational than structured back to back questions. So, overall this interview process for Wellstar was impressive. I was even asked to come back for a second interview to meet staff members, which I had never had happen before.", "Interview Questions": "Interviewers expressed a lot of interest in my previous work experiences on my resume pertaining to relevant populations."}, {"date": "2 Feb 2016", "title": "Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Wellstar Health System", "Interview Descriptions": "Applied on-line, called for an interview a couple days later. Met with manager and director. Very casual and relaxed interview. After the interview was given a tour of the area and introduced to employees and department.", "Interview Questions": "Situational questions, \"How do you handle difficult employees \". Most questions were background based."}, {"date": "21 Dec 2016", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Wellstar Health System (Marietta, GA) in Feb 2016", "Interview Descriptions": "This was a group interview, allowing staff members of all levels to come in and ask various questions. Enjoyed this type of interview. I this was a great approach to put the candidate at ease, however, I think some people would be intimidated by this process.", "Interview Questions": "All types of questions regarding experience, body mechanics, school, work ethics. "}], [{"date": "24 Jan 2016", "title": "Clinical Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at Wellstar Health System", "Interview Descriptions": "Great relaxed environment. The unit staff really cared about who was going to get the position and truly wanted someone to be a part of their little family. I appreciated how relaxed the environment was. They knew that interviews were stressful and made it more like a conversation than a questionarre. It was odd how HR didn't sit in, just introduced and left.", "Interview Questions": "Name a difficult situation where you have given excellent care."}, {"date": "27 Jan 2016", "title": "Nutrition Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Wellstar Health System (Hiram, GA) in Jan 2016", "Interview Descriptions": "Met with 3 management members. Very nice. Easy questions. Didn't even ask for food temps just basics. Cutting. Favorite food to prepare. How-to prepare. Ingredients. Are you in school? Reliable transportation? Describe a hard scenario and how well you responded? Just keep eye contact!", "Interview Questions": "Why do you feel your a great candidate for the position?"}, {"date": "6 May 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Wellstar Health System (Atlanta, GA) in Jan 2016", "Interview Descriptions": "I was a new grad and it was a panel of managers.  Overall the situation was not as stressful as I expected.  Everyone was very nice and they wanted you to succeed", "Interview Questions": "A difficult situation with a patient and how did you deal with it?"}, {"date": "1 Sept 2016", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System in Jan 2016", "Interview Descriptions": "Applied online, they called mi interview on phone then one on one.questions were good. I was interviewed by two people at same time each one asking questions back to back.", "Interview Questions": "If a patient fall, what the first thing u do?"}, {"date": "26 Mar 2016", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 months. I interviewed at Wellstar Health System (Marietta, GA) in Dec 2015", "Interview Descriptions": "VERY slow process in that it took 5 months from the time that I applied until the time I learned that they were going to look for more candidates. Interviewed in person on two separate occasions with a total of 15-16 people. I really liked the organization but felt like they really didn't know what they wanted. Overall great experience as they seemed to be a great organization and very hospitable throughout the process.", "Interview Questions": "What's a perception that people have of you that isn't accurate, and why? "}, {"date": "27 Oct 2015", "title": "Information Security Team Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System", "Interview Descriptions": "Specific questions, explanation of position and expectations, laid back atmosphere. The interview was 2:1. They asked very specific questions about items on my resume. They allowed plenty of time at the end of the interview for me to ask the questions I had prepared. I was very comfortable during the interview; it was not a stressful experience.", "Interview Questions": "Describe your experience with performing risk assessments."}, {"date": "31 Oct 2015", "title": "Registered Nurse (RN) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Atlanta, GA) in Oct 2015", "Interview Descriptions": "Interviewed before a panel, panel consisted of managers from department of several different hospital locations; included a multitude of questions, personality, situational, clinical, past experiences; allowed time for questions and/or concerns from potential employee; very pleasant attitude, positive experience", "Interview Questions": "Why do you want to work for Wellstar?"}, {"date": "14 Oct 2015", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Wellstar Health System (Marietta, GA) in Sept 2015", "Interview Descriptions": "I applied online and I heard from the manager about 5 days later. I was asked to come in for an interview with him. I was sent a pre-interview reference check and background check. He was very laid back. I interviewed with him and then was sent to another office to interview with 4 employees in sets of two. After the interview I was given a tour of the pharmacy and was informed that I would hear from him in about 2 business days.", "Interview Questions": "How well do you handle conflict? What are your strengths and weaknesses? What do you want to know about the organization? What type of experience do you have? How flexible are you?"}, {"date": "30 Oct 2015", "title": "CCP Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (North Atlanta, GA) in Sept 2015", "Interview Descriptions": "I applied online from the wellstar website. After a couple of months I was then called and asked a few questions.  A couple of weeks later I was called again and asked to go to the location for a face to face interview. Preparing for an interview is always nerve racking no matter how prepared you are. Just be confident and positive. Let them know what you have to offer and what you can contribute to the company.", "Interview Questions": "Why do you want this job"}, {"date": "18 Nov 2015", "title": "Registered Nurse (RN) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wellstar Health System (Marietta, GA) in Sept 2015", "Interview Descriptions": "Answer standard questions on-line then you will get called back by HR if you are picked for an interview.  Typically HR will walk you over to the unit to introduce you to the manager doing the interview.", "Interview Questions": "Why you want to work at Wellstar\r\nWhy do you want to change jobs"}], [{"date": "18 Aug 2015", "title": "Certified Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "Looking forward to an interview with this company. Had few friends already did and they were very impressed. Very fair and professional. Their benefits package  and hours are also attractive", "Interview Questions": "What experience in the field do you have?"}, {"date": "14 Aug 2015", "title": "New RN Residency Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System", "Interview Descriptions": "Applied online and it took a week for someone to call me. A quick phone interview was done over the phone. The panel interview was scheduled a week later. The panel interview consisted of 3 managers from different floors. Each manager asked a question and they all took notes. I got a total of 5 questions. The managers were very nice. The interview lasted about 45 minutes.", "Interview Questions": "How do you handle conflict with a coworker?"}, {"date": "6 Aug 2015", "title": "Patient Access Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Hiram, GA) in Aug 2015", "Interview Descriptions": "Interview went smooth.  Asked alot of questions just wanted to know how long it takes for them to contact you back if hired. But most of all they were very friendly and upfront about the company policies.", "Interview Questions": "How to deal with difficult co-workers and nmanagers?"}, {"date": "29 Jul 2015", "title": "Front Office Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wellstar Health System in Jul 2015", "Interview Descriptions": "I interviewed 3 times with the manager and several doctors.  All of the interviews were pleasant and appropriate.   Entire process took 30 days.  Process is extensive. Drug screen,  background check. Health assessment.   Now on to orientation.", "Interview Questions": "why do you want to work for Wellstar?"}, {"date": "29 Jan 2016", "title": "Senior Systems Administrator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 5 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in Jul 2015", "Interview Descriptions": "Technical screen by third party consulting company, then face to face interview with hiring manager.  Fairly simple process that appears to be geared more toward getting a warm body in the door.  Tech screener asked pretty standard questions for the job role and spent much time promoting the benefits of working in the healthcare industry.  Hiring manager asked zero technical questions and concentrated on personality fit.", "Interview Questions": "Tell me about yourself."}, {"date": "12 Jun 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in Jun 2015", "Interview Descriptions": "Met with nurse managers and  was asked to describe experiences as a nurse using the STAR approach. Was asked about my work history and my goals for the future. Interview lasted about 45 minutes.", "Interview Questions": "Tell us about a time you had a conflict with coworker?\r\nTell us a time you made a difference in the life of a patient?\r\nWhat does being a nurse mean to you?\r\nTell us about a time you made a mistake?"}, {"date": "15 Jul 2015", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Wellstar Health System (Marietta, GA) in Jun 2015", "Interview Descriptions": "I was interviewed by a panel of 6 women.  They all asked me varioud questions about my current and previous experience.   One lady was really stern,  but i didn't get caught off guard by it.  Overall I thought the interview went good.  But i didnt get the job.  This was my second interview with wellstar.   I don't know why it's so hard to get hired by them!", "Interview Questions": "Whst is one of your bad qualities"}, {"date": "19 Jul 2015", "title": "Front Office Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wellstar Health System in Jun 2015", "Interview Descriptions": "Applied through Wellstar's Career page. Took a while to receive a call back to interview. Inteviewed with several different offices. If you advance past the interview the next phase in hiring process is slow. There is not any communications as to status of progression on the website. You just have to wait and see. Overall the interviews went as to be expected.", "Interview Questions": "Why do you want to work for Wellstar?"}, {"date": "2 Nov 2015", "title": "Front Office Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wellstar Health System (Atlanta, GA) in Jun 2015", "Interview Descriptions": "Apply online, interview was with manager and supervisor, contacted 3-4 days after interview from HR saying I've gotten the position, had to fill out references, background check, drug test, physical exam, orientation for two days.", "Interview Questions": "Do you have experience with Epic? Computer literate? Education?"}, {"date": "27 Jun 2015", "title": "Licensed Practical Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Wellstar Health System in Jun 2015", "Interview Descriptions": "Went very well. Nice and short , but very informative. They gave me multiple options on interview times to work around my schedule. The commute btwn the interviewing location and the actual location for work was far, not sure why?", "Interview Questions": "How did I feel working with X population of people?"}], [{"date": "23 Oct 2015", "title": "Assistant Vice President Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in Jun 2015", "Interview Descriptions": "Phone interview by recruiter, followed by in-person interview. In-person interview with HR included briefing in benefits and brief review of background. Interview with potential supervisor briefly included background and went on to discuss management philosophy, expectations in first year, and upcoming structure changes.", "Interview Questions": "What is your management style?"}, {"date": "16 May 2015", "title": "Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "Simple application but a long wait time to hear back. It was a 2 part interview first with an HR representative and the second was a  Panel interview. The HR interview was straight forward basic questions but the panel asked tricky but relevant questions.  HR is a little disorganized but friendly.  Overall a good experience but other hospitals offer more clarity throughout the process.  Well star is a heat place to work and offered me a good stepping stone for my career.", "Interview Questions": "List strengths and weaknesses."}, {"date": "3 May 2018", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Marietta, GA) in Apr 2015", "Interview Descriptions": "It was one on one then group or panel interview. I did not find it too difficult. I also had a phone screen call before the one on one.I found the panel interview more taxing as they had multiple questions coming at me from different people . It did not seem very organized. I left feeling frustrated.", "Interview Questions": "why do you want to work here?"}, {"date": "19 Apr 2015", "title": "Lab Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wellstar Health System (Cobb, GA) in Apr 2015", "Interview Descriptions": "They  conducted  a very thorough background  check  on  both  criminal and  employment verification,  they  check  all  references thoroughly.  The  interview  was  very  easy  and  mostly  common  sense questions like  order of  draw and  how  to  correctly  enter  a room.  If  you  just  be  yourself  then it  isn't really a difficult process at all.", "Interview Questions": "How  do  you  handle  customer service with  a difficult patient? "}, {"date": "5 Jun 2015", "title": "Front Office Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Wellstar Health System (Marietta, GA) in Apr 2015", "Interview Descriptions": "very long process, everyone friendly and pleasant, ask normal interview questions, smooth and laid back environment. nice manager and recruiters, I had 3 interviews then finally got an offer. the process is very long. they are very particular when screening their candidate,  very welcoming and h elpful and understanding.it. bruhhhhh ffffffffttt hovercraft#\r\npretty", "Interview Questions": "what are your strengths and weaknesses"}, {"date": "10 Mar 2015", "title": "Environmental Service Tech Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Wellstar Health System", "Interview Descriptions": "I applied on line. Weeks later I was contacted by a recruiter. We had a phone interview. Two more weeks went by before I was contacted again. They invited me to do a face to face interview.", "Interview Questions": "In 3 to 5 years where do you see yourself?"}, {"date": "17 Feb 2015", "title": "Lab Support Specialist (Phlebotomist) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wellstar Health System (Marietta, GA)", "Interview Descriptions": "Interview was formal and straight forward. The manager asked situational questions. Be prepared to explain previous examples of patient care/customer experience in great details. Explain each situation and how you handled it to resolve the issue.", "Interview Questions": "\"Explain how you handle high stress situations and give one example of how you handled that situation in a fast past environment.\""}, {"date": "18 Nov 2016", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Wellstar Health System (Marietta, GA) in Feb 2015", "Interview Descriptions": "the interview was to the point and informative on duties and responsibilities. Also, what you can expect from them and also what they can expect from you. You have to pass the drug test, psychological exam and possess a current license to carry.", "Interview Questions": "How much experience do you have?"}, {"date": "2 Jul 2016", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Wellstar Health System (Marietta, GA) in Jan 2015", "Interview Descriptions": "There was no interview. I was told that I was hired because I was black. All I had to do was stick a patient.  The patient was so incoherent he he didn't even know that I wasn't an employee.", "Interview Questions": "What days do you want to work?"}, {"date": "25 Oct 2015", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in Jan 2015", "Interview Descriptions": "Was called in for an interview,  asked the order of draw.  Had to  perform venipuncture on a current employee properly. Asked  how do I feel about team  work and employees you may not  get along with.  Met the current employees and were shown around the department. It was a fast interview.", "Interview Questions": "What is the order of draw"}], [{"date": "4 Sept 2014", "title": "Manager and Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System", "Interview Descriptions": "Phone screen quickly after applying, in person interview for one, no other contact after phone screen. Would be more professional if they acknowledged or provided closure to the process, instead of leaving you hanging out there not knowing if you were being considered or not.", "Interview Questions": "N/A"}, {"date": "9 Aug 2014", "title": "Front Office Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wellstar Health System", "Interview Descriptions": "I submitted an application online and was called into the office to meet with the practice manager. She asked about my background and experience and what my future plans were. Nothing \"situational\" or standard cheesy interview questions. She called me about a week later and said they wanted to hire me. They had HR contact me to set up an official start date and orientation time.   Since HR was involved, it took a lot longer than some jobs, but that seems like the norm when corporations are involved. But it was nice to come into an interview and not be thrown a bunch of b.s. interview questions. It should just be a conversation between two people, not an interview to be the next Miss America.", "Interview Questions": "Nothing difficult or unexpected."}, {"date": "11 Oct 2018", "title": "Liaison Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in Aug 2014", "Interview Descriptions": "Seated in a room with 30+ other applicants. We were called to individual tables to be interviewed. I was qualified for several positions so they kept shuffling me from person to person. I was not offered a job from that day, however, the recruiter called and left a message that another hiring manager wanted to speak with me. I returned the call more than once and never got a reply to set up the new interview..", "Interview Questions": "They asked if I thought I could keep up with the pace of the job."}, {"date": "2 Jul 2014", "title": "Staffing Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Wellstar Health System", "Interview Descriptions": "Awkward. Questions were all over the place. Nothing about me as an individual just about how I would do the job. As a result there is a severe lack of cohesion among coworkers in the department.", "Interview Questions": "How do you have fun at work?"}, {"date": "1 Jun 2015", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Wellstar Health System in Jul 2014", "Interview Descriptions": "Applied mid May, first call back mid July; first interview end of July; notice of acceptance mid August. There were 8 people in my interview - all from different departments within PAS. They were real people and were all very friendly.", "Interview Questions": "What's the best example of customer service you have shown?"}, {"date": "25 May 2014", "title": "LIne Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "okay and not good as no real concern to find out about the candidate.  Management review was harsh and theyt seemed to care less and only wanted a body to meet criteria.", "Interview Questions": "N/A"}, {"date": "15 May 2014", "title": "Registered Nurse (RN) Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Wellstar Health System (Marietta, GA)", "Interview Descriptions": "It took 4 months to complete the process. HR was nice but very slow. The people that interviewed me were very nice, very professional. I  spoke with people working in the department and they seemed not to be a team and said the PTO was not so good or the health insurance which surprised me and was true when I looked into to it deeper. Although PTO accrues, you can't take any during the first 6 months. I was not planning on it but emergencies happen so it made me uncomfortable. I have seen where that's used to discipline people, read it here on the reviews. Also the new health insurance plan is just an Obama care plan they sell under Piedmont-Wellstar Health Plan. I read the fine print and was surprised about the high deductibles, copays and coverages if you don't get the premium plan, not sure if everyone qualifies to purchase it, didn't get that far. You do have to use their doctors it looked like, which I think would be fine unless you already have doctors somewhere else you want to keep using.", "Interview Questions": "Typical questions about your background, education, experience and such. Don't remember any unexpected questions for a nursing position."}, {"date": "9 Jun 2015", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Marietta, GA) in May 2014", "Interview Descriptions": "After submitting my application online, I did two working interviews which I didn't get paid for. I then waited for a month before I was finally offered a job. It took almost three months and they wouldn't tell me my salary until I was signing my contract.", "Interview Questions": "Would I be willing to travel?"}, {"date": "22 Apr 2014", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System", "Interview Descriptions": "HR called for an interview a week after I applied online. She offered me the position at that time and we negotiated salary due to my work experience. They do an very extensive background check and reference check.", "Interview Questions": "Tell me a time that you had to deal with an extremely difficult patient.."}, {"date": "12 Oct 2014", "title": "OR Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Atlanta, GA) in May 2014", "Interview Descriptions": "They're basically wasn't an interview with the manager, because you have to do an online personality assessment and a telephone interview with a HR representative. They'll give you at out while you're there and let you start whenever you like. The employees are very mean to new people. And they have a high turnover rate.", "Interview Questions": "Can you deal with difficult doctors?"}], [{"date": "29 Mar 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 days. I interviewed at Wellstar Health System", "Interview Descriptions": "I was interviewed by a group of nurses. Intimidating to me.Second time on another unit. The manager who interviewed me was not the one who became the unit manager. That upset me.", "Interview Questions": "Why did you leave your last position? I could have asked what happened to the manager who hired me?"}, {"date": "13 Mar 2014", "title": "Patient Access Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Wellstar Health System (Austell, GA) in Feb 2014", "Interview Descriptions": "Applied online, received invitation for F2F interview, email confirmation with request for additional information for previous employment verification, arrived at interview 30 min early, was ask to wait in hallway, when ask to join the interviewer there were 2 interviewers present, both ask situational type questions, and why I wanted to work for Wellstar. I found the interview to be a bit unprofessional as they would start to ask questions at the same time and then there was a you first, no you first type of situation. The interview lasted approximately 45 minutes to 1 hour. At the end of the interview I was told they would contact me after consulting each other and receiving verification from previous employers. I never received any contact and while I attempted to follow up I was only able to leave a message and still never heard back. It would have been considerate to at least send a TBNT email.", "Interview Questions": "These type of interviews always ask things like, How did you handle working with a coworker that didn't like you? "}, {"date": "26 Jan 2014", "title": "Front Office Coordinator/Front Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wellstar Health System (Marietta, GA)", "Interview Descriptions": "All application are done online through WellStar.org.  It takes a very long time to hear back from someone.  Most people do not hear back within 6 months.  It is helpful to keep logging into your account and keep your resume as up to date as possible.  Once an HR representative contacts you regarding your position, you meet with a recruiter and possibly the manager you will be working under the same day.  If you are accepted, another meeting is scheduled to officially offer the position, the salary and benefit information.", "Interview Questions": "What is one instance of outstanding customer service that you have displayed? This is the most common question."}, {"date": "5 Jan 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System", "Interview Descriptions": "Received call with interview invitation email to follow. Went to live interview. Roundtable with multiple managers/educators. Received job offer the following day via phone, with email to follow.", "Interview Questions": "N/A"}, {"date": "9 Dec 2013", "title": "Director of Communications Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wellstar Health System in Nov 2013", "Interview Descriptions": "I received a phone call / screening about a week after I applied, and was then given a homework assignment that consisted of crisis communications exercises and a personality test. During the interview, they also wanted to know about high profile media placement.", "Interview Questions": "No unexpected questions.  "}, {"date": "28 Sept 2015", "title": "Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in Sept 2013", "Interview Descriptions": "I was very sick and had a raspy voice, but through that, my interviewers could tell that I had the personality and experience for the job. They gave me a tour of the environment after the office interview. I was interviewed by the manager and supervisor. They were very polite and because my experience and availability aligned with their desires, I was an easy hire.", "Interview Questions": "How well would you say you are at customer service."}, {"date": "26 Jan 2016", "title": "ICU RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Wellstar Health System in Aug 2013", "Interview Descriptions": "It was easy.  I enjoyed talking with my managers.  They asked appropriate questions.  I had an interview in front of 4 people that asked about my previous travels and experiences.  I was offered the job quickly.  I had to complete a lot of paperwork.", "Interview Questions": "A time when I had an issue with the doctor."}, {"date": "28 Nov 2014", "title": "Trainer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Wellstar Health System in Aug 2013", "Interview Descriptions": "The interview was a very basic interview questions, nothing special.  Had to present to verify that you could speak in front of a crowd.  In and out of the interview in under 10 minutes.", "Interview Questions": "N/A"}, {"date": "15 Jul 2013", "title": "Senior Systems Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Wellstar Health System (Marietta, GA)", "Interview Descriptions": "Probably one of the worse interviews I've ever been through. The hiring mgr flat talked me out of the position. Was saying stuff like I can only guarantee 3 months but there is a chance to go longer it all depends on you and other contractor's performance. Was in the middle of doing a DC migration and i asked how many PMOs were assigned he said none. That his team was \"just doing it\". Sorry i dont want to be part of a half assed data center move. He did not ask me any questions about myself or what I've done at previous jobs. This was a red flag to me. The environment seemed very hectic and employees faces seemed \"less than thrilled\" to be there. I told the recruiter I was no longer considering this position.", "Interview Questions": "They were all soft questions. Nothing technical. Which led me to believe they just wanted a warm body and didn't care who they got. This is not an environment that I can be successful in. "}, {"date": "24 Feb 2016", "title": "Medical Records Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Wellstar Health System (Marietta, GA) in Jul 2013", "Interview Descriptions": "I had interview with Claudia. It took a hour interview with her. She did review my resume and cover letter that I gave it to her. I described my experience as working for medical field.", "Interview Questions": "Why did you wanted to be part of this team?"}], [{"date": "8 Sept 2016", "title": "Clinical Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System (Marietta, GA) in Jul 2013", "Interview Descriptions": "Onsite interview after online resume submission. You must pass the gallop assessment to be hired. You go to meet the HR recruiter. They give you a tour and you meet the interviewing manager. Some of the interviews were group interviews, while others were one on one. After the interview it takes about three weeks until orientation. The interview process was very easy and overall it was a good experience,", "Interview Questions": "Describe a time you went above and beyond to provide the best quality care in a difficult situation?\r\nWhat makes you the best candidate for the job?\r\nHow do you deal with family chaos?"}, {"date": "13 Aug 2013", "title": "Front Office Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wellstar Health System (Marietta, GA) in Jul 2013", "Interview Descriptions": "I applied online and after four weeks, I was contacted by the recruiter. Since I was already in their system from previous positions that I applied, it was quick process. I was set an interview within a few days. On the day of interview I meet with the office manager. She went into the job listing, duties, and benefits offered with the company. It was a pleasant experience.", "Interview Questions": "Nothing was difficult, straight to the point what experiences I had previously."}, {"date": "14 Nov 2016", "title": "Environmental Service Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Wellstar Health System (Douglasville, GA) in May 2013", "Interview Descriptions": "Applied online got called back within two days interviewed..accepted offer. Had to email references so that they could describe the type of person I am. Had to do a drug test and got called to say I was hired", "Interview Questions": "Are you comfortable handling blood?"}, {"date": "17 Apr 2013", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wellstar Health System", "Interview Descriptions": "I found the posting on wellstar.org. In addition to applying through the website, through a connection I had, I found the manager's name and e-mail and sent a personal, detailed e-mail of my personal history and why it was relevant in addition to my resume.\r\n\r\nAbout 3 or 4 weeks later, I received a phone call from the manager, asking basic HR questions about my experience, what I expected from the job, etc. Over the phone, we scheduled an interview in person.\r\n\r\nHR followed up with an e-mail and during the interview, I was interviewed by 6 people in different departments in a comfortable room with rocking chairs. Since the department emphasized women and children, the atmosphere was more about nurturing. We negotiated pay right on the spot and I went to orientation about 2 weeks later.", "Interview Questions": "You are overqualified for this position. Why would you want to take this?"}, {"date": "22 Oct 2016", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Wellstar Health System (Marietta, GA) in Apr 2013", "Interview Descriptions": "Received first call from team supervisor to setup interview,then was interviewed by a day shift supervisor who asked basic interview questions relating to my resume,afterwards walked over to manager for final interview.", "Interview Questions": "what would you say is your weakness?"}, {"date": "6 Dec 2015", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wellstar Health System (Windy Hill, GA) in Apr 2013", "Interview Descriptions": "We had a group interview, each took an individual written test. selection was based performance based. Followed by a 3 weeks paid training. Everything was medical base and nothing difficult since some of the questions offered multiple choices.", "Interview Questions": "tell us about yourself"}, {"date": "26 Jul 2015", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Wellstar Health System (Austell, GA) in Apr 2013", "Interview Descriptions": "There was a quick phone interview.. be sure to speak on skills related to the position. Later there was a panel interview... ALL BEHAVIOR based.. be sure to give examples of relateable job experience.. last was a quick meeting with direct supervisor where I completed paperwork to start.", "Interview Questions": "name a time when you provided excellent customer service, name a time when you went over and beyond, name a time when you were asked to do something against your morals..."}, {"date": "1 Dec 2015", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in Apr 2013", "Interview Descriptions": "The interview process was very good, the manager at the time was very down to earth, didnt make me feel nervous, was interested in my interest if that makes sense.", "Interview Questions": "What do you look for in a manager?"}, {"date": "5 Mar 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System", "Interview Descriptions": "Pretty straightforward..did a mini-phone interview with HR, then got a call back for a face to cafe. Met with HR and then the hiring manager.", "Interview Questions": "It wasn't a difficult interview at all, pretty standard \"why do you want to work here\", \"tell me about your career\" type questions"}, {"date": "31 Jul 2016", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Marietta, GA) in Mar 2013", "Interview Descriptions": "They called me and did a brief phone screening later called me back for a sit down interview with Human Resource. Then during the sit down interview the recruiter asked a few questions. A few days later she called me back to let me know that I have the job.", "Interview Questions": "Why did you choose this particular hospital?"}], [{"date": "1 Feb 2013", "title": "Radiology Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Wellstar Health System", "Interview Descriptions": "Long", "Interview Questions": "Why do you want to work here"}, {"date": "31 Oct 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Wellstar Health System (New York, NY) in Feb 2013", "Interview Descriptions": "It was the same as every interview that any one has ever gone on before. so it was easy to see that the recruiter helped out with making it a easy set up for the job.", "Interview Questions": "have you worked in the health care field "}, {"date": "18 Nov 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Wellstar Health System (Atlanta, GA) in Jan 2013", "Interview Descriptions": "The interview was an in person Panel interview with nurse manager and assistant nurse manager at the Hospital Unit conference center. It was casual and straight forward. This was following the Gallup Career Personality Assessment online.", "Interview Questions": "Tell me about a time when you had to explain a complex issue to someone who knew very little about it. How did you make sure you got the point across? \r\n\r\nDescribe a situation in which you handled a dissatisfied or difficult patient. Specifically, what did you do? \r\n\r\n"}, {"date": "9 Jul 2014", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 months. I interviewed at Wellstar Health System in Jan 2013", "Interview Descriptions": "Have a strong knowledge of healthcare terminology. Do you research on the softwares, and equipment that are supported Flexible shift. Dress to impress as if you wanted the managers position. Be positive, on time, very confident, Honest and good references", "Interview Questions": "How did you react in an emergency 911 situation"}, {"date": "18 Mar 2014", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System (Marietta, GA) in Nov 2012", "Interview Descriptions": "Initially interviewed with HR recruiter. She asked typical \"situational questions\" Tell me about a time when.... Then met with the department manager, toured the floor and talked with staff which was extremely helpful.", "Interview Questions": "What would the most challenging adjustment coming on board"}, {"date": "7 Mar 2014", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wellstar Health System (Marietta, GA) in Sept 2012", "Interview Descriptions": "Two interviews.  First interview a phone interview with HR, and the second with management.  Job offer extended a few days after second interview. \r\nApplied online.  Hard company to get on with.  Required to take a personality, psychological test upon applying.  Second interview was with management, and then taken around department to meet the staff, and have them ask you questions.  Easy interview if you have the knowledge and experience necessary.", "Interview Questions": "Asking about dosages and frequencies of medications that aren't required knowledge for this specific job.  "}, {"date": "3 Dec 2014", "title": "IT Copr Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Wellstar Health System (Atlanta, GA) in Aug 2012", "Interview Descriptions": "Communications about the job was slow and there were many delays.  Once the process started, it moved along.  The Org wasn't sure of my actual duties, that it would come later.", "Interview Questions": "Where do you want to be in 5 yrs."}, {"date": "1 Jun 2014", "title": "Project Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Wellstar Health System (Atlanta, GA) in Jul 2012", "Interview Descriptions": "The interview process was very relaxing. The managers were very friendly and everyone had positive attitude.", "Interview Questions": "How did long did it takes for WellStar to adopt and adapt to the Change Board"}, {"date": "23 Sept 2015", "title": "Front Office Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellstar Health System (Marietta, GA) in Jul 2012", "Interview Descriptions": "Phone interview with the recruiter, then face-to-face interview with department manager. After that you or may not have a second interview in front of a panel; depends on the department.  Pretty straight to the point.", "Interview Questions": "What is customer service to you?"}, {"date": "19 Jul 2016", "title": "Telecommunication Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in Jun 2012", "Interview Descriptions": "Very down to earth. The group I interviewed with were very in touch with the industry and the latest and great technologies which made my interview earlier. The interview team was panel style and included basic question. They asked the questions you would expect to hear at an interview.\r\nWhat do you know about the company.... Tell us about you... Past experiences.....", "Interview Questions": "What do you know about the company.... Tell us about you... Past experiences....."}], [{"date": "20 Jun 2014", "title": "IT Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Wellstar Health System (Atlanta, GA) in Jan 2012", "Interview Descriptions": "HR assessed almost 200 resumes and sent only 10 over to the hiring manager. HR initially did not want to offer the requested salary stating that they are a not-for-profit organization. The hiring manager, however, overrode HR so that they could draw better talent into their growing organization. Once on board, the entire first day is dedicated to orientation. The department I hired into did not have a formal on-boarding process, which made it quite difficult to understand who to go to for basic needs.", "Interview Questions": "Tell me why I should NOT hire you."}, {"date": "24 Jan 2012", "title": "Patient Access Services Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Wellstar Health System (Kennesaw, GA) in Jan 2012", "Interview Descriptions": "I interviewed with a panel first and then moved on instantly to a one on one interview with HR management.. it went backwards... However, I was asked general questions.. weaknesses, strengths, availability, past experience and to describe important assets like customer service, being on time and be ready to give examples in all your responses.", "Interview Questions": "Past experience"}, {"date": "2 Jul 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Wellstar Health System (Marietta, GA) in May 2011", "Interview Descriptions": "The interview process when I was hired was painless and easy.  It has changed since then with new management.  They also required a personality test to make sure that I was a good cultural fit, which was interesting.", "Interview Questions": "They asked about my experience."}, {"date": "26 May 2011", "title": "Patient Access Services Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wellstar Health System (Austell, GA) in May 2011", "Interview Descriptions": "First a Phone interview with HR. Then a few days later another interview with HR, passed the screening, then across the street to a 1 hour interview with the PAS department hiring manager. The next day HR calls to schedule a week later, an eight panel member, 90 minute interview.  Four days later, “a walking tour of the facilities” with four of the panel members and the hiring manager. The HR person even sounded somewhat aghast that after three interviews including the eight person panel interview they would make you come back a third time for “a walking facility tour”. She said \"she wants you to come in again!\" Three days total investment which would be fine if you are not losing PTO time on your current job. \r\nThree weeks later, I still have no courtesy decline communication or answer. I have passed a government security clearance, so no background issues.  I feel it is extremely rude and inconsiderate for a candidate that invests this much time to receive no communication for a 32k a year position. If you just did a phone screen and got no decline letter, maybe that is acceptable.\r\nI assume that this hiring manager for  routinely wastes  a lot of WellStar's time, her time and is extremely inconsiderate of a candidates time, gas, and the fact that you have to use vacation or personal time to come to 4 interviews. Not to promptly notify one of your status is extremely rude after making it down to the final two. How much time could it possibly take to extend this simple courtesy after a candidate willingly invests this much and the manager clearly has time to spare?", "Interview Questions": "Would you be upset if you spent a lot of time completeing a task then were told you needed to do it differently?"}, {"date": "8 May 2012", "title": "Manager, Service Excellence Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wellstar Health System (Marietta, GA) in Apr 2011", "Interview Descriptions": "The interview started off positively with the actual team I would be working with.  By the time I was sent over to speak with the HR Manager and others (Interview #5) I was pretty worn out.  I just don't think it takes 5 interviews to figure out you won't hire.", "Interview Questions": "It was primarily target selection interview... typical"}, {"date": "2 Nov 2010", "title": "Health Place Exercise Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Wellstar Health System (Marietta, GA) in Sept 2010", "Interview Descriptions": "UNPROFESSIONAL conduct within Wellstar Health Place both from the Director's Secy to the relisting of the position after the second interview without further communication.  I saw the position was relisted and it had been 2week since my interview, therefore wondered if my candidacy was no longer in the running. All I got was a reply that said THANK YOU. NICE JOB", "Interview Questions": "So you owned your own business?"}, {"date": "29 Jul 2011", "title": "Hospital Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Wellstar Health System (Atlanta, GA) in Aug 2010", "Interview Descriptions": "First off - if you think it is a good idea to apply to Wellstar online - think again. Even when qualified, the return reply is more often than not an automatic rejection. \r\n\r\nI applied online and was rejected last yr and then received an interview call a month later. They do not follow protocol in the contact method and HR does not care about your concerns that they do not follow protocol in the hiring process. The person running the HR hiring dept responded to an email I wrote in an unprofessional manner. I had called  (she was never available and did not return calls) asking about interview follow through post-interview and correct chain in the hiring process. No one has job security these days including HR hiring managers. It is incredible to have such a sloppy hiring system combined with unprofessional email transmissions.\r\n\r\nTry to apply online? Get used to the categorical rejection without so much as an call. But they list and relist these jobs almost weekly. Either they cannot retain those hired or they need to meet regulations  on listing.\r\n\r\nThey do NOT care how qualified you are. \r\n\r\nAnother student in my school recounted a similar no follow through interview. She was interviewed by several of would be co workers and never heard back from the hiring interviewer. If you get an interview (rare) then be prepared to be set before a group of peers who get to decide if you are hired or not. No previous review of your resume. They are all called in to evaluate if they like you or not and have no previous experience hiring employees. They simply indicate their opinion of your personality.\r\n\r\nVERY professional!  Laughable.", "Interview Questions": "What do you want out of life?"}, {"date": "20 Jan 2012", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Wellstar Health System (Marietta, GA) in Feb 2010", "Interview Descriptions": "The hiring manager was very personable and took an interest in my story.  She asked questions and probed but also provided information about herself.  She was candid and asked direct questions.  As nursing interviews go, this one was about as straightforward as is typical of the profession.  The recruiter \r\nwants to understand that your skill sets will match up with the unit you are assigned.", "Interview Questions": "None of the questions were tricky or out of the ordinary.  The recruiter did want to know how I would adapt to a float pool position, as it requires flexibility and a willingness to work in many different environments within the hospital."}]]