[[{"date": "29 Jun 2023", "title": "Assistant Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The University of Tennessee-Chattanooga (Chattanooga, TN) in Apr 2023", "Interview Descriptions": "There were two rounds of interviews. First round was a video call with a search committee. They simply asked a series of questions (why are you interested, what can you bring, etc.). Second round was a few weeks later, all day event at the university. Ate breakfast with the search team and potential coworkers, had an interview with search team again (same/similar questions as before). After that, I had an interview with the department head, a brief campus tour, then headed to lunch with the director. After lunch we came back to campus, I had to give a brief presentation on an initiative I was passionate about, then I finished my day with a debrief with the director. I ultimately declined their offer because the pay was so low compared to amount of responsibility and time commitment.", "Interview Questions": "What can you bring to the table?"}, {"date": "5 Jan 2023", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The University of Tennessee-Chattanooga", "Interview Descriptions": "There is not much of a formal interview, depending on the department/professor. I just asked if my advisor needed anyone on the research team and he said yes and gave me the job.", "Interview Questions": "Do you want a job?"}, {"date": "19 May 2022", "title": "Peer Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at The University of Tennessee-Chattanooga", "Interview Descriptions": "The interview process went very smoothly. It did not last very long, and the interviewers were very friendly. It mostly felt like they were trying to get a feel for if the interviewee would be committed to the position and willing to take on menteeswho were different fromn them.", "Interview Questions": "What attributes do you possess think will serve you best in this role?"}, {"date": "30 Apr 2022", "title": "Makerspace Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The University of Tennessee-Chattanooga", "Interview Descriptions": "Interview was conducted via Zoom due to Covid-19. Interview was pleasant and relaxed. Interviewer was thorough, professional, nice, informative, and wonderful. I would rate the interview process a 3 out of 10 in regards to difficulty.", "Interview Questions": "Why are you interested in this position?"}, {"date": "3 May 2022", "title": "Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at The University of Tennessee-Chattanooga (Chattanooga, TN) in Apr 2022", "Interview Descriptions": "The interview process went really well. From the callback, until the last meal. Everything was well organized and thought out. It was a full day but was given time to collect my thoughts and rest. I was treated with respect throughout the entire process.", "Interview Questions": "What was my vision for the program?"}, {"date": "3 Mar 2022", "title": "Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The University of Tennessee-Chattanooga", "Interview Descriptions": "The format of the process for me was a series of interviews. One virtual screening interview, then followed by interview with team and a presentation on relevant subject matter for the job", "Interview Questions": "What experience I had working with college students"}, {"date": "11 May 2022", "title": "Front Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The University of Tennessee-Chattanooga (Chattanooga, TN) in Jul 2021", "Interview Descriptions": "It went very smoothly and was done by a welcoming staff. It through zoom and it started on time and did not take to long. I would highly recommend working with the university.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "23 Apr 2021", "title": "IT Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The University of Tennessee-Chattanooga", "Interview Descriptions": "It was very brief and they ask you basic questions. You will need to know basic computer skills such as Microsoft office, excel, and PowerPoint. Overall, it was a really pleasant experience and I feel like it went really well.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "4 Jan 2022", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at The University of Tennessee-Chattanooga (Chattanooga, TN) in Jul 2019", "Interview Descriptions": "First I spoke with the Dean about the position. Had an in-person interview with the Dean. Toured the College and University. Met with and presented to faculty, staff, and students. Hired", "Interview Questions": "Vision for Innovation in the classroom? How would I engage the community? How would I create interactions and immersive experiences?"}, {"date": "11 Jul 2017", "title": "Adjunct Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at The University of Tennessee-Chattanooga (Chattanooga, TN) in Sept 2016", "Interview Descriptions": "It was very laid back. I actually sought them out because I wanted a certain position, so the interview process was more asking my availability and experience and sharing about the history of the position.", "Interview Questions": "What is your experience?"}], [{"date": "10 Sept 2016", "title": "Transcriber Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at The University of Tennessee-Chattanooga (Chattanooga, TN) in Jun 2015", "Interview Descriptions": "I submitted my resume and received a call back within an hour. I had to do a typing test and send them the results. After I did that (it was over 90+mph), I was called in for an interview. Went in the next day for an interview and they ask some basic questions.", "Interview Questions": "Have you worked with anyone with disabilities before?"}, {"date": "9 Jul 2015", "title": "Web Services Librarian Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at The University of Tennessee-Chattanooga (Chattanooga, TN) in Apr 2015", "Interview Descriptions": "Traveled to Chattanooga from east coast; was picked up by librarian I'd be reporting to.  Went out to dinner with library director.  Next day, day-long interview..a presentation, meeting with various panels, tour of rather large building. Presentation was: imagine you are implementing subject guides, what would be your process? There are many staff members, and many departments, so the group interviews can be long.  People there are quite friendly, and building is nice.", "Interview Questions": "Why would you be librarian when you could be web developer?"}, {"date": "18 Dec 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at The University of Tennessee-Chattanooga in Jan 2015", "Interview Descriptions": "Interview was done in person, relatively easy, it only took my 30 mins. The whole process took 3-4 weeks til receiving offering letter. The interview was very easy because I have talked to them before hand. The school is very relax about this and in need of new GA.", "Interview Questions": "Why do you want to be a graduate assistant?"}, {"date": "2 Oct 2013", "title": "Report Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at The University of Tennessee-Chattanooga", "Interview Descriptions": "Had one on one interview with director and panel interview with 3 senior level administrators.  Communication prior to interview was primarily through email and phone calls.", "Interview Questions": "N/A"}, {"date": "14 Jul 2015", "title": "Science Education Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The University of Tennessee-Chattanooga (Chattanooga, TN) in Jun 2011", "Interview Descriptions": "Picked up and airport, taken to dinner. Picked up at hotel the next morning after breakfast alone at hotel. Met with various individuals on campus: Dean,Department Chair, Challenger Center Director, then lunch with several faculty members. Next I gave a presentation back on campus. After the presentation I was taken back to my hotel.", "Interview Questions": "How I utilized technology in the classroom."}]]