[[{"date": "31 Mar 2021", "title": "Literacy for English Language Learners Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PALS (Edmonton, AB) in Feb 2021", "Interview Descriptions": "Virtual Interview- Due to Covid. Lasted about 15 minutes. They told me about the program in short, and what they needed and asked if I am willing to move forward", "Interview Questions": "Questions were clear, and they appeared to have gone through my CV really well. They asked about my previous experiences and why I wanted to join them, what I can bring etc."}, {"date": "16 Sept 2018", "title": "Behavior Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at PALS (Roseville, CA) in Sept 2018", "Interview Descriptions": "I applied on indeed within 3 weeks I received a call back for an interview.  After passing the initial interview with the BCBA, I  was told that I would get a call back for a second interview. My second interview was supervised by a staff member in the child's home.  I ran 3 trials with a kiddo as the staff member observed me.  After my interview, I was told that I would get a call from the BCBA with in a couple of days. The next week I was called and offered a third interview and was told that this was their interview process. My third interview was much like the second interview, I ran a few trials with the kiddo and was observed. I was told at both observations that I did an amazing job and received  little to no feedback. I was told that the BCBA would call me in a couple of days.  The BCBA never contacted me. Early one morning I received a text message  from the women who observed me during my third interview, asking if our interview was still on for that day. I kindly told her that I didn’t receive a call from the BCBA and I wasn’t informed about an interview though I would be willing to attend. She never replied back. Within a few hours, I received an email stating they were moving forward with another candidate. Maybe I didn’t cut it or maybe because I had no clue of the interview ,who knows. This  interview process was A TOTAL NIGHTMARE but like they say, when 1 door closes another 1 opens. I was hired on as a behavior specialist shortly after at an amazing company with top pay so  I really can’t complain. 😀", "Interview Questions": "What would your past employer say about you? "}, {"date": "3 Dec 2017", "title": "Home Health Caregiver Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at PALS (Farmington, NM) in Oct 2017", "Interview Descriptions": "Very simply question answer process to 15 minutes or less. Was presented a situation and asked  what I would do questions. one on one interview with a person that would be a supervisor.", "Interview Questions": "what would you do in a situation such as.....?  Do you like to clean? Can you knit or crochet?"}, {"date": "11 Dec 2018", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at PALS (Greeneville, TN) in Mar 2016", "Interview Descriptions": "The person I interviewed with made me extremely uncomfortable and was sort of disrespectful. Which continued once I was hired. But they were not very kind, and extremely inconsiderate. I accepted the job only because it was my first job.", "Interview Questions": "What is a girl like you applying to a place like this for? "}], []]