[[{"date": "17 Oct 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Maynooth University", "Interview Descriptions": "The interview overall was easy-going and welcoming. There were three interviewers. One being the PI and the other asking more specific questions about the role. It lasted around 40 minutes.", "Interview Questions": "Interest and experience in the field? Can you give an example how of you managed a difficult situation? Tell us about yourself."}, {"date": "19 May 2022", "title": "University Tutor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Maynooth University", "Interview Descriptions": "Teaching demo in 10 minutes; Behaviour questions and questions related to a teaching demo............\nGrades are scored based on the criterion: \nRelevant Teaching and Assessment;\tAdministration/ Organisational Skills;\tTeamwork and Communication Skills;\tFit with Cert, TtT and MSC profile and requirements.", "Interview Questions": "Why did you apply for this job and why do you want to join our department? "}, {"date": "10 Dec 2021", "title": "Technical Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Maynooth University", "Interview Descriptions": "Online interview  questions about cv experience education skills train to work there and salary expectations.  They did not seen to be keen to pursue my application further and i felt there was no genuine interest", "Interview Questions": "How do you compare to other candidates "}, {"date": "27 Apr 2021", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Maynooth University (Maynooth) in Apr 2021", "Interview Descriptions": "Very lengthy and unclear.  The atmosphere was rushed and felt like the panel is not interested. Was asked to prepare a presentation but it was unclear what the panel was looking for in the presentation.", "Interview Questions": "What do you know about sustainable enterprise education?"}, {"date": "14 Dec 2020", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Maynooth University (Dublin, Dublin) in Nov 2020", "Interview Descriptions": "I applied in late September and didn't get contacted until mid-November. HR communicated mainly in emails. I got interviewed online 2 weeks after the invitation. \r\nIt was pretty annoying the mails from Maynooth people go to spam all the time. If you apply for a job there, remember to check your spam. \r\n4 people on the interview panel for an executive job, 3 people asked more than 10 questions within 30 minutes in total, it was indeed a bit tense. The candidate really had to be prepared.", "Interview Questions": "Previous experience and examples of how to deal with different situations regarding administration, communication and teamwork as well as IT skills."}, {"date": "31 Aug 2021", "title": "Campus Concierge Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Maynooth University (Maynooth) in Oct 2020", "Interview Descriptions": "We did it in a group interview format where we worked through team exercises together as well as telling them about our previous experiences that we feel could help us with this job", "Interview Questions": "How would you deal with a difficult situation?"}, {"date": "19 Nov 2017", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Maynooth University in Sept 2017", "Interview Descriptions": "A face to face interview for one hour with the head of the department. The questions were mostly related to my CV and my past research experience. Where do I see myself in 5 years. Whats my career goals. What are my plans.", "Interview Questions": "Questions related to my CV and my past research experience"}, {"date": "17 Dec 2016", "title": "Post Doctoral Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 6 days. I interviewed at Maynooth University in Oct 2016", "Interview Descriptions": "It was very simple. There were 3 people in the room. Each one of them made questions, according to their area of expertise (research, funding writing, etc). I was basically telling them which jobs I did in my previous employment and they would ask clarification questions here and there.", "Interview Questions": "Tell us about your most recent research\r\nWhich research methodologies are you familiar with"}, {"date": "1 Aug 2017", "title": "Lab Demonstrator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Maynooth University in Aug 2016", "Interview Descriptions": "No interview, sent in c.v. I assume they looked at my examination results as I was a past student there. I simply replied to an email asking for anyone available and then was contacted a few weeks later with an offer.", "Interview Questions": "Looked at my c.v"}, {"date": "26 Mar 2016", "title": "Post Doctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Maynooth University in Mar 2015", "Interview Descriptions": "Email application. The interview was a skype call. Presentation and general questions about my previous research. General questions about parallel programming. They described the duties and goals of the position.", "Interview Questions": "General question about my previous research."}], [{"date": "17 Apr 2016", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Maynooth University (Kildare) in Mar 2015", "Interview Descriptions": "Panel Interview with 5 people on campus. Large room, slightly harsh for conducting an interview. The interview itself was quite intense and lasted just under an hour. The panel were quite intense and you needed to know your stuff inside out!", "Interview Questions": "Previous Experience, Technical Knowledge, Experience of Teamwork"}]]