[[{"date": "20 Mar 2023", "title": "Adjunct Faculty Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hondros College of Nursing in Mar 2023", "Interview Descriptions": "Talked with a recruiter, who then said she would call back to set up interview with hiring manager. Never called back that afternoon as promised. Received an email in a week asking again when I could set up interview and again never called back. If this is how they treat you before you are employed, just think how it will be after. No Thanks.", "Interview Questions": "When can you come in to interview."}, {"date": "27 Feb 2022", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Hondros College of Nursing", "Interview Descriptions": "Great interview, very informative, learned a lot about the company, was about an hour longer, seems like a good company to work for. Seems face paced and lots of room for advancement.", "Interview Questions": "Explain a situation where you had to resolve a conflict"}, {"date": "23 Oct 2021", "title": "Career Services Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hondros College of Nursing (Cleveland, OH) in Oct 2021", "Interview Descriptions": "The person who set up my initial phone interview just never called. I received a message from him, 3 hours later, apologizing that he didn’t make it back in time from a luncheon and asked for my availability, requesting to reschedule at “my earliest convenience.” I figured I would give it another chance, and responded with my availability. \r\nUnfortunately have never heard back to this day. This speaks loud and clear about the work environment.", "Interview Questions": "N/A"}, {"date": "29 Dec 2016", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hondros College of Nursing (New York, NY)", "Interview Descriptions": "Easy interview, but the lady who did my interview was very rude the entire time. When I asked her if i could have her contact information just in case I had any more questions she was very unpleasant baout it.", "Interview Questions": "How do you define success?"}, {"date": "30 Apr 2017", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Hondros College of Nursing (Westerville, OH) in Jan 2016", "Interview Descriptions": "Great interview by DON. Thorough reference and background checks.  I feel it was meant to be for me to have this job to teach nursing students. I would love the  job if the pay was better.", "Interview Questions": "Describe your experience as a nurse"}, {"date": "30 Nov 2016", "title": "Nursing Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hondros College of Nursing (Columbus, OH) in May 2015", "Interview Descriptions": "I first spoke over the phone to a recruiter and she was very up front about the position expectations including the benefits, schedule, and salary which made it easy to decide the position was the right fit for me.", "Interview Questions": "They asked why I wanted to be in education. "}, {"date": "5 Apr 2016", "title": "Office Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Hondros College of Nursing (Columbus, OH) in Feb 2015", "Interview Descriptions": "Phone interview first then in person interview if selected.  The questions were pretty basic. It was explained how the process works in that the phone interview was just basic questions. This was to see the compatibility of the position with my education and experience.", "Interview Questions": "Why do you want to leave your current job?  They also want to know your current salary and the salary you are expecting."}, {"date": "2 Oct 2013", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Hondros College of Nursing (Westerville, OH) in May 2010", "Interview Descriptions": "I was interviewed by the Director of Nursing and the Human Resources Manager.  The interview was agreeable and low key, asking the usual questions pertaining to the position I was applying for.", "Interview Questions": "N/A"}]]