[[{"date": "1 Jun 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hamilton Health Sciences", "Interview Descriptions": "One virtual interview via zoom. Second in-person interview. Unfortunately, the interviewer was typing on her phone during the interview while I was speaking, which I found to be unprofessional. Otherwise, the questions were standard and the rest of the interviewers were professional.", "Interview Questions": "Do you have experience doing ethics approvals?"}, {"date": "11 Apr 2023", "title": "IT Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hamilton Health Sciences (Hamilton, ON)", "Interview Descriptions": "The interview was pretty straight forward. The person interviewing was very welcoming and open about their business. They were interested specifically in health management background, which I did not have.", "Interview Questions": "Which business analytics tools or software have you worked with?"}, {"date": "11 Oct 2022", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hamilton Health Sciences", "Interview Descriptions": "Very Nice, Asked easy questions interview was over zoom. The interviewer was very friendly and easy-going so able to be relaxed.  make sure to ask questions at the end to show you are interested", "Interview Questions": "Scenario-based questions - If you have 3-5 different patients who do you go to first?"}, {"date": "25 Feb 2022", "title": "Registered Nurse Emergency Department Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hamilton Health Sciences (Hamilton, ON)", "Interview Descriptions": "Applied online, was interviewed by phone. Situational questions. Typical of prioritizing patients. Behavioural \"tell me about a time...how did you handle it\". I interviewed two different times, ER and Resource Team. Despite my clear cover letter & application indicating \"seeking FULL TIME\", I was asked at the end of each interview \"will you take part-time? We'd like to try you out first\". No. I'm not a car being taken for a test drive. I will not relocate to another city for a job that cannot guarantee a roof over my head and food on the table! Rude.", "Interview Questions": "Tell me about a time you had to deal with a difficult person."}, {"date": "10 Feb 2022", "title": "Talent Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Hamilton Health Sciences (Hamilton, ON) in Feb 2022", "Interview Descriptions": "Phone call screening, scheduled interview. Met via. zoom, discussed the role, asked a series of questions. Opened the floor for questions. Interviewers were kind and kept the conversation flowing. Positive experience overall.", "Interview Questions": "Tell us about a time where you lead a team initiative \r\nTell us about difficult situation with co-worker\r\nTell us about how you handle being assigned several different tasks and how you manage"}, {"date": "22 Feb 2023", "title": "Electrical Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hamilton Health Sciences in Dec 2021", "Interview Descriptions": "A very standard interview, a semi-casual setting with a fairly comfortable pace. I was interviewed by two interviewers who were easy to talk with and kept things fairly light. Some outside work conversation over family but fairly prescript", "Interview Questions": "Past experiences that would be transferable to the job posting"}, {"date": "13 Oct 2021", "title": "Quality Control Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hamilton Health Sciences", "Interview Descriptions": "Mostly behavioural based questions about working in a team and your leadership experiences. Some situational questions about healthcare in general and specific to the organization. Questions about where you see healthcare going in the future", "Interview Questions": "1. A time where you had conflict with a team member and how did you approach it\n2. Where do you see healthcare in 10 years "}, {"date": "15 Aug 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hamilton Health Sciences", "Interview Descriptions": "The hiring managers are professional and listen closely to what you are trying to say. They also provide valuable feedback. They are very informative and punctual. Nothing negative to say about the interview process.", "Interview Questions": "Tell me something about your work experience"}, {"date": "25 Jun 2021", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Hamilton Health Sciences", "Interview Descriptions": "Phone interview followed by panel interview.\r\nAsked questions about forecasting sales in a hospital, how should a hospital predict sales after pandemic year. Overall, be prepared to get questions out of the box and thinking on your feet.", "Interview Questions": "How to forecast sales in a hospital "}, {"date": "17 May 2022", "title": "CDM Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hamilton Health Sciences (Hamilton, ON) in Apr 2021", "Interview Descriptions": "2 rounds in total. First round was phone interview and it took 20min, then in-person interview. Asked lots of behavioural questions and the org. Interviewers were friendly and asked great questions", "Interview Questions": "Tell me about your work experience "}], [{"date": "21 Jan 2021", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hamilton Health Sciences", "Interview Descriptions": "Overall quite good. It was a new team being built, so naturally some teething problems. \r\nThere were a lot of stages. Code screener, informal phone chat, technical take home test, formal interview (90min), and then final interview.", "Interview Questions": "How do you handle collaboration? "}, {"date": "12 Jan 2021", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hamilton Health Sciences", "Interview Descriptions": "The interview was quite short, basic questions describing your experience and knowledge. Had to give situational responses.  Department seemed to be undergoing a lot of change so not very organized process. Took 2-3 months overall.", "Interview Questions": "Experience handling a difficult coworker"}, {"date": "17 Jul 2023", "title": "Registered Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hamilton Health Sciences (Grimsby, ON) in Oct 2020", "Interview Descriptions": "Interview process was lengthy, but thorough. Interviewers (manager/educator) were very welcoming, offered a tour of the facility and introductions with future co-workers and ensured you felt comfortable and all questions were answered", "Interview Questions": "Situational questions related to the role Education History Shift coverage"}, {"date": "28 Aug 2020", "title": "Software Student Position Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hamilton Health Sciences", "Interview Descriptions": "The interview was held with two department heads. They were looking for individuals interested in or entering a specific college program. This was a little bit off-putting as individuals who weren't interested in the position didn't seem to have a fair chance.", "Interview Questions": "Why are you interested in the role?"}, {"date": "29 Mar 2020", "title": "Physics Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hamilton Health Sciences (Hamilton, ON) in Mar 2020", "Interview Descriptions": "I applied online, got contacted a week later for an interview in two weeks. Interview lasted about 40 minutes starting with a standard HR section (tell us about yourself, what is your greatest weakness/strength, why do you want to get this job, what would you do in various situations) and followed by a more technical section (basic physics and math, attention to detail, errors and uncertainties, radiation safety).", "Interview Questions": "Given two quantities with uncertainties, how much uncertainty does their product have?"}, {"date": "20 Feb 2020", "title": "Psychologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hamilton Health Sciences (Hamilton, ON) in Nov 2019", "Interview Descriptions": "They asked about 8 questions including what makes you the best person for the job, quality improvement, and don’t behavioural questions. There were 3 people on the panel and the hiring process took 4 weeks to work out salary.", "Interview Questions": "How did you improve the workplace in your last position?"}, {"date": "24 Mar 2021", "title": "OT Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hamilton Health Sciences (Hamilton, ON) in Sept 2019", "Interview Descriptions": "Interview with manager and some co workers. They were Friendly, team oriented, no HR involvement during interview or offer which was surprising- may have benefitted from an HR persons person's involvement", "Interview Questions": "Tell us about how your experience related to their specific population? "}, {"date": "6 Aug 2019", "title": "Business Clerk Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hamilton Health Sciences (Hamilton, ON)", "Interview Descriptions": "selected for interview approximately 3 weeks after submitting resume; interviewed by three people with typical interview questions, lasted about 45 minutes, heard back 2 weeks later after they had contacted my references", "Interview Questions": "Can you tell us about a time you had to deal with a difficult situation at work, how did you resolve the issues?"}, {"date": "7 Jul 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hamilton Health Sciences", "Interview Descriptions": "Application\r\n\r\nI applied online. The process took 2 weeks. I interviewed at The Scarborough Hospital (Scarborough, ON) in December-2018.\r\n\r\nInterview\r\n\r\nI got a call from the HR. They set up interview day. I went to the interview and was interviewed by two managers. After interview, I got a phone call after 1-2 weeks from the HR.", "Interview Questions": "y past work experience working with clients in the hospital"}, {"date": "1 Mar 2021", "title": "Registered Nurse Neonatal ICU Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hamilton Health Sciences (Hamilton, ON) in Jul 2019", "Interview Descriptions": "The interview was with the nurse manager and a nurse educator. They asked about my past clinical experiences, then asked a few questions about premature infants and sick newborns to assess my knowledge", "Interview Questions": "What would you do if your intubated baby was having an O2 desaturation?"}], [{"date": "19 May 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hamilton Health Sciences (Hamilton, ON) in Feb 2019", "Interview Descriptions": "Apply on their website, email notification for interview. Usually a panel of 2 interviewers (manager + educator). Went to the interview at manager's office, educator was present to ask questions as well. They took turns asking a list of 6-7 questions. It was a friendly environment/conversation.", "Interview Questions": "What education, knowledge, and skills do you have for this job?"}, {"date": "19 Mar 2018", "title": "Business Transformation Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hamilton Health Sciences (Mississauga, ON) in Feb 2018", "Interview Descriptions": "HHSC typically recalls previous consultants that work for them.\r\nI was asked what roles I previously play.  What were my likes / dislike,  strengths / weakness and how I can contribute to the current job value proposition. \r\nI recalled the wins & extra value adds I did and how my previous career strengths can assist in delivering the next goals. \r\n,", "Interview Questions": "What is your experience with Change Management?\r\nI am a ITIL Change Management Architect and chair the CRB (Change Review Board), "}, {"date": "31 Oct 2017", "title": "RPN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Hamilton Health Sciences (Hamilton, ON) in Sept 2017", "Interview Descriptions": "The RN, interviewing lady was very pleasant. She was only one who interviewed me. She was very down to earth, patient, and helpful during my interview answers.  She did not ask me many questions. And informed me how many left, to reassure me.", "Interview Questions": "Conflicts and resolution: with your co-workers. "}, {"date": "26 Oct 2020", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Hamilton Health Sciences (Hamilton, ON) in Feb 2017", "Interview Descriptions": "Welcoming, situational and behavioural questions. Easy going and welcoming. Non biased open ended questions.  Guiding and honest. Understanding and explain well the job and opportunities available within the field. What you can do to excel and programs available to employees", "Interview Questions": "Specific to area of care?"}, {"date": "7 Nov 2016", "title": "RN W/Degree Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hamilton Health Sciences (Hamilton, ON)", "Interview Descriptions": "Interview was with the unit manager and the unit educator. No clinical questions were asked to my surprise, especially since it was for a unit with more highly acute patients.\r\n\r\nBoth interviewers were polite. I did make some funny comments and they laughed, which to me was a sign that we would get along humour-wise.", "Interview Questions": "Basic interview questions, the one that I did not have on my list to prepare for are the following: How can I tell if you're stressed?\r\nWhen do you feel stressed?"}, {"date": "17 Jul 2016", "title": "Billing Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hamilton Health Sciences (Hamilton, ON) in May 2016", "Interview Descriptions": "Applied in march 2016, received a call and Interview for the end of may at Juravinski Hospital. It's a group interview, I was interviewed by the Program Director, some lady from HR and the secretary for the program. They are all lovely and sweet women. They asked me to talk about my resume and then had a couple of papers with scenario based questions to answer which if you work in a healthcare environment you can answer relatively well. It was an overall easy interview. After a week I heard back and did not get the job. I'm pretty young and I'm sure they would have preferred someone older than I or with more experience. No hard feelings.", "Interview Questions": "How would I retrieve the information a pharmacist wants from a hospital one of your patients visited? What is the most notable thing you've done at work where you went out of your way etc?"}, {"date": "4 Apr 2016", "title": "Medical Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hamilton Health Sciences (Hamilton, ON)", "Interview Descriptions": "Had to do a typing test, medical terminology test and interview with the manager.  Heard back from them in less than 1 week.  They did check my references.", "Interview Questions": "Asked typical interview questions, but nothing too tricky."}, {"date": "11 Feb 2016", "title": "Nuclear Medicine- Radiation Safety Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hamilton Health Sciences (Hamilton, ON)", "Interview Descriptions": "Applied online and heard back 2 months later inviting me for in-person interview. I live long-distance in another city and they asked me to come in rather than a phone interview (they did not assist with travel expenses to interview in person).  Waited for 30 min in waiting room before they saw me. There were four people (human resources manager, technologist, department manager and physicist) and each took turns asking questions. It lasted about 40 min. My first impression as soon as I walked through the door was a negative one (the department manager looked completely bored) and I felt like they weren't serious -as if they were only there because they had to be.\r\n\r\nOne month later, I received a generic rejection letter by email acknowledging that they were very impressed with my skills and qualifications but I was not the successful candidate. However, I don't think they hired any candidate as I find it odd that they continue to re-post the same position many times. I interviewed last summer 2015 and I noticed that it has been re-posted many times over the past 6 months (last repost: Jan 22/2016). I find it hard to believe that they couldn't find a candidate to date....\r\nFound a job elsewhere.", "Interview Questions": "They asked general interview and situational questions.\r\n1. Why do you choose your field.\r\n2. Where do you see yourself in 5 years\r\n3. How do you handle conflict.\r\n"}, {"date": "9 Nov 2019", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hamilton Health Sciences (Hamilton, ON) in Jan 2016", "Interview Descriptions": "First of all, the administrative staff were very helpful in facilitating my interview. They provided me with clear directions and checked in to be sure that I found where I needed to be. When I met my interviewers they were kind and relaxed. They asked thoughtful questions and I didnt feel uncomfortable at all. The interview consisted of a panel of 3 people, the supervisor and two fellows.", "Interview Questions": "What are your future career goals?"}, {"date": "6 Nov 2015", "title": "RPN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hamilton Health Sciences", "Interview Descriptions": "Typical interview process. Was contacted by the secretary of the manager and appointment was set up for a few days later.  Manager was significantly late for the interview, about 30 minutes late to be exact.  The interview took place with the manager, educator and the secretary.  There really was nothing out of the ordinary.  Parking is expensive at all the sites.  Be sure to ask for directions to where the interview will take place as this was not communicated with me and I ended up in the wrong part of the building.", "Interview Questions": "Typical behavioral and scenario based questioning"}], [{"date": "1 Jun 2016", "title": "Autism Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hamilton Health Sciences (Hamilton, ON) in May 2012", "Interview Descriptions": "Called for interview. Met with program coordinator and clinical leader for an interview. Was given some scenarios before interview to discuss.  Other questions were around experience in previous roles.  Only one interview required. Was called the next week for a job offer.", "Interview Questions": "Specific Experience with clients with ASD."}]]