[[{"date": "23 May 2023", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AdventHealth Waterman (Tavares, FL) in May 2023", "Interview Descriptions": "The interview process was really great, everyone had great communication, answered all my questions and was a joyful process. I used the website and email, it was very simple. It was easy to find exactly where I needed to go, parking was a breeze. The lab manager took her time with me, answered all my questions and talked a little while. Jennifer made me feel confident in taking the position", "Interview Questions": "How would I handle a hard stick on a patient"}, {"date": "1 May 2023", "title": "RN Float Pool Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AdventHealth Waterman (Great Lakes, IL) in Apr 2023", "Interview Descriptions": "As you can imagine applying for nursing openings is intense. Try to be as organized and be as open as possible with the recruiter and managers. So far they have been helpful and welcoming. I get the feeling they will allow my career to grow and I expect to stay with them.", "Interview Questions": "Why do you want to work for AdventHealth?"}, {"date": "12 Aug 2021", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at AdventHealth Waterman (Leesburg, FL) in Aug 2021", "Interview Descriptions": "My online interview was a wonderful experience! I was able to meet and get to know my team managers without any glitches or interference. My team managers were very welcoming and easy going. They also shared a lot of knowledge and gave plenty of insight about the job and what’s expected.", "Interview Questions": "Explain a time when you had to deal with a difficult task? How did you handle it?"}, {"date": "11 Jun 2021", "title": "Nurse Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AdventHealth Waterman (Mount Dora, FL) in May 2021", "Interview Descriptions": "Hiring event. Quick and to the point. Asked about my understanding of the position and a time that I used one of their core values. There were two interviewers and they were both very professional and helpful in answering my questions.", "Interview Questions": "To describe a time I used one of their core values in my last job. "}, {"date": "18 Jun 2019", "title": "Office Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AdventHealth Waterman (Tavares, FL) in Jun 2019", "Interview Descriptions": "The interview process was great. I felt at ease and it was more of a conversation.  Michelle, the person who interviewed me, was fantastic.  She is very knowledgeable and passionate about AdventHealth.", "Interview Questions": "What I am looking for in my next position. "}, {"date": "14 Oct 2022", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AdventHealth Waterman (Tavares, FL) in Mar 2019", "Interview Descriptions": "Had two interviews. 1 one-on-one and the 2nd as a panel interview. Both were not bad at all or difficult. Be yourself and make sure you study up on the company beforehand so you’re well prepared.", "Interview Questions": "What does our mission, “Extending the healing ministry of Christ” mean to you?"}, {"date": "31 May 2019", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at AdventHealth Waterman (Tavares, FL) in Jan 2016", "Interview Descriptions": "Laid back interview with one manager asking typical job questions, no experience required. Will be trained on the job how to care for patients and move them from different modalities. Have a good personality and you will be hired if you're the right fit for the team.", "Interview Questions": "What was on time you faced a difficulty you had to overcome?"}, {"date": "22 Aug 2016", "title": "ICU Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at AdventHealth Waterman (Tavares, FL) in Feb 2015", "Interview Descriptions": "My interview was conducted over the phone because I resided out of state at the time. Charge Nurse and Manager conducted interview. Asked me questions regarding experiences, why I wanted to move, etc. Manager was very nice, friendly, and personable. Charge Nurse was more intense, grilling me on questions regarding my experience with critical care patients.", "Interview Questions": "Why do you want to work on this unit?"}, {"date": "9 Mar 2015", "title": "Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at AdventHealth Waterman (Tavares, FL) in Mar 2013", "Interview Descriptions": "I was recommended, I applied I got call and interviewed and got the job.", "Interview Questions": "What drives you to care for others"}, {"date": "6 Oct 2012", "title": "Food and Nutrition/Cafe Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at AdventHealth Waterman (Tavares, FL) in May 2008", "Interview Descriptions": "I put in my resume then visited then talked to manger.  Called in for interview and they consider my past work experience in determining my pay. All was good.", "Interview Questions": "N/A"}]]