[[{"date": "19 Dec 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Clair Health", "Interview Descriptions": "One interview the day after I applied. Should have been a red flag that they were eager to fill position and said all the right things. Unfortunately, none of the \"promises\" made in interview materialized.", "Interview Questions": "Tell me why you want this job"}, {"date": "26 Aug 2022", "title": "Nurse Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Clair Health", "Interview Descriptions": "I do not remember this portion of the interview process or the questions that were asked.  They were basic, related to patient care, job experience, and behavioral questions. Everyone was very kind.", "Interview Questions": "N/A"}, {"date": "6 Aug 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Clair Health", "Interview Descriptions": "Contacted shortly after applying. Brief phone interview with recruiter. In-person interview with HR and Hiring Manager. Offered the job that day and accepted offer. Very efficient and professional interview experience.", "Interview Questions": "Describe my experience with patient care."}, {"date": "26 Aug 2021", "title": "Clinical Quality Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Clair Health in Aug 2021", "Interview Descriptions": "Simple, behavioral based interview questions. HR is very easy to contact and set up meetings with although they do not always know everything about the position you are interviewing for.", "Interview Questions": "What was a time you had to deal with a difficult customer and how did you handle it"}, {"date": "4 May 2021", "title": "Medical Records Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Clair Health (Pittsburgh, PA)", "Interview Descriptions": "The interview process consists of HR reaching out via email or by phone to schedule a Skype interview with me. The HR coordinator that contacted me was 5 minutes late for the Skype interview so that really says something about the organization itself. After I discussed my qualifications with HR, they asked what my salary expectations were.  They then cut me off as they were offering 12.55 hourly for this position (without negotiation) and wished me the best. At least they were being honest about it. I am a firm believer that once an employer treats their employees well, their employees will do the same. I did not expect much from this organization due to how the interview process went. Look elsewhere if you are looking to make more than 12 an hour!", "Interview Questions": "I see you worked for ________. Can you tell me a little bit more of what your job entails."}, {"date": "27 Sept 2021", "title": "Registered Nurse, MSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Clair Health (Pittsburgh, PA) in Feb 2021", "Interview Descriptions": "It was a three stage interview process-\n1. With HR via Skype\n2. With Unit manager via phone \n3. With Unit Manager in person and a shadowing experience on the Unit. About a week later, I got a phone call with an  offer.", "Interview Questions": "In what ways would you be an asset to the team"}, {"date": "19 Jan 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Clair Health (Pittsburgh, PA) in Feb 2021", "Interview Descriptions": "It was a straightforward process. Started first with a phone call, then a Skype interview, and then a visit to the facility to observe the unit and meet the current employees", "Interview Questions": "How did you handle a difficult patient or family member"}, {"date": "21 Oct 2018", "title": "Therapy Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Clair Health", "Interview Descriptions": "Typical interview questions. Asked about previous jobs and what I want to do with my future. Everyone I met with was very nice. It was a quick process and didn’t take too long. I heard back within about a week and a half.", "Interview Questions": "What barriers do I think I may face working this job"}, {"date": "15 Mar 2021", "title": "Certified Surgical Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Clair Health in Jan 2018", "Interview Descriptions": "Got an interview with HR approximately 4 months after applying. When I accepted the position I was told I would be starting at a higher rate than what I saw on my first paycheck. The interview lasted 30+ minutes.", "Interview Questions": "What was a time I faced a difficult situation and how did I deal with it?"}, {"date": "9 Jan 2018", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at St. Clair Health (Pittsburgh, PA) in Dec 2017", "Interview Descriptions": "I met with an HR employee to discuss what the internship would entail and my work history. The purpose of the prescreen was to see if I would be a proper candidate for the position that they were looking to fill in their hospital.", "Interview Questions": "What was my favorite professional experience?"}], [{"date": "20 Sept 2017", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at St. Clair Health", "Interview Descriptions": "First, I was asked to meet with HR. The HR representative seemed disinterested in getting to know me at all. She seemed to have a printed listed of questions she quickly read through often times cutting me off in the middle to continue on. I found it to be extremely rude. As an HR rep, she has peoples careers--livelihoods--in her hands and she choose to take this responsibility so callously! After abruptly ending the interview, she threw some benefits paperwork in front of me and ushered me outside. There I waited to meet with the pharmacy manager. He was extremely kind and easy to talk to. He made me feel at ease and the interview seemed very casual.", "Interview Questions": "How would your coworkers describe you?"}, {"date": "16 May 2017", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Clair Health (Pittsburgh, PA)", "Interview Descriptions": "It took a couple months before I was called for an interview with HR and department manager. You must be finger printed and pass a criminal background check, child abuse/predator background and drug screen. A physical with the hospital doctor as well.", "Interview Questions": "Basic and typical interview questions"}, {"date": "27 Feb 2017", "title": "Pt Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at St. Clair Health (Pittsburgh, PA)", "Interview Descriptions": "One on one with manager. I had already been working there as PRN so the manager simply told me there was an opening for full time and asked if I wanted to take it.", "Interview Questions": "N/A"}, {"date": "14 Oct 2015", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at St. Clair Health (Pittsburgh, PA) in Sept 2015", "Interview Descriptions": "It took about four weeks from application to interview.  I met with an \"employment specialist\" first which was pretty intimidating.  She seemed to have a premeditated question and answer list for everything.  It was pretty monotone, which made it difficult to evaluated how I was doing.  I then met with the nurse manager and went through the questions all over again.  It took about two hours total.  I felt that I had gotten along great with the manager and things were really looking promising.  Unfortunately, I was told to wait about two weeks, and didn't hear back.", "Interview Questions": "If you were in a situation with a difficult family, how would you handle it?"}, {"date": "20 May 2013", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Clair Health", "Interview Descriptions": "Applied online and received call to come in for interview about 3-4 days later. Met with a HR rep first for an hour answering standard \"what would you do in this situation...\" Questions. After that, I met with the manager of the department I was applying for about two hours.  If you are sent home after the HR phase, you're not getting the job.", "Interview Questions": "Tell me about a time when you had to stand up for something you believed in when others disagreed in the work environment. "}, {"date": "28 Aug 2016", "title": "Staff Physician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at St. Clair Health (Pittsburgh, PA) in Jan 2012", "Interview Descriptions": "mainly asked about my training, my children, common things that I was asked in Residency. Asked what drew me to medicine, and family life balance with work.   Asked about benefits that I Would expect and my style of practicing medicine.    Wanted to know about where I lived, grew up, college degree and residency experiences.", "Interview Questions": "about compensation and flexibility, reason for choosing hospital"}, {"date": "26 Aug 2015", "title": "Non-nursing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Clair Health in Sept 2011", "Interview Descriptions": "Interview scheduled within 1 week of applying. One on one HR interview to start. Second interview with department manager after first round of interviews. Was kept in the loop throughout the process until a decision was made. From submitting application to receiving offer, the entire process took about 3 weeks.", "Interview Questions": "Standard interview questions"}]]