[[{"date": "21 Jun 2023", "title": "Workforce Development Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UMass Memorial Health", "Interview Descriptions": "They reached out for a phone screen asking for my availability. I responded with my availability and followed with no response from them. This is beyond unprofessional. Steer clear of them.", "Interview Questions": "Please share your availability to interview"}, {"date": "8 Jun 2023", "title": "Patient Care Associate (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UMass Memorial Health (Worcester, MA)", "Interview Descriptions": "Hopped on an easy phone call. Managers very kind and easy going. Asked about me - no behavioral questions. Asked about plans that would interfere with schedule and past work experience.", "Interview Questions": "Tell me about yourself and why you want the job"}, {"date": "7 Mar 2023", "title": "Customer Service Representative (CSR) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UMass Memorial Health", "Interview Descriptions": "Not so bad and the people were nice. This was years ago so I barely remember it. Was too nervous. Interview was short. I ended up moving out west to better job opportunity so don’t have any regrets.", "Interview Questions": "What do you see yourself doing in 5 years"}, {"date": "26 Sept 2022", "title": "Talent Acquisition Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UMass Memorial Health", "Interview Descriptions": "Withdrew from the process after recruiter (who’s LinkedIn shows job hopper tendencies) reached out requesting to interview. Attempted several times to speak with her over several weeks and no response. Unprofessional. ", "Interview Questions": "She only asked for availability and never confirmed a day and time after several follow ups. "}, {"date": "13 Jun 2022", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UMass Memorial Health (Worcester, MA) in May 2022", "Interview Descriptions": "The interview process was organized and efficient. After submitting my resume, I was contacted roughly a week later to schedule a WebEx interview with the department leaders. Utilizing WebEx was a seamless transition from my previous experience with Zoom. After the WebEx interview, I was invited to interview in person and meet the potential team. That process was also very organized and on schedule. All in all, the interview process took roughly a month to complete and there was constant communication throughout.", "Interview Questions": "Q: How do you think your skills could translate well within this role?\n\nQ: How did you hear about this role and what interested you about this role? \n\nTypical interview questions but also a lot of \"getting to know you\" type conversations. This helped me get comfortable and feel welcome/wanted which allowed me to answer questions honestly and thoroughly. "}, {"date": "3 May 2022", "title": "Chef Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UMass Memorial Health (Fitchburg, MA) in Apr 2022", "Interview Descriptions": "we went over the job details no real questions asks about me and what i will bring to the company even when my resume had some details. it went smooth.", "Interview Questions": "do i have a car, a valid driver's license and a good registration"}, {"date": "16 Mar 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UMass Memorial Health", "Interview Descriptions": "interview process was easy and straightforward. Was offered a phone interview, then followed up with in person interview. After the in person interview I received a offer. This whole process was quick and effective.", "Interview Questions": "how would you handle a dissatisfied/angry patient "}, {"date": "5 Jul 2022", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at UMass Memorial Health (Worcester, MA) in Dec 2021", "Interview Descriptions": "It was a very smooth interview. The interviewer was very welcoming and polite. There was no tension while having the interview, and it is always advisable to not pretend but act natural.", "Interview Questions": "Tell me about yourself and why you want to work as a PCA"}, {"date": "4 Oct 2021", "title": "Clinical Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at UMass Memorial Health", "Interview Descriptions": "The interview process was quick, I applied and had two meetings with the team. After that it took about 3 weeks to get all the paper work in. I thought the process was rather smooth .", "Interview Questions": "Please tell me about yourself?"}, {"date": "3 Sept 2021", "title": "Patient Care Associate (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UMass Memorial Health", "Interview Descriptions": "The job recruiter reached out and asked for my availability. She set up FaceTime interview for the next day. She was proactive and told me what I needed done in order to make it to the next orientation date.", "Interview Questions": "They asked about my previous work experience. "}], [{"date": "3 Oct 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at UMass Memorial Health in May 2021", "Interview Descriptions": "Straight forward, felt more like getting to know someone new, asked typical interview questions-describe strengths and weaknesses, long term goals, are you open to new learning opportunities. Comfortable informal interview that covered all your basics", "Interview Questions": "what are your strengths? Weaknesses? How do you handle conflict in the workplace? "}, {"date": "15 Feb 2022", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at UMass Memorial Health (Worcester, MA) in Feb 2021", "Interview Descriptions": "After applying online and recieving Jobvite email invitation to follow application I recieved  a phone call interview from the unit coordinator who then ivited me to tour the unit invited to tour unit.", "Interview Questions": "Why I applied for this position"}, {"date": "10 Nov 2022", "title": "Medical Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UMass Memorial Health in Sept 2020", "Interview Descriptions": "the interview process was fine it was not more difficult or different than any other, and I accepted the job, I am writing this because its making me to view other job salaries", "Interview Questions": "normal interview questions for anyone"}, {"date": "18 Sept 2020", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UMass Memorial Health (Worcester, MA) in Aug 2020", "Interview Descriptions": "easy interview process. called me two days later with a job offer. lots of information to fill out, will have to go for a physical and drug test, as well as orientation before starting.", "Interview Questions": "Why are you leaving your current job?"}, {"date": "21 Jan 2021", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMass Memorial Health (Worcester, MA) in May 2020", "Interview Descriptions": "Great experience, reviewed job well and answered all of my questions. Provided me with great information on the job and what to expect. They discussed and answers all questions about orientation and reviewed the process", "Interview Questions": "Reason for wanting to join their team and unit ? "}, {"date": "5 Sept 2020", "title": "Under OCI Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at UMass Memorial Health (Worcester, MA) in Feb 2020", "Interview Descriptions": "Lengthy, not very technical - mostly on Excel; good chance to ask questions about the department and their projects. Had to go thru 4 people ranging from senior analyst to director. But found out a person in the same position had her interview thru the phone (pre-covid mind you), and was not very competent with Excel. So, hard to say.", "Interview Questions": "How to join two sets of data?"}, {"date": "30 Jan 2020", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at UMass Memorial Health (Worcester, MA) in Jan 2020", "Interview Descriptions": "GOT CALL FROM The UMass Memorial Medical Center Recruiting Team, THEN FILL ONLINE APPLICATION AFTER THAT GOT THE PHONE CALL FROM NURSE MANAGERLICENSURE & CERTIFICATIONCOMMUNITY /OTHER ACTIVITIES Advanced Cardiac Life Support Certification – American Heart Association                     April 2018-2020\r\nBasic Life Support Certification – American Heart Association                                          July 2012-2021\r\nPediatric Advanced Life Support Certification – American Heart Association", "Interview Questions": "MY PAST  EXPERIENCE IN HEALTH CARE, EDUCATION IN USA and  EDUCATION I GOT IN INDIA, BRIEF EXPLANATION FROM BY BACKGROUND TILL PRESENT JOB OTHER WORK EXPERIENCE(INDIA)Advanced Cardiac Life Support Certification – American Heart Association                     April 2018-2020\r\nBasic Life Support Certification – American Heart Association                                          July 2012-2021\r\nPediatric Advanced Life Support Certification – American Heart Association                   \r\n"}, {"date": "19 Feb 2020", "title": "Healthcare Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at UMass Memorial Health (Worcester, MA) in Jan 2020", "Interview Descriptions": "one round phone interview with 3  and three rounds onsite interviews with 6 people\r\nonsite was informed the same day with the phone interview\r\nthe offer come at the next week of onsite interview", "Interview Questions": "projects, clean data, how to find priority to different projects"}, {"date": "21 Feb 2021", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMass Memorial Health in Dec 2019", "Interview Descriptions": "The new grad process is pretty transparent- they have set dates for interviews so you can plan ahead in that respect. The phone interview was pretty easy going with general questions about why I went into nursing, what I am interested in. They did not leave any time for questions which I thought strange. I heard back the next day that I was selected for in-person interview. You are not told ahead of time who you are meeting, if a unit manager will be there, or what unit you are interviewing for which is a bit strange. I was told in school that you should always meet your manager at an interview, get a feel for the unit. It was thirty minutes in person- I was asked questions for about 25 minutes, they had a piece of paper with prompts or scenarios to read off of and a form to fill in. Then was given only 5 min (at most) to ask them questions. I was never given a clear answer as to which unit I was being interviewed for and there was not a unit manager present. I also learned that although you are guaranteed full-time benefits, the position itself was not full-time. After orientation you have to apply to the unit (again?) and then they tell you how many hours they can give you, with the minimum of being 20-24-ish. I was notified a week later that I was not selected. Overall, I felt the interview in person was aggressive and biased. Not a place I would have felt supported and safe to learn and make mistakes.", "Interview Questions": "Why did you decide to go to X school and not a school in Massachusetts?  Why did you get a Master’s degree? Why should I trust you to take care of a family member? Provide me (interviewer) with Patient education on the following scenario, how would you react to an angry/upset patient who has been waiting a long time; where do you see yourself long term; tell me about a time you worked in a group."}, {"date": "27 Jan 2020", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at UMass Memorial Health (Worcester, MA) in Oct 2019", "Interview Descriptions": "I applied for a managerial position and checked the job board posting weekly.  There was no communication  until I actually had a phone interview which translated into a 1:1 onsite interview which went very well!  The onsite interview went very well and then again there was no communication for 3 months until I received a canned email stating I did not get the job,", "Interview Questions": "There were no behavioral questions asked.  There was a panel of interviewers and they all told me about the expectations and role of the job.  Each interviewer asked me questions about my experience and they all expressed their excitement about having me join the team."}], [{"date": "14 Nov 2022", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at UMass Memorial Health (Worcester, MA) in Oct 2019", "Interview Descriptions": "Very thorough. There were many options to give complete concrete answers. The interview process overall took around 30 days to 45 days maximum. The waiting period was an average of 15 minutes. The staff were friendly and waited to accompany the interviewee throughout the interviewing day.", "Interview Questions": "What was the most difficult course you took in college?"}, {"date": "2 Oct 2019", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at UMass Memorial Health in Aug 2019", "Interview Descriptions": "They called and set-up an interview. They asked me questions about my background. Then about a week later they offered me a position. After that the process was smooth .", "Interview Questions": "What do you like about Umass"}, {"date": "5 Apr 2019", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMass Memorial Health", "Interview Descriptions": "It takes awhile to hear back from them, but once the interview process starts it can go fast. Unfortunately you don't get to go thru people other than Human Resources.", "Interview Questions": "Why Healthcare?"}, {"date": "10 Jun 2019", "title": "Rad Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UMass Memorial Health (Marlborough, MA) in Jan 2019", "Interview Descriptions": "Online application. Interview with Imaging Director, Dept supervisor, and HR. You have to be screened for drug test, all immunization, background check, and valid Professional Licenses. In addition, you have to have proof of residency, or citizenship docs.", "Interview Questions": "Talk about your self. How do you see you 5 years from now? What are your weaknesses and strengths?   "}, {"date": "6 Dec 2018", "title": "Certified Pharmacy Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at UMass Memorial Health (Worcester, MA) in Nov 2018", "Interview Descriptions": "I applied on the company website after being referred by an employee. Got the interview call in a week. On the day of the interview, the manager showed the work place around and later I was interviewed by a panel of 3 which lasted for 30 minutes. They look out for culturally fit candidates. They have great benefits. But I had to decline the offer as I wasn't flexible with shifts.", "Interview Questions": "Do you see yourself in the pharmacy sector for the next 5 years?"}, {"date": "12 May 2017", "title": "Business Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMass Memorial Health (Worcester, MA)", "Interview Descriptions": "The interview process took quite a while because I had to meet with several very busy people.  I think I met with seven people over the course of 3 or 4 days.", "Interview Questions": "Tell me about yourself."}, {"date": "22 Dec 2020", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at UMass Memorial Health (Worcester, MA) in Apr 2017", "Interview Descriptions": "Interview went very well and effortless. I was screened with good questions that made me reflection on why I applied for the position. I was provided with a tour of the facility and met a good portion of staff. I have no complaints.", "Interview Questions": "Why is volunteering important to you?"}, {"date": "8 Mar 2017", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UMass Memorial Health (Worcester, MA) in Feb 2017", "Interview Descriptions": "I got an email to do a Webcam interview first, which was a little daunting. Also had to borrow a webcam from a friend for it. Then I got a phone call, then was invited to do an in person interview. The majority of communication is through email.", "Interview Questions": "What can you contribute to the company?"}], [{"date": "14 Mar 2017", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at UMass Memorial Health (Worcester, MA) in Jan 2017", "Interview Descriptions": "The interview process went well. I applied online and within a couple of days had received an in-person interview for the following Monday. I felt as though the interview went well and was contacted by the chief to let me know I was a great fit but then, because the chair of the department didn't think they could train me as a new grad, I did not receive an offer. Very nice bunch and I think with the experience would have had no problem receiving an offer.", "Interview Questions": "Why UMass?"}, {"date": "25 Oct 2016", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMass Memorial Health (New York, NY)", "Interview Descriptions": "I had to take the mandatory Epic assessment test prior to interview. Math, verbal and technical. Up to two hours to take proctored test. The interview was based on how I scored on the assessment test.", "Interview Questions": "Would you be willing to attend the training in WI?"}, {"date": "8 Aug 2017", "title": "Central Intake Administrative Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UMass Memorial Health (Leominster, MA) in Sept 2016", "Interview Descriptions": "I originally applied for the job online. Shortly after I received a phone call to set up an in-person interview. I had 2 interviews total and they were both pretty short and sweet. Within a week or so I received a call from HR offering me the job. They were able to negotiate the pay some based on my needs.", "Interview Questions": "Do you have experience working with EMRs?"}, {"date": "18 Jun 2018", "title": "Housekeeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UMass Memorial Health (Worcester, MA) in Aug 2016", "Interview Descriptions": "It was pretty casual. more of a conversation with the hiring manager to get to know you better. The manager came to meet me at the lobby since I didn't really know the place on top of my head. He walked me through the hospital as we talked and then sat down to talk some more. by the time i realized, i was hired.", "Interview Questions": "Do you want to make this a career?"}, {"date": "3 Aug 2017", "title": "Housekeeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMass Memorial Health (Leominster, MA) in May 2016", "Interview Descriptions": "Applied and a Week later had an interview scheduled. First I meet with human resources managment & then right after met with department management. Two weeks later got called with an offer.", "Interview Questions": "Why do you want this job?"}, {"date": "3 Jun 2016", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at UMass Memorial Health in Apr 2016", "Interview Descriptions": "Ask more about the statistical models and the details in the resume. They care more about the techinical skills which you have, you need to fammilar every details information in you resume", "Interview Questions": "Tell me something about the GLM models"}, {"date": "25 Jul 2016", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at UMass Memorial Health (Worcester, MA) in Mar 2016", "Interview Descriptions": "It was long but thorough. I met with many interviewees during the process. I went in for a temp position and then was asked to interview for the permanent position.", "Interview Questions": "Why do you want to work at Umass?"}, {"date": "12 May 2016", "title": "Consultant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 months. I interviewed at UMass Memorial Health in Mar 2016", "Interview Descriptions": "The recruiting process was long, scheduling phone interviews took a lot of changes. The described role was unclear, reporting structure of the role changed during process . Offer was made, staffing agency pushed very hard for acceptance", "Interview Questions": "How old are your children"}, {"date": "11 Jan 2016", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at UMass Memorial Health", "Interview Descriptions": "Brief and straightforward.  Toured the lab facility, met current staff, and sat with lab manager to discuss duties, responsibilities, lab culture/environment, and position specific details like hours and shifts available.", "Interview Questions": "What is your availability?"}], [{"date": "20 Nov 2015", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at UMass Memorial Health in Nov 2015", "Interview Descriptions": "I was immediately scheduled to be seen, and interviewed in a private room by a professional manager. I was given the job after 1 more additional interview and all paperwork was provided via PDF attachments or using a link on their job site system.", "Interview Questions": "Why are you interested in the healthcare industry?"}, {"date": "13 Jul 2017", "title": "PCA-II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UMass Memorial Health (Worcester, MA) in Sept 2015", "Interview Descriptions": "I applied online with my resume. I got an email and call from talent acquisition. Then I was called by nurse manager for an interview. I went to the interview which mostly consisted of a tour of unit, and discussing position. The next day I was called by HR with job offer.", "Interview Questions": "How I would balance work and personal life?"}, {"date": "6 Aug 2015", "title": "LSW Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at UMass Memorial Health", "Interview Descriptions": "Awkward, felt they were busy and that I was not a priority. They are set in a school of thought that must match up with candidates. By the end of interview I felt they were try to talk me out of it.", "Interview Questions": "Why did I want the job"}, {"date": "11 Oct 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMass Memorial Health in Aug 2015", "Interview Descriptions": "I got hired at a job fair. I was initially contacted by an talent acquisition specialist through linkedIn. They did a brief over the phone qualifying process and once they were interested, I was invited to a job fair interview process.", "Interview Questions": "What are some weaknesses?"}, {"date": "4 Aug 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at UMass Memorial Health (Worcester, MA) in Jun 2015", "Interview Descriptions": "Extremely long. Treated like a first day training - was sat in front of computer, showed various databases, programs, etc., and told how to use them. Also was given printouts, booklets, reports to look over. Asked a lot about social media (in my background, but was told not relevant to position, just that they were interested in my thoughts). Never heard from them again, no phone call, no email to tell me the position was filled, didn't receive a reply to my inquiries.", "Interview Questions": "We have no social media presence, what would you suggest we use?"}, {"date": "15 Jul 2016", "title": "Staff RN On Cardiovascular Unit Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at UMass Memorial Health (Worcester, MA) in May 2015", "Interview Descriptions": "I was already working as a float pool nurse on 11-7 shift and was looking to change my shift to days or evenings.  I applied through the postings for several openings and received a call within a week after the posting was closed. The talent acquisition team called me and set up an interview with the unit manager.  I met with unit manager at the hospital on the unit I was applying for a position on.  I met a few of the staff members, had a chance to ask questions and was shown around the unit. The interview was very relaxed, but appropriate.  Skills were on resume and a few situations were discussed that may arise on the unit.", "Interview Questions": "Why do you want to work here?"}, {"date": "12 Jan 2015", "title": "Nurse Educator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UMass Memorial Health", "Interview Descriptions": "A 4hour interview, first with ADON, then a panel interview with nurse managers, other educators. Some of the questions were outright ambiguous and personal. I was asked about how I would establish trust. I mentioned, I would share information with my fellow educators etc... However I was told by the one who asked the question that, she was looking for an answer like.. I will demonstrate to the educators I am capable to providing nursing care such as going on the floor to work while I was been monitored. Seriously. After working for years, attaining MSN, I have to be monitored by another nurse if am capable of performing a nursing care to establish trust? Wow. I felt like a new grad.\r\nI called weeks later to inquire but was told the position is currently on hold due to budgeting. Months later, job was still posted.", "Interview Questions": "What are your long term goals."}, {"date": "11 Feb 2016", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UMass Memorial Health (Worcester, MA) in Jan 2015", "Interview Descriptions": "I applied and after some time, roughly three months had passed, I was contacted to come back for a second interview where I was hired on the spot. The process was very clean and thorough, as was my onboarding experience.", "Interview Questions": "What my experience was and what I could bring to the hospital to help better staff"}, {"date": "23 Aug 2019", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UMass Memorial Health in Jan 2015", "Interview Descriptions": "Reviewed details and work experience, what else is there to know for this instutition?  Polite and thoughtful interview set in a good environment.    No pressure, just be yourself, and you will do fine!", "Interview Questions": "What are your goals and ambitions for your career?"}, {"date": "5 Dec 2017", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UMass Memorial Health (Kingston, NY) in Nov 2014", "Interview Descriptions": "They didn't ask me much, pretty much told me when to start.  They guy didn't say much, just sat in a chair on his computer. I had a more professional experience in shoprite.", "Interview Questions": "are you in school?"}], [{"date": "9 Oct 2014", "title": "Department Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UMass Memorial Health", "Interview Descriptions": "A full day of interviewing with departmental staff was arranged several weeks after resume submission. Despite the feedback during the interviews being very positive, and being told I was one of two final candidates, the lack of follow-up post interview was very disappointing.  A courteous email  or call informing me the other candidate was selected would have been appreciated.", "Interview Questions": "What would you do it you were going to be late for work?"}, {"date": "8 Oct 2014", "title": "Patient Access Services Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UMass Memorial Health in Oct 2014", "Interview Descriptions": "Applied online and received a phone call from recruiting about two weeks later to conduct a phone interview. Was brief, totaled 8 mins. Asked: Tell me about yourself, Why did I choose this hospital, Have I had conflict with co-workers in the past and if so what was the resolution, what are your strengths. Recruiter set me up for an in-person interview with the mgr. We met and she was very friendly, had a list of questions that ranged from What have you achieved in your previous job? to How have you dealt with difficult clients in the past? Overall the experience was great, had a few laughs and thought it went well. She was interviewing the rest of the week and said it would be up to 3 weeks to hear back, its still the first week so fingers crossed but haven't heard anything back yet.", "Interview Questions": "N/A"}, {"date": "13 Jun 2013", "title": "Senior Applications Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at UMass Memorial Health (Worcester, MA) in Feb 2012", "Interview Descriptions": "Normal interview process, phone screen, on site meeting in round table discussion, team came in to meet and ask questions.  The team was quite large at the time of the interview and as time went on the entire team that interviewed me had left for other companies.", "Interview Questions": "Tell us about yourself"}, {"date": "10 Jul 2015", "title": "Telecommunications Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at UMass Memorial Health (Worcester, MA) in Jun 2011", "Interview Descriptions": "I really don't remember. I know I had 2 interviews. They don't really care if you're qualified or motivated because they basically hire people who know other people. A lot of employees can barely speak proper english. There is a lot of secrecy and gossip behind the facade of friendly employers.", "Interview Questions": "Are you willing to come in whenever we need you"}, {"date": "8 Jan 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at UMass Memorial Health in May 2010", "Interview Descriptions": "Met with multiple people within the division.  Interviews were detailed but not rigorous or intimidating - all were kind and interested in learning about my background and personality.  Importance of attitude and dedication.", "Interview Questions": "Why are you interested in healthcare?"}, {"date": "31 Dec 2013", "title": "Support Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at UMass Memorial Health in Aug 2009", "Interview Descriptions": "Easy interview with little questioning.", "Interview Questions": "N/A"}, {"date": "14 Dec 2013", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at UMass Memorial Health (Marlborough, MA) in Feb 2009", "Interview Descriptions": "was just hired as per diem...no resume, no application. really", "Interview Questions": "N/A"}, {"date": "2 Oct 2013", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at UMass Memorial Health in Feb 2009", "Interview Descriptions": "Interviewed and hired quickly.", "Interview Questions": "Nothing specific."}]]