[[{"date": "N/A", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Montefiore Medical (New Rochelle, NY)", "Interview Descriptions": "Fast and easy interview process. Everyone was very nice and helpful. Currently going through the onboarding process. HR was very helpful. Had two interviews on the same day and a nursing exam prior.", "Interview Questions": "Tell me about yourself What are you strengths What are you weaknesses"}, {"date": "22 Jun 2023", "title": "Internship Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Montefiore Medical (Bronx, NY)", "Interview Descriptions": "Had to set up two interviews then go in person, video chat. It was very nice being able To talk to everyone. The staff was really nice and didn’t take long.", "Interview Questions": "What was job experience like"}, {"date": "21 Jun 2023", "title": "Lab Technician II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Montefiore Medical", "Interview Descriptions": "It was a lengthy but rewarding process. I had my interview over zoom. To become a Montefiore associate there are a lot of different requirements to meet, however, it is definitely worth the effort.", "Interview Questions": "Do imyou have experience in (said field)"}, {"date": "16 Jun 2023", "title": "Medical Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical (Bronx, NY)", "Interview Descriptions": "Interview process was not too difficult. They were very accommodating. First interview was about 20 minutes and another interview with HR about another 20 minutes. I received a response very quickly and offered several start dates to accommodate my vacation.", "Interview Questions": "What made you interested in this position? Why do you think are a good candidate?"}, {"date": "20 May 2023", "title": "Operations Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Montefiore Medical (New York, NY)", "Interview Descriptions": "Vetted by HR, quick call with hr specialist asking basic questions regarding my resume, and then i was set up for an interview with the practice director, that lasted about 45 minutes then was set up for an interview with the practice vice chairman, that lasted about 30 minutes. A few days later, hr senior recruiter called me to ask me about my expectations regarding compensation, and then about  two days later, I was offered the job.", "Interview Questions": "how will you be successful managing multiple locations."}, {"date": "13 Jun 2023", "title": "Data Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Montefiore Medical (New York, NY) in Apr 2023", "Interview Descriptions": "Communication had a lot of delay. panel interview by hiring team. General questions related to previous experience in data analytics. Overall neutral experience, some of Interviewers were not friendly- that reflects the work culture", "Interview Questions": "How did you use python in your previous role?"}, {"date": "16 May 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical (New York, NY) in Apr 2023", "Interview Descriptions": "Had 2 interviews, first on the phone with the nursing recruiter. The interview was basic question. Second interview was good. It was with the nurse. She asked my more about experience.", "Interview Questions": "What is a successful nurse to you"}, {"date": "20 May 2023", "title": "Human Resources Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Montefiore Medical (New York, NY) in Mar 2023", "Interview Descriptions": "I was contacted by the Recruiter and had an initial phone screen. Then she invited me for the in person interview. The interview was more than an hour. They had one and one with each team member. It was really repetitive to answer the same question to everyone. \n1st had the one and one with the Recruiter, 2nd one and one with the HR manager and 3rd with the HR Director. \nAnd then I never heard back from them. Please respect your candidates and give them feedback with a yes or no, after any interview.", "Interview Questions": "Why did you choose Montefiore?"}, {"date": "27 Jan 2023", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Montefiore Medical", "Interview Descriptions": "It takes 2 months before I was called in for interview. Manager call you to set-up the date and time of interview appt. Casual and easy. Welcoming environment and interviewers were 2 managers. Nice people", "Interview Questions": "Why do you want to work here?"}, {"date": "14 Nov 2022", "title": "Senior Surgical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Montefiore Medical", "Interview Descriptions": "It was very easy and it might have been this way due to my interviewer. Although I think anyone with the right credentials can get into this industry just alright.", "Interview Questions": "What is your greatest weakness?"}], [{"date": "4 Oct 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Montefiore Medical", "Interview Descriptions": "I applied for this position couple months ago. It was not a long wait for me like others have stated. My interview process when something like this: I interviewed with nurse manager Got a call from HR to schedule an interview . I will update the outcome.", "Interview Questions": "How will you deal with an aggressive patient?"}, {"date": "23 Sept 2022", "title": "Ward Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Montefiore Medical", "Interview Descriptions": "basic Application : easy\nin person interview with management: be prepared for questions about what you're looking for, your experience, and why you're looking for a new position.\nThen phone interview with talent requisition \nthen application part one\nthen application part two\nthen offer letter", "Interview Questions": "why you want to work for Montefiore ?"}, {"date": "24 Sept 2022", "title": "MMG Performance Coach Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3+ months. I interviewed at Montefiore Medical (New York, NY) in Sept 2022", "Interview Descriptions": "This review is for a position within MMG offices in Yonkers, not the hospitals. The interviews consisted of 3 virtual meetings to meet the VP, acting director and 1 coach for the department. The process took about 3 weeks. After all interviews were completed, the VP emailed to ask for examples of past work. In my experience, this is always a bad sign. \r\nQI/PI work revolves around proprietary and confidential projects privvy to each institution, so asking for samples feels unethical. It feels like they were definitely shopping for ideas for free.\r\nThere was no response after submitting the sample work. Just the automated rejection email. \r\nThis department experiences frequent turnover and PI coaches dont stay very long. \r\nBeware of being asked to submit free content.", "Interview Questions": "Standard questions regarding project management, ideas for carrying out QI initiatives."}, {"date": "13 Aug 2022", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Montefiore Medical (Bronx, NY)", "Interview Descriptions": "It is super hard to get a job with montefiore and they know it. It is even joked about during orientation. You have to interview with HR, then the manager, do two exams, drug test, background check, Physical etc. they schedule all these things on different dates and different montefiore  locations all over the Bronx. very confusing process.", "Interview Questions": "Name a time when you went above and beyond for a patient\n\nHave you been late to previous job and what did you do about it. \n\nWhat would your previous managers say about you? "}, {"date": "15 Jul 2022", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Montefiore Medical (Bronx, NY)", "Interview Descriptions": "First was a call with the director where they asked the typical questions about myself, my experience, certain types of projects I have worked on and how I deal with some roadblocks. After I had to complete a case study and submit it. Then I interviewed with the PM who would be my manager and we spoke about my experience, as well as the answers to my case study. Then I spoke with a member of the project team about my experience in certain situations and how I would go about process improvement and things like that. Then I had an interview with one of the directors and spoke more about my project experience. All of it was on Microsoft Teams through the video except for the first call.", "Interview Questions": "Tell me about your background"}, {"date": "17 Jun 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Montefiore Medical", "Interview Descriptions": "Went through a zoom interview where I was asked standard questions such as strengths, weakness, leadership, etc. as well as job specific questions (related to experiences helping underserved populations). Interview lasted about 30 minutes.", "Interview Questions": "What is your biggest weakness?"}, {"date": "19 May 2022", "title": "Nursing Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Montefiore Medical (Bronx, NY) in May 2022", "Interview Descriptions": "After your online application, Send you email  for virtual interview and tips  which is good after 24-48 hours you recieve  a link for the interview and the. You wait if your hired", "Interview Questions": "What are  your Qualifications and background "}, {"date": "10 May 2022", "title": "Registered Nurse, Emergency Room Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Montefiore Medical (Bronx, NY) in May 2022", "Interview Descriptions": "I received a call from HR and she sent me the skills survey quiz for the references link, asked me to send her my BSN, my RN registration & license, and to complete the full application to the position I applied for. We then had an interview scheduled which went so well. I then received a call from the ED manager for an interview. I was interviewed by the Nurse Educator & the ED Nurse Manager. It was a learning experience and helped me tap into my knowledge from school.", "Interview Questions": "What is the process of sepsis? How would you go about a 23 year old  patient who comes in with LLQ pain? "}, {"date": "21 Mar 2022", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Montefiore Medical", "Interview Descriptions": "Friendly Conversation. No pressure, they just want to know you! Everyone was very polite and made me feel comfortable. I spoke to three PA's and they were all very nice and they wanted to get you to work there.", "Interview Questions": "Why did you choose internal medicine?"}, {"date": "2 Feb 2022", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Montefiore Medical (New York, NY)", "Interview Descriptions": "Quick and friendly, heard back within a month. Starting process took longer, but the interview was great. The interview itself was a professional and smooth process, but HR was frustrating.", "Interview Questions": "N/A"}], [{"date": "1 Oct 2022", "title": "Customer Service Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Montefiore Medical (New York, NY) in Feb 2022", "Interview Descriptions": "Interview was remote because of covid, you get assigned a manager to interview you and a code for the teams log in wait for the interviewer, they come on ask you a few questions and that’s it. ", "Interview Questions": "Name a time where you made a mistake you had to fix"}, {"date": "27 Jan 2022", "title": "Epic Application Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Montefiore Medical (New York, NY) in Dec 2021", "Interview Descriptions": "3 Rounds: First- Since I come from a non-EPIC background, I was asked to give the EPIC skill assessment exam (I took 1.5 hr to complete), Second - After clearing the Skills Assessment, I had 1-1 with the hiring Manager (1 hr), Third - Final round w/ Manager of Hiring Manager and the Manager of another team that this team that I was getting hired to will be closely working with.", "Interview Questions": "Behavioral questions, Experience related, insights into Role and company"}, {"date": "4 Apr 2022", "title": "Clinical Psychologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 months. I interviewed at Montefiore Medical in Nov 2021", "Interview Descriptions": "There were a total of five interviews that were conversational. It was overall a great experience. I learned about the program and they were very interested in bringing aboard a candidate who was a good fit to the program and wanted to ensure that the program was a good fit for the candidate as well.", "Interview Questions": "N/A"}, {"date": "25 Oct 2022", "title": "Senior Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical (Bronx, NY) in Nov 2021", "Interview Descriptions": "1 day interview. Meet with director. Wait 3 days for call back . Brief overview of departmental goals and responsibilities. Team strengths and weaknesses. Understanding structure of department what is meeded to succeed", "Interview Questions": "Greatest strength in yourself Weaknesses"}, {"date": "15 Dec 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical (New York, NY) in Oct 2021", "Interview Descriptions": "The questions were pretty moderate, the interview I had was done over FaceTime. The interviewer was nice and it went well. Hopefully things will work in my favor. I’d hope to soon be employed by Montefiore medical center.", "Interview Questions": "What’s your 5 year plan."}, {"date": "28 Sept 2021", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical", "Interview Descriptions": "They have you fill a questionnaire, med math, and application of medication administration. 30 qs. if you pass, you go on to the next step. if not, have a good attitude about it and hopefully they allow you to retake it.", "Interview Questions": "Why do you want this position, ect. What is you goal?"}, {"date": "8 Sept 2021", "title": "Data Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Montefiore Medical", "Interview Descriptions": "A 90 Minute interview process meeting with 1 senior data scientist, a team member, and the head of the team. ~30 minutes of technical focusing on database management and the rest was behavioral. Prior to the interview there was a case study that a presentation had to be created for and was reviewed and discussed with the head of the team.", "Interview Questions": "Technical portion: asked about sql statements to sort thru a transactional database\n\nBehavioral: primarily going through resume "}, {"date": "15 Aug 2021", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Montefiore Medical", "Interview Descriptions": "Had an interview in-person with the supervisor and regional medical director, it was mostly behavioral based to assess fit of yourself with the organization. It was not an overly stressful experience, more conversational. We also discussed long term objectives that was in addition to current position job duties, responsibilities and tasks.", "Interview Questions": "How do you see yourself growing with the organization."}, {"date": "16 Sept 2021", "title": "Change Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Montefiore Medical (New York, NY) in Jun 2021", "Interview Descriptions": "The process is so weird and poor. First round was with HR then director then HR again, then virtual video and Audi interview, then 200 plus question then with 4 people team interview.", "Interview Questions": "All stupid question and very unprofessional. They have been looking for more than 8 months now and still not selected the candidate yet. "}, {"date": "13 Apr 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical (Bronx, NY) in Apr 2021", "Interview Descriptions": "I found the interview process to be very thorough, conversational and respectful. The feedback provided was eye-opening and appreciated. The follow-ups were courteous. I appreciate being kept in the loop.", "Interview Questions": "Why did you choose this field?"}], [{"date": "23 Feb 2021", "title": "Social Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Montefiore Medical", "Interview Descriptions": "HR requires you to complete 3 reference checks up front, 5 references if they cannot contact your current supervisor, just to even get to sit for an HR screening call. After I completed my 5 references the HR rep told me my salary requirement was too high and wouldn't let me negotiate and discontinued my application. Completely wasted my time and unprofessional as I had to provide references upfront. ***The salary range is 50-60K and you should know this upfront before you start the process!***", "Interview Questions": "What's your salary requirement no thats too high sorry no I can't tell you what the range is "}, {"date": "13 Feb 2021", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Montefiore Medical", "Interview Descriptions": "The interview process took about 2-3 months due to delays at HR. Once it was initiated, it was VERY slow with lots of hold-ups. The HR department was very disorganized and lost many of my documents. The interview itself was easy.", "Interview Questions": "Questions were specific to my role and my work. "}, {"date": "23 Jan 2021", "title": "Buyer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Montefiore Medical", "Interview Descriptions": "Short interview, went over basics of benefits and pay then met the manager and went down to the department. They went over the basics of the job. Very friendly and nice", "Interview Questions": "What system do you use at your current job "}, {"date": "12 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Montefiore Medical", "Interview Descriptions": "it could have been better they are desperate for nurses right now at some of their upstate locations, perhaps the main campus is different but who knows. right now they want you in as fast as possible and don't care too much about the process.", "Interview Questions": "tell me about yourself today."}, {"date": "3 Jan 2021", "title": "Physcians Assistant Specialties Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Montefiore Medical", "Interview Descriptions": "Multiple staged days, tours, and interviews. Unfortunately delayed due to COVID and not able to fully see what the working environment would be. Slightly unorganized because interviews across multiple sites and hospitals", "Interview Questions": "What can you bring to Montefiore? "}, {"date": "22 Oct 2020", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical", "Interview Descriptions": "concise and to the point, met with medical director and working PA. wasn't showed the floor but was explained the duties clearly. interview was more of conversation. wasn't given an offer by medicine department but HR representative called to do separate interview; shortly after gave offer. th", "Interview Questions": "Why would you choose to work at Montefiore? "}, {"date": "20 Oct 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Montefiore Medical", "Interview Descriptions": "It was great.  Recruiter was so honest with what she was expecting. Told me a suit is recommended especially for first graduates and how she will cancel people out depending on appearance.", "Interview Questions": "Why do you want to work here? Tell me about yourself."}, {"date": "22 Jul 2020", "title": "Physician Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Montefiore Medical", "Interview Descriptions": "i was contacted by HR for a phone interview. First i had to complete an online assessment and a HireVue virtual interview. the email correspondence was friendly and timely. I was contacted 1 week after applying", "Interview Questions": "to first complete the virtual interview"}, {"date": "2 Mar 2020", "title": "RN Staff Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Montefiore Medical", "Interview Descriptions": "It was a little lengthy, but overall pretty straightforward. Two interviews on the unit (one with the nurse manager and the other with charge nurses) and one with HR. Had to complete a fundamentals test and a med-math test as well.", "Interview Questions": "How did you handle a situation with a difficult patient or instructor?"}, {"date": "16 May 2021", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical (New York, NY) in Mar 2020", "Interview Descriptions": "Is was very good, the questions were reasonable, the interviewer was professional but also made me feel comfortable.  They let me know what I was getting into and I had to understand that you are to help people not to look for a check, which I’m glad they said because I feel the same way, after all these people we are talking about.", "Interview Questions": "How would you care for a patient "}], [{"date": "16 Nov 2020", "title": "Director IT Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Montefiore Medical (Yonkers, NY) in Feb 2020", "Interview Descriptions": "An initial video screen was sent to the hiring manager and then I was invited in to interview directly with the hiring manager.   A good friend who previously worked with the hiring manager warned me that she was a total jerk.  I went anyway to find out that he was completely right.  As soon as the hiring manager asked me if I worked with my friend at my previous company and I confirmed it, she started crapping all over my friend which was extremely unprofessional.  I would never want to work for someone like this.  I would have had a hard time accepting the offer if she had extended it.  She also kept me in her office 30 minutes past the interview schedule end time and never once asked me if that was ok or apologize for infringing on my time.  So inconsiderate!!!", "Interview Questions": "How many people were on your CAB (Change Advisory Board)..."}, {"date": "16 Oct 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical (Bronx, NY) in Feb 2020", "Interview Descriptions": "Basic interview questions, asked about personal experiences directly related to the job.  The interviewer was very caring and wanted to know about me. The initial interviewer was sick and they were very accommodating as to finding someone else to interview me.", "Interview Questions": "What is my theoretical orientation>"}, {"date": "4 Dec 2019", "title": "PA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Montefiore Medical", "Interview Descriptions": "I applied online. and was then contacted by HR, then scheduled an in-person interview with the specific medicine department, they then showed you around. interview was ~30-60minutes.\r\nI applied online. and was then contacted by HR, then scheduled an in-person interview with the specific medicine department, they then showed you around. interview was ~30-60minutes.", "Interview Questions": "Tell me about yourself. why do you want too work here?"}, {"date": "15 Nov 2019", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical (Bronx, NY)", "Interview Descriptions": "Applied online and received call back from HR. \r\nSet up interview with director.  Likely high chance to receive offer if scheduled for interview\r\nPerformed interview in department and completed onboarding process (~3-4 weeks later)", "Interview Questions": "Why are you a good fit? "}, {"date": "13 Sept 2019", "title": "Ward Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Montefiore Medical", "Interview Descriptions": "Went well and didn't last long. They asked basic questions that any interviewer would ask.  Spoke to the HR manager first and then had an interview with the hiring manager. Hired on the spot. They asked basic customer service questions to see how I would deal with patients and their families.", "Interview Questions": "What does teamwork mean to you?"}, {"date": "14 Sept 2019", "title": "Medical Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Montefiore Medical", "Interview Descriptions": "Phone interview through a talent company? Focusing on a few basic questions about work history, experience and how these can improve and help promptly towards my career (goals).  Fairly thorough and detailed expectations. Straight to the point with a short time frame to prove your skills. I hope I can get in person interview soon.  Nerve wracking at first and they don’t tell you exactly what will happen next. The status is under consideration/pending. Expecting  either a rejection with a “thank you” after a good amount of time. I am writing this review using this site because I am very curious how their hiring process works.", "Interview Questions": "Tell us about yourself?"}, {"date": "23 Oct 2019", "title": "Unit Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Montefiore Medical (Bronx, NY) in Sept 2019", "Interview Descriptions": "I went on a couple of interviews, and my interview with HR was the second interview I had out of 3. Once you’re in their system they kind of call you for random units, I finally got a job offer from HR a month after my interview. They don’t say anything regarding your interview while you wait for a call back so you must be very patient.", "Interview Questions": "Do you have any customer service experience?"}, {"date": "4 Sept 2019", "title": "Art Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Montefiore Medical", "Interview Descriptions": "One of the preliminary interview steps is to record yourself, via an app, answering the questions. It was a nerve-wracking. I am not a vlogger or selfie taker, so it felt both meaningless and uncomfortable. You are given as much time as you want to practice, but the actual interview questions are different from the practice questions. The whole thing felt invasive, superficial, and like the employer did not care enough to invest even in a Skype interview.", "Interview Questions": "Not verbatim, but something along the lines of \"how did you handle a difficult situation on the job?\""}, {"date": "28 Aug 2019", "title": "Human Resource Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical", "Interview Descriptions": "The first step of the interview was a video interview.  There were 3 questions and you were not able to review your answers.  A phone interview would of been preferred so that an idea of the company could of been obtained instead of feeling a swipe.  Throughout the process I have learned that the Recruiting team is unorganized and unprofessional. After completing the video interview I received a duplicate email for another request which I later found out that I received the wrong title for the interview (good reason to have a phone interview). I did not receive the position but about a month later I received another interview request, I reached out to confirm it was not in error  and the response I received was curt and unprofessional.", "Interview Questions": "Why are you interested in this role?\r\n"}, {"date": "27 Aug 2019", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Montefiore Medical (Bronx, NY)", "Interview Descriptions": "Filled out a form and was given a math test. I passed and was given an interview. I had to interview at different sites. There was a few sites that didn’t get back so I called HR and they called and offered me a position in the next 2 weeks after the interview.", "Interview Questions": "N/A"}], [{"date": "1 Sept 2019", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Montefiore Medical (Bronx, NY) in Aug 2019", "Interview Descriptions": "This was for a position at the Wakefield Montefiore campus, all the campuses are run a bit differently. I applied online and got an email immediately saying that I do not have the minimum requirements for the position. A few weeks later I got a call from the Department asking to set up an interview. Overall the interview was pleasant and the interviewers were very nice. I got an answer from them 3 weeks later.", "Interview Questions": "What was your worst clinical rotation and why? (I am a new graduate PA)"}, {"date": "17 Jun 2019", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Montefiore Medical (New Rochelle, NY)", "Interview Descriptions": "I applied online. Was emailed for an in person interview. The HR manager was very friendly as well as the nursing manager. Be prepared for clinical questions from the nursing manager. HR also gives a 30 question nursing exam. It was super easy though 15 med math and 15 general medication questions such as \"What is the most popular Sub Q location\" all multiple choice. Interview questions from HR were typical behavioral questions.", "Interview Questions": "Tell me about a time you went above and beyond for a patient. "}, {"date": "18 Jun 2019", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Montefiore Medical (Bronx, NY)", "Interview Descriptions": "I was contacted for a video interview where they ask about five questions. Then  received a phone interview and that followed with a in person interview that same week. The in person interview were with 3 Managers and then an individual with an Administrator. I was then called by HR for a final interview. Please go in to these interviews prepared, they ask a lot of behavioral question, know your background on Montefiore and the position you're applying for.", "Interview Questions": "Why did you choose Montefiore?"}, {"date": "13 May 2019", "title": "PA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical", "Interview Descriptions": "Smooth and informative. It seems like they really care about finding a position that you are interested in. Willing to teach and train. Seems very PA friendly. Overall good experience!", "Interview Questions": "Tell me about yourself, and why I wanted the job"}, {"date": "30 Dec 2019", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at Montefiore Medical (New York, NY) in May 2019", "Interview Descriptions": "1. Phone interview with the hiring manager.\n2. Phone interview with HR.\n3. On-site interviews - every interview was 45 minutes.\nFour managers and one team member.\n5. Online assessment.\n6. Five professional referrals.\n7. Background check.\n8. Drug test.\n9. Physical exam.", "Interview Questions": "Tell us about your previous position"}, {"date": "7 Mar 2019", "title": "Physician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Montefiore Medical", "Interview Descriptions": "Applying for a job and being treated as a low priority prospective employee. The system had massive amounts of paperwork and it led to me not even continuing through with all of the massive and unnecessary beaurocratic work.", "Interview Questions": "How can you serve the poor population?"}, {"date": "6 Mar 2019", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Montefiore Medical", "Interview Descriptions": "I met with HR and took a short pharmacology exam. The interview was one on one. The interviewer was very laid back and nice and straight forward. No difficult questions. If you prepared normally you should be fine. I was told a second interview will definitely be set up with me but have been waiting for two months now.", "Interview Questions": "How did you deal with a difficult patient?"}, {"date": "20 Feb 2019", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Montefiore Medical", "Interview Descriptions": "One Director called me to schedule the interview. Three Directors interviewed me at once. They were very friendly and wanted to set me up for success in the interview. They were emphasized the importance of the fast pace of the hospital.", "Interview Questions": "What type of social services have you referred people to, what did discharge planning look like in your previous role, tell me about yourself."}, {"date": "16 Apr 2019", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Montefiore Medical in Feb 2019", "Interview Descriptions": "Interview process feels natural. Be your-self and tell the truth. Some departments may let you fill out a detailed form with divers of questions. Then the one-on-one comes after.  If there is no forms they will ask about your past experiences. In addition, a tour of the hospital may be included.", "Interview Questions": "Tell me about yourself?"}, {"date": "11 Apr 2019", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Montefiore Medical (New York, NY) in Jan 2019", "Interview Descriptions": "Interviewed with director and some clinical pharmacists. Director will give you a case to figure out and present.  After having a one on one with director, you will be interviewed by the clinical pharmacist who will ask you questions based on your resume.", "Interview Questions": "What made you apply here? "}], [{"date": "30 Dec 2018", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Montefiore Medical (Bronx, NY)", "Interview Descriptions": "Very Good interview process.  The first step was online with behavioral interview questions and if you pass the online assessment then you will be called for an in-person interview. There are about 5 questions that you will be asked online, so be sure to prepare beforehand. Research the hospital and be ready to answer behavioral based interview questions.", "Interview Questions": "Why Montefiore? How do you handle a difficult personality, person, situation? Describe how you handled a difficult patient? What is your favorite season?"}, {"date": "3 Oct 2018", "title": "Clinical Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Montefiore Medical (Bronx, NY)", "Interview Descriptions": "Extensive, took a exam on the day of the interview on clinical skills.  Very dragged out since had to interview with different managers, VP and other staff members.  Then had to go back a few times to interview with other staff members", "Interview Questions": "All questions were expected"}, {"date": "11 Jan 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Montefiore Medical (Bronx, NY) in Oct 2018", "Interview Descriptions": "It was casual yet professional. The hiring manager at the time asked what prompted me to join the organization, about my nursing skills, and what I expect from the organization. By answering honestly and expressing a sincere desire to keep learning, I got a second interview which then led to a job offer.", "Interview Questions": "What motivated you to join the organization?"}, {"date": "24 Sept 2018", "title": "Human Resources Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Montefiore Medical (Bronx, NY)", "Interview Descriptions": "Phone call followed by a full day interview with 3 stakeholders.  All interviews were an hour.   I thought the questions were reasonable and they really wanted to know more about me and my working style  Overall it was a good experience and the staff were very welcoming.", "Interview Questions": "Why Montefiore?  What interests you about health care?"}, {"date": "18 Sept 2018", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical (New York, NY)", "Interview Descriptions": "Cordial, though not as connected between hiring managers, physicians, and HR as one would hope. The staff were friendly and helpful. The establishment was well-maintained and organized. I was able to get a good feel for the department at that location but a bit less for other locations.", "Interview Questions": "Why I wanted to work in the particular field. "}, {"date": "6 Aug 2018", "title": "Medical Resident PGY-1 Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical (New Rochelle, NY)", "Interview Descriptions": "Applicants are invited to interview throughout the application season. Interviews are behavioral-based and conducted by the medical director and senior staff. They include a guided tour of the facilities with opportunities to meet current staff.", "Interview Questions": "Tell me about yourself."}, {"date": "2 Dec 2022", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Montefiore Medical (Bronx, NY) in Aug 2018", "Interview Descriptions": "I met with the manager first, in which he asked questions about my dedication, my experience, and my dedication. After I met with the staff members in which they asked me questions about personality, work ethic, and hypothetical situations.", "Interview Questions": "What would you do if you were put in a situation in which you were unfamiliar with?"}, {"date": "21 Jan 2020", "title": "Clinical Laboratory Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Montefiore Medical (Bronx, NY) in Aug 2018", "Interview Descriptions": "Got an email to come in for an interview. Prepared went in and had a quick, friendly interview about my experience and what was the expectations if I was hired.", "Interview Questions": "Why do i want to work at montefiore"}, {"date": "25 Jul 2018", "title": "Clinical Social Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Montefiore Medical (Yonkers, NY) in Jul 2018", "Interview Descriptions": "Advice for Yonkers interviewees:\r\n•\tIf you are interviewing in Yonkers and are taking Metro-North, go to the Greystone stop. It is much closer to the Montefiore campus than the Yonkers station. No one will tell you this when they send you your interview confirmation.\r\n•\tUber is available to and from the train. No need to walk up to the closest street – they will come down to the train.\r\n•\tIf you are tempted to put your jacket and interview shoes on in the taxi don’t do it! It’s a windy, twisty road and you will just get knocked around in the cab.\r\n•\tAnd seriously, unless you’re interviewing for the role of CEO or Comptroller, don’t even bother wearing a suit or nice shoes.\r\n•\tIn any case, there is a lovely Starwood Hotel right next to the complex, where they will offer you free coffee, tea, water, comfy seats, and a nice rest room to change in. Take advantage of this!\r\n•\tThe Montefiore HR person will likely tell you that you are interviewing at 200 Corporate Road. This is not quite right, and if you’re like me, you’ll be waiting there for a while until someone directs you to a building on the other side of the complex (I think it’s #175).\r\n•\tWhen you finally get to your destination, there will be no one there to greet you. Why do they have the interviews in Yonkers? Couldn’t they do the interviews in the Bronx?? In any case, if you’re lucky, someone will be exiting the building and will let you in. \r\n•\tYou might be tempted, at this point, to get a drink of water from the “waiting area” – don’t bother – there are no cups there. You might also be tempted to ask to use a rest room, but again, there won’t be anyone there to greet you to let you in, so there is no one to ask. Ideally, you have had your water and used the restroom at the Starwood Suites (I can’t recommend them highly enough there!)\r\n•\tIf you’re waiting a long time without anyone coming to greet you, and believe me you will be, you might be tempted to try to contact your HR rep. Again, don’t bother. She won’t answer the phone and then will just send you a snarky note to tell you that she knows you’re there.\r\n•\tAnother nice person might at this point notice you’ve been sitting there a long time and offer to show you where the interview conference room is. I don’t know if this is necessary, but I took the opportunity to wait in the conference room. My interviewers finally came in about 10 minutes late, dressed super-casually, I might add. I felt like a moron for dressing up for the interview. Lesson learned, I guess.\r\n•\tMy interviewees would be my managers and seemed uncomfortable with the process. Why not have an HR person there if you are holding interviews at the HR headquarters??? Anyway, cookie-cutter questions: Why you? Why Maimonides? What was your hardest case last year? Snooze… After 35 minutes the interview was over. \r\n•\tNow, if you’re like me, and have to take a day off of work to take the Metro-North ($16.50) up to Yonkers for an interview and pay for an Uber back and forth ($16) from the train, you might want to determine beforehand if this job is a really good fit for you before making this journey. Another lesson learned, I guess? I’m not sure.\r\n•\tHaving some time to kill after the interview, I went back to Starwood Suites to change my clothes, get another (FREE!) cup of coffee and sit in a comfy chair in blessed air conditioning. The ladies room there has a HUGE garbage bin which was handy for me to toss all the paperwork I had brought with me to make sure I had done ample research on the company. \r\n•\tSeriously, the best part of that day was the time I spent in the Starwood Suite lobby. They were super-awesome there. I should check to see if they need any social workers…", "Interview Questions": "cookie-cutter questions: Why you? Why Maimonides? What was your hardest case last year? "}, {"date": "3 Oct 2019", "title": "Finance Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Montefiore Medical (Yonkers, NY) in Jul 2018", "Interview Descriptions": "The Interview Process can be different for each Position. The is a phone Interview with Hiring Manager. Then an in person Interview with with the Hiring Manager and other people in the department. In Person interview was about 3 hours.", "Interview Questions": "General Typical Questions\r\n-Tell me about yourself?\r\n-Tell me Strengths?\r\n-Why You want to work here?\r\n-Tell me of a time you had a problem at work and how did you solve it\r\n-Management Style"}], [{"date": "12 Jun 2018", "title": "Utilization Management Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Montefiore Medical (Bronx, NY) in May 2018", "Interview Descriptions": "Received a phone call to schedule an in-person interviews with the hiring manager. Everything went well and was asked typical interview questions. I also asked some of my own questions. \r\n\r\nI received an offer, but I turned it down. I applied and interviewed for an Utilization Management position but received an invitation to apply for another position under the hiring manager.  They wanted me to take a pay cut for a lower-level position but my resume clearly shows that I'm at a mid-career level. Montefiore requires you provide 5 references including your current manager and then sends them a long online survey to rate your skills and abilities. They do think this is excessive and don't care that this could get you fired from your existing job.  When I tried to negotiate salary, the HR recruiter said \"not gonna happen\". Their whole recruiting process is just so demeaning and dismissive. Everything from the slow response times to the non-negotiable low ball offers. I would not recommend.", "Interview Questions": "What were the responsibilities of your last position?  "}, {"date": "30 Dec 2022", "title": "Substance Abuse Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Montefiore Medical (Bronx, NY) in May 2018", "Interview Descriptions": "Very long process with 3 phases, one of which a video recording and 2 in person appointments in different locations. The very last interview I sat across 3 top executives.", "Interview Questions": "Many scenario questions were presented."}, {"date": "17 Apr 2018", "title": "HR Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Montefiore Medical", "Interview Descriptions": "First it was a phone interview. Than an in person interview. Interview took about one hour and the I met with 3 people. They got back to me within a week.", "Interview Questions": "What experience can you bring to the table"}, {"date": "26 Aug 2019", "title": "Administrative Supervisor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Montefiore Medical (Bronx, NY) in Apr 2018", "Interview Descriptions": "I received a phone screening, face to face with hiring manager for the department that I would be working in. The manager went over the training process and asked if hired would there be any conflicts that would prevent me from completing the process.", "Interview Questions": "They wanted to know about my work history; why I want to leave my current position; three words that I could use to describe myself ; what would my co workers say about me. "}, {"date": "4 Nov 2018", "title": "Dietary Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Montefiore Medical (New York, NY) in Feb 2018", "Interview Descriptions": "It was short and specific and straight to the point however you need to be careful with your answers as it shows your IQ  level to see which position you qualify for", "Interview Questions": "Why do you want to work for montefiore?"}, {"date": "26 Sept 2019", "title": "Nurse Aide Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical (New York, NY) in Jan 2018", "Interview Descriptions": "it was good, the interviewer were friendly, gave me a tour of the place, they seem interesting in my work and what i had to offer. i believed i was an asset to their company", "Interview Questions": "why do you want to work here"}, {"date": "20 May 2022", "title": "Financial Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Montefiore Medical (Bronx, NY) in Jan 2018", "Interview Descriptions": "You first must pass a couple of basic information tests with HR, like a typing test and customer service test. First interview is with HR, then you have two interviews in person on site. In my experience they were 15-20 each and every manager was pleasant and informative.", "Interview Questions": "Tell them about facing a recent difficult scenario with a patient and how I resolved it. "}, {"date": "17 Nov 2017", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Montefiore Medical (Mount Vernon, NY) in Nov 2017", "Interview Descriptions": "Basic skills test passed it then interviewed now waiting to here back. I believe it takes up to 2 weeks. I was informed that they are interviewing other candidates and will call the candidate that they've chiseled.", "Interview Questions": "N/A"}, {"date": "9 Sept 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Montefiore Medical", "Interview Descriptions": "Interview with HR was very easy going.  The recruiter was very nice and ask simple questions, \"What do you know about Montefiore?\" \"What is an example of when you went to the extra mile for a customer/client?\".  Meeting with the nurse supervisor was more of her explaining the position and the unit then an interview process.", "Interview Questions": "There were no crazy hard questions. Just know your stuff about Montefiore."}, {"date": "9 Sept 2017", "title": "Chronic Care RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Montefiore Medical (Bronx, NY)", "Interview Descriptions": "Very slow and disjointed HR process. Service felt very impersonal and difficult to get updates on positions applied for. It took 3+ months to get HR to get all pieces in order to get an offer despite multiple interviews with a variety of people. \nProvided generic job descriptions and unaware of job specifics.", "Interview Questions": "How do you handle difficult workplace situations?"}], [{"date": "8 Aug 2017", "title": "Outreach Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical (Bronx, NY) in Aug 2017", "Interview Descriptions": "The interviewer was nice, she didn't ask much questions as I had prepared for.  The interview was a relaxed setting. I hope to get a call back, I would love to work for this company.", "Interview Questions": "What type of management style you like to work under?"}, {"date": "4 Nov 2021", "title": "ER Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Montefiore Medical (Bronx, NY) in Sept 2017", "Interview Descriptions": "Montefiore Children's Hospital HR department was thorough, and professional.  I met with several levels of management which promoted positive environment.  They described the possible shifts and described their timeframes accurately.", "Interview Questions": "Leader or follower?\r\nWhat's the hardest patient or situation you've come across?"}, {"date": "15 Aug 2017", "title": "Study Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Montefiore Medical (New York, NY)", "Interview Descriptions": "I spoke with the research coordinator about my past experience, my understanding of their current research endeavor, basically tried to communicate why  I would be well suited to this position.", "Interview Questions": "What experience do you have speaking with healthcare providers?"}, {"date": "30 Nov 2021", "title": "Unit Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Montefiore Medical (Bronx, NY) in Aug 2017", "Interview Descriptions": "There are at least three appointments with various people that  l interviewed before getting hired.... Human Resources representative, designated Area Managers and Recruiter. Background check and lab appointments are necessary.", "Interview Questions": "What is highest Education level or plans to pursue in the future.  What is empathy? "}, {"date": "16 Mar 2021", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical (Bronx, NY) in Aug 2017", "Interview Descriptions": "I had interviews with two people. The interview lasts about 30 minutes. They asked simple basic behavioral questions in the beginning such as the backgrounds, strength and weakness, relationship with team members. then, they asked some clinical questions in scenario based.", "Interview Questions": "how do you work as a team member? "}, {"date": "5 Oct 2017", "title": "Senior Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Montefiore Medical (Yonkers, NY) in Jul 2017", "Interview Descriptions": "Probably one of the most laborious processes that I've been through.  Had a phone screen with HR then underwent a video interview.  After that I was then scheduled to come in for an in person interview with 2 associate directors and 2 peers. Upon confirming those interviews, I received an application and an invitation to complete an 80 minute Healthcare Competency Review (basically an IQ test).  Finally interviewed, no one had any idea at the time of the organization structure (so I had no idea if I was even interviewing with the hiring manager).  I was subsequently called back for a 2nd interview, this time VP, Assoc VP and more Directors.  This process took approximately 8 weeks.  Really felt like the applicant's time was not respected and does make me question what it would be like to actually work in this environment.  At no point did anyone who I met tell me how this was a great place to work, only that they are growing, very busy and that it would be challenging work.", "Interview Questions": "Many of the people you will be working with on projects have very large egos, how would you deal with those difficult personalities?"}, {"date": "7 Jun 2017", "title": "Senior Admitting Clerk Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical (Bronx, NY) in May 2017", "Interview Descriptions": "First I was called in for an interview. I set up an appointment to meet with the department manager. A good tip on the interview is to be yourself and talk about what you know. Make sure you have experience.", "Interview Questions": "How do you handle pressured situations, such as a patient family member being upset?"}, {"date": "15 May 2017", "title": "Patient Educator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical in May 2017", "Interview Descriptions": "The first step is a virtual interview. They send you a link and you record yourself answering certain interview questions. You can only record yourself once. You cannot watch what you have recorded. Their system wasn't working and I had to call them for a week straight before they finally sent me another link. A few days later they then sent me someone else's link. Their system needs to be reviewed.", "Interview Questions": "Why do you want to work here?"}, {"date": "19 Oct 2020", "title": "Outreach Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Montefiore Medical (Bronx, NY) in Feb 2017", "Interview Descriptions": "There were 2 interviews. One with the direct supervisor and one with HR. Both were very simple and they were mostly interested in my character and ability to be adaptable to changes in the job requirements.", "Interview Questions": "What is one interesting thing about you?"}, {"date": "30 Jan 2017", "title": "Health Educator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Montefiore Medical", "Interview Descriptions": "Got a phone call to go to Yonkers office initially to meet with supervisor of heath education than I went to several interviews at several locations for the position. I was not chosen at either of the locations although the local hiring staff made the decision, I also was not bilingual.", "Interview Questions": "How would I fit in their busy work environment?"}], [{"date": "15 Apr 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Montefiore Medical (New York, NY) in Jan 2017", "Interview Descriptions": "I was interviewed at Bronxy for the position of registered nurse. had four rounds of interview. three rounds with HR  and reference check. definitely Make sure your references are authentic.", "Interview Questions": "what are your strengths"}, {"date": "14 Dec 2016", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Montefiore Medical", "Interview Descriptions": "Overall the interviews were mostly behavioral questions about how you would handle certain situations.  Also, questions about what are good and bad things past managers would say about you.  Had to do a case study on the spot about managing a specific project/business plan.", "Interview Questions": "Describe a time you were faced with an issue and what steps did you take to resolve it?"}, {"date": "20 Nov 2016", "title": "Accounting Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Montefiore Medical", "Interview Descriptions": "Professional, engaging and a real discussion not an interrogation.\r\nInterviewer went over the resume and asked questions. Be sure to have a copy of your resume so you can follow. Interviewer took lots of notes. It was focused, efficient and to the point. No idle chat.\r\nInterviewer was friendly but very professional. Look out for follow up questions during the interview, to answers that you gave earlier in the interview.", "Interview Questions": "What are your strength and weaknesses for this position?"}, {"date": "27 Apr 2017", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical (Bronx, NY) in Nov 2016", "Interview Descriptions": "Was interviewed once by Clinical Manager, second time with both Office manager.  The questions were pretty clear cut, and managers did not make you feel nervous.  Showed you around the clinic.  Hiring process was pretty lengthy, with a physical, drug screen and a stack of paperwork to fill out.  Took over 6 weeks from time of offer.  Also had to wait until the next group orientation was.", "Interview Questions": "How would you handle a difficult Doctor?"}, {"date": "19 Jul 2017", "title": "Applications Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Montefiore Medical (Yonkers, NY) in Nov 2016", "Interview Descriptions": "The interview was a multiple step process. First, coordinating with the HR department, sending in my resume and cover letter. Then, we scheduled my first \"interview\" with HR. This was a pretty standard HR interview. Asking about my experiences, why they should consider me, and giving me some context about the organization. Next came the actual interview with possible future bosses. I was interviewed by three Epic senior product managers at once, asking again about my past experience and how it might benefit them. \r\n\r\nFrom there I \"applied\" officially to the job posting that they would consider me for. This portion took some time as they were waiting for approvals, budgets, etc. \r\n\r\nDrug tests, on-boarding questions, took awhile as well.\r\n\r\nEventually I heard back and received an offer. Overall it was a good experience.", "Interview Questions": "What is one example from your past experience when you went above and beyond expectations to deliver a positive change. "}, {"date": "18 Nov 2016", "title": "Pharmacist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Montefiore Medical (New York, NY) in Nov 2016", "Interview Descriptions": "It was a very comprehensive interview. First I met with the Director of Pharmacy Operations. Then I was given a patient case to assess. The director then asked me questions about my experiences and rotations during my last year of pharmacy school. Afterwards, I met with a panel of four different pharmacy managers and the director to present the patient case that I had assessed and they asked me more questions about my experiences.", "Interview Questions": "What have you heard about Montefiore?"}, {"date": "21 Jan 2017", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Montefiore Medical (Yonkers, NY) in Oct 2016", "Interview Descriptions": "This has to be the rudest team I have ever had the chance to meet.  I have no idea why they contacted me. Two of the five (includes HR) interviewers did not show, one did not want to be there and the other was over animated and condescending.", "Interview Questions": "A hammer and a nail cost $1.10, and the hammer costs one dollar more than the nail. How much does the nail cost?"}, {"date": "27 Sept 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Montefiore Medical (New York, NY)", "Interview Descriptions": "Very quick, they were really interested in knowing my background and experience and not in evaluating everything I was saying, basically they were very open-minded. I first got the interview with the hiring managers and then with HR, as it should be.", "Interview Questions": "What do you do when you have to do something you don't know or never did before?"}, {"date": "12 Sept 2016", "title": "Customer Service Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical (Yonkers, NY)", "Interview Descriptions": "I had an unpleasant interview experience, I was interviewed by 3 male staff at the same time. I probably had more work experience than the 3 of them combined. Age discrimination may be an issue here? Hostile work atmosphere  just from the interview!", "Interview Questions": "What have you been doing since laid off?"}, {"date": "16 Dec 2016", "title": "Study Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Montefiore Medical (New York, NY) in Sept 2016", "Interview Descriptions": "The interview was OK, the problem were the steps after the interview. No information regarding the benefits was provided to me, even after I asked for it several times, and no follow up of my hiring process was made. Some steps were just delayed by human resources which proved to be very inefficient. They simply didn't do their job, and it was OK to them. My start date was delayed 15 months because of them.", "Interview Questions": "What do I do if I am not sure about some procedure?"}], [{"date": "9 Aug 2016", "title": "Customer Service Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Montefiore Medical (New York, NY)", "Interview Descriptions": "Please come prepared to the interview if you really want the position. Dress up to part and do not come in with shabby clothing. Read about the job description which you are applying for because the manager may ask you if you know what kind of job did you apply for. HR usually calls you within a week or two to inform you that you were selected for the job. You will need to take a drug test and TB shot. It usually takes a month before you start working.", "Interview Questions": "The majority of the interview questions were behavioral questions. Study sample behavioral questions online."}, {"date": "16 Aug 2016", "title": "Senior Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Montefiore Medical (Bronx, NY)", "Interview Descriptions": "Very professionally done. I had a phone screen first then a skype interview followed by two face to face interviews. All of this was followed up by personality test, reference checks, drug screen and background checks. Lastly was the medical clearance before orientation.", "Interview Questions": "All behavioral type questions. "}, {"date": "11 Aug 2016", "title": "Project Manager - IT Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Montefiore Medical (Yonkers, NY) in Aug 2016", "Interview Descriptions": "HR contact, telephone interview {additional rounds F2F}\r\nInitial HR interview was outstanding.\r\nHiring manager interview was scripted, not conversational, lack of connection; did not give an initial overview of the organization; seemed more tactical than strategic focused.   Interviewer wanted to know more about candidate background, which was great, but there was a lack of clarity to determine where position would make the greatest impact. Did not give overview of types of projects one would be assigned, what the culture, environment was like - except that many groups do not collaborate, which is the hardest challenge in the PM space. Interviewer seemed a bit stressed or overwhelmed while talking about it, also very pressed for time.  Did not feel interviewer took a keen interest, except poking at why landed in different industries, as if project management is not transferrable skill. \r\nBe a bit more open minded - you never know what kind of gem lurks behind the resume.  First impressions are important.", "Interview Questions": "Tell me about you\r\nHow do you manage cost\r\n\r\nWhy do you want to work here {sigh, probably one of the worst questions to ask an interviewee}"}, {"date": "8 Jul 2016", "title": "BIS OPERATIONS CONSULTANT III - - SAP Materials/Logistics Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Montefiore Medical (Tarrytown, NY) in Jul 2016", "Interview Descriptions": "Phone interview 1 hour followed by site interview (if you get a call back) two 1hour sessions with dept heads and team. The interview was pleasant however I get the feel that they do not hire many outsiders all of the interviewers have been working at MF for 10+, 20+, 30+ years and they seem to hire from within.", "Interview Questions": "What was you single greatest accomplishment within SAP?"}, {"date": "1 Feb 2020", "title": "Behavioral Health Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Montefiore Medical (New York, NY) in Jul 2016", "Interview Descriptions": "The on boarding process was a disaster. HR was very disorganized. Would not get call backs in a timely manner. Requested documents had to be provided several times. Typical interview process. Meet with management and work hx & experience reviewed.", "Interview Questions": "N/A"}, {"date": "7 Aug 2016", "title": "Division Recruiter Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Montefiore Medical (Norcross, GA) in Jul 2016", "Interview Descriptions": "Met in a one hour one on one interview with the Vice-President where she asked several questions, also offered some insight about the company as well as her own personal life", "Interview Questions": "What would I be able to bring to the company?"}, {"date": "23 Jun 2016", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Montefiore Medical", "Interview Descriptions": "1 in person interview 2 weeks process. References check, drug screen, Background check. Smooth and easy process. really good team to talk about the opportunities. They gave good details about the position and what the expectations are.", "Interview Questions": "Skills related question"}, {"date": "22 Jun 2016", "title": "Clinical Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Montefiore Medical in Jun 2016", "Interview Descriptions": "It took a month from my initial interview so we offered a second interview .  Then it was a ping-pong game of back-and-forth to fill out many different forms .  The recruiters were rude and do not respond to you in a timely manner .  Still waiting to hear if I got the job or we can a half later when I was told I would be informed that afternoon or the next day .", "Interview Questions": " I was asked to name a situation where I went above and beyond my call of duty"}, {"date": "31 May 2017", "title": "Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical (Bronx, NY) in Jun 2016", "Interview Descriptions": "Online application was completed and I received a call back about 1 1/2 months later. I needed 3 letters of recommendation and all three also needed to compete an online review about my work ethic and experience. I was interviewed by all of the supervisors individually and with HR on the phone to assess my knowledge of the position I was applying for. They did a background, fingerprint, and drug screen.", "Interview Questions": "Why are you applying for this job?"}, {"date": "21 Mar 2016", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Montefiore Medical", "Interview Descriptions": "It wasn't bad...it was behavioral and situation type questions. I was interviewed by HR first and then by the team. It was about 3 people. They asked questions about HIPPA and HL7 compliance. It overall went well. I had several questions I asked. They describe the position and being oncall. Asked me if I had any questions. I met with the team lead and the product manager.", "Interview Questions": "What is HL7?"}], [{"date": "7 Dec 2016", "title": "Database Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Montefiore Medical (New York, NY) in Apr 2016", "Interview Descriptions": "about 2 weeks. Phone screen with HR and with a manager.\r\n\r\nDatabase department is full of overworked staff. Their management can't care less about them. And rather prefer them to work 3rd shift with no incentives.\r\n\r\nAfter an interview i didn't even followed up - no desire to work for a sweat shop with no upside.\r\nBtw, the pay is lower than market. Location is one pain to get to.", "Interview Questions": "how do you get the team to support the processes without offshore support?"}, {"date": "23 Mar 2016", "title": "Senior Clerk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Montefiore Medical in Mar 2016", "Interview Descriptions": "I applied online. I got a phone call from HR a few days later and was asked to come in and take a computer test. I passed the computer test, and then got a callback. Met with the supervisor and director. It went really well. Now I'm waiting for a callback.", "Interview Questions": "What would you do if a coworker get out of line with you?"}, {"date": "20 Aug 2019", "title": "Medical Biller Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Montefiore Medical (Bronx, NY) in Feb 2016", "Interview Descriptions": "Interview question were based on billing and how I would handle certain scenarios such as appeals and rejections. I was also asked what typed of billing EHR's I was familiar with and would I be able to work under someone for a small period of time.", "Interview Questions": "What would I if i would get a rejected claim? How would I handle an appeal?"}, {"date": "17 Jan 2016", "title": "RN Staff Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Montefiore Medical (Bronx, NY) in Jan 2016", "Interview Descriptions": "I received an email from HR right after applying to fill out a full application and set up an interview the following week.  I spoke to the HR director on the phone and since I am from out of state she said she would try to set up an interview with a nurse manager that day. She was very nice and answered any of my questions that I had.", "Interview Questions": "N/A"}, {"date": "2 Sept 2020", "title": "Senior Regional Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Montefiore Medical (Yonkers, NY) in Jan 2016", "Interview Descriptions": "Three interviews with four different employees.  Long and thorough but this can be expected at a Health Care organization.   The interview questions were very specific to the position and there were scenario questions a swell.   There have a background check and a drug test.", "Interview Questions": "They ask to describe a scenario where I failed.  Good question."}, {"date": "17 Dec 2015", "title": "Physician Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Montefiore Medical", "Interview Descriptions": "brief interview with HR PA recruiter -  what are your weakness and strengths...talked about PA background...make sure you know what salary you want and why...not a difficult interview", "Interview Questions": "weakness/strengths"}, {"date": "8 Nov 2015", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Montefiore Medical (Yonkers, NY)", "Interview Descriptions": "2 Interviews, indicated more money for transfer, then told error by HR department.\r\nLast interview was a panel interview with department. During interview phase you get an vague overview of what to expect, but if unfamiliar with departmental programs being used,  demanded expectations can be hard to calculate in new role. Have capacity to cope with various at times challenging personalities.", "Interview Questions": "How do you handle difficult personality?"}, {"date": "5 Jun 2017", "title": "Senior Accounting Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical (Yonkers, NY) in Oct 2015", "Interview Descriptions": "It's a lot of back and forth. It seems like they want to make sure they are hiring the best of the best. It's not a bad process - just a long one. And the physical clearance portion can take up to two weeks.", "Interview Questions": "Why do you want to work for Montefiore? What makes you qualified to work here?"}, {"date": "3 Oct 2015", "title": "Secretary II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Montefiore Medical (New York, NY) in Sept 2015", "Interview Descriptions": "The process took a while I waited a few months for response. But it was worth it during the interview I got asked standard customer service questions. And what would you do questions. The interviewers were very nice and straight to the point.", "Interview Questions": "Why montefiore"}, {"date": "1 Oct 2015", "title": "Senior Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical (Bronx, NY) in Sept 2015", "Interview Descriptions": "The interview went well. It was pretty much informing me of the requirements of the job and expectations. However I was also told that the hiring process for the position is long, it can last 2-5 months. So far I've been waiting almost a month and was told to call the person who interviewed me back this week. So I guess I'll see what happens.", "Interview Questions": "Why do you want to work for Montefiore"}], [{"date": "18 Jan 2016", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Montefiore Medical (Bronx, NY) in Aug 2015", "Interview Descriptions": "Smooth take exam .....background check etc...... Normal things employers do....2 interviews one with HR and the other with nursing manager you will work with then you will be contacted to submit all documentation", "Interview Questions": "Nothing fancy"}, {"date": "5 Jan 2017", "title": "Environmental Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical (New York, NY) in Aug 2015", "Interview Descriptions": "interview went well but the entire process is very long. manager and director who did the interview made me very comfortable, there attitude made me want to work with them", "Interview Questions": "how do I manage my staff"}, {"date": "29 Jan 2018", "title": "PC Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Montefiore Medical (Yonkers, NY) in Aug 2015", "Interview Descriptions": "You apply online at montefiore.org. Then if you are one of the lucky folks or if you know someone that's work at the Hospital, they can vouch for you. You get a call/email to come in to meet the HR person, then the Hiring Manager the same day. If you pass the Interview you will get a call with Job offer then a package in the mail or go in to HR to sign the offer.", "Interview Questions": "Do you know SCCM?"}, {"date": "21 Jul 2018", "title": "Operations Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Montefiore Medical (Bronx, NY) in Jun 2015", "Interview Descriptions": "They asked why I thought I would be a good fit. I asked them about what they felt would be my biggest challenges.  What I could offer them. The HR department moves pretty slow and you need to stay on top of them.", "Interview Questions": "What is the first thing 3 things I would do if I were hired."}, {"date": "3 Feb 2017", "title": "Systems Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 5 weeks. I interviewed at Montefiore Medical (Bronx, NY) in Apr 2015", "Interview Descriptions": "It was a challenging experience but the way it was setup was a bit unorganized. The inteviewer's seemed like they had no communication among themselves making the process confusing for all applicants", "Interview Questions": "Why do you want to switch from senior clerk to IT"}, {"date": "4 Jun 2015", "title": "Practice Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Montefiore Medical (Bronx, NY) in Mar 2015", "Interview Descriptions": "I was interviewed by the Director of Operations and the Human Resources Manager on the first day. I was called for a second round of interviews and considered for two different positions within the Medical Group. One of the interviews was a Medical Director. Another interview was with an Administrator. The Director of Operations is very nice and at the same time direct and upfront. The other interviewers were also pleasant.", "Interview Questions": "They asked me about my experience and how I would handle a difficult situation and difficult providers."}, {"date": "28 Jan 2015", "title": "Healthcare Performance Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Montefiore Medical", "Interview Descriptions": "Got a call by secretary of manager to confirm interview time, then go to the site, which is beautiful.  Finish a writing sample on site within 30 mins and then interviewed by the manager and one guy from engineering team. Lasted for an hour with both technical and behavioral questions.", "Interview Questions": "How do you calculate the number of calls coming in to the front desk of a small practice without the exact number of calls being monitored?"}, {"date": "11 Jul 2016", "title": "Information Technology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Montefiore Medical (Bronx, NY) in Jan 2015", "Interview Descriptions": "They responded to my application very promptly. Interview was very standard to what one would expect. They met me at the office and walked me to the interview room. Met with two associates and simply asked me about my resume and prior experience. It was very simple and lasted roughly a half an hour.", "Interview Questions": "Describe your best quality in one word"}, {"date": "18 Nov 2014", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 months. I interviewed at Montefiore Medical", "Interview Descriptions": "Be ready to fill out a lot of paperwork, but that is as hard as it can get.  Great position to get as soon as you get out of college, better pay than an entry level job in a BA field. It also comes with great perks, and what I liked most is that you can go back for your MBA payed by the union.  A full timer gets 6 free credits each semester, a part-time employee gets just 3.  Still better considering sky rocketing tuition fees.  Like any job the interview process can be intimidating, but remember to stay positive and answer honestly.", "Interview Questions": "What is one of your strengths as a customer service specialist? "}, {"date": "3 Nov 2014", "title": "Administrative Inter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Montefiore Medical", "Interview Descriptions": "It was a very basic interview with behavioral questions. They mostly asked me questions regarding my resume, but nothing that required detailed responses. One of the questions they asked me was how I could go about gaining group consensus toward creating a change. Another question I was asked was what my weaknesses were. The recruiters are a poor reflection of the organization, because one recruiter would not pronounce my name right no matter how many times I corrected him. It was disrespectful.", "Interview Questions": "how I could go about gaining group consensus toward creating a change."}], [{"date": "24 Feb 2017", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Montefiore Medical (New York, NY) in Sept 2014", "Interview Descriptions": "Took about an hour including the wait time. Interviewer just asked basic questions about experience nothing out of the ordinary. I met with the manager a couple of days after and that interview was just her getting to know me not really an interview, but with HR it was pretty simple.", "Interview Questions": "Name a time you went above and beyond for a client"}, {"date": "25 Dec 2015", "title": "Administrative Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Montefiore Medical in Jun 2014", "Interview Descriptions": "Basic interview process.  Initial interview phone call, then a face to face with hiring manager,  then recruiter call if position is offeted. Be sure to ask questions as well about location especially if you drive and need parking.", "Interview Questions": "Can you tell me about your weaknesses and strengths and why you want to work here."}, {"date": "11 Nov 2015", "title": "Care Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Montefiore Medical (Yonkers, NY) in Jun 2014", "Interview Descriptions": "Lots of people present.  Asked a lot of questions about things that ultimately did not pertain to the job.  More of a meet and greet experience.  Not very informative about the company or the job itself.  Not very organized about where the interview was heading.", "Interview Questions": "How would I get along with others"}, {"date": "26 Aug 2015", "title": "Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Montefiore Medical (Yonkers, NY) in May 2014", "Interview Descriptions": "The interview process was very informal as well as knowledgeable, but a bit misleading.  They tell you that this position can lead to great things, but the one thing they leave out which is a VERY BIG THING is that it can take up to seven years to get promoted or even change positions if you don't know someone internally.  Any who....the interviewer ask your basic interview questions as well as verifies your work history and why you would like to work for Montefiore.  If you make it through interview one, you receive a call and they ask you to report to a Yonkers, NY location to fill out a massive amount of paperwork including payroll before you officially are hired.  You speak with an HR rep who basically details you on the position and feeds you the same crap they first interviewer feeds you then gives you an orientation date and a schedule of things you have to complete before the orientation which includes drug screening and a TVB shot in which you have to schedule at one of their locations and you have to get the shot one day then wait a few days and go back for the results.  If the results come back negative the doctor will sign off on it and all the paperwork you received on the interview journey you have to take with you to orientation on the date given at the given location to be stamped and that ends the interview process.  My advise to anyone seeking this position....MAKE SURE YOU HAVE A CRYSTAL CLEAR BACKGROUND!  They will use even the smallest thing against you even if it happened ten years prior to your interview with no felony attached.", "Interview Questions": "What can you offer Montefiore?"}, {"date": "3 Feb 2018", "title": "General Surgeon Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Montefiore Medical (Bronx, NY) in May 2014", "Interview Descriptions": "The guy interviewed me. He was really nice and respectful. A trauma rolled in as I was walking out so he had to attend to it and cut it short.", "Interview Questions": "Where did you go to school"}, {"date": "28 Oct 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Montefiore Medical (Bronx, NY) in Apr 2014", "Interview Descriptions": "Went on an interview where I was interviewed by 3 managers from 3 different units, then got called in a month later to take a basic pharm exam at HR, and then interviewed with someone from recruiting the same day as the exam and she offered me the job.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "31 Mar 2014", "title": "RN I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Montefiore Medical", "Interview Descriptions": "Met with a nurse recruiter, took a 30 question basic nursing/math quiz, then met with a nurse manager.", "Interview Questions": "Asked a lot about my resume, group/conflict experience, if you had made a medication error before"}, {"date": "10 Oct 2016", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Montefiore Medical (Bronx, NY) in Apr 2014", "Interview Descriptions": "Unit Manager and Assistant Manager both interviewed me at the same time with different questions (critical thinking) outside the box. Gave a tour of the unit. Asked why I wanted to work there.", "Interview Questions": "What would you do if a patient needed to use the bathroom but no aids are around at the moment but you had to give a medication, what would you do"}, {"date": "28 Jul 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Montefiore Medical (New York, NY) in Mar 2014", "Interview Descriptions": "I interview with HR and after that she called the floor manager and I meet with her a couple of days letter. HR had a professional straight to business approach to it. With the manager it was more laid back.", "Interview Questions": "It was a customer service base question on how would you handle this situation."}, {"date": "28 Feb 2017", "title": "Programmer Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Montefiore Medical (Yonkers, NY) in Feb 2014", "Interview Descriptions": "Dreadful, I should have known better. Late for their own phone screen, then put you on hold, rudeness. Late for their own in person interview and then let others interrupt meeting. rude.", "Interview Questions": "Traveling to other hospitals"}], [{"date": "6 Mar 2018", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Montefiore Medical (Bronx, NY) in Jan 2014", "Interview Descriptions": "Interview process was smooth but took longer than necessary. I met with the hiring manager who knew exactly what she wanted in a candidate and was straight to the point. But HR took forever to finalize the process.", "Interview Questions": "What is your greatest strength?"}, {"date": "28 Jun 2017", "title": "Telecommunications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical (Bronx, NY) in Sept 2013", "Interview Descriptions": "The interview was rather quickly, as for the hiring process was a bit long. Due to background check, drug testing, education testing and work referral. Orientations is a requirement as well in order to be hired.", "Interview Questions": "How well am i at multitask? "}, {"date": "30 Aug 2013", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 6 months. I interviewed at Montefiore Medical (Bronx, NY)", "Interview Descriptions": "I applied online mid January, at some point in February I was asked to come in and take a pharmacy tech exam, pretty basic, a few days later I was asked to come in and take a second exam. After doing so, I had my first interview with the hiring director of pharmacy a few weeks later. My interview was scheduled at 12 noon. I was there from 11:45 until about 2:15 pm and there was still another candidate to be interviewed before me (his secretary confirmed he was slow). I rescheduled and finally had an interview with him, for him to tell me there's been a hiring freeze and to contact him in 3 weeks. 3 weeks and 3 emails later he still does not reply but I receive an email from the secretary of the director of pharmacy on the main campus scheduling an interview (this comes about 2 1/2 months after I applied). I had an interview with her then immediately had a panel interview with 3 pharmacy managers, went pretty well. I send out thank you emails to everyone I've interviewed with and no reply from anyone. Another two months later, one of the managers from the panel interview wanted to interview me again. I was quite surprised being that he was the only manager asking questions during the panel interview. This now being my fourth interview, went pretty good as well, sent my thank you note. two to three weeks later I follow up to find out they chose someone else. Four interviews in over almost a 6 month period and no offer. i was pretty livid. No consideration or courtesy from any of the staff, except the secretaries.", "Interview Questions": "What did you do when you've seen someone violating company policy"}, {"date": "15 Apr 2013", "title": "Senior Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Montefiore Medical", "Interview Descriptions": "I had a great interview with the VP of Marketing at that time. I really enjoyed his tact and thoughtfulness. The interviews with the medical leadership were just a pass by interview, not very in-depth. I did not get the feeling they really valued marketing.", "Interview Questions": "N/A"}, {"date": "10 Apr 2013", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Montefiore Medical (Bronx, NY) in Apr 2013", "Interview Descriptions": "I received an email from my school about possible job opportunities at montefiore and then i sent my resume. I was then contacted for an interview within about a week. The man interviewing me was a fellow physician assistant but was the head of the department. He was friendly and the conversation was smooth. He was not intimidating at all. I was then given a tour of the department.", "Interview Questions": "He told me that the competition was between me and another candidate that had more experience and then he asked why he should pick me?"}, {"date": "10 Oct 2013", "title": "Sonographer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Montefiore Medical (Bronx, NY) in Mar 2013", "Interview Descriptions": "2 interviews", "Interview Questions": "Why did you choose this hospital"}, {"date": "7 Feb 2016", "title": "PC Support Remote Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Montefiore Medical (Bronx, NY) in Mar 2013", "Interview Descriptions": "I was hired over the phone. I was explained what the job was in detail. I was told who i would deal with and the sites i would support. I was told i would be given training for the first month at the Moses Campus working with the Desktop Service request group. I would learn all the IT ways and shadow the employees. I would handle tickets and how to use the software CA Service manager. I would then work with the remote technicians going to remote sites and how to handle them. I would be given a laptop,label maker and net work tester.", "Interview Questions": "How would i handle a difficult client?"}, {"date": "19 Oct 2015", "title": "Senior Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Montefiore Medical (Yonkers, NY) in Feb 2013", "Interview Descriptions": "Long wait for call backs but the employees at HR were very nice. They helped with not making the process nerve wrecking. Once interviewed they made me feel comfortable with the outcome.", "Interview Questions": "If hired how could you help the company?"}, {"date": "11 Jun 2015", "title": "Food Service Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Montefiore Medical (Bronx, NY) in Dec 2012", "Interview Descriptions": "It was a pleasant experience. Hr. seemed to be on point with direct questioning and 3 stage process of interviewing with professionals. The waiting period was the longest, but their response was very up skilled.", "Interview Questions": "What would be the right protocol that I would implement, when a union member needs discipline"}, {"date": "7 Dec 2012", "title": "Administrative Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Montefiore Medical (Bronx, NY) in Oct 2012", "Interview Descriptions": "Brought in my an agency, to interview for a temp to perm position.  The interview was with the Business Manager.   The interviewer had my resume and knew my credentials, I had the impression, she knew who she was planning to hire.  The interview lasted 15 minutes.", "Interview Questions": "Questions weren't difficult and gave no indication of any interest in credentials or skills.  Rather the focus was on being on call 7 days a week, and demonstrating attention to detail in difficult situations."}], [{"date": "26 Apr 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Montefiore Medical (Bronx, NY) in Jul 2012", "Interview Descriptions": "Straightforward. Submit resume online.", "Interview Questions": "N/A"}, {"date": "27 Aug 2016", "title": "Unit Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Montefiore Medical (Bronx, NY) in Jul 2012", "Interview Descriptions": "I was interviewed by the manager of the unit along with three of the staff members. I then had a follow up interview with an HR manager, background and drug test. Once I got the job had a week of orientation and three months probation period. Interview process was timely however, it was worth it.", "Interview Questions": "How would you handle yourself in a fast paced environment such as this with patients, doctors and family members and incoming phone calls ?"}, {"date": "20 Jun 2012", "title": "Human Resources Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Montefiore Medical (Bronx, NY) in May 2012", "Interview Descriptions": "Arrived on time for the interview and was kept waiting 2 hours. Upon arrival a woman at reception desk told me I was in the wrong place and the person I was scheduled to be interviewed by did not work there. Her story changed when I produced the email. During the 2 hour wait to be interviewed, office staff came out walking buy but not speaking. Not once was there an explanation why I was waiting so long. I asked the receptionist why the wait and she said, \"All I can do is to tell them you are here.\" A woman finally appeared and she was so nasty I wondered why they bothered to call me in for an interview. I was interviewing for a management position and the person interviewing me was unable to discuss the current structure of the department that would directly impact my answers as to how I would run the department. I felt as if there was no job and that I was being pumped for information.  I left with a very negative impression of this staff but was not surprised as I was warned by other Glass Door reviews I read before the interview. If I had it to do over I would have passed. I left thinking what a horrible place to work.", "Interview Questions": "Why do you really want to work here?"}, {"date": "31 Aug 2014", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Montefiore Medical (Bronx, NY) in May 2012", "Interview Descriptions": "All went smoothly without any difficulty. The process too several days and was a combination of telephone interview, 1:1 interview, discussion of skills, explanation of expectations. There really is not more to add to this statement, but we are required to provide a 50 word minimum.", "Interview Questions": "N/A"}, {"date": "8 Sept 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Montefiore Medical (New York, NY) in Apr 2012", "Interview Descriptions": "Met with the nurse manager. it was a panel interview with about 6 people. Manager was very friendly and asked some basic questions about me. A week after that i met with the HR. Interview wast so difficult, just remain confident and you'll be fine. The entire process took a month to be hired", "Interview Questions": "Tell me about yourself, why nursing"}, {"date": "5 Jun 2012", "title": "ACO Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Montefiore Medical (Yonkers, NY) in Apr 2012", "Interview Descriptions": "Applied online, week later I got telephone from corporate recruiter asking me to come for 1:1 interview to their location. Came on the scheduled date and first I was given paper application to fill - it took me half an hour because I was ask to give all license numbers etc and I had to get it from the internet (I have used my phone to do so). When I completed application I was invited to the office where I had two on one interview with a co-worker of recruiter. Interview was easy but during it recruiter changed position to different one. I agreed. When we finished interview I was told that I will be contacted in regards to new position. After two weeks I got a regular mail saying \"Thank you but no thank you\" no explanation given.", "Interview Questions": "Typical questions, nothing fancy."}, {"date": "31 Dec 2016", "title": "Construction Electrician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Montefiore Medical (Bronx, NY) in Apr 2012", "Interview Descriptions": "the interview was based on general electrical code questions and some electrical diagrams and blueprints, i was also taken on several job sites and performed conduit bending methods after the practice i was put on a 90 day probationary contingency and then after completion was hired permanently.", "Interview Questions": "they asked me about an employee at another institution they knew who worked with me directly."}, {"date": "4 May 2016", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Montefiore Medical (Yonkers, NY) in Mar 2012", "Interview Descriptions": "It is a two to three stage interview process including drug test and health evaluation. General questions asked on the interview. Patient Care must come first. You might meet with 2 or more managers. Ask alot of questions", "Interview Questions": "How do you feel working in a hospital environment?"}, {"date": "25 Sept 2013", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Montefiore Medical (Bronx, NY) in Feb 2012", "Interview Descriptions": "HR at Montefiore is really not very good. You must keep on top of them to make sure you are given the money you deserve for your years of experience.", "Interview Questions": "Many repetitive questions from the recruiters after you meet with the management and staff of a unit. Not sure how relevent it is for HR to do a full interview when you interview with multiple levels of management in nursing and physicians."}, {"date": "13 Oct 2014", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Montefiore Medical in Jul 2011", "Interview Descriptions": "A third party recruiter arranged for an interview with the Director of the department. I had an initial telephone interview with the director. He asked me about my background and what I did in my previous positions. He also asked leading questions regarding my analytical skills looking for me to present insightful comments. He also asked about my technological capabilities and which healthcare financial association and government agencies I was involved with or depended on for regulations. He then recommended that we meet in person and I would be contacted by the recruiter. We meet personally and he suggested what I might earn in this position. There after I meet with an HR rep and he made an offer over the phone a week afterwards.", "Interview Questions": "N/A"}], [{"date": "25 Sept 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Montefiore Medical in Jul 2011", "Interview Descriptions": "Simple and straight forward.  No particularly difficult questions as long as you have the knowledge base.  If you know your info as a nurse it should be fine.", "Interview Questions": "They asked questions on how to document specific scenarios. "}, {"date": "12 Nov 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Montefiore Medical in Feb 2011", "Interview Descriptions": "You will meet with HR first.  You will have to take a short math exam (pharmacology calculations).  You will then meet with the manager of the floor you have applied to.", "Interview Questions": "Describe a moment when you had a communication issue with a patient and how you were able to overcome the issue."}, {"date": "11 May 2009", "title": "Financial Representative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at Montefiore Medical (Bronx, NY) in Jan 2009", "Interview Descriptions": "easy", "Interview Questions": "what are 3 neg qualities about urself"}]]