[[{"date": "30 Jun 2023", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Garnet Health Medical Center (Middletown, NY) in May 2023", "Interview Descriptions": "Interview itself was wonderful and nursing staff were lovely. Human Resources is an absolute pain to deal with, nursing manager said she selected me in our follow up emails but HR has not communicated", "Interview Questions": "Tell me why you want to work at Garnet Health"}, {"date": "16 Nov 2022", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Garnet Health Medical Center", "Interview Descriptions": "It was okay was in front of a panel of people was very nervous but I got the job be firm and make sure you let your skills shine don't let anyone intimidate you in the process", "Interview Questions": "What are my strengths in working"}, {"date": "15 Feb 2023", "title": "Certified Surgical Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Garnet Health Medical Center (Middletown, NY) in Nov 2022", "Interview Descriptions": "Interview was great got the job then they turned around and pulled back after the offer. after I could not start in a month. They asked me to reapply the following month. Do they pull back offers regularly?", "Interview Questions": "How far I’d I live ? I told them 25 minutes and they said that was to far I needed to be 20 mins"}, {"date": "5 Nov 2021", "title": "Organizational Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Garnet Health Medical Center", "Interview Descriptions": "The interview process was very smooth! Upon being hired I was given an informational document about the next steps and exactly where to go for each step of the hiring process.", "Interview Questions": "They asked me about why I was interested in the healthcare field and what I wanted to learn there. "}, {"date": "4 May 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Garnet Health Medical Center", "Interview Descriptions": "Applied for several positions, recruiter told me she wouldn't submit for some even though I met the qualifications. Once I finally got an interview (not for the department I really wanted to work in,) my interviewer was amazing, and the interview went well. No communication for over a month after the interview, despite my emails.", "Interview Questions": "Describe a situation where you had a disagreement with someone, how did you handle it, what happened?"}, {"date": "5 May 2021", "title": "Recruiter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Garnet Health Medical Center (New York, NY) in Apr 2021", "Interview Descriptions": "It was alittle intimidating due to it being multiple people but overall they made me feel comfortable and all the questions were a bit challenging but luckily I know my job responsibilities.", "Interview Questions": "If they asked my co-workers to describe me, what would they say?"}, {"date": "4 Feb 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Garnet Health Medical Center", "Interview Descriptions": "Very smooth and staff were attentive and courteous. \r\nThe interviewers were receptive to my questions/concerns. They were gracious and made me feel welcomed and as though my opinion was valued.", "Interview Questions": "How am I qualified for the position? "}, {"date": "3 Apr 2020", "title": "RN, Bsn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Garnet Health Medical Center (Middletown, NY) in Oct 2019", "Interview Descriptions": "Short, informal in the coffee shop. Asked about my strengths and weaknesses,  why ORMC and all the basic interview questions -I.e \"tell us about youself\" kind of thing.  For some reason, they were reluctant to take me for an initial tour of the work area and to interact with existing staff", "Interview Questions": "\"Tell us about yourself \""}, {"date": "28 May 2019", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Garnet Health Medical Center (Middletown, NY) in Apr 2019", "Interview Descriptions": "Very friendly, board interview, very easy and nice staff. The interview was a board interview with several members from each department.  Everyone was open and laid back in their questioning.", "Interview Questions": "Why do you want to work here"}, {"date": "12 May 2019", "title": "RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Garnet Health Medical Center (Middletown, NY) in Feb 2019", "Interview Descriptions": "Recruiting team was ver professional and helpful. Very efficient and effective. Reachable and reliable..Recruiting team was ver professional and helpful. Very efficient and effective. Reachable and reliable. Good professional staff. It has good pay and good benefits as well as jours", "Interview Questions": "Tell me about uourself"}], [{"date": "18 Oct 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Garnet Health Medical Center (New York, NY) in Feb 2018", "Interview Descriptions": "interview with HR where typical interview questions were asked, then met with two floor managers, had to take a physical fitness test and nursing test with HR prior to starting", "Interview Questions": "Where do you see yourself in five years"}, {"date": "27 Jan 2018", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Garnet Health Medical Center (Middletown, NY)", "Interview Descriptions": "Loooonnnnngggggggg.........plan to wait to hear anything back, keep applying for positions eventually one will grab, it sometimes takes years to get anything, HR claims they get over 300 apps for every position per day, and thats only what they see after the system has already weeded out ineligible candidates.  The actual interview was smooth general questions and background info. Once completed and offered a position drug and back ground screening are required and also health screening", "Interview Questions": "Why do you want to work here?"}, {"date": "30 Oct 2019", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Garnet Health Medical Center (Middletown, NY) in Dec 2017", "Interview Descriptions": "I first filled out an application online. I was contacted by an HR staff to set up an interview. I was interview by the lab supervisor and lab manager on the day I chose.", "Interview Questions": "How do you handle a difficult patient?"}, {"date": "29 Sept 2015", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Garnet Health Medical Center", "Interview Descriptions": "Recruiter got in contact with me and scheduled an interview within a week.  Hiring process was quick and easy. The week long orientation can be divided which is convenient if you have other obligations. Overall they are accommodating and I learned a lot from employment here.", "Interview Questions": "What have you done in a situation"}, {"date": "27 Jan 2016", "title": "Nurses Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Garnet Health Medical Center (Middletown, NY) in Aug 2015", "Interview Descriptions": "After a through online application process, including an personality quiz, and consenting to a background check and drug screening, a representative from the human resources department contacted me to setup an interview.  The HR dept is very kind, and easy to work with.\r\n\r\nOn the agreed day, five people were called together to interview for similar positions, and called into a room one at a time to discuss qualifications.  Questions were very fair, and I felt very comfortable interviewing with these people.  Overall, a positive experience.", "Interview Questions": "Why do I feel qualified to work there, what makes me a good patient care individual.  Questions of that nature."}, {"date": "21 May 2015", "title": "Food Service Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Garnet Health Medical Center (East Middletown, NY) in May 2015", "Interview Descriptions": "It was okay I wanted an opportunity to get the job but the listing called for little experience and she wanted me to have more experience . This job is difficult but their hiring process is very strict and very hard to get an offer.", "Interview Questions": "What are your qualifications for working here?\r\n\r\nWhy should we hire you?"}, {"date": "13 Dec 2018", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Garnet Health Medical Center (Middletown, NY) in May 2015", "Interview Descriptions": "early morning interview \r\nGroup interview\r\nTwo weeks later I was asked to come to the office to take a writing test\r\nTwo weeks later I got an offer\r\nOffer accepted \r\nOrientacion lasted 2 weeks\r\nUnit orientation lasted 3 months", "Interview Questions": "Tell me about yourself"}, {"date": "8 May 2019", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Garnet Health Medical Center in Apr 2015", "Interview Descriptions": "Process was long. Took about 4 to 6 weeks, numerous calls from various humans resources employees, had to Interview then wait, then drug test and more waiting. I think they should.comminucate  better to expedite the process", "Interview Questions": "Why do you want to work in a hospital "}, {"date": "6 May 2015", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Garnet Health Medical Center (Middletown, NY) in Mar 2015", "Interview Descriptions": "7Be confident, prepare by reading the hospitals mission statement, &  practice questions.  Be prepared to take a 50Q med surg exam which was fairly easy common med surg questions (test for hep, med math ect, antidotes for meds). I was offered a job on the spot!", "Interview Questions": "Why ORMC?\r\nWhy did I become a nurse?\r\nTell me about a time when you had to deal with a difficult pt/ co worker?\r\nwhere do you see yourself in 5 years?\r\nWeakness?\r\n"}, {"date": "16 Dec 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Garnet Health Medical Center (New York, NY) in Mar 2015", "Interview Descriptions": "Hiring process took 4 weeks. One interview with the HR and then was taken for a written test. A week later was called for interview with unit manager. Behavioral questions and why I was interested in the organization. Got job offer by 4th week.", "Interview Questions": "If a CNA has problem with the assignment u gave her, what would you do"}], [{"date": "29 Jan 2015", "title": "Applications Coordinator Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Garnet Health Medical Center", "Interview Descriptions": "Received email after online application. \r\nInitial interview is about yourself they want to know who you are and what are your experiences and skill sets and some basic behavioral questions.", "Interview Questions": "Tell me little bit about yourself?"}, {"date": "27 Jun 2015", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Garnet Health Medical Center (Middletown, NY) in Aug 2014", "Interview Descriptions": "Very simple interview just like any other interview. Be professional and think before you speak. Always remain professional! Speak about how good you are with customer service and interacting with others. Its an awesome easy job to have.", "Interview Questions": "Why did you want to work for their hospital?"}, {"date": "4 Aug 2014", "title": "Nursing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Garnet Health Medical Center (Middletown, NY)", "Interview Descriptions": "I would advise the Greater Hudson Valley Medical Group/Orange Regional Medical Center (Human Resource Department) to work effectively with local educators. Many trade schools/colleges contain talents that would benefit ORMC/CRMC. Timelines do not fit for recent graduates or prospective employees to finish their education and better themselves. There is lack of communication when dealing with the human resource department. This organization has grown too quickly and cannot keep up with the volume of work. The Greater HUDSON VALLEY... but you're not working with local educators, how can you be the Greater Hudson Valley. Please take my review as constructive criticism. SUNY Orange is rated one of the best educators in NYS for nursing and the timelines of graduating or prospective graduating seem to not run parallel for employment opportunities. ORMC and CRMC are known hospitals in the Hudson Valley you should be collaborating for a bridge to employment program, not limiting prospective employees. I would suggest the Human Resource department to be more involved with the community and support local schools.", "Interview Questions": "Very Simple"}, {"date": "1 Jun 2013", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Garnet Health Medical Center in Mar 2009", "Interview Descriptions": "I was recruited from an agency.  I had 2 interviews.", "Interview Questions": "Who is the most difficult coworker you've ever had and how did you deal with it?"}]]