[[{"date": "7 Mar 2023", "title": "Accounts Payable Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Baton Rouge General", "Interview Descriptions": "The first interview went really well. I was asked appropriate questions. I was called back later that afternoon to schedule a second interview. The second interview was strange. The person interviewing me didn't ask me any questions about the job but about how many children I had, and we talked about that for a few moments. She mentioned other positions that might be a good fit. I never got a call back after the second interview.", "Interview Questions": "How many children do you have? - of course, this has nothing to do with if you get the job or not."}, {"date": "6 Dec 2022", "title": "Radiology Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baton Rouge General", "Interview Descriptions": "Over the phone. I was called, asked several questions, answered, she asked if I had any questions and that’s it. Super quick and easy. She was very nice and understanding even though I was not fully prepared for the interview.", "Interview Questions": "Experience How would I be an asset? Current job/school situation."}, {"date": "18 Aug 2022", "title": "Patient Access Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baton Rouge General in Jan 2022", "Interview Descriptions": "Takes about a month but straight to point and easy. No hard questions or shockers. More of role play questions and answers. Nothing to be nervous about relax and be yourself.", "Interview Questions": "More of getting to know you "}, {"date": "8 Dec 2020", "title": "Resident Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baton Rouge General (Baton Rouge, LA) in Oct 2020", "Interview Descriptions": "very friendly environment and a conversational interview style. the residents were super nice.  I had an interview with multiple people and it was fun. the PD took at least 30 minutes to explain the process of the interview and introduction of the program", "Interview Questions": "a common question like tell me about your self "}, {"date": "3 Mar 2020", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Baton Rouge General (Baton Rouge, LA) in Jul 2019", "Interview Descriptions": "Was contacted within the first week of submitting an application. The interview process was very quick and allowed for me to shadow a transporter the day of. Was hired immediately after interview ended.", "Interview Questions": "What experience do you have in dealing with patients? "}, {"date": "7 Nov 2018", "title": "PFS- Specialist II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Baton Rouge General (Baton Rouge, LA) in Nov 2018", "Interview Descriptions": "The interview process was pretty easy. My interviewer Cheryl was an absolute sweetheart and I can tell she really took the time and energy to get to know me and not just going though the motions. She described the job in much detail and seemed engaged throughout the whole interview.  After I met with her, I got a callback the next day to come in and meet with HR. I met with Amber who was again very warming and I felt comfortable talking with her about my skills and experience. She then told me if everything went well that I would be hear back to do a job shadow to see if its a good fit...That same day Cheryl called me and asked me to come in and shadow and meet with another department head. I will be doing this Thursday Nov 8th and will update if a job offer is given to me!", "Interview Questions": "What would make. you a good candidate for this position?"}, {"date": "15 Jun 2017", "title": "Patient Access Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Baton Rouge General", "Interview Descriptions": "Very thorough. My interviewer was very nice and professional. She treated me with common courtesy and it really made me feel good about the possible job opportunity. I would recommend this company to anyone looking for a job.", "Interview Questions": "Why do you want to work for this company?"}, {"date": "12 Aug 2017", "title": "Patient Access Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Baton Rouge General (Baton Rouge, LA) in Jun 2017", "Interview Descriptions": "Applied for job got interview within 3 weeks 2 weeks after I got a call from hr offering me the job. Start to finish took about 2 months to actually get on.", "Interview Questions": "What is your favorite color? How are you working on a big group of women in different age groups?"}, {"date": "7 Mar 2017", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Baton Rouge General", "Interview Descriptions": "They had a 3 part interviewing process which consisted of the initial interview with the hiring manager then a peer to peer interview,  and then lastly if you met all their requirements you had to do a job shadowing with the physician you woukd be working with.", "Interview Questions": "How many years experience did I have?"}, {"date": "2 Nov 2017", "title": "Mental Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Baton Rouge General (Baton Rouge, LA) in Feb 2017", "Interview Descriptions": "Quite brief, not a challenging process.  Wanted to know my background and what I felt I could contribute to the team.  Standard, and there is a mandatory shadowing session before hiring to determine if the fit is a good one.", "Interview Questions": "What makes you ideal for this role?"}], [{"date": "1 Jan 2017", "title": "Event Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Baton Rouge General (New York, NY) in Dec 2016", "Interview Descriptions": "It was a three step interview (phone, in-person x2). Phone- qualifications screening and desire. 1:1- Personality/qualifications/sell yourself. 1:2- (Final round of interview with the highest boss) sell yourself. They started with a pool of candidates and narrowed it down to ten for the second round, and three in the final round.", "Interview Questions": "Why do you want this position?"}, {"date": "23 Nov 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Baton Rouge General (Baton Rouge, LA)", "Interview Descriptions": "Sent my resume in through the main webpage and received an email and call from HR within 2 days to set up and interview/meeting. Met with HR, then unit manager, and was offered position within the week. Went through orientation and background check with HR very quickly and started working within a month of submitting my resume.", "Interview Questions": "Identifying times when you met with frustration or disappointment in previous work and how you handled it."}, {"date": "19 Jul 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Baton Rouge General (Baton Rouge, LA)", "Interview Descriptions": "I was first contacted my the unit manager who set up a time for me to come in and meet with the charge nurse and tour the unit.  The charge nurse asked me a few interview questions that day and then about 2 weeks later I got a call from HR stating that they were extending a job offer.", "Interview Questions": "What are your strengths and weaknesses?  How do you handle stress?  How would you desribe yourself?"}, {"date": "18 Nov 2015", "title": "Radiology Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Baton Rouge General (Baton Rouge, LA) in Apr 2014", "Interview Descriptions": "I applied online through their website and was called in via phone a few weeks later to interview with HR. HR rep didn't know a lot about the actual job I was interviewing for. The process was a little unorganized and the questions were very generic.", "Interview Questions": "Why do you want to work for BRG?"}, {"date": "22 Jul 2016", "title": "Patient Access Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Baton Rouge General (Baton Rouge, LA) in Feb 2014", "Interview Descriptions": "Put in application. Met with HR for general interview. Received call back and met with department manager and also did a shadow shift to see if it is something I would like. Received phone call and offer letter from HR to do drug screen and background check. Entire process from appplication to hire took about 2 months. The longest period was waiting to be called for an interview, everything else went pretty quick (2-2 weeks)", "Interview Questions": "Name a time where you had to de-escalate a situation and what did you do?"}, {"date": "24 May 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Baton Rouge General (Baton Rouge, LA) in Jan 2014", "Interview Descriptions": "The interview was a standard nursing interview focused on experience and interpersonal skills. It lasted about an hour and I received a call back within a few days for a job offer.", "Interview Questions": "Why do you want to work here versus other hospitals?"}, {"date": "7 Oct 2015", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Baton Rouge General (Baton Rouge, LA) in Sept 2013", "Interview Descriptions": "I was referred to work here by a current employee, so there was not much to the interview.  After I applied online I went in for a one on one interview where she basically asked me a few general questions and then told me I was hired and proceeded to tell me the job duties.  A TB test, a drug test, and a background check followed along with the usual paperwork.  I was then shown around the hospital and met with management which then set training dates.", "Interview Questions": "N/A"}, {"date": "1 Sept 2015", "title": "PCA II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baton Rouge General (Baton Rouge, LA) in Jan 2012", "Interview Descriptions": "Applied online, received phone call for interview 2 weeks later. Met with Recruiter, discussed experience and other typical interview questions. Had a job offer that same day. Started working within a week of interview.", "Interview Questions": "What made you want to become a PCA?"}]]