[[{"date": "27 Jun 2023", "title": "BHT-behavioral Health Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ingalls Memorial Hospital (Harvey, IL) in Feb 2023", "Interview Descriptions": "About a 30 min interview process, the supervisor interviewed me I had a recruiter which did respond to my text messages in a timely fashion, the questions were simple and to the point, mostly to see how you would handle certain situations on a psychiatric unit and see if you can handle the job and if you are a good fit for the unit. I actually was nervous than realized it wasn’t so bad!", "Interview Questions": "What would u do to try and de escalate a patient threatening another patient on the unit"}, {"date": "8 Aug 2022", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ingalls Memorial Hospital", "Interview Descriptions": "Took a while for interviewer to come out but her energy was positive and inviting. She provided her career journey at the hospital and was very nice. Tour of the department concluded the interview.", "Interview Questions": "How do you handle stress?"}, {"date": "24 Jul 2022", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ingalls Memorial Hospital", "Interview Descriptions": "Virtual times two, recruiter and direct manager. Quick offer, but do to union salary constraints, I had to decline their offer. Otherwise, I would have given them a shot. Present process overall", "Interview Questions": "Experience helping in a team"}, {"date": "30 Mar 2022", "title": "Respiratory Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Ingalls Memorial Hospital (Harvey, IL) in Nov 2019", "Interview Descriptions": "Easy interview, few questions about ABG’s. Asked questions about self, and knowledge of ventilators. Asked how well you can handle pressure. Very easy going questions nothing to major . Was offered job once interview was done.", "Interview Questions": "Have you ever worked with Servo I , Trilogy?"}, {"date": "25 Sept 2016", "title": "Staff RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Ingalls Memorial Hospital (Harvey, IL)", "Interview Descriptions": "Questions were mediocre not what I expected and not related to the skills for a RN and I think that's important to caring for ill patients,  healing, well being, and success with self care.", "Interview Questions": "Where do you plan to be in the next 5 years?"}, {"date": "11 Jul 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Ingalls Memorial Hospital (Harvey, IL) in Jun 2016", "Interview Descriptions": "I attended the nursing job fair held in June. All staff were very friendly and I was given the opportunity to visit the unit and speak with nurses on the floor. I was given information on the expectations and basically offered the position upon going online to complete the application process.", "Interview Questions": "Why do you want to work for Ingall's Hospital?"}, {"date": "28 Feb 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Ingalls Memorial Hospital (Harvey, IL) in Feb 2016", "Interview Descriptions": "Received a phone call about 3 weeks after I applied online. Had a very short phone interview with a recruiter in HR. She asked me to come in one of the next following days. After about an hour interview with HR, I was sent to the unit that I was interviewing for to tour the unit and meet with a few RNs that were working that day. \r\n\r\nI was offered the position the following day.", "Interview Questions": "1. Why do you want to work for ingalls?\r\n2. Why do you want to work on this unit?"}, {"date": "26 Jul 2016", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ingalls Memorial Hospital (Harvey, IL) in Jan 2016", "Interview Descriptions": "First is the interview then drug screening and background checks, and orientation. Once you start with the interview you answers the questions that are given. Then you'll receive another phone call to come in to do a drug test and to do a background checks. Then the final steps is orientation to go over everything about the job I had applied for.The outcome of the whole job process was excellent.", "Interview Questions": "Why should I hire you?"}, {"date": "1 May 2015", "title": "Customer Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ingalls Memorial Hospital (Harvey, IL)", "Interview Descriptions": "Receive phone call for interview. Passed first interview. Was told that I will meet with another manager for second interview. Awaiting to call to see if I receive an offer for employment. Interviewer were very nice and straight forward. Ask plenty of questions. The interview is very up front and will tell you everything you need to know before you accept an offer.", "Interview Questions": "What will you do if someone is not carrying their own weight?"}, {"date": "12 Dec 2014", "title": "CLA Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Ingalls Memorial Hospital", "Interview Descriptions": "You must apply online; follow up via a telephone to human resources; await for them to call you for an interview; partake in a drug screening; you must be certified and experienced with thorough knowledge of how to perform phlebotomy, this includes the order of draw, the sites to choose, where not to draw, and have the ability to work alone in the field.  There is a lot of traveling involved.  You will travel from home to home drawing blood independently and completing entire homes with up to 50 draws alone.  You may have to do more than one home; sometimes help will be provided if they are not short -staffed, but most times they are short staffed. you are required to transport specimens back to the lab and do registrations and specimen processing.", "Interview Questions": "none. if you no the order of draw, and how to stick, you're good to go"}], [{"date": "21 Jul 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Ingalls Memorial Hospital (Harvey, IL) in Jul 2014", "Interview Descriptions": "Human resource schedules an interview. Meet with human resource. Interview about 45min then schedule another interview with unit manager some times the same or another day in the future. Meet with unit manager interview for about 45mins.", "Interview Questions": "Why do you wanna be a nurse\r\nWhy do you wanna work here\r\nPlans for the future"}, {"date": "19 Apr 2014", "title": "Billing Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Ingalls Memorial Hospital", "Interview Descriptions": "Why is diversity important?", "Interview Questions": "How do you use your strengths to your advantage?"}]]