[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "So much has improved!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Jul 2020", "job_title": "Anonymous Employee in Panajachel, Sololá", "duration": "N/A", "pros": "I have worked at Mayan Families for 3 years now, and the difference over that time with the change of administration in the middle has been indescribable. Staff are now cared for, supported, paid fair wages, and there is a positive family-like atmosphere amongst the team. I'm really proud to work here.", "cons": "As the organization comes out of a transition, there are still challenges and structures being set up, which can be frustrating sometimes. We are also still working on increasing funding to make sure we have enough staff to cover all the needed work."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Mayan Families changed my life and career in the best way possible!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "30 Jul 2017", "job_title": "Program Manager in Panajachel, Sololá", "duration": "N/A", "pros": "Mayan Families  provides a great  experience where you are responsible for projects and proposals with real people that I was excited to work hard for!\r\nThey provide an excellent work environment for those living abroad for the first or third time, and for locals alike. It is an amazing opportunity to work with\r\na Community oriented Non Profit.\r\n\r\nI received training and had to run a lot of things myself, which meant really pushing myself professionally!\r\nGreat development and growth within Mayan Families! The benefits are amazing professional development and the ability to travel around Guatemala and up to Mexico for Visa runs.\r\nGreat place to learn!\r\nGreat hands-on experience in international development work, working alongside local Guatemalans. Plenty of support.\r\n\r\nThe foundation and management seek to have a working environment that feels professionally supportive! Support from upper-management was always the best.\r\nThey walk it every day! Great work enviroment.\r\nI wanted an excellent place to grow and learn to create future career opportunities. \r\nGreat company to grow as a young professional.\r\nGreat people, very smart Guatemalan staff!", "cons": "Needs more funding for large projects!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Awesome place to work and grow professionally!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 May 2017", "job_title": "Project Manager in Panajachel, Sololá", "duration": "N/A", "pros": "I worked at Mayan Families in Panajachel, Guatemala for 18 months and was amazed at everything I did there! The experience helped my professionally in so many ways! I grew as a person and I worked with so many talented Ex Pats and Guatemalans! This is the place to go if you want to see the real Guatemala! I only left to go back North to pay off student loans. I highly recommend Mayan Families! They have heart, they do it correctly and they are one of the only NGO's to truly care about the Indigenous populations in Guatemala! I was always aware of my compensation, time required at work and my responsibilities. If you want to make a real difference, this is the place! If you want to deal with the hard choices and issues relating to poverty, this is the place to work!", "cons": "Internet connections, but that is the reality in Guatemala."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Working hard on needed changes", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Feb 2020", "job_title": "Executive Director in Panajachel, Sololá", "duration": "N/A", "pros": "Major changes are afoot after separating from former founders and partner organization. All local staff is now paid at least minimum wage, put in place proper financial management systems and controls to assure that donations reach community, respecting local leadership to lead our work, improved communication and morale among staff, focus on measuring and improving the impact of our work. Ethical, informed decision-making.", "cons": "Still more work to be done, righting such a big ship takes time. The org is still under resources and so wages aren't what we wish that they could be and the work is hard and stressful, but rewarding."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Life-changing experience, accelerate your career in NGO", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 May 2017", "job_title": "Anonymous Employee in Panajachel, Sololá", "duration": "N/A", "pros": "Truly an eye-opening and amazing experience getting to work at a local NGO in beautiful Lake Atitlan, Guatemala. If you are at all interested in international development, public health/ policy, global welfare, microfinance, international education, etc., then an experience at MF will greatly accelerate your career and you will learn so much more than you would at an entry-level position at an NGO in the US/ Europe/ AUS etc. Such inspiring work and amazing colleagues as well, getting to work in a new culture and country and learn the customs is challenging at times but overall so rewarding. Would recommend 10/10 to anyone I know who is interested.", "cons": "Typical of any NGO in a developing country but understaffed, low resource, pay is mediocre but more than enough to live comfortably in US- standard housing and maintain lifestyle you are accustomed to!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Doing too much at once, with no professional guidance", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Feb 2016", "job_title": " in Panajachel, Sololá", "duration": "N/A", "pros": "Great mission, great work. Direct impacts on region. Young, fun staff. Beautiful area to work in, and lots of opportunity to gain program experience", "cons": "Hard working conditions on little pay. Low office moral. No experienced professionals at all, only young and enthusiastic hires that do not have much prior experience. Little evaluation of programs leads to serious waste of donation funds. Hard to effect change in current systems. Management makes poor decisions with impunity. Organization caters too much to donors, letting their funds determine how organization is run, instead of basing operations on data and needs of local clients."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A great place to grow!", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "17 May 2017", "job_title": "Anonymous Employee in Panajachel, Sololá", "duration": "N/A", "pros": "Amazing coworkers\r\nWorking for a noble cause, in an impoverished part of the world and an organization with a great track record!\r\nOpenness to get involved in many aspects of projects within the organization. Lot's of work which I like. Living in Guatemala gives you an opportunity to learn, travel and grow. I learned so much! The opportunities working at Mayan Families gave me for my career are amazing! I feel that can go anywhere and know that I can handle virtually anything thrown at me.", "cons": "The Rainy season, although I got used to it."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing learning experience!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Jul 2017", "job_title": "Coordinator in Panajachel, Sololá", "duration": "N/A", "pros": "Great challenges, great people! Amazing location and place to work! I loved Guatemala and working at Mayan Families!Their approach to marketing and getting the stories out is second to none! Got to work on everything, planning, proposals, budgets, monitoring and evaluation.  At Mayan Families it is the people, the location and the opportunities!", "cons": "I wanted to stay, but student loans called me back."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "The Bad Development Model", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 May 2017", "job_title": "Anonymous Employee in Panajachel, Sololá", "duration": "N/A", "pros": "Young, energetic foreign team and fantastic, hard-working Guatemalan/indigenous staff. Beautiful location. Provides insight into nonprofit world and/or access to nonprofit opportunities and careers for those fresh out of college and with little-to-no-experience.", "cons": "Mayan Families embodies the development model that is doing it wrong - in other words, \"bad aid.\" They do try and work on some programs that seem to want to inspire change within communities long-term, but the way that they operate is unfortunately without any understanding of development work and sustainability, becoming more of a model that does more harm than good. They priortize the donor over what the sponsorship model is actually doing in communities and how indigenous families and communities are really benefiting, becoming more \"poverty tourism\" than the sustainable development work that they boast. This is enhanced by the need to grow faster and expand instead of focusing on really doing projects with forethought, expertise, funds, and collaboration within communities. Worst of all, there is discrimination against indigenous staff who are paid dismal salaries even in comparison to the very low rates given to foreign \"volunteer\" staff. This is made further problematic by the daily ethically questionable aspects and choices made by the founders and directors at large who perhaps don't understand these issues or perhaps do not prioritize them. These directors also cultivate a general atmosphere of disrespect and distrust against all their employees, either young foreigners or indigenous staff, which further contributes to a negative work environment."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Good intentions are not enough", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Mar 2017", "job_title": "Coordinator in Guatemala", "duration": "N/A", "pros": "Good opportunity for career growth.", "cons": "No work life balance."}]]