[[{"date": "26 May 2023", "title": "Digital Media Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Pratt Institute (Brooklyn, NY)", "Interview Descriptions": "It took a month to get the interview. It was only last for 20mins. Basically just some general questions about my experience and schedule. Then we went over my portfolio.", "Interview Questions": "Would you like to share your portfolio with us"}, {"date": "20 Jan 2023", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pratt Institute (New York, NY)", "Interview Descriptions": "I found the interview really problematic. Esp comments from the chair at the time, who asked highly gendered questions (as did some of the panel), and following on from this, used my CV to criticize people he knew within my experiences. The process was disorganized: lateness from the panel and fumbling through zoom. The Dean hadn’t even read my CV and had no idea who I was in the interview. It was such a mess. I would have turned down any offer.", "Interview Questions": "N/A"}, {"date": "1 Feb 2022", "title": "Teaching Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Pratt Institute", "Interview Descriptions": "Fairly easy. Asked about what my interests are and if I had any skill in digital arts. Walked me through the day to day responsibilities. Didn't get to chat with the prof I will be TAing with.", "Interview Questions": "Do you know how to use any adobe softwares?"}, {"date": "27 Feb 2022", "title": "Graphic Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Pratt Institute in Jan 2022", "Interview Descriptions": "Met a manager on a zoom meeting and went through my portfolio to talk about the process and thought process behind the outcome. Then, a manager explained the role and what they do.", "Interview Questions": "How would you describe the relationship between your background and our mission?"}, {"date": "16 Feb 2022", "title": "FASHION FACULTY Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Pratt Institute (New York, NY) in Nov 2021", "Interview Descriptions": "Very well organized correspondence!\r\nZoom interviews took place with 3 members of Pratt Search Committee. Each member took turns asking specific questions which led to further discussion. \r\nFollow up with next steps were great.\r\nSuch a lovely team!", "Interview Questions": "What is a current issue and how would you address it. "}, {"date": "17 Aug 2021", "title": "Graduate Assistant (Library) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pratt Institute", "Interview Descriptions": "The process consisted of one in-person interview with the Pratt Institute Libraries' Head of Public Services, lasting roughly 30 minutes. The interview was fairly informal and casual, and I received a written job offer a few days afterwards.", "Interview Questions": "- Why are you interested in this position? \n- What reference experience do you have? \n- How have you dealt with a difficult customer situation in the past? (provide example)\n- What is a work project you're proud of? (provide example)"}, {"date": "3 Jun 2021", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pratt Institute", "Interview Descriptions": "This was a Zoom interview; I was not able to establish a good rapport with the interviewer and as a result did not do very well for the duration of the interview. It was fine, the job was ultimately not for me anyway.", "Interview Questions": "What interested you in this position"}, {"date": "24 Jun 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Pratt Institute (New York, NY) in Jun 2021", "Interview Descriptions": "Informal and fast. everyone involved was friendly and quick to respond to me so communication was strong. everything was professional and respectful which I appreciated very much. I would recommend Pratt as a prime place for employment because they won't ghost you or leave you hanging.", "Interview Questions": "What is a difficult task"}, {"date": "15 Apr 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Pratt Institute", "Interview Descriptions": "good overall\ninterviewer is really nice\nit was about 30min\nshort with about six questions\nasking about the background and experiences\nwaited about five days to receive the offer\ninterviewer is really nice in person and the time is flexiable", "Interview Questions": "go through your background please\n\n"}, {"date": "25 Jan 2021", "title": "Computer Lab Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Pratt Institute", "Interview Descriptions": "Fairly simple interview. Asked about general experience and why I should get the position. Wanted to know how familiar I was with software in question. Quite relaxed interviewer which made the interview much easier. Great experience overall!", "Interview Questions": "What software are you familiar with?"}], [{"date": "11 Mar 2023", "title": "Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pratt Institute in Jan 2021", "Interview Descriptions": "Open interview process, kind hearted people behind the scenes! Didn't get the job but appreciated the experience. Great questions and well run interview. Would apply again if another position opens up. Lovely campus.", "Interview Questions": "What are my strengths / challenges as an administrator?"}, {"date": "23 Jun 2019", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Pratt Institute", "Interview Descriptions": "I had an interview with two people at the same time, the assistant to the president and the lab manager. They let me fill a questionnaire mainly asking about what I would do in certain situations at the job.", "Interview Questions": "What is your work ethic?"}, {"date": "12 Jul 2022", "title": "Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Pratt Institute (New York, NY) in Jan 2019", "Interview Descriptions": "Just some regular application and interview process. They asked for some previous teaching experience and expertise subject related questions. Also talked about portfolio, studio produced work and if I had any teaching experience.", "Interview Questions": "What led you to apply to teach here?"}, {"date": "15 Sept 2018", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Pratt Institute (New York, NY) in Sept 2018", "Interview Descriptions": "Ask about my goal to achieve in this position\r\nWhy I want to apply for this position\r\nTalk about the position daily work and required hours\r\nAsk about my hours available for the work\r\nAsk me about my english ability on answering the phone call", "Interview Questions": "why you want to apply this position?"}, {"date": "19 Aug 2019", "title": "Woodshop Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Pratt Institute in Aug 2018", "Interview Descriptions": "No Interview， fill the form and submitted to the wood shop. They will inform you through email within a week. Very good on campus job. You will learn a lot of wood shop techniques", "Interview Questions": "N/A"}, {"date": "5 Jan 2020", "title": "Program Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Pratt Institute (Brooklyn, NY) in Jul 2018", "Interview Descriptions": "Well prepared is needed. The employer will send you all the documents and questions that they may need. Also, you need to provide three interesting topic for the program. That will be good for new employers.", "Interview Questions": "Do you have similar experience?"}, {"date": "14 Apr 2017", "title": "Phone-A-Thon Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Pratt Institute", "Interview Descriptions": "The employer held a phone interview where she asked what experiences I had in communication/customer service type work. She also asked what experiences I had would help me to, for example, handle an angry caller. She was very friendly and it went smoothly.", "Interview Questions": "What experiences have I had in talking to people"}, {"date": "4 Aug 2016", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Pratt Institute (Brooklyn, NY)", "Interview Descriptions": "General application (CV/Cover letter) followed by in person campus visit and interview. I met the students, department staff, head of department and dean. I was interviewed by a panel of faculty members initially, and then on campus by various senior management.", "Interview Questions": "N/A"}, {"date": "3 Jun 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Pratt Institute (New York, NY) in Aug 2016", "Interview Descriptions": "I was referred by another graduate assistant. The employer asked my resume, then interviews and talk about schedule . He asked about the Microsoft office experience, math level, and told me this work need to be detailed and treat them carefully.", "Interview Questions": "The working hours? Can be flexible?"}, {"date": "13 Dec 2017", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Pratt Institute (Brooklyn, NY) in May 2016", "Interview Descriptions": "Applied online and received a call to set up the interview time about a month later. Met with several folks faculty, staff and students and immediate supervisors and VP of student affairs.", "Interview Questions": "Overall easy going interview. Plenty of time to ask questions. Full day interview. Met with Faculty, staff and students. "}], [{"date": "21 Oct 2017", "title": "Teacher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Pratt Institute in Feb 2016", "Interview Descriptions": "After submit my application, I received a phone call. The process took more than 1 week. \r\nI interviewed at Pratt on weekdays.  the person who asked me several questions. I did not get a offer.", "Interview Questions": "Why do you want this job?"}, {"date": "14 Dec 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Pratt Institute (Brooklyn, NY) in Sept 2015", "Interview Descriptions": "Enrolled in a shop safety class and got asked if I'd like to be a Graduate Assistant for the woodshop. Had a test run to oversee the shop safety test during alongside my boss to see my communication and safety knowledge.", "Interview Questions": "What are your years of experience and skill level in furniture building"}, {"date": "3 Mar 2015", "title": "Financial Aid Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Pratt Institute (Brooklyn, NY) in Jul 2014", "Interview Descriptions": "The interview process was simple, they asked appropriate questions regarding the job and everyone was friendly and professional.\r\n\r\nAfter the interview I sent emails to everyone on the panel thanking them for the interview. \r\n\r\nNo one took the time to contact me about the position after the interview.  To this day I haven't heard from them.  I've done many interviews over the years, but this is the first company that didn't have the common decency to let me know that I wasn't going to be given the position; not even a simple thank you for your time or considering the company.  Very unprofessional!", "Interview Questions": "Where do I see myself in 5 years?"}, {"date": "20 Jul 2015", "title": "Lab Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Pratt Institute in Jul 2014", "Interview Descriptions": "Had to fill a form first with a number of questions and then schedule an interview. The interview questions were related to my answers in the form. The interviewer was my boss and was very nice to talk to. He just wanted to make sure that I was willing to do the job.", "Interview Questions": "How much experience do you have with computers?"}, {"date": "18 Jul 2014", "title": "Institutional Advancement Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Pratt Institute in Jun 2014", "Interview Descriptions": "Working around creatives at an art school would be amazing for me, so I've jumped at both opportunities I've had to interview for positions in the Institutional Advancement department, which encompasses development, communications, and in-house graphic design for the Institute. Both times, I've made it to the final candidate rounds of interviews, and both times, the final experiences have left a bad taste in my mouth. \r\n\r\nThe hiring managers are quite thorough in their interviews -- you will often undergo a phone screening and then an initial interview where you are asked for more specific details about your resume and work experience, which then begins to move into your values and work style. This last time, I was interviewed for a writer position in the department and my final interview round was with the three executives I would be writing for (not working directly with), who conducted the interview interrogation style. I felt like I was taking a test or defending a thesis. \r\n\r\nDespite that, I was still excited for the potential the position held and the environment -- this also despite the pitifully low-balled salary the Institute was offering.  After numerous correspondences with the hiring manager, and then reaching the end of the interview process, I wrote once more to inquire about my candidacy either way. My message was met with silence, which seemed odd after everything else. The following week, I received a generic form letter in the mail notifying me that they had \"chosen another candidate . . . \" whose experience better matched the role.  \r\n\r\nDisgusting. \r\n\r\nAfter multiple rounds of interviews, and rapport build, it would have been perfectly fine for the hiring manager to reply to my email inquiry that I had not been chosen for the position. It would have left me with a better impression of the Institute, rather than feeling like I will never apply for a post there again, although they obviously find my skills and personality a potential match. \r\n\r\nHiring managers need to understand and respect that candidates also invest a great deal of time and effort into the interview process, and while feedback like \"what you can do better\" or \"why we didn't choose you\" isn't obligatory, a human touch is for candidates you were seriously considering.", "Interview Questions": "N/A -- felt very specific to each candidate and based on my specific resume, skill set, work samples"}, {"date": "6 Feb 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Pratt Institute", "Interview Descriptions": "It took forever to be called after application submission. I forgot I applied. Interviewed and got the offer two weeks later", "Interview Questions": "Do you like to doodle?"}, {"date": "21 Aug 2014", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Pratt Institute (Brooklyn, NY) in Feb 2014", "Interview Descriptions": "I applied via email directly to the position supervisor. Since I was referred by a friend and colleague. I got an immediate response to negotiate an interview. There were a few preliminary questions about availability and job responsibilities.", "Interview Questions": "How are you under pressure?"}, {"date": "10 May 2016", "title": "Film/Video Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Pratt Institute (Brooklyn, NY) in Oct 2013", "Interview Descriptions": "I met with the dept. chair's office. We spoke about my background and what the job entailed as well as common interests. Like most people at Pratt, the chair was SUPER NICE and on a personal level have to say it was a good meeting. \r\n\r\nThe campus is a bit difficult to navigate, but also beautiful, so arrive early. I dressed business casual (it's an art school---only the president wears suits.)\r\n\r\nThe conversation was mostly about artistic interests and projects.", "Interview Questions": "What makes you qualified for this job?"}, {"date": "25 Jun 2017", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Pratt Institute in May 2013", "Interview Descriptions": "referral through friend who already taught there. The interview was informal and cordial. The conversation was ca. 15 minutes long, discussing possible classes, availability and teaching experience as well as professional experience.", "Interview Questions": "experience teaching/subjects of interest to teach"}, {"date": "26 Jan 2014", "title": "Systems Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Pratt Institute (Brooklyn, NY) in Dec 2012", "Interview Descriptions": "The interview process was excellent.  They were flexible about my availability as I was still working full time.  The culture was proactive as well as modern and it was immediately apparent.  They were very open and offered huge amounts of information relative to their expectations and our role as unit and in the overall structure of the business.", "Interview Questions": "How long do you think it will take you to learn the entire system?"}], [{"date": "11 Jun 2012", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Pratt Institute (Brooklyn, NY) in Sept 2010", "Interview Descriptions": "It was very easy interview, since they were aim to hire a student in school. It was a part-time job. It was the director who asked me some questions, such as what kind of office work I have done before, what major I was..", "Interview Questions": "what is your major? "}]]