[[{"date": "15 Jul 2022", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yeshiva University", "Interview Descriptions": "Great  interview with great staff  that asked several questions regarding the position. Always mindful on the questions and good reference to my own resume. Very personable with three people interviewing", "Interview Questions": "How didnyour previous experience relate to thos position"}, {"date": "27 Sept 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yeshiva University", "Interview Descriptions": "very pleasant, professional and courteous. I was given a chance to ask questions and learned a lot about the organization.  I enjoyed the interview process and had a positive experience", "Interview Questions": "Why do you think you are a good fit for this role?"}, {"date": "18 Feb 2021", "title": "Math Peer Tutor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yeshiva University", "Interview Descriptions": "The interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates and making a hire", "Interview Questions": "Tell me about an accomplishment you are proud of"}, {"date": "1 Dec 2022", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Yeshiva University (New York, NY) in Sept 2019", "Interview Descriptions": "Interviewed back in HS for Yeshiva. Had to write an essay and letter of recommendation. Heard back a few months after. Yeshiva came to our school since we had a lot of applicants.", "Interview Questions": "What major are you interested in?"}, {"date": "20 Apr 2023", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Yeshiva University (New York, NY) in Jan 2019", "Interview Descriptions": "It was very simple. I had an interview with HR. This was not difficult but the recruiter, Sheri Young, was amazing and really smart. I had come for an interview for one department but after this interview, considered a different position. I had a second with the head of the department.", "Interview Questions": "I don't remember exactly, but there were a lot of questions about my former work experience."}, {"date": "10 Nov 2017", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yeshiva University (New York, NY) in Sept 2017", "Interview Descriptions": "One in person interview that was quick (half hour) with three faculty members followed by an Excel computer skills test and a document formatting exercise. The interview questions were standard with no curve balls or anything unexpected. The only thing that threw me off was that is was very quick and cut short towards the end because they had another candidate scheduled to come in immediately after.", "Interview Questions": "Why do you want this job and what is your long term plan and goals?"}, {"date": "13 Jun 2017", "title": "Student Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Yeshiva University (New York, NY) in Nov 2016", "Interview Descriptions": "Very easy. You sit in an office and the head librarian asks you what year you are in YU/RIETS. Additionally, you need a reference, but if you put down as a reference someone the library knows of (which is most of the rabbinical staff) then you're in.", "Interview Questions": "Why do you want to work in the YU Library?"}, {"date": "2 Oct 2016", "title": "Secretary Ll Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yeshiva University (New York, NY)", "Interview Descriptions": "I met with the Dean of students whom I would be working for. He asked me lots of questions, told me what he needed asked me if I think I could handle it and I said yes, at that time I was sent to HR to fill out my forms and was hired.", "Interview Questions": "How would I handle a very busy office if someone walked in while I was on the phone?"}, {"date": "25 Sept 2016", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Yeshiva University (New York, NY) in Sept 2016", "Interview Descriptions": "After I sent my resume through their portal, it was about two weeks until I received an email with the interview request. I met with three people for about an hour. They were very personable and knowledgeable. I felt well prepared and they listened carefully to my responses and answered my questions thoroughly. From the interview, Yeshiva University seems like a wonderful place to work.", "Interview Questions": "What about my background makes me a good fit for this job?"}, {"date": "1 Dec 2017", "title": "Accounting Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yeshiva University (New York, NY) in May 2016", "Interview Descriptions": "Just one interview in the YU finance department. It probably lasted 20 minutes no longer. It was a brief and very easy interview. It was led by the Director of Accounting along with one of the senior accountant staff whom didn't really know much about interviewing. Then I heard back from the director of accounting after 2 weeks later I believe.", "Interview Questions": "Tell me about yourself? Why you interested in this role? What do you know about the YU Finance department?"}], [{"date": "26 Mar 2015", "title": "Front End Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yeshiva University (New York, NY) in Mar 2015", "Interview Descriptions": "first round met HR, second round met web service manager and interactive director. About 70% are behavior questions, and 30%are technical questions. Nice conversation. Simple but professional. Q: Why do you think this position is good fit for you? What does you supervisor say about you?", "Interview Questions": "What is the biggest challenge in your current job?"}, {"date": "15 Dec 2016", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Yeshiva University (New York, NY) in Mar 2015", "Interview Descriptions": "I received many questions regarding scenarios that would happen in the dorms and outside. A good interview should go for about 45 minutes and make sure to thank the interview for their time afterwards.", "Interview Questions": "Someone comes out to you, what do you do?"}, {"date": "2 Mar 2015", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Yeshiva University (New York, NY) in Feb 2015", "Interview Descriptions": "Simple and professional. An application to HR and then set up time with the party to whom you will report. Dean is wonderful and a real mentsch! I was most impressed with his honesty and integrity as he was willing to reveal the limitations of the position and the challenges one is likely to face.", "Interview Questions": "How will you be able to mesh your talents with this role"}, {"date": "18 Aug 2014", "title": "TA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yeshiva University", "Interview Descriptions": "You have to go in knowing the class and knowing what is important to the teacher. It it not enough to know all of the matirial. You have to be excited about it as well. The teacher wants to have someone with passion as well. it pay to do your research. look at what other classes in other schools are doing and try to to show her those ideas. that shows intiative", "Interview Questions": "What would change about my teaching style"}, {"date": "28 Oct 2015", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Yeshiva University (New York, NY) in Apr 2014", "Interview Descriptions": "You apply with a project and a couple essays, you then proceed to have a 2 on one interview with the heads of housing, if they like you they will call you back for the group interview with roughly 30-40 others and following that they will give you a week or two and then let you know if you received the position.", "Interview Questions": "How would you solve a crisis on your floor"}, {"date": "18 Oct 2013", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Yeshiva University", "Interview Descriptions": "Interviewed with my immediate boss and one level up. Fairly straight forward. Expectations were expressed and abilities were probed.", "Interview Questions": "Most notable failure."}, {"date": "20 May 2015", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Yeshiva University (New York, NY) in Jun 2012", "Interview Descriptions": "After submitting a resume, I was called to discuss the opportunity. It was a simple conversation with a few questions. Then. I was asked to come into the office and I met with my would-be boss. Interview went well, questions were pointed but not too difficult.", "Interview Questions": "All the questions were standard, since this was a relatively easy position. I was asked:\r\n\r\nTell me about yourself.\r\nCan you perform the functions. \r\nWhat do you want to do while you are here, other than the duties described. "}, {"date": "30 Jun 2016", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Yeshiva University (New York, NY) in Apr 2012", "Interview Descriptions": "Applied online and waited several weeks. Was invited to interview with HR, followed by hiring manager, followed by director. Also spoke with potential colleagues and employees in other departments.", "Interview Questions": "Why are you the best person to hire for this position"}, {"date": "2 Apr 2013", "title": "Study Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Yeshiva University in Apr 2010", "Interview Descriptions": "I was working in a similar setting in another state, so my interview was pretty much straight forward.  Was asked about my skills, years of experience, expected salary, moving time. Was explained in detail about the work environment, contract and other expectations.", "Interview Questions": "Was asked about grant writing experience and weekend availability."}, {"date": "6 Oct 2010", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Yeshiva University (New York, NY) in Jul 2008", "Interview Descriptions": "First contacted by HR  & scheduled a \"phone interview\" that probably lasted 10 minutes, then we scheduled a 1:1 with another person in HR and that interview was very bizarre. Lastly, I interviewed with the department I had applied for & met their Executive Assistant & the Finance person.", "Interview Questions": "Would you have a problem understanding a different culture?"}]]