[[{"date": "N/A", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "I loved interviewing, very easy process. I had two interviews, and they were great I can't recall every question, but it was a typical interview. I met with my boss then the team", "Interview Questions": "They asked what experience I had."}, {"date": "12 Jun 2023", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health", "Interview Descriptions": "There are two interviews in the whole process. First a phone interview, and then they schedule you for a video interview. They are pretty punctual with notifying you of interview dates.", "Interview Questions": "Q: What are your long-term goals?"}, {"date": "1 Jun 2023", "title": "Nurse Extern II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health", "Interview Descriptions": "The interview process started with a phone interview and then progressed to an in person interview and a shadowing period. The in person interview was with the hiring manager and then I immediately followed that with an opportunity to spend a few hours on the unit shadowing a nurse.", "Interview Questions": "Tell them about a time that I made a mistake and how I corrected it. What did I learn from that experience."}, {"date": "11 May 2023", "title": "Investment Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "It was fine. Normal process but may have changed recently. Interviews with the team were informative and helpful for both sides. Not sure what they do now though with virtual options.", "Interview Questions": "What is your role on a team?"}, {"date": "6 May 2023", "title": "HUC Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Advocate Aurora Health (South Milwaukee, WI)", "Interview Descriptions": "interview is a structured conversation where one participant asks questions, and the other provides answers. In common parlance, the word \"interview\" refers to a one-on-one conversation between an interviewer and an interviewee.", "Interview Questions": "interview is a structured conversation where one participant asks questions, and the other provides answers. In common parlance, the word \"interview\" refers to a one-on-one conversation between an interviewer and an interviewee."}, {"date": "3 May 2023", "title": "PSR Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Advocate Aurora Health (Park Ridge, IL)", "Interview Descriptions": "Phone screen interview then interview with manager and lead psr…straight forward! Very nice people. Asked 2 standard interview questions and the rest you ask them your own questions!!! Very very very wonderful interview experience", "Interview Questions": "Tell me about a time you worked without supervision."}, {"date": "28 Jun 2023", "title": "Medical Office Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health (Joliet, IL) in May 2023", "Interview Descriptions": "It was a straightforward process, I completed my application online. The next step was to a speak with the coordinator over the phone. The last step was a teams interview with the hiring manager.", "Interview Questions": "How do you deal with a difficult patient?"}, {"date": "21 Apr 2023", "title": "Facilities Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Advocate Aurora Health (Milwaukee, WI)", "Interview Descriptions": "Manager has little skills in my field. Made it a little strange when asked questions that were rather odd ones in my field. HR questions did cover well on basic questions.", "Interview Questions": "Why you want to work for them"}, {"date": "12 Apr 2023", "title": "Regustered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health (Chicago, IL)", "Interview Descriptions": "2 interviews and was asked situational questions, triage questions, goal oriented questions. I was able to shadow and meet the team. The hiring process was relatively quick, in about a week.", "Interview Questions": "Where do I see myself in 5 years"}, {"date": "3 Apr 2023", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health (Chicago, IL) in Apr 2023", "Interview Descriptions": "I’m not sure yet, interview is Friday and I’m a a little nervous. Tell me about yourself. Where do you see yourself in five years? What do you believe are your professional strengths? What do you consider your weaknesses? Why did you leave your last job? Why do you want to work for this organization?", "Interview Questions": "Tell me about yourself. Where do you see yourself in five years? What do you believe are your professional strengths? What do you consider your weaknesses? Why did you leave your last job? Why do you want to work for this organization?"}], [{"date": "16 May 2023", "title": "Registered Nurse - Labor & Delivery Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Advocate Aurora Health (West Allis, WI) in Apr 2023", "Interview Descriptions": "Initially was rejected because the recruiter didn't think I had my RN license. I was able to correct her and she set up a time to speak with me. We talked for about 10 minutes- very informal. She then set up a time for me to interview with the hiring manager via video chat. That interview occurred roughly a week or so later. I met with the hiring manager for about 45 minutes. The hiring manager set up a time for me to come shadow the unit. I shadowed the following week for 4 hours. I received a rejection 2 weeks later.", "Interview Questions": "Q: Tell me about yourself. Q: When have you provided excellent patient care/gone above and beyond. Q: Why Labor & Delivery? Q: Strengths & weaknesses."}, {"date": "1 Apr 2023", "title": "Allied Health Professional Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health", "Interview Descriptions": "There were 2 rounds of interviews. One was more behavioral based and the other was knowledge based. The process was overall easy but it did take a while to hear back about the next steps", "Interview Questions": "Why do you want to work for us?"}, {"date": "11 Jun 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Advocate Aurora Health (Chicago, IL) in Apr 2023", "Interview Descriptions": "Completed a phone interview with a recruiter, then was scheduled for a zoom interview with the hiring manager. The interview lasted 30 minutes with majority of it explaining the position.", "Interview Questions": "Why do you choose nursing as a career?"}, {"date": "10 Mar 2023", "title": "RN Nurse Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "Multiple interviews but speedy process. Everyone I met with was very nice and from different levels associated with the position. The interview was usual format and average in difficulty. No issues throughout process,", "Interview Questions": "Tell me a time you would’ve done something differently."}, {"date": "24 Apr 2023", "title": "Patient Service Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Advocate Aurora Health (Downers Grove, IL) in Mar 2023", "Interview Descriptions": "You will first be ask to do a Phone interview which is very organized a telephone number and guest code is email to you after you confirm a date and time through text for your scheduled Phone interview", "Interview Questions": "Tell me how you start your work day?"}, {"date": "20 Feb 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "This was about 9 years ago but it was initially telephonic then I met in person with HR and the Manager. We chatted about my experience and about the job description and expectations.", "Interview Questions": "What is one thing you wish to improve about yourself?"}, {"date": "17 Feb 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "Nothing offered yet. One with hr another with manager. Ask behavior questions and resume. Was through phone . Interview was in December. No one responded yet. Waiting game . Professional and behavioral topics covered", "Interview Questions": "Resume walkthrough and ask general question"}, {"date": "13 Feb 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Advocate Aurora Health (Milwaukee, WI) in Feb 2023", "Interview Descriptions": "Had one interview with HR and it was a phone screening. The second interview was with the manager of the job position and team lead. I just got moved on to my third interview meeting with a small group involved in the interviewing process.", "Interview Questions": "What are your strengths and how would you apply them in this position?"}, {"date": "8 Mar 2023", "title": "Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Advocate Aurora Health in Feb 2023", "Interview Descriptions": "One of the most tedious processes ever. The hiring manager has not responded to me in over a month and the recruiter ignores your emails constantly. I don’t know why it would take over a month just to get a final decision on a low level position. I’m still hopeful but no response yet sadly.", "Interview Questions": "Present a time when you had to juggle working with multiple tasks with many deadlines."}, {"date": "27 Jan 2023", "title": "Intake Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health", "Interview Descriptions": "Very thorough interview process consisting of 3 interview rounds. First interview- with HR representative. Around 30 minutes in length. Second Interview- with potential supervisor. Around 45 minutes in length. Third interview- with potential team. Around 30 minutes in length.", "Interview Questions": "Questions pertaining to relevant experience."}], [{"date": "17 Jan 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "I had received an invitation for phone interview with a recruiter via email. Was able to schedule the interview online for the following day. The first interview lasted 45 minutes. The recruiter asked generic questions about work and school history. Scheduled a video conference with recruiter and hiring manager for the following day.", "Interview Questions": "Tell me about a time you had a patient who you could not communicate with. What was the situation and how did you respond."}, {"date": "28 Dec 2022", "title": "EPD Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "It was rushed. The supervisor was doing the interview and he seem busy. I understand being late sometime is fair but they were really late. Unorganized and the management style is the same. I’m here to see what other had to say.", "Interview Questions": "What a bad situation and how did you get threw it."}, {"date": "5 Dec 2022", "title": "Health Navigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "Typical interview questions asked. Many “describe a time when” questions. Discussed the role and previous experience. Overall a good interview experience first with the HR team member as well as with the hiring managers.", "Interview Questions": "Describe a difficult situation you’ve encountered and how you dealt with this."}, {"date": "4 Dec 2022", "title": "Human Resources Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health (Chicago, IL) in Dec 2022", "Interview Descriptions": "The position posted HRM-Southside Chicago address was in Downers Grove. The impression is the job was located in Downers Grove, supporting the Southside Chicago employees. At the end of the interview, the person interviewing finally informed me I lived to far from the position. Deciding for ME, I could not make the drive.", "Interview Questions": "I was asked general interview questions, and the person interviewing me sounded disconnected and dismissive, with a very loud background."}, {"date": "20 Nov 2022", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "Involved a short phone interview with a recruiter and then a zoom interview with the manager and education coordinator. The interview process was fairly quick. About 1 week in total.", "Interview Questions": "How do you handle work place stress?"}, {"date": "23 Sept 2022", "title": "Human Resources Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "Positive experience overall. Phone Screen, 2 interviews with hiring leaders. Recruiter was communicative throughout the entire process and forecasted what to expect from the experience. They expressed they were interested in moving forward with next steps after the 2 interviews, and asked me to get back with them if I was interested. My interest in moving forward would have depended on the offer extended so I withdrew myself from the process. ", "Interview Questions": "Why are you looking to leave your current role? "}, {"date": "15 Sept 2022", "title": "Unit Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "HR, Peer and managers straight to the point very open and lax no pressure be yourself very accommodating for scheduling interviews. Good people to work with. Excellent place to work in even in high stress situations \n", "Interview Questions": "How you dealt with a difficult situation "}, {"date": "11 Sept 2022", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "Very basic questions were asked, more so \"get to know you\" questions. staff was very friendly and gave a brief tour of the pharmacy and an explanation of each role.", "Interview Questions": "How important do you think the role of a pharmacy technician is to the patient?"}, {"date": "4 Oct 2022", "title": "Outpatient Psychiatrist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Advocate Aurora Health (Marinette, WI) in Sept 2022", "Interview Descriptions": "Applied online at night and was contacted by a recruiter the next morning to set up an interview. Interview with recruiter happened a week later. This was the more challenging of my two interviews… a lot of scenario questions. The recruiter was very nice though. I was told at the end of that interview that the therapy manager would reach out to schedule a virtual interview with me. That manager reached out the same day, and the virtual interview was scheduled for a week later. This interview was more laid back and had more to do with seeing if I would be a good fit than anything else. Another therapist was present for the interview as well, and I was given a lot of information about the position and perks of working for Advocate Aurora. I was told that the recruiter was off for the weekend but that I should hear back early the following week. I was contacted Monday morning with a job offer.", "Interview Questions": "We work with many diverse clients. Give an example of a time you have something up to make someone more comfortable."}, {"date": "12 Aug 2022", "title": "Ophthalmic Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "The process went pretty quickly. I received a phone call to set up a phone interview and had a in person interview all within 1-2 weeks. Difficult was average. No complaints.", "Interview Questions": "How many years of experience?"}], [{"date": "9 Aug 2022", "title": "PSR I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "Typical interview process and questions - took some time to get through the screening process and had to follow up- had interview remotely - lasted about 45 minutes - very casual", "Interview Questions": "Work history and experience level"}, {"date": "2 Jul 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "with 2 faculty members, who are nurses that is a manger and director, very easy going and delightful , made small talk with a sense of humor and accommodating to questions", "Interview Questions": "Can you work 12 hour shifts ?"}, {"date": "11 Oct 2022", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Advocate Aurora Health (Milwaukee, WI) in Jul 2022", "Interview Descriptions": "First you apply via the website, then you do a call with a recruiter, then if you are selected, an interview with a lead, and then lastly a job shadow with current employees", "Interview Questions": "If you had an administrative task and a patient related task, which one would you complete first, how would you handle conflict with a coworker, describe a time where you handled a difficult situation"}, {"date": "12 Jan 2023", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health (Milwaukee, WI) in Jul 2022", "Interview Descriptions": "Interview process was a little tough. First, you meet with a recruiter, then if you are a good fit: you will be informed on the position and shifts available. If you choose to accept, your info will be passed over to which hospital you choose. Process took a bit, so just always watch out for a email or stay in contact with your recruiter. I went in to do an in person interview with the Phlebotomist Lead, she liked me and offered me to come shadow @3am which is what time 1st shift starts for that hospital. I shadowed and love it! Very easy, especially if you have been a phlebotomist before.", "Interview Questions": "Why do you think you are a good fit for this position?"}, {"date": "21 Jun 2022", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "First you get a phone screen with HR then of HR approves you'll get set up with a virtual interview with the manager and assistant manger they'll decide if they like you enough to do a walk threw with the company", "Interview Questions": "Why do you want to work here"}, {"date": "20 Jun 2022", "title": "Operating Room RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Advocate Aurora Health (Chicago, IL) in Jun 2022", "Interview Descriptions": "Phone interview has been completed with hospital recruiter and a video call has been established with department staff to speak with them and have an opportunity to ask them any questions.", "Interview Questions": "she asked about previous experience, why I wanted to work for advocate, how different personalities are handled in the OR and what previous employers would say about me. "}, {"date": "28 Jun 2022", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health in Jun 2022", "Interview Descriptions": "It was a very Smooth process. First I talked to a recruiter and they send your information to the facility. They then reach out for an interview. The recruiter then reaches out with an offer.", "Interview Questions": "What was something you did that was considered kind?"}, {"date": "14 May 2022", "title": "Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Advocate Aurora Health", "Interview Descriptions": "I applied online and was contacted via email initially to set up a meeting with the recruiter. The inital phone screen with a recruiter was 20 minutes. Afterward, there was a meeting/formal interview with the therapy management director.", "Interview Questions": "Explain a time when you expressed empathy in your work."}, {"date": "27 Apr 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "Recruiters are difficult with their interviews. They call you after you apply and interview right on the spot.  At least set up an appointment. Way too catch someone off guard with their questions.", "Interview Questions": "Tell me about a nursing error you have done"}, {"date": "12 Apr 2022", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "The interview process was easy and provided very valuable information pertaining to your unit and role. I connected very well with the interviewer and was very informative. Professionalism was very apparent and the interviewer eased my anxiety by assuring me that the unit was a welcoming unit.", "Interview Questions": "Tell me about yourself and why would we hire you ?"}], [{"date": "4 Apr 2022", "title": "Float Pool CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "I applied thinking I would never hear from them. I got a call three days later and found out that I'd applied to a hospital that was an hour commute away. As soon as that was established to not be favorable, the recruiter connected me with a colleague that was recruiting for a hospital that is walking distance. I had two more calls and received an offer an hour after the second round.", "Interview Questions": "How well do you work with people? "}, {"date": "9 May 2022", "title": "IT Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Advocate Aurora Health (Chicago, IL) in Apr 2022", "Interview Descriptions": "The first interview was a phone call with the recruiter.  Mary was wonderful, gracious and easy to talk to.  She answered all my questions.\r\nThe second interview was with the person I would report to which lasted an hour.  This person was pleasant but all business.  Following that, I interviewed with 2 of her peers for 30 minutes each.", "Interview Questions": "History and background questions that were mostly aimed at fit within the position."}, {"date": "19 May 2023", "title": "Associate Research Biostatistician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health in Apr 2022", "Interview Descriptions": "There was a phone screening interview by HR personnel. They are quite fast. After 2 days, I got email to schedule for personal interview. That one was really intensive. It lasted about 45 minutes and asked me many questions about statistics.", "Interview Questions": "What is chi-square test and Fisher Exact test? What is the difference between statistical significant and clinical significance? Tell me about the types of data? What do you prefer between 95% CI and p-value? What is effect size?"}, {"date": "13 Mar 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health (Chicago, IL) in Mar 2022", "Interview Descriptions": "Reached put via email and phone call to set up interview, 1st step involves phone interview with recruiter to discuss salary expectations, and review of resume, and discussion reason for position change", "Interview Questions": "Why do you want to work for advocate?"}, {"date": "8 Feb 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "Easy and great. The manger didn't ask to many questions. she kept it easy and professional. she is very sweet. if you don't get hired, they will place you in a different position and you still will get paid.", "Interview Questions": "what are your strengths and weaknesses."}, {"date": "1 Apr 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Advocate Aurora Health in Feb 2022", "Interview Descriptions": "I completed the second interview and never heard back, even though they said multiple times I would hear back either way. I reached out to the managers I interviewed with and the recruiter and I never got a response. I thought it was extremely unprofessional and a waste of my time.", "Interview Questions": "Average nursing questions like, what makes a good nurse, what are your strengths, etc "}, {"date": "5 Jan 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "There was an HR interview, a manager interview, and a peer interview. There were some delays during the process but that was due to a hiring freeze that occurred after the interviews were done. The interviews themselves happened quickly.", "Interview Questions": "What is one time you had to work as a member of a team"}, {"date": "3 Jan 2022", "title": "Community Connector Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "First I had a phone interview, which went great! The person who interviewed me was warm and engaging with clear questions. After we finished, they immediately let me know I would be moving on the final zoom interview with the person who be my direct supervisor and responsible for making the final decision on hiring. That interview was also a very positive experience-- the interview was fluid and with a lot of dialogue between us.", "Interview Questions": "What are your future goals?"}, {"date": "27 Jan 2022", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Advocate Aurora Health in Jan 2022", "Interview Descriptions": "Initial interview to go over your qualifications and the expectations.  Secondary interview to have a deeper dive into your motivations and specific skills. Lots of theoretical questions about possible scenarios that you might be presented with and questions about your strengths and weaknesses.", "Interview Questions": "What would your previous employer say about you?  What would your employer say is a weakness of yours?\r\nHow did you handle a difficult situation at work, give an example?"}, {"date": "9 Apr 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Advocate Aurora Health (Milwaukee, WI) in Nov 2021", "Interview Descriptions": "Very quick process. Communication was open, updates provided frequently. Recruiter gave me options with multiple units to shadow during the process. The application was smooth. I was able to apply to many positions at once", "Interview Questions": "What makes me stand out from another prospective candidate? "}], [{"date": "27 Nov 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Advocate Aurora Health (Chicago, IL) in Nov 2021", "Interview Descriptions": "It was good it felt like a casual conversation. Also moved very fast I got the interview through my college and they made a offer that day. They will work with you if you are close to nclex date.", "Interview Questions": "Why Do you want to be in the ER?"}, {"date": "29 Nov 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Advocate Aurora Health (Chicago, IL) in Nov 2021", "Interview Descriptions": "Sent in an application over the weekend and received a phone call the following week. The interview process went quick. The recruiter was quick to respond back to any questions. Unsure if an offer will be extended", "Interview Questions": "Past clinical experience; why I became a nurse"}, {"date": "12 Oct 2021", "title": "Patient Transport Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Advocate Aurora Health", "Interview Descriptions": "First, a phone interview  is done with a recruiter. Once you pass the phone interview, an  interview is scheduled with the department manager.  A series of questions are asked and if chosen, HR will contact candidate within 2 weeks.", "Interview Questions": "What would you consider your weakness?"}, {"date": "5 Oct 2021", "title": "University Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "Volunteer coordinator set up interview with hiring manager. Hiring manager approved internship with coordinator and university coordinator. Took about two weeks. Internship was a bit unorganized and slow. Overall experience was mediocre.", "Interview Questions": "Why do you want to work with AAH? "}, {"date": "1 Oct 2021", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "The questions seemed very basic and  didn't seem to dig for information. It seemed more of a formality to interview me rather than and indication of real interest in me for the postion.", "Interview Questions": "What was your previous experience."}, {"date": "23 Sept 2021", "title": "Compensation Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "Very thorough and informational. They let you meet with all of the leaders you will be working with which is nice so you can get a feel for the culture of the team.", "Interview Questions": "What do you do to encourage diversity, equity and inclusion amongst your work?"}, {"date": "9 Sept 2021", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "Easy process, comfortable interview process. Human Resources made it easy to understand and follow the interview process after applying. Once the interview was finished the responded in a timely manner.", "Interview Questions": "What makes you an a great addition to the team?"}, {"date": "19 Oct 2021", "title": "Physician Assistant, PA-C Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Advocate Aurora Health (Park Ridge, IL) in Sept 2021", "Interview Descriptions": "Three weeks of interviewing with various members of the team, over Microsoft Teams: all at inconvenient times, and while still working my regular full-time job. There was no feedback afterwards and I had to follow-up with the recruiter on the status after I didn’t hear anything for over a week.", "Interview Questions": "What interests you about this job? Tell me about yourself. What experience can you bring to this position? Etc"}, {"date": "15 Oct 2022", "title": "Healthcare Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health (Chicago, IL) in Sept 2021", "Interview Descriptions": "The interview process wasn’t invasive it was pretty cool. I was asked about my history and my work experience and different things I’ve accomplished and experienced. I was asked if I was used to receiving high call volumes and able to multitask.", "Interview Questions": "Can you explain one time you faced adversity and needed to bring your way back from that successfully on the job"}, {"date": "11 May 2022", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health in Sept 2021", "Interview Descriptions": "Started with an HR screen followed by interview with the hiring manager. Then interview(s) with others on the team and/other partners. Took about one month from once I had the first interview.", "Interview Questions": "Can you give me an example of how you had to gain the cooperation of others? What was the outcome?"}], [{"date": "19 Aug 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Advocate Aurora Health", "Interview Descriptions": "It was great, they are all very welcoming and nice. Just be yourself and be authentic and let your confidence guide you. Prepare and make sure you have situations that you can use examples from.", "Interview Questions": "Why did you apply to this certain unit "}, {"date": "18 May 2022", "title": "Medical Scribe Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health (Milwaukee, WI) in Aug 2021", "Interview Descriptions": "They ask very normal interview questions. Tell us about yourself? What is a weakness that you may have etc. The women who conducted my interview was very nice and respectful. The job requires me to travel so I has to turn it down", "Interview Questions": "Tell me a little about yourself. "}, {"date": "29 Jul 2021", "title": "X-Ray Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health (Appleton, WI) in Jul 2021", "Interview Descriptions": "My interview process went very smoothly. Manager was very professional and friendly. Asked the appropriate amount of questions. Overall experience was great! I would definitely recommend aurora in my opinion.", "Interview Questions": "What are your strengths and weaknesses? "}, {"date": "20 Jun 2021", "title": "Lab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "Ask questions about yourself and capabilities , how well you can function in multiple settings. Do you like working with people and being engaged. They get to know you as a person to better understand you. They want to know if you can get the work done and be a leader", "Interview Questions": "How well do you work in a stressful environment"}, {"date": "14 Jun 2021", "title": "PACU Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health", "Interview Descriptions": "was a zoom call but the interviewer had their camera off\nroughly 45 minutes\nwas asked to talk about myself, why i wanted the specialty but talked a lot and answered questions for me it felt like", "Interview Questions": "how i coached someone through\nwhat patients / family members would say to describe me \nhardest part about nursing school"}, {"date": "23 Jun 2021", "title": "Housekeeper Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Advocate Aurora Health (Chicago, IL) in Jun 2021", "Interview Descriptions": "A lot of scenario questions it lasted for 15 minutes 3 people interviewed me on zoom they asked me a lot of why and what questions and described the duties of the job", "Interview Questions": "Why do you want to work at a hospital "}, {"date": "28 May 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "I was told something completely different than what was posted on the job website.  The job description was not Accurate.  Interview was ok.  Long process but not difficult. Interviewed with both manager and supervisor as well as peer interview.", "Interview Questions": "Name a time where you had to resolve a conflict with a coworker? "}, {"date": "16 May 2021", "title": "Quality Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "Horrible, very unprofessional panel interviews. The team's drama was aired out amongst the panelists and lead to an unproductive interview. Would not recommend unless you want to have your time wasted at this organization.", "Interview Questions": "Brought up team drama during interview."}, {"date": "11 May 2021", "title": "Student Nurse Extern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "Recruiter interview was fairly casual.  It lasted 45 mins. She asked usual questions. She did explain the role , benefits and expectations. Process moved fast . Transcripts are required to be uploaded .", "Interview Questions": "what are your Strengths and weakness?"}, {"date": "24 Jun 2021", "title": "CCU RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Advocate Aurora Health (Chicago, IL) in May 2021", "Interview Descriptions": "Was reached out by recruiter and had a phone conversation about minimum qualifications. I was scheduled an interview with the manager about a week later. Spoke with the manager and she asked me about my experience, what the unit is about, scheduling etc. and notified me about a panel interview with the Charge and two of the staff members on the unit.", "Interview Questions": "Tell me about a time you had a disagreement with a team member and how did you handle it?"}], [{"date": "27 May 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Advocate Aurora Health (Chicago, IL) in May 2021", "Interview Descriptions": "It first starts with a preliminary phone call.\nIt's not formal, but still basic interview questions are asked to screen you. They want to make sure you fit in with their environment.\n\nThe second interview is a video interview where the hr manager and the unit nurse ask you about 7 questions and then they ask you if you have any questions in return.", "Interview Questions": "How do you make the unit more fun?"}, {"date": "13 Jun 2021", "title": "Genetic Counselor I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Advocate Aurora Health (Oak Lawn, IL) in May 2021", "Interview Descriptions": "Scheduled pre-screening interview with recruiter, which consisted of a very brief phone call; then met with supervising genetic counselor virtually; then was invited to meet team on-site at Christ Hospital for additional interviews with other team members and toured the location; interviewed with team members including practice manager, MFMs, ultrasound technicians, and other clinical staff", "Interview Questions": "How do you handle scenarios in which you have to give patients bad news? "}, {"date": "20 Apr 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Advocate Aurora Health", "Interview Descriptions": "It was pretty quick but they were very friendly. I had two interviews, with one person.  I was able to shadow for a few hours after the interview.  All my questions were answered and I got an offer a few days after the second interview.", "Interview Questions": "Tell me about a time when you had to deal with a difficult patient? "}, {"date": "3 May 2021", "title": "Manager of Clinical Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health in Apr 2021", "Interview Descriptions": "Straightforward interview.  I had a telephone interview with HR, Teams meeting with the department's director, panel Teams meeting, and the final interview with the manager/director of HR.  Everyone was pleasant and knowledgeable.  They are trying to see if you are a good fit.  I had a great experience!", "Interview Questions": "Many behavioral questions.  Lots of \"tell me about a time when\" and '\"what would you do\" questions."}, {"date": "4 May 2021", "title": "Physical Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Advocate Aurora Health (Chicago, IL) in Apr 2021", "Interview Descriptions": "A phone interview followed by an in-person interview. The phone interview was with a recruiter and the in-person was with the regional coordinator.  Both interviews were performed within two weeks of each other. I thought the process was quite quick.", "Interview Questions": "Do you work well within a team?"}, {"date": "26 Mar 2021", "title": "Accounting Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "It was easy - the interviewer spent most of the time telling me about the job responsibilities and about the company.  They asked me if I felt I had the skills to take on this job and they asked me about my past jobs.", "Interview Questions": "They wanted to know about my experience"}, {"date": "18 Mar 2021", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "Phone interview with HR, then in person manager and peer interview. Very straight forward. Lots of repetitive questions about potential situations in clinical setting and communication with peers. HR convo was simple, reviewing resume and qualifications.", "Interview Questions": "Describe a time you disagreed with a physician, what are your strengths and weaknesses, how do you advocate for patients...?"}, {"date": "12 Apr 2021", "title": "Medical Scribe Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health (Oconomowoc, WI) in Mar 2021", "Interview Descriptions": "You must complete a medical scribe evaluation before the interview which includes a grammar test, typing test, and essay portion which is sent to Scribe America. If the evaluation looks good and is approved then you get to be interviewed.", "Interview Questions": "How would your former employers describe you?"}, {"date": "15 Mar 2021", "title": "Referral Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health (Milwaukee, WI) in Mar 2021", "Interview Descriptions": "Had a very quick phone interview with HR. The a 30 minute interview with department supervisor and Lead on a zoom meeting. She did ask all the cleshay interview questions. The whole process took about a month. I start in 3 weeks so if you're looking to start as soon as possible it doesn't always work out that way.", "Interview Questions": "Name a time when you had difficulty communicating to a patient and how did you deal with it?"}, {"date": "13 Jan 2022", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Advocate Aurora Health in Mar 2021", "Interview Descriptions": "This was for the covid vaccination clinic. Phone interview, followed by a formal job offer. I got a call from an HR representative to ask me a few questions about why I wanted to work there.", "Interview Questions": "Q: Why do you want to work for Advocate?\r\nQ: Questions about customer service skills since it is a front desk type of position."}], [{"date": "3 Jun 2021", "title": "Workforce Development Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health (Chicago, IL) in Mar 2021", "Interview Descriptions": "The interview process was very standard. It started with a phone screen with a recruiter. Then an interview with my direct supervisor. Finally, I interviewed with our department director. I heard back within 2 weeks.", "Interview Questions": "Standard questions related to job responsibilities"}, {"date": "11 Mar 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health (Chicago, IL) in Mar 2021", "Interview Descriptions": "It was thorough. They asked me why I choose their company and asked me to tell them about myself. The manager was so sweet and nice. She gave me some advice on the side too. All in all I thought it was a good learning experience. Always be yourself .", "Interview Questions": "Why did you choose our hospital?"}, {"date": "24 Feb 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health (Chicago, IL)", "Interview Descriptions": "Phone screening, hiring manager interview, potential of additional matrix leader interview, followed up by peer interview panel. Behavioral based question sets and supplemental questions around technical expertise. Usually peer interview stage involves two to three prospective candidates still interviewing.", "Interview Questions": "Describe a time in which you developed a direct report. Please explain the actions you took to improve their performance and or skill set.  How did your actions improve the performance of the direct report? "}, {"date": "26 Feb 2021", "title": "Corporate Interiors Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health", "Interview Descriptions": "Interview started on time and was well coordinated during this odd virtual time. Hiring manager was pleasant and explained the position very clearly. she listened to my responses and spend extra time to answerall questions.", "Interview Questions": "I was asked to explain my role in my current position and all my responsibilities "}, {"date": "17 Feb 2021", "title": "Bereavement Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Advocate Aurora Health", "Interview Descriptions": "The interview was very quick and I interviewed with the whole team and was able to get a response within two days. Only issues was that I had to email the manager myself because my application was denied for no reason.", "Interview Questions": "Why did you want this position"}, {"date": "5 Feb 2021", "title": "Hematology Oncology Physician Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health", "Interview Descriptions": "Pretty standard in my opinion for a large health system. Multiple interviews over time but the process is very drawn out. Weeks pass between interviews and no one updates you on the job status for weeks after completing the interview. Makes you feel like you are not a priority.", "Interview Questions": "Why do you want to work for advocate/aurora?"}, {"date": "20 Sept 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Advocate Aurora Health (Park Ridge, IL) in Feb 2021", "Interview Descriptions": "- 1st step: Discussed the role with the recruiter\n- 2nd step: A couple of days later, I gave an interview with the floor managers and further discussed the role\n- 3rd step: Further into the interview, I was also interviewed by other CNAs in my approval of the position. ", "Interview Questions": "- Tell me about yourself\n- Behavioral questions were mainly asked"}, {"date": "1 Feb 2021", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "Personable with pertinent introductions made to leadership and clinical staff. Engaged in learning my healthcare philosophy and how best this could be used to serve the surrounding community. Created a space to get to know colleagues professionally and personally.", "Interview Questions": "What are you passionate about within your specialty?"}, {"date": "9 Jan 2021", "title": "Help Desk Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "Advocate Aurora Health, is one the 10 largest not-for-profit, integrated health system in the United States, serves communities primarily throughout eastern Wisconsin and Illinois.  Interview was easy to go through and fast.", "Interview Questions": "Describe how to make toast in step by step format."}, {"date": "12 Jan 2021", "title": "Diet Clerk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health (Milwaukee, WI) in Jan 2021", "Interview Descriptions": "Easy, automated phone interview. Asked basic interview questions about previous work experience, customer service and leadership skills, and strengths/weaknesses. Also asked about salary. Have not yet received further interview update.", "Interview Questions": "Describe a moment where you showed excellent customer service skills."}], [{"date": "12 Apr 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health (Milwaukee, WI) in Jan 2021", "Interview Descriptions": "Virtual interview with the recruiter which lasted about 30 minutes or so.  Asked the usual questions you get during an interview. Needed to do the usual drug testing & medical screening before starting.", "Interview Questions": "Why would this role be a good fit for you?"}, {"date": "30 Jun 2022", "title": "Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health in Jan 2021", "Interview Descriptions": "The application process and review took too long. I found another job before it was completed.  It was not streamlined enough. I went to work for a different hospital locally.", "Interview Questions": "Never had one. Took to long for application review. "}, {"date": "24 Aug 2021", "title": "Director Managed Care Op Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Advocate Aurora Health (Chicago, IL) in Jan 2021", "Interview Descriptions": "A recruitment consultant reached out after applying to schedule a screening interview.  Then a video interview was scheduled with a hiring leader who was the main decision maker on selecting candidates to offer positions.", "Interview Questions": "Tell me about your experience working with healthcare providers."}, {"date": "5 Nov 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Advocate Aurora Health (Downers Grove, IL) in Jan 2021", "Interview Descriptions": "It was a very easy interview process, it was during covid, so it was all online. The human resources staff was easy to communicate with and prompt to reply. The interview went by quick, and the managers do not intimidate you like in other places.", "Interview Questions": "Why do I want to work there? What would I contribute to the team?"}, {"date": "8 Dec 2020", "title": "Social Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "Quick phone interview told would have a video interview next week but did not occur.  I received second contact about a video interview for another position I applied for but interview times pretty restricted", "Interview Questions": "I don’t remember just about my employment background "}, {"date": "27 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health (Chicago, IL) in Dec 2020", "Interview Descriptions": "I applied online and heard back from a recruiter about a week later and had a phone interview. I scheduled a second interview on microsoft teams and was offered a position the next day", "Interview Questions": "What is your 5 year plan?"}, {"date": "28 Nov 2020", "title": "CVICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "It was straight forward. A couple days after I applied, I got a text for an interview. First an interview on the phone with the recruiter talking about logistics and also experience questions, and then zoom interview with manager.", "Interview Questions": "If I was a kitchen utensil, what would I be"}, {"date": "22 Feb 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health (Milwaukee, WI) in Nov 2020", "Interview Descriptions": "interview/in contact with a recruiter from the company. If that goes well, you can move to an interview with the manager which is your next step. after that, you wait to hear if you are hired or not.", "Interview Questions": "examples of how you work with a team, and what would you do in certain situations"}, {"date": "6 Dec 2020", "title": "Materials Attendant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Advocate Aurora Health (Milwaukee, WI) in Nov 2020", "Interview Descriptions": "I applied through their career portal. I received a message from HR the next day and had to complete a video screening before moving forward with the process. I then spoke with an HR person on the phone who asked the same questions as the video screening.", "Interview Questions": "The recruiter asked questions verifying employment and what shift I’d like to work. I applied for a first shift position, but she went ahead and scheduled me for an interview with the second shift manager. He didn’t seem prepared and wasn’t the best at articulating his thoughts, which made for a frustrating experience that felt like a waste of time. It was a short interview that confirmed how little effort this company puts into the hiring process. I was told I’d hear an update within a week, and of course, that never happened. For as many hoops as you are made to jump through for an initial interview, you would think their HR department would show more diligence and consideration for the candidates."}, {"date": "26 Oct 2020", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health (Chicago, IL) in Oct 2020", "Interview Descriptions": "It was at first an okay experience until I got as far as a group interview with who would of been fellow managers. They were clearly irritated with each other, disorganized and the whole interview was extremely unprofessional. Although, one of the interviewers boasted how Advocate prides themselves on professionalism. They never really asked much about my specific experience. Just a lot of the strength and weaknesses general questions. The response was I did not get the job because I did not have enough experience. I guess 15 years was not enough for them. Or, the obvious, they did not like my personality as a fit. I would rather them say I just wasn't a fit rather than I did not have enough experience which was a lie. Completely lost respect for this institution and how they precieve \"professionalism\".", "Interview Questions": "What are your top 5 strengths. "}], [{"date": "21 Oct 2020", "title": "Cna/Cma Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health in Oct 2020", "Interview Descriptions": "Friendly, kind manager. We used zoom for the interview because of COVID, they all seem very nice and accommodating. They didn’t make it awkward and seemed like they didn’t micro manage their employees.", "Interview Questions": "Just brief questions regarding work ethic. Etc "}, {"date": "15 Oct 2020", "title": "Patient Tranporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health (Oak Lawn, IL) in Sept 2020", "Interview Descriptions": "The interview process was very easy it was fun it was very easy because we did it over a zoom call which made it very much easier on everything to expect is just be prepared for different questions because the questions are different for everything so just", "Interview Questions": "The normal set of questions "}, {"date": "16 Aug 2020", "title": "Phlebotomy Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Advocate Aurora Health", "Interview Descriptions": "easy they basically will hire anybody.. the environment seems unprofessional very childish atmosphere....high turnover....seems like they do alot of classes probably due to the high turnover rate. some employees were not very welcoming either which is really sad.", "Interview Questions": "why do you want to work here"}, {"date": "18 Oct 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Advocate Aurora Health in Aug 2020", "Interview Descriptions": "Process consisted of several rounds. First round was a HR screening call, then it was with the hiring manager, a peer interview and then finally a project presentation with department leadership.", "Interview Questions": "Typical corporate questions such as how do you manage conflict, describe your strengths, etc. Few technical questions. Most about personality and fit."}, {"date": "1 Sept 2020", "title": "Audiologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Advocate Aurora Health (Milwaukee, WI) in Aug 2020", "Interview Descriptions": "Due to Covid, first interview was on phone. Professional and comfortable conversation. Many questions about history and specific \"tell me about a time\" questions. First meet/site interview, wearing masks, lasted 90 minutes.  Good conversation regarding position, not a repeat of questions.", "Interview Questions": "Tell me about a time you dealt with conflict"}, {"date": "14 Aug 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health (Chicago, IL) in Aug 2020", "Interview Descriptions": "Applied through website, received an email to set up a phone interview. Phone interview process was short and mainly just set up interview date to talk with unit manager. Interview with unit manager was virtual through teams.", "Interview Questions": "Why the cardiac telemetry unit? "}, {"date": "25 Apr 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Advocate Aurora Health in Aug 2020", "Interview Descriptions": "First a basic question and answer, job over view with the hiring rep. Followed by an interview with the manager. After the meeting with the manager to discuss the unit and ins and outs of a typical day there is a peer review interview. This tends to be informal with a few members on staff, this is the best time to ask specifics about the unit from the people who you will potentially be working with.", "Interview Questions": "Tell me about a difficult encounter with a patient, family member or peer. "}, {"date": "27 Jul 2020", "title": "Anonymous Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health", "Interview Descriptions": "I applied online and was contacted via email for an interview. I did a phone interview as well as one with supervisors. The questions were pretty basic and everyone seemed very nice.", "Interview Questions": "How you handled a difficult coworker"}, {"date": "9 Jun 2020", "title": "Anonymous Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health", "Interview Descriptions": "I received an email to schedule a time for a phone interview. The interview consisted of the usual questions: what are your strengths and weaknesses, what makes you a good fit for the job, etc. I was told that I would get a call from the hiring manager in a few days to schedule a follow up interview. I called and left H.R. a message after waiting over a week and didn't hear back. I later received an email indicating there was a change in my job application status and found out that I was no longer being considered for the position. It would have been nice for H.R. to bother to reach out and return a phone call, but I guess being considerate is too much to ask for.", "Interview Questions": "what are your strengths and weaknesses? "}, {"date": "1 Jun 2020", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health", "Interview Descriptions": "Applied online, talked with HR \r\nThen was interviewed by the unit manager. Was hired within 3 ish weeks. \r\nEasy process, managers were very nice while the interview process and same with HR. Process was overall relatively easy", "Interview Questions": "What arw your strengths"}], [{"date": "29 Apr 2022", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Advocate Aurora Health (Chicago, IL) in Jun 2020", "Interview Descriptions": "easy. not much pressure. i was called on the phone and i was scheduled for interview. basic question was asked, and it was very interactive. i was hired on the spot.", "Interview Questions": "your interest and why joining the team"}, {"date": "15 Sept 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Advocate Aurora Health in Jun 2020", "Interview Descriptions": "Screening call and interview with HR, then contacted by clinic nursing supervisor. Had virtual interview with her, then second virtual interview with other clinic  staff (clinic director, other clinic nurses)", "Interview Questions": "How do you handle multiple difficult situations coming up at once? (time management/prioritizing)"}, {"date": "16 Mar 2023", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Advocate Aurora Health in Jun 2020", "Interview Descriptions": "There were two separate interviews. The first interview was with 2-3 supervisors. The second interview was with the manager. The 1st interview was more general/typical interview questions and questions related to the position. The 2nd asked more questions related to the position and then provided time to ask questions. This is where I learned more about the work culture, job expectations, etc. By the end of the 2nd interview, I got the job offer.", "Interview Questions": "Tell me about a time you had a disagreement with a coworker, do you think you can work in a fast paced environment, tell me a time you went out of your way to help a coworker, if you had a patient message saying they were frustrated what would you do, etc"}, {"date": "27 May 2020", "title": "CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health", "Interview Descriptions": "Good. Woman was very nice and asked very good questions. Gave me time to ask questions that I had so make sure you ask what you would like to know to show interest", "Interview Questions": "Why nursing"}, {"date": "13 May 2020", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health", "Interview Descriptions": "A recruiter reached out to me via email. I had a brief phone interview. The recruiter asked my interested and arranged an interview with the unit manager. I was interviewed briefly and then received a very nice tour of the unit and hospital. I received an email within the week with a job offer.", "Interview Questions": "Describe a time you went above and beyond for a patient. "}, {"date": "21 Apr 2020", "title": "Health Unit Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Advocate Aurora Health", "Interview Descriptions": "Getting the interview I emailed a recruiter and he texted soon after. Asked what time would be best for me for an over the phone interview. We set it up for the next day", "Interview Questions": "What time is good for you?"}, {"date": "24 Mar 2020", "title": "RVT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Advocate Aurora Health (Downers Grove, IL)", "Interview Descriptions": "I interviewed over the phone because I was out living out of state at the time. The interview process was pretty seamless. The recruiter e-mailed & we arranged a phone interview for a few days later.", "Interview Questions": "In my previous experience how have I handled conflict?"}, {"date": "16 Feb 2020", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Advocate Aurora Health", "Interview Descriptions": "I had a phone interview with Hr that lasted 30 mins with standard questions. Once approved I  then a second interview with manager and lead RN. Standard interview question with a tour\r\nOf the facility.", "Interview Questions": "How I multitask "}, {"date": "26 Feb 2021", "title": "Registered Nurse, Emergency Room Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Advocate Aurora Health (Green Bay, WI) in Feb 2020", "Interview Descriptions": "Organized, efficient, pleasant. The whole process took less than two weeks. Questions were pretty typical. I felt liked I was adequately prepared for the interview. First interview was over the phone and the second interview was with 5-6 people.", "Interview Questions": "Describe yourself in 5 words."}, {"date": "20 Jan 2020", "title": "Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health", "Interview Descriptions": "This was a really disheartening discussion with an internal recruiter. My internal submission for a position was rejected within six minutes, indicating that my cover letter was not opened or read. When I first called I was lied to about the vast number of applicants with the exact title and experience. After the position stayed open for over three months and I applied to another I called again to ask about the quick rejection time to see if there were positions I might be considered competitive for if something were missing from my experience for a supervisor position to be a consideration.", "Interview Questions": "Don't you feel like your resume is a bit of a stretch for this position?"}], [{"date": "8 Feb 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health in Jan 2020", "Interview Descriptions": "I applied and someone reached out a week later to schedule an interview over the phone. The phone interview consisted of the interviewer getting to know you. I got scheduled for a second interview the same week which was a video call and more scenario based. I had the second inter ton a Friday and on Monday I received the job offer.", "Interview Questions": "Name a time there was a conflict and how was it resolved"}, {"date": "12 Jan 2022", "title": "Family Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Advocate Aurora Health (Chicago, IL) in Jan 2020", "Interview Descriptions": "Truthful, honest and openness. Staff are willing to walk you through the process of a real day in the organization. It was really good to be interviewed by the person who would be my collaborating physician. Everyone was very warm and welcoming. I received a tour of the clinic and which rooms I would work from. I was introduced to my nurse and medical assistant.", "Interview Questions": "Tell us about a time where you encountered conflict and hours did you handle it."}, {"date": "23 Mar 2020", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Advocate Aurora Health (Chicago, IL) in Jan 2020", "Interview Descriptions": "initial phone screen, follow up phone screen, in-person interview/shadow. The initial\r\nPhone screen was quick, about 15 minutes. The follow up was longer, maybe a half hour or so. In person was about two hours.", "Interview Questions": "Basic Work history questions "}, {"date": "5 Oct 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health (Aurora, IL) in Jan 2020", "Interview Descriptions": "I felt like they were just entertaining me and already had their mind made up about another candidate. The woman interviewing me was nice. I didn’t receive a second interview", "Interview Questions": "What is Your biggest weakness "}, {"date": "2 Dec 2019", "title": "Certified Medical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Advocate Aurora Health", "Interview Descriptions": "I was contacted by phone and asked if i was interested in a phone interview. I accepted and they emailed me a link to set up the phone interview. A few days later, I had my phone interview with a hiring recruiter which lasted 30 minutes.", "Interview Questions": "Why do you want to work for Aurora?\r\nAny related experience?\r\nWhat would make you a good fit for Aurora?"}, {"date": "13 Apr 2022", "title": "Business Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Advocate Aurora Health (Milwaukee, WI) in Dec 2019", "Interview Descriptions": "Long process.  Telephone, 2  F2F and panel interview.  The company takes a long time due to the number of people you would have to interview with. Overall, the people are friendly, but may not give you feedback unless you request the feedback.  The feedback will come from an Hr person.", "Interview Questions": "Tell me about a time when you have to work with a difficult person."}, {"date": "27 Oct 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Advocate Aurora Health (Crystal Lake, IL)", "Interview Descriptions": "Received an email Monday, scheduled a phone interview for Wednesday, and had an in person interview with manager on Friday. Also had a peer interview with two other nurses that day. I received a phone call a few hours later with an offer. I was surprised with how fast the process was!", "Interview Questions": "A time when you dealt with a difficult coworker & patient"}, {"date": "30 Aug 2019", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health", "Interview Descriptions": "Quick and standard questions. The interviewer seemed uninterested and did not have much to say. Did not even give me his name.  Did not know the answer to most of my questions.", "Interview Questions": "Why aurora?"}, {"date": "13 Aug 2021", "title": "Operations Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Advocate Aurora Health (Chicago, IL) in Sept 2019", "Interview Descriptions": "Overall had four interviews (HR - Hiring Manager - Medical Director, Peer), but a quick process. Two onsite in Chicago and over two the phone. Hiring decision was made within 2 months time.", "Interview Questions": "If you were in the position, what would you be three focus areas?"}, {"date": "23 Aug 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Advocate Aurora Health", "Interview Descriptions": "I met with the manager and requested to shadow the floor for a day. The interview was about 1 hr long. After the interview, the manager walked me around the unit and we set up a time for me to come in and shadow the floor", "Interview Questions": "Background/ experience"}], [{"date": "6 Aug 2019", "title": "Guest Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health", "Interview Descriptions": "Was interviewed by 3 group leaders. They sat me down in the office, looked over my resume, and asked me questions based on my experience, as well as, questions regarding how I would handle particular situations.", "Interview Questions": "What would you do if there is a long line and your coworker took too long using the restroom or stepping away from the desk?"}, {"date": "22 Aug 2019", "title": "Information Security Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2+ months. I interviewed at Advocate Aurora Health (Milwaukee, WI) in Aug 2019", "Interview Descriptions": "Submitted on 7/14 total of +60 days\r\n+30 days call from recruiter\r\n+7 days another call from it person to schedule\r\n+14 days schedule an interview via Skype on August 5\r\n+14 days interview with Director Cyber and Manager \r\n+7 I called HR follow-up\r\n+2 I called again. She told me \"Too ambitious and get bored\" according to the hiring team. Hilarious!\r\n\r\n1) tell about self\r\n2) what's the vulnerability management work done\r\n3) why here\r\n\r\n***Every person said they move extremely slow and nothing gets done. Be aware what your getting into\r\n\r\n**COMPLETE WASTE OF TIME DON'T INTERVIEW WITH THESE GUYS", "Interview Questions": "Tell about self"}, {"date": "17 Jul 2019", "title": "Patient Service Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Advocate Aurora Health (Kenosha, WI)", "Interview Descriptions": "Completed interview with HR rep in Kenosha and then interviewed at office position was for. Everyone was very nice, and I wish the timing was better where I could have accepted the offer for the position.", "Interview Questions": "Why I wanted to work there."}, {"date": "3 Oct 2019", "title": "HR Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Advocate Aurora Health (Kenosha, WI) in Jul 2019", "Interview Descriptions": "Interview process was not at all ideal. I applied in early June, was never phone screened, and was interviewed on-site with the VP of HR in mid-July. That was after a 3 week long game of phone tag with the recruiter. The on-site interview went well, but I never heard back regarding next steps. I withdrew from the process after 6 weeks of waiting, and was contacted by the recruiter at the end of August for a final panel interview. I asked if we could discuss benefits beforehand (because I never received an initial phone screen), and the recruiter scheduled a phone conversation that took place at the beginning of September. She mentioned again that day that an administrative assistant would contact me to schedule the on-site interview, and she even asked for dates and times that I'd be available. I never heard back since that day. I sent a follow-up email and did not receive a response. Working in HR and having a background in recruitment, I understand the importance of keeping candidates warm, but this was flat out humiliating and misleading. I was thrilled about the opportunity,  but now I am so grateful that I dodged a bullet. If you plan on interviewing for a position at Aurora, expect a long process with minimal communication.", "Interview Questions": "Most of the questions during the on-site interview were geared towards my background and my future career goals. "}, {"date": "27 Mar 2022", "title": "Health Unit Coordinator (HUC) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Advocate Aurora Health in Jun 2019", "Interview Descriptions": "Overall a pleasant experience. Phone interview with HR, followed by an in person meeting with the department manger. Solid communication throughout the whole process. From applicating to job offer it took 3 weeks.", "Interview Questions": "STAR question format, along with personality questions. "}, {"date": "7 Mar 2020", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health in Jun 2019", "Interview Descriptions": "Group interview with the nurse educator and three nursing peers for a new grad position. Questions asked were pretty standard. Everyone was friendly. Interview was brief followed by a quick tour of the unit.", "Interview Questions": "Why are you interested in critical care nursing?"}, {"date": "14 Oct 2019", "title": "Patient Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Advocate Aurora Health (Kenosha, WI) in Jun 2019", "Interview Descriptions": "Straight and to the point but also very friendly and open. After the interview, my now boss walked me around the clinic, introduced me to everyone and I shadowed with my future fellow PSR's for about an hour.", "Interview Questions": "Why do you think you'll be a good fit here?"}, {"date": "8 May 2019", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Advocate Aurora Health", "Interview Descriptions": "apply, get phone interview with recruiter, get passed to management, interview in person, get hired. Once hired, then you will do a background check and then take a hair sample drug test. Then orientation and then you will eventually branch off to your department.", "Interview Questions": "why do you want to work here"}, {"date": "3 Jun 2019", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Advocate Aurora Health (Green Bay, WI) in May 2019", "Interview Descriptions": "Immediate response from Recruiter; took months to get an interview.  Weeks after interview no response. A great company I would love to work for.  Very busy, very focused on health and well being of community, patients, and employees.", "Interview Questions": "Discussed strengths, how you handle stressful situations, flexibility in work location"}, {"date": "14 Oct 2019", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Advocate Aurora Health (Milwaukee, WI) in May 2019", "Interview Descriptions": "3 different interviews, which relate to getting to know the interviewee better. Very easy and comfortable process that exposes the type of person the interviewee is, the type of employers you will be working for, and also the job that you may be performing.", "Interview Questions": "why do you want to work here?"}], [{"date": "14 Oct 2019", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Advocate Aurora Health (Oak Lawn, IL) in May 2019", "Interview Descriptions": "I was interviewed by 6 employees varying in different jobs on the unit in a private room. They each asked me a question about myself to see if I would be a good match for the unit.", "Interview Questions": "Why do I want to work on the specific unit, have I ever had any conflict with employers or coworkers, scenario questions, and questions about my previous work history."}, {"date": "28 Apr 2019", "title": "Senior Software Developer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Advocate Aurora Health (Milwaukee, WI)", "Interview Descriptions": "They have you do live coding exercises in visual studio which can be a bit stressful, but they let you talk things out with them and they give some help. They ask an array of object-oriented concept questions. They also interview in a group, which can be a little overwhelming, but people were nice.", "Interview Questions": "Describe the concept of polymorphism."}, {"date": "18 Apr 2019", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health", "Interview Descriptions": "Phone interview with HR.  Followed by in person interview with unit manager and maybe also assistant manager. Finally, a peer interview with two or three nurses from the unit.", "Interview Questions": "How would you deal with conflict with another coworker? Describe a time when you went above and beyond for a patient."}, {"date": "7 Jun 2021", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health (Aurora, IL) in Apr 2019", "Interview Descriptions": "Easy Interview process. Met with supervisor and manager. After interviewing,  I was offered the position either the same day or the next day. It was my first interview ever and I had no problem.", "Interview Questions": "What are my weaknesses and strengths in the medical field "}, {"date": "4 Jul 2019", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Advocate Aurora Health (Downers Grove, IL) in Mar 2019", "Interview Descriptions": "Applied for job through their portal as a reference from someone else who works there.  Got a call from HR to screen me and then was setup with an interview time. Met with the individual who would be my manager and went home. Got a call from HR to schedule a second interview with the director and a peer panel. Interview times were only available on a day I said I absolutely could not do, but made it work.  Did the interviews and went home. I sent a thank you after the interview and waited. I followed up with them twice: one week later, and then two weeks later. No responses with a status. No rejection notice. Absolutely nothing.", "Interview Questions": "How do you stay up-to-date with trends and changes in the industry?"}, {"date": "12 Sept 2022", "title": "Nurse Practitioner Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Advocate Aurora Health (Chicago, IL) in Mar 2019", "Interview Descriptions": "3 interviews (site, director, hospital). 4+ hours spent interviewing for one site. Overall average experience. Recruiter was not very professional during the process which was frustrating.  Site management and clinical staff were nice to interview with.", "Interview Questions": "Mainly about previous experience and availability."}, {"date": "17 Apr 2019", "title": "Rehab Aide Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2 months. I interviewed at Advocate Aurora Health (Milwaukee, WI) in Mar 2019", "Interview Descriptions": "I applied the week before got a call the following Monday. I enjoyed the interview with the HR rep she was really nice and easy to talk to. A week later got a call from the administrator interview for the following week. Second interview was average, fairly easy questions. I got called for a last minute interview 3 weeks later. I met with administrator and lead.  Same questions from previous interview were asked.  It’s been a month haven’t heard anything assume I didn’t get the job. Oh well (:", "Interview Questions": "If I was a object an office what would I be and why?"}, {"date": "13 Mar 2019", "title": "RN Staff Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Advocate Aurora Health (Chicago, IL) in Feb 2019", "Interview Descriptions": "Call and screened then set up another phone interview the next week.  I was called 30 minutes early for the second interview, and was interpreted by the interviewer three times during the interview. She also seemed to want to get the interview over with as soon as possible... The first phone interview went really well though!! I will still apply to jobs here!!", "Interview Questions": "Tell me what your strengths are?"}, {"date": "9 Feb 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Advocate Aurora Health (Libertyville, IL) in Feb 2019", "Interview Descriptions": "I attended the career fair at Advocate condell in Libertyville. I met with the manager, she asked some questions about my resume, behavioral questions, and nursing care questions. She asked me to come for shadow and peer interview.  I shadowed for 4 hours and peer interviewed with 4 nurses. I was offered a job next day.", "Interview Questions": "How do you deal with confrontation?  if a patient was scheduled for cardiac cath, patient tells you he doesn't know what the procedure is about or what will happen, what would you do? "}, {"date": "29 Apr 2019", "title": "Surgical Technologist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Advocate Aurora Health in Jan 2019", "Interview Descriptions": "Wait up to 3 months for a call to get phone interview. Then location interview to meet manager. Not a very long interview with manager. She talked a lot about her vision for the department. She seemed like a dictator.", "Interview Questions": "Why do you want to work here?"}], [{"date": "13 Sept 2019", "title": "Benefits Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Advocate Aurora Health (Chicago, IL) in Jan 2019", "Interview Descriptions": "The interview was like any other interview. Very basic questions . There was  a panel of us to 3 people all taking turns asking questions. Overall, the experience was like every other interview I had done. As long as you answer questions honestly and try to tie in what Advocate is about then you should be perfectly fine.", "Interview Questions": "Why did you apply for this position?"}, {"date": "20 Jan 2022", "title": "Credentials Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Advocate Aurora Health (Oak Lawn, IL) in Jan 2019", "Interview Descriptions": "Interview was over the phone first with the company, then I went in person and interviewed with manger then the whole group.  They then called me and gave me an offer, I countered offer them and they gave it to me.", "Interview Questions": "Where do I see my self in five years.\n"}, {"date": "3 Feb 2019", "title": "Physician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Advocate Aurora Health (Kenosha, WI) in Dec 2018", "Interview Descriptions": "General interview process for a physician. Took about 5 hours. Overall it was a casual interview until I was in the room with nursing managers or some nurse leadership who asked me some questions which in my opinion did not make sense. After that the recruiter told me I would get a call within a week or 2 after the interview.  I did not expect the acceptance but just a follow up if they still considered me. No response for a month. I then texted the recruiter and was given an answer that they were still interviewing more candidates. All i want was were they leaning toward yes or no but they made me wait for 2.5 months. Stay away from this organization.  Very unprofessional!", "Interview Questions": "They asked me why I wanted to practice there. How many procedures have I done? What I was looking for in the practice. There were interview questions from the nurses as well which were like they were from textbooks.  I didn't really know the objectives of that. It look faked to me."}, {"date": "12 Apr 2019", "title": "Nurse Extern II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Advocate Aurora Health in Nov 2018", "Interview Descriptions": "fairly easy, laid back once I got an interview. I had a few interviews through this company that I was stood up for. I tried at 3 different locations and only one manager showed up to a scheduled interview. the recruiter was very apologetic for the other managers.", "Interview Questions": "why did you choose this company, where do you see yourself within the next few years"}, {"date": "26 Apr 2021", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Advocate Aurora Health in Aug 2018", "Interview Descriptions": "Interview with HR Representative over phone first. Then met supervisor for in person interview. Fairly standard questions, everyone was very pleasant and amicable. They both made me feel comfortable like I was having more of a conversation than being interviewed.", "Interview Questions": "Tell me a little more about yourself.\nTell me about a time you faced conflict with a co-worker and how was it resolved?\nIf I asked some of your former co-workers how they would describe you, what would they say?"}, {"date": "7 Aug 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Advocate Aurora Health (Park Ridge, IL) in Aug 2018", "Interview Descriptions": "A week after I applied I was contacted by a recruiter who screened me. As a former Advocate employee (PCA), my process was a bit different. After that call, we selected an interview date and time to meet with the unit manager. On my interview day, I met with the unit manager and she gave me a tour of the unit. I met with some of the nurses on the unit. A day later I received an offer.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "14 Jul 2018", "title": "Specialty Pharmacy Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Advocate Aurora Health (Appleton, WI) in Jul 2018", "Interview Descriptions": "After I had applied, a recruiter for this position decided to give me an unsolicited phone call at my current place of employment. This was both extremely embarrassing and awkward for me as I was trying to teach  a student and I was surrounded by other staff. During the phone call the recruiter told me the position was for a Long Term Care pharmacy supervisor. This make the position description totally inaccurate, since specialty pharmacy and long term care pharmacy are completely different. If the description was correct I would have never applied for this position.", "Interview Questions": "N/A"}, {"date": "29 Nov 2021", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Advocate Aurora Health in Jul 2018", "Interview Descriptions": "It was informal and took about an hour. A tour was provided, and all staff greeted me on each floor. It seems like a great environment to work at.  It was more of a conversation rather than being interrogated with questions.", "Interview Questions": "what are your strengths and weaknesses?"}], [{"date": "18 Jun 2018", "title": "Rehab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Advocate Aurora Health (Oak Park, IL) in Jun 2018", "Interview Descriptions": "Was called by a recruiter and did a preliminary phone interview and that was the time where we set up a time to meet with the tech coordinator. After the first interview, the following week I came in for a peer interview with 2 techs and a PT.", "Interview Questions": "What kind of values would you bring to the team?"}, {"date": "30 Sept 2018", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Advocate Aurora Health (Milwaukee, WI) in Jun 2018", "Interview Descriptions": "Very relaxed interview. Hiring manager very professional and easy to interview with. I felt all my questions were answered and it was a positive experience. I would say it was one of the best interviews I ever had.", "Interview Questions": "Name a time when you made a mistake and how was it handled?"}, {"date": "24 Feb 2019", "title": "FNP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Advocate Aurora Health (Chicago, IL) in Jun 2018", "Interview Descriptions": "Phone interview with the recruiter then received an email that they'd move forward with a face interview. After 2 weeks received an email from the recruiter with the job offer.", "Interview Questions": "Asked my previous experience. Why I want to work for Advocate"}, {"date": "26 Aug 2018", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Advocate Aurora Health (Libertyville, IL) in Jun 2018", "Interview Descriptions": "Send resume, called in for interview, interview is 2 parts, one part with HR and another with a manager of the unit you applied for, then wait for a return call to see if you got the job", "Interview Questions": "What experience have you had in the past related to this position"}, {"date": "3 Jun 2018", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Advocate Aurora Health (Kenosha, WI) in Jun 2018", "Interview Descriptions": "Great interview process. Phone interview with a recruiter, then with the hiring manager, shadowed on the floor, then was offered a position a week later. It is a long interview process though. It look about a month and a half.", "Interview Questions": "Explain a time you saw someone do something inappropriate and what did you do. Name three strengths and two weaknesses. Where do you see yourself in five years. Why nursing."}, {"date": "4 Apr 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Advocate Aurora Health (Chicago, IL) in Apr 2018", "Interview Descriptions": "Apply online, Hr Called interviewed and scheduled a interview with the floor manager.  Was very nice and understood that you might be nervous . Asked questions that I found on here.", "Interview Questions": "Why Nursing?"}, {"date": "30 Jul 2018", "title": "Family Nurse Practitioner Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Advocate Aurora Health in Apr 2018", "Interview Descriptions": "Many phone interviews, and the first one caught me off guard as it was many months after I had originally applied.  It took to the fourth dialogue encounter (this one in person) to really dig into the depths of what the position details were - mainly because everyone I talked to prior didn't' have the answers. The in-person interview was scheduled for an hour - lasted over 90 minutes. While it went well, it was also a bit disjointed at times between the individuals interviewing me.", "Interview Questions": "Typical \"name a time where you had to deal with a difficult provider\".  Sometimes the dialogue was quite vague leading up to the question that wanted specifics, left little time to really process how to answer the questions.  "}, {"date": "7 Jan 2019", "title": "HUC Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Advocate Aurora Health (Milwaukee, WI) in Apr 2018", "Interview Descriptions": "Fast at first but then slowed down one I started dealing with manager.  I was told I would get phone calls from manager by a certain date and didn't on multiple occasions.", "Interview Questions": "How do you deal with an employee you don't get a long with?"}], [{"date": "21 Jan 2020", "title": "PSAR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Advocate Aurora Health (Milwaukee, WI) in Apr 2018", "Interview Descriptions": "Quick.  Had a job within a few weeks.  However, I heard from others their interview process was a few months.  Applied online, then got an email asking to set up a phone screen.  Talked with a recruiter who then sent my information over to the manager who I had a group interview with.  After the interview I was shown the facility which I thought was a good sign.  I received a call the following week stating I had got the job.", "Interview Questions": "Tell us about yourself? Why do you want to work for Aurora?"}, {"date": "2 May 2018", "title": "Phlebotomist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Advocate Aurora Health (Milwaukee, WI) in Apr 2018", "Interview Descriptions": "After submitting several applications and several weeks, I had a phone interview for a position which I did not get. A few more applications and I received a call for an in person interview, which I thought went very well, was taken on a tour of the area, meet other employees, etc. everyone seemed so nice and interested in me. Week and a half later received an e-mail that they selected another candidate. Applied for more positions, website states I'm \"being considered\" Hopefully I'll receive a call and or offer for that position! It just seems to be taking a long time!", "Interview Questions": "What was your proudest moment as a Phlebotomist?"}, {"date": "7 Jun 2019", "title": "Senior Applications Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Advocate Aurora Health (Oak Brook, IL) in Mar 2018", "Interview Descriptions": "Phone interview with H.R.  Next on-site with hiring manager. Possibly a third if you got that far.\r\nTwo separate contacts stated they would notify of next steps. Was Ghosted after the first interview never heard from them again. Did receive an interview survey about how the company did, which seemed pretty rude and unprofessional considering they also \"Ghosted\" me on the interview process.", "Interview Questions": "Why Advocate? Tell me about yourself? What are your strengths and weaknesses. Have you done this technology or that technology? "}, {"date": "14 Jul 2022", "title": "Nutritional Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Advocate Aurora Health (Barrington, IL) in Jan 2018", "Interview Descriptions": "first there was a phone screen with HR. Then they set up an interview with the department manager. Questions were behaviorally based, and personality based like strengths, weaknesses and then asking about long term goals.", "Interview Questions": "Describe a time you dealt with a difficult client. "}, {"date": "7 Dec 2021", "title": "Sterile Processing Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Advocate Aurora Health (Chicago, IL) in Mar 2017", "Interview Descriptions": "Fun company to work with great people great staff. One of the top hospitals I know of, I was interested from visiting a friend who was a patient there awhile back", "Interview Questions": "How  would you describe yourself "}, {"date": "31 Jul 2019", "title": "PSR Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Advocate Aurora Health (Milwaukee, WI) in Feb 2017", "Interview Descriptions": "1st will be an interview with HR then supervisor of department . Then it will take months to hear back if they have an offer or not. They process takes forever", "Interview Questions": "Tell me about a time you went above and beyond. "}, {"date": "16 Aug 2019", "title": "Schedule Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Advocate Aurora Health (Downers Grove, IL) in Jan 2017", "Interview Descriptions": "The interview process was pretty simple. Meet with the manager first and then I met with 3 members of the team all together.  The manager pretty much prepared me to meet with the team because I believed me liked me that much and wanted them to like me as well.  It was very nice of her to do that.", "Interview Questions": "How did you handle a difficult situation in your previous position?"}, {"date": "18 Apr 2019", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Advocate Aurora Health (Chicago, IL) in Sept 2015", "Interview Descriptions": "1:1 with the manager, she asked me several questions on my interview. Familiarized me with all the clinics I would have to go to, introduced me to all the staff on the team.  Overall it was a great experience.", "Interview Questions": "Why do I want to work for Advocate?"}]]