[
    [
        {
            "date": "8 Jan 2023",
            "title": "Teacher Assistant Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Average Interview",
            "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Puerto Rico (San Juan, PR) in Oct 2022",
            "Interview Descriptions": "The interview was good, they made me feel comfortable the whole time. Once I was accepted they helped me out with all the documents to get into the University. Very recommended",
            "Interview Questions": "Why did I want to be part of the University? Questions about my previous jobs"
        },
        {
            "date": "25 May 2022",
            "title": "Web Designer Interview",
            "results": "Accepted Offer",
            "experience": "Negative\nExperience",
            "difficulties": "Average Interview",
            "Application Type": "I applied through college or university. I interviewed at University of Puerto Rico",
            "Interview Descriptions": "Three rounds of interviews and a final approval from the program leader. Inquisitive on the details and how was *my* process into understanding and delivering what was requested and in compliance with the standards.",
            "Interview Questions": "What are some bad examples of web design?\n"
        },
        {
            "date": "6 Apr 2022",
            "title": "Student Library Assistant Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Easy Interview",
            "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Puerto Rico (San Juan, PR)",
            "Interview Descriptions": "Fue super super facil.  No me preguntaron sobre experiencia ni nada por el estilo.  Es perfect para estudiantes full time que necesitan pal de pesos. Me llamaron y me preguntaron sobre mi disponibilidad.",
            "Interview Questions": "Lo unico que me preguntaron fue mi disponibilidad y me pidieron la copia de mi programa de clases."
        },
        {
            "date": "1 Aug 2021",
            "title": "Nursing Student Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Easy Interview",
            "Application Type": "I applied online. The process took 7+ months. I interviewed at University of Puerto Rico (Mayaguez, PR) in Jan 2018",
            "Interview Descriptions": "I did not have an actual interview when applying to  the BSN, so I can not have an opinion about that I am just trying to continue in the page so ignore this!",
            "Interview Questions": "I do not really I did not have interview (im just a student)"
        },
        {
            "date": "24 Aug 2018",
            "title": "Graduate Research Assistant Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Average Interview",
            "Application Type": "I applied online. The process took 1 day. I interviewed at University of Puerto Rico (San Juan, PR) in Feb 2015",
            "Interview Descriptions": "One on one with the supervisor and co-worker. They ask typical interview questions such as how would you describe your work ethics and how do you see yourself in 5 years from now.",
            "Interview Questions": "Are you fully bilingual?"
        },
        {
            "date": "4 Aug 2014",
            "title": "Makeup Artist Interview",
            "results": "No Offer",
            "experience": "Positive Experience",
            "difficulties": "Average Interview",
            "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Puerto Rico",
            "Interview Descriptions": "I have been a poffecional makeup rtist for the past 9 yaers I am now 21 yaers old I have all my paper work and everything. I had to wait 3 week to get called for and interview and it was better than I people had told me it was going to be. I have had a great experience using glassdoor.com",
            "Interview Questions": "Can you do a tattoo on my back?"
        },
        {
            "date": "3 Jun 2015",
            "title": "Student Assistant Librarian Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Easy Interview",
            "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of Puerto Rico (San Juan, PR) in Aug 2013",
            "Interview Descriptions": "Really smooth. Interviewer was really good. The interviewer was always asking me to be relaxed and calmed. Also tge greeted me really nicely. Plus my former boss where right next to my interviewer.",
            "Interview Questions": "What are your plans for the future?"
        },
        {
            "date": "16 May 2014",
            "title": "Translator Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Easy Interview",
            "Application Type": "I applied through college or university. I interviewed at University of Puerto Rico (Mayaguez, PR) in Oct 2012",
            "Interview Descriptions": "I first heard of the job opening through a message sent through the University of Puerto Rico's students' email system. I replied to the message, sent a resume, and received a reply message fairly quickly. When I went for the interview, it was very informal and friendly. I met with two of the staff, and they asked me about my background, language skills, typing skills, and how well I could use web searches, computer programs, etc. \r\n\r\nThen they gave me a few paragraphs of text, and asked me to translate it. They would rate me in terms of speed, accuracy, etc. Once I handed in my translation, I was asked to go home while they compared and read through the paragraphs other interviewees and myself handed in.\r\n\r\nThankfully, I was informed that I got the job that very same afternoon! And I've been there since.",
            "Interview Questions": "Nothing, really. Just the translation sample, which was about microorganisms I knew nothing about!"
        },
        {
            "date": "3 Sept 2012",
            "title": "Director of External Resources Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Difficult Interview",
            "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at University of Puerto Rico (Carolina, PR) in Jul 2012",
            "Interview Descriptions": "Interviews with Chancelllor and Deans.  Written sumamry of proposals.  Curriculum Vitae.",
            "Interview Questions": "How much money can bring in next month?"
        },
        {
            "date": "29 Oct 2015",
            "title": "Jornal Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "N/A",
            "Application Type": "The process took 1 day. I interviewed at University of Puerto Rico (Rio Piedras, PR) in Jun 2011",
            "Interview Descriptions": "Good; very short and quick they like to ask about how you are doing in school before you work with them as a student working part time. Usually is best if you provide an actual class schedule so it’s easier for them from a time management perspective to decide if you are a good fit. The training is always a learning process.",
            "Interview Questions": "Insights are about how you are as student and time management with class schedule"
        }
    ],
    [
        {
            "date": "24 Oct 2012",
            "title": "Administrator Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Easy Interview",
            "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at University of Puerto Rico (San Juan, PR) in Jun 2009",
            "Interview Descriptions": "I've been working here for more than 10 years and this position was offered by me by the Intitution Administration.  I had a very short interview and it was based on my desire to be promoted.",
            "Interview Questions": "My salary requirement.  I was unsure about the amount of money that I should ask."
        }
    ]
]