[[{"date": "21 Nov 2022", "title": "Senior Marketing Strategist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northern Alberta Institute of Technology", "Interview Descriptions": "One interview with 5 people. Then asked to complete an assignment over the weekend, which was quite time-consuming and leads me to believe they were using candidates' ideas to utilize in their own marketing plans, which is ridiculous. After I completed the assignment, I had to follow up with the HR Professional to confirm the assignment was received. The HR professional had stated they would be in touch in the next couple of days and the team is in process of reviewing it. But I never heard back. Later found out they hired an internal candidate... not sure why they would waste other candidates time.", "Interview Questions": "How do you utilize content marketing in your marketing campaigns? NAIT's biggest competitors that aren't academic institutions?"}, {"date": "2 Nov 2022", "title": "Accounting Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northern Alberta Institute of Technology", "Interview Descriptions": "Got a call about a week after the opening closed. Typical interview questions, about 30 mins. Interview was on Microsoft Teams, had the opportunity to ask questions at the end of the interview.", "Interview Questions": "What is your 5 year plan, how do you deal with stress"}, {"date": "18 Oct 2022", "title": "Accessibility Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB) in Oct 2022", "Interview Descriptions": "The interview was done by an Admin and a senior accessibility specialist. They asked around 12 questions: situational ones mostly. They were open to give me explanations and to lead me into the right direction.", "Interview Questions": "When you read the job description what did you find most challenging? How fast could you learn it?"}, {"date": "29 Sept 2022", "title": "Plumbing Instructor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northern Alberta Institute of Technology", "Interview Descriptions": "Panel interview with chair, department head and hr. Pretty basic questions relating to experience and how to deal with apprentices. Thought it went well. They ended up doing an internal hire", "Interview Questions": "If two students were having an issue and disrupting class, what would you do?"}, {"date": "31 Aug 2022", "title": "Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB) in Aug 2022", "Interview Descriptions": "Although it was not too bad, their final decision was not announced! I was disappointed! Not responding is weird and unprofessional, but at least they could have informed me I was not accepted!", "Interview Questions": "Both general questions and some specific ones regarding my skills and experience"}, {"date": "23 Nov 2021", "title": "Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB) in Aug 2021", "Interview Descriptions": "Standard HR phone interview, then group interview with the hiring manager, HR, and Team Lead. \nSecond interview was a group interview where I then received a project to write a mini case study.", "Interview Questions": "Tell me about a time you've dealt with adversity in a project. "}, {"date": "8 Jul 2021", "title": "Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Northern Alberta Institute of Technology", "Interview Descriptions": "With a panel of subject matter experts. Direct question. What’s nice about them, is that they share their feedback even if you don’t get the job. Solid feedback with details", "Interview Questions": "How do I keep myself updated with the latest marketing topics and trends?"}, {"date": "5 Aug 2021", "title": "Senior Technical Lead Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB) in May 2021", "Interview Descriptions": "The interviewing team (manager of the team, 2 team members, and an HR member) seemed very interested in having a conversation about the role and to become to understand me.  It was very human, and it was striking, because I've had some many soul-less 'we're doing you a favour even talking with you' interviews.\r\n\r\nThos interview gave me a very positive impression of the team and the work environment in this area of NAIT.  I knew very much that I would love to work in this environment (which was not the case, unfortunate for me, fortunate for another candidate).\r\n\r\nThe questions were some around background, some technical questions (which were subtly social-based), and some \"describe a bad work situation where <...> happened\".", "Interview Questions": "How would you handle a situation where a customer kept pressuring for more work out of the team?"}, {"date": "24 Sept 2021", "title": "Senior Software Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB) in Mar 2021", "Interview Descriptions": "An initial, informal, half hour meet and greet over coffee with HR and a manager to get acquainted, so they could get a feel for personality fit and talk about the project. \n\nThe actual interview was about an hour, focusing mainly on higher level project management, organizational skills, and personality fit. Very light on technical questions, and there was no 2nd round interview.", "Interview Questions": "Past experience - How does your past experience apply to this position and what makes you excited about this position at NAIT?\n\nOrganizational skills - How would you deal with organizing tasks to meet deliverables; how  would you deal with conflicting deadlines if your manager is on vacation. What is your experience with project tracking software and managing a small team\n\nHow would you deal with conflict with a coworker"}, {"date": "1 Mar 2021", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northern Alberta Institute of Technology", "Interview Descriptions": "Two interviews. First with HR rep and a few team members. Second with the entire team.\r\nTook a month to get called for an interview, them two more weeks to get the answer.", "Interview Questions": "-Talk about previous projects related to position"}], [{"date": "30 Mar 2023", "title": "Health and Safety Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB) in Feb 2021", "Interview Descriptions": "It was straightforward and refreshing. I was asked to talk about myself, my strengths and weaknesses and other behavioural questions. Compensation and benefits were discussed, as well as how long it would take me to start working if I accepted the offer", "Interview Questions": "What are your weaknesses and strengths"}, {"date": "8 Apr 2020", "title": "Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB)", "Interview Descriptions": "It was fast and very interactive. The interviewers were very accomodating and helpful; The coordinator was friendly and gave me adequate information about the job. NAIT's overall interview process is fast and it was clear for me to understand.", "Interview Questions": "How do you overturn a bad experience of a customer?"}, {"date": "5 May 2023", "title": "Clerk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB) in Jan 2020", "Interview Descriptions": "before interview, submitted resume through indeed canada. during the interview process,, it was good, follow STAR method, approachable interviewer, no dresscode , panel interview , it was not that long took abot thirty minutes.", "Interview Questions": "tell me something about you"}, {"date": "31 Jul 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northern Alberta Institute of Technology", "Interview Descriptions": "It was a run of the mill behavioural based interview. For example, What would you do if...\r\nThe HR and manager were friendly enough. Overall it was a positive experience-- nothing negative but nothing exciting either.", "Interview Questions": "Tell us about a time you had a conflict and how you handled it."}, {"date": "10 Jul 2023", "title": "Student Service Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB) in Jun 2019", "Interview Descriptions": "Was a 3 step process - interview, take home assignment, then mini interview to meet team. Very important for this role as it is very important to hire the right person.", "Interview Questions": "Role playing giving directions for coffee"}, {"date": "8 Aug 2019", "title": "Communications Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB) in Feb 2019", "Interview Descriptions": "The interview process was quick. I was offered the job in less than a week. There were three people on the panel and it took about one hour to complete the interview. Nothing major.", "Interview Questions": "What do you know about NAIT"}, {"date": "13 Dec 2018", "title": "Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northern Alberta Institute of Technology", "Interview Descriptions": "4 people interviewing. They asked some technical questions by providing examples.  Wanted to explain what I have done till now and what my goals are. Each person asked about 4 questions", "Interview Questions": "Explain what you do in your position now."}, {"date": "24 Apr 2018", "title": "Help Desk Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB) in Jan 2018", "Interview Descriptions": "It was technical interview, with situation based questions. One week notice for in person interview. Group panel of three employee, one from HR and other two from the department conducted the interview.", "Interview Questions": "What motivates you to go to work?"}, {"date": "23 Aug 2017", "title": "Director of Business Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB) in Aug 2017", "Interview Descriptions": "The interview was a panel setting, with one human resource representative and four from within the working groups.  Each took a turn in asking a prepared question on behaviour based situations, and all five took notes on the responses. The interview was scheduled for one hour and started 15 minutes later than planned.", "Interview Questions": "The questions were behavioural based on situations from past working experiences."}, {"date": "18 Mar 2017", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB) in Mar 2017", "Interview Descriptions": "I applied online for the project management position, two weeks later received a phone call to invite me for an interview, followed by a details email, they asked me to bring project portfolio documents with me. The Intrivew panel included three people ( HR, PMO manager and an IT manager).", "Interview Questions": "How did you prepare yourself for this interview?"}], [{"date": "6 Feb 2017", "title": "Eat At Nait Food Services Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB) in Sept 2016", "Interview Descriptions": "I applied online and I also I left my resume in person. I got a call like a week after. The interview was very easy and laid back, they jask you to talk about yourself and your past experiences. They will also ask you where you'd like to work in Nait", "Interview Questions": "How would you manage your studies and your work at the same time?"}, {"date": "21 Aug 2016", "title": "Team Leader, Food Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB) in Jul 2016", "Interview Descriptions": "It was a good experience as there's 5 managers from different department interviewed me. at first I was shocked because there were 5 manager sitting on the long table waiting for me. it was actually a non-stop questions so you better really know what you are applying for and make sure you really have an related experience", "Interview Questions": "tell more about your self"}, {"date": "1 Oct 2016", "title": "Space Planner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB) in May 2016", "Interview Descriptions": "Was very positive, comfortable, and questions were well written. They were open to answering questions from myself and provided honest answers so both parties could ensure the relationship was a good fit from both sides. Questions were appropriate for the position - being both complex and relevant. Preparation for the interview included understanding the work of public service as well as how an educational institution operates. Only criticism is that their HR department wasn't very helpful once an offer letter is signed. Couldn't tell me where to go my first day, what time I should be there, or how to arrange for parking. Had to track down the contact information of my reporting manager on my own and ask them.", "Interview Questions": "How I approach resolving conflict amoungst peers, leadership, and clients."}, {"date": "30 Mar 2016", "title": "Helpdesk Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB)", "Interview Descriptions": "Hiring process was average. One interview with an HR person, one manager and a supervisor. We met at an HR office on campus. All the interviewees were there sitting in the waiting area downstairs.", "Interview Questions": "Technical questions, problem resolution questions, and proudest moment / accomplishment at work. Questions about work experience and reasons for leaving previous job(s)."}, {"date": "3 Apr 2017", "title": "Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB) in Jan 2016", "Interview Descriptions": "I applied online. The process took 4+ weeks. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB) in March-2017.I applied online for the project management position, two weeks later received a phone call to invite me for an interview, followed by a details email, they asked me to bring project portfolio documents with me. The Intrivew panel included three people ( HR, PMO manager and an IT manager).", "Interview Questions": "How did you prepare yourself for this interview?"}, {"date": "17 Jul 2015", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB) in Dec 2014", "Interview Descriptions": "Interview was pretty standard, except that they called at 4 p.m. for an interview the next morning at 9 a.m. and the H.R. Dept. was sending out form requests that had been sent to other perspective employees. It had their (not my) name in the email!", "Interview Questions": "How would you handle a student putting down another student in class?"}, {"date": "1 Jun 2018", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB) in Oct 2014", "Interview Descriptions": "Pre-Screening Interview followed by face-to-face interview with a panel. The Panel consisted of a Mix of Management and Instructors. The process took a few weeks to complete and was very easy.", "Interview Questions": "Typical interview questions one would expect of a college. 30 minutes of softball questions. "}, {"date": "17 Apr 2014", "title": "SSCC Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB)", "Interview Descriptions": "Met with HR and Supervisor. Seemed rather casual and bit unprofessional. Supervisor had a weird stare and snorted at my answers. Could not believe this was even happening. Through me off and made me a bit defensive. At the end, it was clear I did not want to work with this group of people.", "Interview Questions": "How would you deal with little to no supervision? ...really? What the heck does the supervisor do then?"}, {"date": "1 Jun 2015", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB) in Nov 2013", "Interview Descriptions": "I applied online, and did not hear from them for a month or so. Then, got an email which instructed me to create  a Skype account for the interview. The interview was a panel interview. Very basic questions about the classroom management and content delivery. I found the interview to be very easy to manage. I was surprised that they did not invite for an in location interview and to give me a tour of the location. Later, found out that there is a high turn over rate, and they do not care because many hired leave before a year is over.", "Interview Questions": "Very basic and easy to answer."}, {"date": "4 Jul 2012", "title": "Enterprise Development Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB) in May 2012", "Interview Descriptions": "After receiving a phone call to set up a time, I met with 4 members of the organization: an HR rep, my two supervisors and the entrepreneur I would be working most closely with (in an assisting role).  The interview was 1 hour and gave me a few questions on what my accomplishments/workstyle was like and then gave me a chance to ask questions and tell my own story.", "Interview Questions": "How would you deal with uncommitted clients?"}], [{"date": "26 Jan 2016", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Northern Alberta Institute of Technology (Edmonton, AB) in Jan 2012", "Interview Descriptions": "Had at least 5 rounds of interviews. Extremely redundant process.  Too much back and forth on same issues. The process could have been much shorter. Lot of personality compability questions. Was asked to integrate and how would i better sure the core values of  the institute", "Interview Questions": "N/A"}]]