[[{"date": "30 Jun 2023", "title": "Office Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Rosecrance (Crystal Lake, IL) in Mar 2023", "Interview Descriptions": "To start I had three interviews. One interview over the phone, one interview was a video conference and finally an in person interview. I was greeted and interviewed by my trainer in person followed by the supervisor. Everyone was very friendly, laid back and honest. The interview process is very thorough to be sure it is the right fit.", "Interview Questions": "Why are you interested in working here?"}, {"date": "9 Jan 2021", "title": "Community Relations Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rosecrance in Dec 2020", "Interview Descriptions": "Phone interview was with HR specialist then zoom interview with the Chief VP of marketing. Interview went well but their lack of communication sucked and was ghosted after the zoom interview.", "Interview Questions": "Are you familiar with event planning and managing groups of people during event?"}, {"date": "23 Oct 2020", "title": "Community Relations Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rosecrance (Milwaukee, WI) in Aug 2020", "Interview Descriptions": "The interview process seemed to go okay initially.  I first spoke with a Rosecrance recruiter.  I was then contacted for a Zoom interview with the recruiter and marketing manager. I was told I'd hear back likely within two weeks.  It's been two months. I saw that the job for which I interviewed was continually being posted on job sites. I reached out to the recruiter via email a month ago to ask her where things landed, and I never received a response. Obviously, safe to assume I was not a final candidate, but the courtesy of a follow up would have been appreciated.", "Interview Questions": "Are you familiar with southeast Wisconsin?"}, {"date": "6 Jul 2020", "title": "In-Home Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rosecrance", "Interview Descriptions": "super easy and to the point. Asked a variety of questions. Questions ranged from easy to more thought provoking questions. Now I wait for a follow up interview and hopefully get a call back.", "Interview Questions": "why are you a good fit for rosecrance?"}, {"date": "3 Feb 2020", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Rosecrance (New York, NY)", "Interview Descriptions": "They tested my skills in different ways and skills I was able to do it\nThey tested me to see if I can proform at different levels and \nType of jobs", "Interview Questions": "what are my skills"}, {"date": "3 Sept 2019", "title": "Unit Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rosecrance", "Interview Descriptions": "Easy enough, two or three phased interview process, including a background check and a drug test, along with a shadowing opportunity. They hired me faster than expected, but that's seems to be because the job is a revolving door.", "Interview Questions": "Usual things asking what experience I had that would make me a good fit, etc..."}, {"date": "24 Feb 2019", "title": "Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rosecrance", "Interview Descriptions": "Brief and to the point.  The process is direct.  Prepare great questions in advance.  Interviewers were easy to talk to and did not create unnecessary tension.    They are friendly and approachable.", "Interview Questions": "How do you handle stress"}, {"date": "22 May 2019", "title": "Human Resources Data Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 7 weeks. I interviewed at Rosecrance (Rockford, IL) in Dec 2018", "Interview Descriptions": "Interview was conducted by two members of the Human Resources department. One was a senior member. They took turns asking questions. It was a friendly yet serious environment. They asked about background and explained the role responsibilities, which was very helpful to understand the expectations.", "Interview Questions": "Q: What makes you as a candidate a good fit for this role? "}, {"date": "28 Nov 2018", "title": "HR Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rosecrance", "Interview Descriptions": "Lengthy, yet thorough. However, I had two interviews and after the second one I heard absolutely nothing. I never received a call or even an email back. Very discouraging and makes me think poorly of this company. It is not that hard to send someone a rejection email and it’s also common courtesy.", "Interview Questions": "Experience questions. She mainly talked about Rosecrance."}, {"date": "17 Sept 2018", "title": "Receptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rosecrance in Aug 2018", "Interview Descriptions": "Was interviewed very intensely by three people in an office. They asked a series of questions, some of which were very difficult to answer, such as what I would do if I was working at the front desk and someone came in and started swearing at me. I answered that I wasn’t sure because I hadn’t been trained, but I would try to calm them down. One of the interviewers immediately asked me how I would do this. It felt more like I was being interrogated than interviewed. At the end of the interview they welcomed me to come back in two days to do a shadowing of the receptionist position at one of their buildings, which I accepted. At the shadowing, they showed me every aspect the job would entail and how to do it (which forms to fill out when, how to use their computer system, what to do when answering the phones, etc). At the end, they asked if I thought I would be a good fit and I said yes. However, they didn’t contact me following the shadowing. I emailed them asking what my status was a few days after I shadowed, and they told me they were still interviewing candidates. Not until two weeks later did I get a follow-up email saying I would not be offered the position.", "Interview Questions": "Do you know what we do at Rosecrance?"}], [{"date": "4 Apr 2018", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Rosecrance (Rockford, IL)", "Interview Descriptions": "Applied online,  pretty immediate interview. The Director I interviewed with showed up late for the meeting.  The people that worked there said she is always late.    Long tine for follow up. and emailed lile 5 months later to say the position had been filled.", "Interview Questions": "What do you know about Rosecrance? "}, {"date": "11 Jul 2018", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rosecrance in Jan 2018", "Interview Descriptions": "Questions were pretty standard. Process all together took about 2 weeks. Relaxed interview with HR and a manager. Only reason I declined was because the hospital offered better pay. I’ll keep them in the back of my mind for the next time I might need a job.", "Interview Questions": "What’s something you expect to come from working for this company?"}, {"date": "1 Aug 2017", "title": "Recovery Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rosecrance (Woodstock, IL) in Aug 2017", "Interview Descriptions": "I went to the actual reccovery home I would be working in.  I went downstairs into an office with whom would be my supervisor. HR phoned in for their portion of interview. They asked a series of questions each, and answered my questions.", "Interview Questions": "How would you say you are at supervising people ? What would make you good at doing that ? "}, {"date": "11 Dec 2021", "title": "Unit Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rosecrance (Rockford, IL) in Jan 2017", "Interview Descriptions": "Had three people in my interview. One came in late. Asked appropriate questions related to job. Appeared interested in being there. Appeared busy  had extra phones on them.  Had two coordinators and one HR person", "Interview Questions": "Tell me about yourself. How do you handle challenging situations. Tell me a time you gave poor customer service and how did you fix it."}, {"date": "21 Jul 2016", "title": "Process Improvement Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2+ months. I interviewed at Rosecrance", "Interview Descriptions": "I applied for the position of process improvement coordinator and about a month later received a call to interview. At said interview, I spoke with two individuals,  one who had worked in a similar position and an HR manager. The interview was standard and both individuals seemed nice. My anger with company the fact that they NEVER followed up with me after the interview,  even after I called to check on position morr than once. What's worse, this the second time this has hapoened. I applied for another potion several months earlier, was interviewed, and was never contacted again.", "Interview Questions": "Tell me about yourself,  your work experience,  etc"}, {"date": "9 May 2016", "title": "Unit Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rosecrance (Rockford, IL) in Apr 2016", "Interview Descriptions": "Applied and heard back from them the next day. Interview was scheduled for a week after the phone call. The interview was pleasant. Some behavioral questions made me think and were somewhat hard to respond to.", "Interview Questions": "What reservations do you have to accepting this position. "}, {"date": "14 Apr 2016", "title": "Unit Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Rosecrance (Rockford, IL) in Jan 2016", "Interview Descriptions": "After submitting my resume, I quickly was called for an interview. I interviewed with an HR rep and a Unit Coordinator. They asked me some difficult questions, however, they were very friendly and made me feel comfortable. The whole interview lasted about an hour.  I also asked them some questions as well to see if I was a good fit.", "Interview Questions": "Here at Rosecrance, we often deal with difficult kids who become aggressive. Tell me what you  would do if two of the kids began to fight?"}, {"date": "14 Jul 2015", "title": "Process Improvement Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rosecrance in Jul 2015", "Interview Descriptions": "I submitted an application and received a call for an interview several hours later. The interview was standard with no challenging questions. Three weeks later and I have yet to hear anything from HR, even though I followed up last week via phone. Disappointed in the interviewing process, as this is the second interview with Rosecrance in which someone has yet to follow through with me. I will not apply for another job with this company in the future.", "Interview Questions": "Describe your previous job."}, {"date": "31 Mar 2019", "title": "Recovery Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rosecrance (Rockford, IL) in Mar 2015", "Interview Descriptions": "Extremely long process.  Over 2.5 months from online application to finalized offer.  Interview process took over 3 weeks before I got a phone interview; another 2 weeks for the face-to-face interview.  I got the offer about 2 weeks later and it took another 3 weeks for the background checks to be completed.  If I wasn't already employed at the time and very eager to join this organization I don't know if I could have waited for their decision.  In the past year I've seen the process streamlined and that's great so we don't lose the best candidates.", "Interview Questions": "Beside the standard \"tell us how you handled ... (challenging situation)...  they also asked about my experience and/or knowledge of the 12-Step Recovery Programs.  It is definitely NOT a requirement to be in recovery as a staff member but it is expected that you're familiar and supportive of the principles (to the extent you can communicate those effectively and convincingly to the clients). "}, {"date": "26 Sept 2014", "title": "RH Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Rosecrance (Crystal Lake, IL) in Sept 2014", "Interview Descriptions": "with in a couple of days after I applied, I received a call from an HR recruiter and was set up for an interview a few days later. I met with a team of 3 people during the interview. I was asked questions pertaining to the positionand had an opportunity to ask questions. The staff was professional, polite, and easy to talk with.", "Interview Questions": "I didn't think the questions asked were difficult"}], [{"date": "8 Mar 2015", "title": "Environmental Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rosecrance in Mar 2014", "Interview Descriptions": "Two managers and a human resources person interviewed me in an office. The department supervisor asked job specific questions and the human resources asked the more general interview type questions. About a week after I received a call offering me the job.", "Interview Questions": "Why do you think you'd excel at this job?"}, {"date": "12 Aug 2013", "title": "Unit Counselor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Rosecrance", "Interview Descriptions": "Was called for an interview several weeks after applying online and set up a time for a phone interview with HR. After that call, was given a lot of vague and conflicting information about what campus I would work at, for what pay rate and what shifts. Finally, weeks later, I was called for a second in person interview with an HR person. WEEKS after that, finally, after calling and emailing to see what was going on, I was reached for an interview with my supervisor. About a week after that, I was called and offered the job. Took about two months for the whole processes, not much communication or organization.", "Interview Questions": "What would you do if a client asked you if you were in recovery or how you \"would know anything\" if you hadn't"}, {"date": "30 Jan 2016", "title": "Psychiatric Assessment Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Rosecrance (Rockford, IL) in May 2013", "Interview Descriptions": "As a former employee of the Center for Mental Health at Swedish American Hospital I was offered the position.  All current employees had the option to keep their position.  There were no  formal interviews.  Anyone who wanted to stay was hired without a formal interview.  There was a background check and a brief interview with the new director.  It was part of the agreement with Swedish American Hospital to keep all current employees if they wished to stay.", "Interview Questions": "N/A"}, {"date": "14 Nov 2012", "title": "Mental Health Professional Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Rosecrance (Rockford, IL)", "Interview Descriptions": "The initial interview was conducted in a tiny room with two individuals interviewing me at the same time.  One would ask questions while the other scrutinized me and feverishly jotted down notes.  The blinds were pulled all of the way up, exposing me to a punishing view of the sun.  When asked if the blinds could be lowered just enough that I wasn't staring directly into the sun, one of the interviewers became annoyed with me shooting a look to her colleague that likened my reasonable request to pillaging through the candy dish on her desk.  At times, they talked over each other, and did not even allow me to answer a question before firing another at me.  Half way through the process, it felt more like an inquisition than a job interview.  I was invited back for a second interview, but the \"interview\" turned out to be four hours of being scrutinized by not only the prospective employer, but also the prospective colleagues.  This was the most bizarre and torturous interview of my lifetime.", "Interview Questions": "The majority of the questions were thinly veiled attempts to unnerve me or get me to divulge personal information.  A four hour interview is atrocious.  "}, {"date": "20 Jan 2016", "title": "Intensive Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Rosecrance (Rockford, IL) in Oct 2012", "Interview Descriptions": "Emailed resume. Phone interview followed by in-person interview with direct supervisor. Explained general responsibilities of position and allowed me to ask current employees questions. Was told what to expect if hired. Training for 2 weeks in documentation, self defense, other job requirements. Was asked if any of the information in interview was unclear or something I was uncomfortable with.", "Interview Questions": "Comfort level interacting with mentally ill clients at their residence."}]]