[[{"date": "23 Jun 2023", "title": "Product Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Parkinson's UK (London, England) in Jun 2023", "Interview Descriptions": "Two interviews, first with the line manager (pretty informal) followed by a panel interview. They provide a task for the panel interview prior to the call, and also the tentative questions.", "Interview Questions": "How do you manage product roadmap?"}, {"date": "5 Nov 2022", "title": "Product Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Parkinson's UK", "Interview Descriptions": "Consistent contact/hiring person throughout. They were very personable and highly relevant to the role. Each step was clearly outlined and explained up front so I knew what to expect and what was expected of me during each phase.", "Interview Questions": "Q: Tell us about your favourite product"}, {"date": "11 Oct 2021", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Parkinson's UK", "Interview Descriptions": "Three person panel. Questions and scored answers . One person with Parkinson’s part of the panel. Location wasn’t convenient and the feedback was limited. Took a while to get a decision re success or otherwise", "Interview Questions": "Whether I was ok with animal testing research to find treatments and if I’d give a days free volunteering to them annually at a compulsory event(!)"}, {"date": "6 Apr 2021", "title": "Senior Helpline Adviser Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Parkinson's UK in Mar 2021", "Interview Descriptions": "Before the interview, I was sent a 45-minute task to do. This task was all about interpreting data relating to call volumes, wrap times and KPIs on the helpline. The focus of this task was something of a surprise, as the job description had not mentioned numerical targets or data analysis, although I am familiar with these. The task was lengthy for the time allocated. \r\n\r\nI was interviewed via Google Hangouts by a panel of three.  The questions were lengthy and I think they all involved multiple parts, preceded by the panel reading out statements about Parkinson's UK. I found it difficult to focus my answers while trying to remember the different aspects of each question. \r\n\r\nThe panel members were otherwise friendly and professional.\r\n\r\nSix days after being interviewed, I got a system-generated email saying no job offer was being made.", "Interview Questions": "How do you feel about Parkinson's UK carrying out research using animal testing?"}, {"date": "15 Dec 2020", "title": "Copywriter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Parkinson's UK (London, England) in Jul 2019", "Interview Descriptions": "Brief task comprising copy-editing and copywriting. Then a face-to-face with the two staff members. They seemed nice. I remember there being a three-part question, though, which I would perhaps advise against. As said, interviewers seemed very nice and the organisation does great work for this cause.", "Interview Questions": "Q: Which task management software have you used in the past?"}, {"date": "11 Apr 2018", "title": "Business Support Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Parkinson's UK (London, England) in Apr 2018", "Interview Descriptions": "One interview with competency based questions based on the role. I was also asked to prepare a five minute presentation at the beginning. I was contacted the same day of the interview with an offer, which was brilliant.", "Interview Questions": "Tell us about a specific time you dealt with conflicting priorities at work?"}, {"date": "25 Mar 2018", "title": "HR Business Partner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Parkinson's UK (London, England) in Mar 2018", "Interview Descriptions": "I found the process positive and, despite not being offered the role, it left me with a very good impression of Parkinson's UK. The HR team were friendly and accommodating throughout and I received some very useful feedback.\r\n\r\nThe online application process was straightforward. I was not able to make the initial interview time but they made an effort to offer an alternative slot.  The interview process involved meeting the head of team, an interview with competency questions, and lastly a 10 minute presentation with Q&A. I enjoyed the three stage process. Meeting the head of team at the outset helped put me at ease and enabled me to find out a bit more about the role.  I also got to meet a number of team members so it felt like a more two way process and enabled me to get a feel for the culture of the organisation.\r\n\r\nAlthough I did not get offered the role the outcome was communicated to me promptly  and I appreciate that I was given detailed verbal feedback and advice that will help me in the future.", "Interview Questions": "What do you think is meant by HR Business Partnering?"}, {"date": "23 Nov 2017", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Parkinson's UK", "Interview Descriptions": "Good and quick process had named contact with HR. Online form to fill was a bit of a faff but essentially needed cv details and a personal statement tailored to the job and person spec. Quick communication to set up interview. One interview, notified same day. Delay because emails were sent to the wrong place but they sorted it out.", "Interview Questions": "Describe a project where you faced challenges. What were the issues and what did you do?"}, {"date": "19 Apr 2018", "title": "Content Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Parkinson's UK (London, England) in Nov 2017", "Interview Descriptions": "I was put forward for the role by an agency. The first stage was a timed copy test which was performed remotely, followed by a telephone interview, and then a final interview (including a 30 minute content planning task with a panel of current team members, followed by a presentation).", "Interview Questions": "What makes good web content? "}], [{"date": "10 Aug 2018", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Parkinson's UK (London, England) in Oct 2017", "Interview Descriptions": "Friendly discussion reviewing my CV with one person in the room. Questions were all valid and justified. A good experience all round, they knew what they were doing and presented a reasonable expectation about the job.", "Interview Questions": "Would I be willing to do a charitable task each year"}, {"date": "22 Oct 2016", "title": "Head of Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Parkinson's UK (London, England) in Jul 2016", "Interview Descriptions": "2 parts: team workshop with potential line reports, then presentation of results to hiring managers and competency based questions. I had no issues with the interview format itself, but was tremendously disappointed in having to chase on multiple occasions for any relevant feedback. \r\n\r\nI suspect they were after gold dust for a temp Head of role; given I had applied directly, had no offer interview, and then had 5 agencies approach me with said role. \r\n\r\nOn the plus side, the interview and pre-interview process was standard, and meeting the team was a great aspect of the interview. The major con, as mentioned before, was having to chase literally for 4 weeks to get any helpful feedback to learn from. For a senior role that I had prepared for a 2 hour interview for, this was plain unprofessional.", "Interview Questions": "Delivering end to end campaigns, supporting and disciplining staff, digital transformation."}]]