[[{"date": "12 Jun 2023", "title": "Volunteer Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at NuHealth (New York, NY)", "Interview Descriptions": "We contacted for a week. They then invited me to an interview where i explained my accomplishments and what i planned to do in the near future. You may see a lot of suffering while volunteering in this hospital. How do you plan to deal with it emotionally?", "Interview Questions": "What skills and qualifications do you have to help you as a hospital volunteer?"}, {"date": "5 Jul 2022", "title": "Resident Physician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at NuHealth", "Interview Descriptions": "Interviewed by program director and 2 APD and chief resident.  Interview was 20 minutes long each.  Learned about the resident education and schedules, salary,  and surrounding area. Batch of five other prospective residents.", "Interview Questions": "What are your goals for the next 5 years"}, {"date": "13 Dec 2021", "title": "Internal Medicine Residency Interview Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NuHealth", "Interview Descriptions": "They interview a lot of candidates on a day . They divide half of candidates to tour the hospital while other half have one on one interview with faculty . Interview candidates get to go to  noon conference with residents which is a good opportunity to show you are interactive .", "Interview Questions": "Each interviewer is different, some ask for case presentation, some just talk casually "}, {"date": "27 Dec 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at NuHealth", "Interview Descriptions": "Getting an interview at NUMC is difficult to accomplish unless you know someone in the inside. Once I had the interview they asked me basic behavioral questions. I was questioned by the DON and 2 nurse managers", "Interview Questions": "Tell me about yourself professionally and where you hope this job will take you "}, {"date": "4 Jan 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at NuHealth", "Interview Descriptions": "Great. Met with NM and hired on the spot. The process time to begin appears long and there is uncertainty as to when I would begin. I’m hearing 4 weeks to even 3 months.", "Interview Questions": "Current experience \r\nClinical experience"}, {"date": "13 Jul 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 6 months. I interviewed at NuHealth (East Meadow, NY) in Jul 2019", "Interview Descriptions": "There is absolutely no clear cut way of hiring and screening at NUMC. They have a general email inbox to forward resumes and letters of interest. Otherwise the interview process was standard. Interviewed in the unit and was toured in the area. The interviewer asked about a situation where I felt overwhelmed and how I handled it, I was asked about what patient care meant to me. Then support staff and fellow nurse were present to ask questions.", "Interview Questions": "What are your goals? Where do you see yourself in five years? How can we support you in achieving those goals?"}, {"date": "3 May 2018", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at NuHealth (New York, NY)", "Interview Descriptions": "I had to take a civil service exam for the medical assistant position  in 2008 , I score # 2 on the list I was called for a interview the year of 2010.", "Interview Questions": "My experience  as a medical also my phlebotomy experience. "}, {"date": "21 Dec 2017", "title": "Clerical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at NuHealth (Nassau, NY) in Dec 2017", "Interview Descriptions": "My interview processes was fast yet well conducted. I was interview by The center manager and a Nurse. They both asked question during the interview, testing my knowledge of the position i was interviewing as well as my past work experiences. Both seemed very determined to find the right candidate for the position.", "Interview Questions": "Why do want to work at this position and organization?"}, {"date": "16 Jul 2014", "title": "Assistant Accountant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at NuHealth (Uniondale, NY)", "Interview Descriptions": "The interview process was very fair. There were no questions I did not know how to answer. There was a curveball or 2, but I was able to honestly answer rather quickly.", "Interview Questions": "Do you have any questions for us?"}, {"date": "3 Apr 2016", "title": "Medical Coder Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at NuHealth (East Meadow, NY) in Jul 2014", "Interview Descriptions": "A Mafia goon expected me to code over 100 charts a day in an ophthalmology clinic.  I took a pass but was called back the next week to interview in the department of Medicine because they knew the first guy scared me away.  I explained to the Director of Medicine and the Acting Chief of Department that the man who first interviewed me had no idea what he was talking about.  They agreed and hired me to work directly for them in the Department of Medicine.", "Interview Questions": "If I knew how to code diagnoses in ICD-9."}], [{"date": "23 Apr 2014", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at NuHealth", "Interview Descriptions": "Answered an ad, submitted resume.  Met with recruiter and NM, was offered position that went rather quickly then.....It took forever, months to be cleared....with a background check, titers for communicable diseases, physical examination...", "Interview Questions": "N/A"}]]