[[{"date": "30 May 2023", "title": "Medical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Facey Medical Foundation", "Interview Descriptions": "I was scheduled an interview with the manager, supervisor, and a staff member. Questions were not difficult and just the usual interview questions to get to know you and how you would handle certain situations.", "Interview Questions": "Have would you handle conflict with a coworker?"}, {"date": "29 Oct 2022", "title": "RN Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Facey Medical Foundation", "Interview Descriptions": "Disorganized process to get interview. Many delays and lack of communication. The people were very nice when I finally got an interview. Very professional, but no intimidation. Great company to be with.", "Interview Questions": "Previous experience in case management"}, {"date": "8 Sept 2021", "title": "Patient Care Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Facey Medical Foundation (Burbank, CA) in Aug 2021", "Interview Descriptions": "The interview was very smooth and the hiring manager made it sound like a conversation versus a formal interview with question after question. She explained the role, company benefits, and pay range. I was offered the position two days after the interview, unfortunately, I did not accept because pay was not great.", "Interview Questions": "Tell me about yourself. What kind of experience do you have and how would it help with the position you are applying for. How do you deal with stress? What is a weakness and a strength? "}, {"date": "21 Jan 2021", "title": "Primary Care Family Physician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Facey Medical Foundation in Jan 2021", "Interview Descriptions": "Pleasant and friendly. Answered my question. Went over benefits for 30 mins. No formal questions . 2 interviews last f 30 mins each. W e r t t nanny’s she’s s dhshs", "Interview Questions": "Informal, answered questions I had "}, {"date": "4 Apr 2019", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Facey Medical Foundation (Mission Hills, CA) in Oct 2017", "Interview Descriptions": "Easy and very helpful. The process was fast and everyone I cane in contact with was nothing but welcoming and cheerful   All the employees I saw during my interview seemed happy and liked there job", "Interview Questions": "Where do you see yourself in 10 years  and how do you see yourself within this company "}, {"date": "9 Jul 2021", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Facey Medical Foundation (Mission Hills, CA) in May 2017", "Interview Descriptions": "There were two interviews that took place. One with HR and one with management. It was a very easy going and comfortable interview. Mostly asked about your experience and tried to get to know you as a person.", "Interview Questions": "Tell me a little about yourself"}, {"date": "3 Jan 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Facey Medical Foundation (New York, NY)", "Interview Descriptions": "Great easy and smooth interview. Nice supervisors in interview. Supervisors made me feel calm and answered all my questions. Interview lasted about 20 minutes and was told I will get a call from Human Resource and got a call the next day.", "Interview Questions": "Why Facey?"}, {"date": "5 Mar 2016", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Facey Medical Foundation (Mission Hill, MA) in Dec 2014", "Interview Descriptions": "It is very difficult to have sometime from human resources to call you,  you need to keep applying for months.  When they do finally call you,  you have to interview with HR first,  then they forward you information to the hiring manager,  and you wait for a call from them.", "Interview Questions": "Why do you want to work for us"}, {"date": "10 Nov 2014", "title": "Receptionist II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Facey Medical Foundation (Mission Hills, CA) in Oct 2014", "Interview Descriptions": "Applied online, received a phone call within one week, attended interview and was asked what my strengths and weakness were as an employee over a 15 minute time period. Was told I would then receive a second phone call if a supervisor was interested and would continue the interview process.", "Interview Questions": "When ever was I asked to handle a task outside of my job description, what was it and how did I handle it?"}, {"date": "11 Aug 2014", "title": "Hospitalist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Facey Medical Foundation in Jul 2014", "Interview Descriptions": "Initial contact via facey.com and in-house recruiter for Facey Medical Group, who referred you to the Chief Hospitalist for a brief phone interview. Interview day consists of meeting with Chief Hospitalist at Providence Holy Cross Medical Center for about an hour, during which you will mainly hear about the details about the hospitalist duties first, then have a brief hospital tour. After that, you meet with 2 of the administrative physicians (the President and Chair/Associate Chair of Medicine) at the same time, who will ask some basic as well as behavioral questions in a relaxed environment. These included:\r\n1. Tell us about yourself\r\n2. Why hospitalist?\r\n3. Why Facey?\r\n4. Provide an example of when you had to give bad news?\r\n5. Provide an example of when you showed leadership? \r\n6. What makes you a good fit?\r\n7. Any questions for us? \r\n\r\nThen, they would talk about the organization itself for about 20-30 mins, after which they go over the benefits and compensation.", "Interview Questions": "Nothing too difficult (see above), but asked more questions than other hospitalist interviews that I have been on. They really want to see if you are a good fit according to their mission and values."}], [{"date": "25 Jan 2014", "title": "Business Office Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Facey Medical Foundation (Los Angeles, CA) in Dec 2012", "Interview Descriptions": "Process is excellent.  Met with the hiring managers and got a reply for hire that day.", "Interview Questions": "Their position doesn’t pay as much as what you’ve earned before."}, {"date": "17 Sept 2012", "title": "Psychotherapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Facey Medical Foundation (Mission Hills, CA)", "Interview Descriptions": "My situation was unique as I was a prior coworker of our medical director.  the HR process is rather protracted unfortunately.  The interview process is standard.  As a licensed provider verification, insurance contracting, etc added time to the process.", "Interview Questions": "no surprises."}, {"date": "18 Mar 2009", "title": "Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Facey Medical Foundation (Mission Hills, CA) in Apr 2008", "Interview Descriptions": "Turned in the application, had initial interview the next day. Person I met with asked about my past experience but I got the feeling this was mainly a fact-checking exercise. Met later in the week with the department manager for a much more thorough interview. She was very friendly and asked several \"what-if\" questions. Then camethe background check, drug test, etc. The processing part of the hiring seemed really extensive.", "Interview Questions": "How do you feel about compromise when it comes to teaching people and getting their buy-in?"}]]