[[{"date": "20 Jan 2022", "title": "Reference Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bibliotheca Alexandrina", "Interview Descriptions": "Was easy and I accepted from the first interview \r\nThree people did the interview but usually it’s done with one person and it lasted for thirty minutes and they were so nice and friendly", "Interview Questions": "Questions concerning how can I deal with people directly "}, {"date": "12 Aug 2022", "title": "Tour Guide Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Bibliotheca Alexandrina (Alexandria, Alexandria Governorate) in Jan 2019", "Interview Descriptions": "I submitted the required papers. I was called back for an interview. I was asked a few questions and then I was told that I got accepted. They were really nice and fun.", "Interview Questions": "Act as if I am a tour guide "}, {"date": "10 May 2022", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Bibliotheca Alexandrina (Alexandria, Alexandria Governorate) in Aug 2018", "Interview Descriptions": "Smooth, and very effective. The questions that were asked were very important and were very friendly. No need to worry about it if you know your field and are confident in your skills", "Interview Questions": "What made you interested in this position?"}, {"date": "27 Mar 2018", "title": "Head of Unit Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Bibliotheca Alexandrina", "Interview Descriptions": "Panel Interview first then one on one interview with the department director,  the panel was a personality assessment and the one on one was more technical where the job role and responsibilities were explained and then I was asked about related previous experience and similar responsibilities.", "Interview Questions": "Your are asked to create a communications plan across Egypt to raise awareness on Egyptian Cultural Heritage, with very limited/zero budget.\r\nWhat tools do you use to ensure their effectiveness of your resources?"}, {"date": "22 Nov 2017", "title": "Head of Security Department Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Bibliotheca Alexandrina in May 2017", "Interview Descriptions": "I only had 1 interview there, there were three interviewers, all with a military background, the applications were filled in English but the interviewers chatted in Arabic, maybe to break the ice.", "Interview Questions": "what would be the first thing to do to the security plans of the Bibliotheca of you were hired"}, {"date": "24 Nov 2016", "title": "Human Resources Manager Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Bibliotheca Alexandrina (Alexandria, Alexandria Governorate) in Aug 2016", "Interview Descriptions": "all in all was good interview. though there were some defect, the interviewee was with a very serious angry face, he gave me the impression that i'm getting into debt of a fight.He told me that the place where i'm working at got no value.", "Interview Questions": "what's the color of money??"}, {"date": "21 Jul 2016", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Bibliotheca Alexandrina (Alexandria, Alexandria Governorate)", "Interview Descriptions": "I received a call after applying for the job to set the time for the interview, the interviewers were both head of the unit, It wasn't that hard, they asked about my experience with people, which way is better for me to communicate with people, how to solve problems, how I deal with the desk overloaded", "Interview Questions": "How can you handle a problem? Tell me about a situation you experienced a problem?!"}, {"date": "24 Sept 2015", "title": "Systems Administration Engineer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Bibliotheca Alexandrina (Alexandria, Alexandria Governorate)", "Interview Descriptions": "If you are a fresh grad, then expect somewhat generic questions in the areas of computer networking, operating systems, technical support and troubleshooting, and communication skills assessment. The interview is in person with the head of the IT infrastructure team. Friendly environment, but don't expect a beverage, though.", "Interview Questions": "Why become a sysadmin? Why not a software developer?"}, {"date": "7 May 2015", "title": "Junior Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bibliotheca Alexandrina (Alexandria, Alexandria Governorate)", "Interview Descriptions": "Applying on the website. Then received call to set the time of the interview. Then I had one interview. \r\nThe Interview was both technical and HR. The HR part was easy. The technical questions were moderate. Most of the questions were about algorithms ( hash functions, strings manipulations ... ). The rest of the questions were about Databases ( inner join vs. left join .. ).and  OOP.", "Interview Questions": "Where do you see yourself five years from now?"}, {"date": "21 Oct 2016", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Bibliotheca Alexandrina (Alexandria, Alexandria Governorate) in Oct 2014", "Interview Descriptions": "Applied through their career web portal. Got contact via email for an interview about 4 weeks later. Received a phone call confirming my acceptance. Hiring was delayed for 2 months later due to some paper work!!", "Interview Questions": "What is the complexity of binary search of a sorted array? Follow up: why is it log(n)? "}], [{"date": "3 Dec 2013", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Bibliotheca Alexandrina (Alexandria, Alexandria Governorate)", "Interview Descriptions": "They called me for an interview after less than a week. I took an interview with the top management of the IT departments there. The questions were both technical and hr. I enjoyed the interview as they were very friendly. after 1-2 weeks from the interview, they called me and told me that i am accepted and give me the job offer and I accepted", "Interview Questions": "why do think that you are the most suitable person for this job ?"}]]