[[{"date": "14 Jun 2023", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National Marrow Donor Program (Minneapolis, MN)", "Interview Descriptions": "Interviewer was not clear on the job requirements and governance structure of the team and associated work streams neither was clear on a roadmap of engagement on the team and overall job requirements", "Interview Questions": "How do you work in an ambiguous environment?"}, {"date": "16 Jun 2023", "title": "Workup Specialist, Bilingual, Portuguese Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at National Marrow Donor Program (Trevose, PA) in May 2023", "Interview Descriptions": "They call me for interview and said that the vacancy was cancelled but if the open vacancy again that I should subscribe again. I really don't see the point of them giving you hope and having to file new application and use \"recommended\" by interviewer if I was already interviewed.", "Interview Questions": "If I had experience in other language. If I had experience in healthcare industry."}, {"date": "4 Feb 2023", "title": "Workup Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Marrow Donor Program", "Interview Descriptions": "3 step interview process. Step 1 is a 15 min phone call with HR. Discussing the job basics and salary. Step 2 and 3 are video interviews with the team managers. This is where you go into detail about personal work experience.", "Interview Questions": "Discuss a time that you had to meet a deadline under pressure. Discuss a time you had to work on a team."}, {"date": "14 Dec 2022", "title": "Workup Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Marrow Donor Program", "Interview Descriptions": "General questions about your background and why you want to join be the match. Goes in depth on asking about your past job history. Also asks if you have any experience with excel.", "Interview Questions": "Why do you want to work for our company."}, {"date": "21 Jun 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Marrow Donor Program", "Interview Descriptions": "Two people asking you about job experience, who you are, or any other relevant experience relevant to the position.  Very pleasant and professional experience and a prompt reply after the interview was over.", "Interview Questions": "Tell us a little bit about yourself"}, {"date": "21 May 2022", "title": "Workup Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Marrow Donor Program in May 2022", "Interview Descriptions": "Phone screen went bad, it seems like in the beggining we had a smooth conversation but after a while everything went wrong. It was probably more attributed to me bc I thought I was prepared and apparently could not answer the way the interviewer was expecting which kinda I could feel his frustration so it went worse and worse.", "Interview Questions": "Tell me about a time you had todeal with sensitive information and how was it."}, {"date": "14 Mar 2022", "title": "Community Engagement Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National Marrow Donor Program", "Interview Descriptions": "Had a very awkward and serious phone call. Seemed like they were just reading off a script. It was pointed and not conversational at all.  They do have a very awesome mission statement though which is nice.", "Interview Questions": "Describe a time that you had to overcome a challenge at work."}, {"date": "1 Apr 2022", "title": "Supervisor Quality Systems Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Marrow Donor Program (Minneapolis, MN) in Mar 2022", "Interview Descriptions": "First, a recruiter interview that generally scoped my interest, and how I felt I would fit in the role.   \r\nThen a one-on-one interview with direct manager.  It was apparent at one point that interest waned, but questions were so general it would be hard to say why. \r\n The interviewer was not that engaged, and it was apparent she just wanted off the call.", "Interview Questions": "General, like 'Describe a time you worked through a conflict with a peer'."}, {"date": "30 Jan 2022", "title": "Workup Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Marrow Donor Program", "Interview Descriptions": "Great interview process. HR Initial interview was done over the phone, Team Interview and Managers Interview were both done via video. After the final interview I was sent an offer the following afternoon.", "Interview Questions": "Name a time where you have had to juggle multiple tasks at one time and how did you handle that. "}, {"date": "16 Dec 2021", "title": "work up specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Marrow Donor Program (Minneapolis, MN)", "Interview Descriptions": "Seamless process, applied online through the website. A couple of days later was invited for a phone screening with HR who said I was going to be scheduled a panel interview with two managers. Interview happened within the next week, managers were very easygoing and seemed excited about the organization. Was offered position a couple of days after.", "Interview Questions": "Was there a time you had to realign your work to meet the collective organizational goals?"}], [{"date": "15 Sept 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at National Marrow Donor Program", "Interview Descriptions": "Applied for the job and then received an email from a recruiter about a week later for a phone screen. Phone screen was rather fast and didn't last the full 30 minutes but I received an email requesting two video interviews with peers. Those went extremely well with \"tell me about a time when\" questions that were based on change, difficulty in the workplace, managing others, leadership, etc. There were no tricks and lots of time to ask questions. Inexplicably, I received a rejection from the recruiter afterward. I wish I would have at least had the chance to meet the person I would be reporting to as I am not sure what I was rejected on exactly.", "Interview Questions": "Tell me about a time you were undergoing change and had to motivate your team. How did you handle it and how did things turn out?"}, {"date": "23 Jun 2021", "title": "Marketing Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at National Marrow Donor Program", "Interview Descriptions": "Simple, very informal. The hiring manager really took the time to get to know me as a candidate. Was honest about the company and encouraged me to apply again in the future if I didn't get selected for the position.", "Interview Questions": "What is the reason you are for looking for a new position."}, {"date": "14 Jun 2021", "title": "Brand Team Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at National Marrow Donor Program", "Interview Descriptions": "Lengthy interview process but HR follow up was poor. If you’re bringing candidates along the process, it’s courteous to keep them updated on status vs them reaching out for updates.", "Interview Questions": "How do you deal with pressure?"}, {"date": "24 Mar 2021", "title": "Workup Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at National Marrow Donor Program", "Interview Descriptions": "Applied online and receive an invite a week or so later to have a 30 minute interview and screening with the hiring coordinator. \n\nThe screening interview was a series of standard interview questions but the hiring coordinator was like talking to a robot. No response, no dialogue , seemed like they had zero interest or passion in their role. They might as well include these questions in the application process and skip the screening stage. After the screening wrapped, I was told I would hear something by the end of the week and heard nothing. About two weeks later, I finally got a response and was invited to a 2 person panel interview with managers. \n\nThe 2 person interview was a fairly positive experience that lasted about an hour with most of the questions being based around Be The Match principles. Questions were more creative than most interviews but still lacked the opportunity for me to go over my actual relatable experience. At the end of the interview, I was told it would be a week or two before any decisions are made due to the volume of applications. \n\nNot even two days later, received a generic denial via email. Asked for feedback on how to improve and heard nothing back, which is disappointing. \n\nOverall, not a horrible process. The whole thing seems pretty traditional and could use an overhaul and upgrade.", "Interview Questions": "Tell me about a time you did the right thing, instead of the easy thing."}, {"date": "19 Jan 2021", "title": "MC, PM Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Marrow Donor Program", "Interview Descriptions": "Interviews were rushed for such a significant project. People were pleasant,  but one was hard to read.  Already had a screening intrvw over Zoom  which typical covers fit, so it made sense to delve into approach and examples of work.  It was more confusing than difficult. aaaa aaaa aaa a", "Interview Questions": "How would you approach this project?"}, {"date": "11 Jan 2021", "title": "Donor Contact Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at National Marrow Donor Program", "Interview Descriptions": "My interviewers (yes there were two) were both lovely and very personable. They asked all the usual questions, and were engaged in the responses and gave feedback. Overall pleasant and quick response time.", "Interview Questions": "Explain a time you were challenged and how you overcame. "}, {"date": "7 Dec 2020", "title": "Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Marrow Donor Program (Minneapolis, MN) in Oct 2020", "Interview Descriptions": "30 min interview with HR\r\n  Basic questions, tells you more about the job, training, what its like a day in the life of. \r\n45 min interview with Case Managers\r\n15 min interview with Managers", "Interview Questions": "Tell me about a time you had to deal with a difficult customer"}, {"date": "2 Sept 2020", "title": "Department Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at National Marrow Donor Program (Minneapolis, MN)", "Interview Descriptions": "The interview process started with a phone interview, followed by an  in person interview. I received a call and email with a job offer. The hiring process was over all a positive one.", "Interview Questions": "Share past experiences - How do you work in a team atmosphere. "}, {"date": "20 Jul 2020", "title": "Clinical Trial Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at National Marrow Donor Program (Minneapolis, MN)", "Interview Descriptions": "This company has a 2 stage interview process. The first interview is with anyone at the company- it is a company fit interview to see if you match the desired profile to work at Be The Match (driven, hardworking, caring, etc). These are very general questions, although somewhat odd (ex. if you could have any kind of superpower what would it be?) Be sure to read up on operational philosophy, values, etc before this interview.\r\n\r\n After the interviewer recommends you continue, you can then have an interview with the person hiring for your position. This interview has more personalized questions, many questions like \"can you provide me with an example of a time you ....\". They allowed plenty of time for me to ask questions at the end.", "Interview Questions": "What word stands out to you in our operating philosophy?"}, {"date": "10 Aug 2020", "title": "Biostatistician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Marrow Donor Program (Minneapolis, MN) in Jul 2020", "Interview Descriptions": "After you submit the application, the first round is phone screening. It will be of 30 minutes.  Then after crossing phone interview there will be the video interview with Biostatiscian and Director.  The final interview will be with the WMU team. The whole process takes 3 weeks in total.", "Interview Questions": "How will you convince the statistical results to non-statistician?"}], [{"date": "13 Aug 2020", "title": "Associate Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Marrow Donor Program (Minneapolis, MN) in Jul 2020", "Interview Descriptions": "Quick movement to the next phase of interviews. Communication was great except following the rejection email - I asked for feedback since this is a company I’d really like to work for and received no response. Due to COVID, the interview was done via WebEx and it went smoothly.", "Interview Questions": "Describe a time you exhibited exemplary talent. "}, {"date": "5 Jun 2020", "title": "Bio Statistician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Marrow Donor Program", "Interview Descriptions": "Typical hiring process. Initial phone interview and then 2 in person meetings, one with statistics team and then another with the statistics manager. Overall the process was super quick, only about 2 weeks", "Interview Questions": "Tell us about past projects you've worked on"}, {"date": "26 Aug 2020", "title": "Human Research Protections Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Marrow Donor Program in Mar 2020", "Interview Descriptions": "The recruiter was very thorough and informative about what the job entailed, benefits package, etc.  She had answers for all of my questions and asked specific questions about how I would be qualified for the position.", "Interview Questions": "What my experience in data auditing was"}, {"date": "5 Aug 2021", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at National Marrow Donor Program (Minneapolis, MN) in Jan 2020", "Interview Descriptions": "Applied online. First I had a phone screening. Then had an in-person interview (pre-COVID) with two different rounds of people. It lasted about two hours. The questions and vibe felt more like a personality quiz than if I was qualified.", "Interview Questions": "How do you work on a team\r\nWhat types of projects have you worked on before?\r\nWhat social media do you follow that are doing a great job"}, {"date": "19 Sept 2019", "title": "BSA Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at National Marrow Donor Program (Minneapolis, MN)", "Interview Descriptions": "You will receive a 40 page operating philosophy mission booklet and will have an interview with someone not in the department you applied for. They will determine first if you a good fit for our mission and if you will fit with our philosophy (a bit cultish). After you pass this step and a drug test, then you will have 2 interviews with the hiring manager and 2-3 other people. The questions are all behavioral... i. e. give me a time when... you must have 10 examples in your pocket or can at least make some up", "Interview Questions": "Give me an example when you had to deal with difficult people."}, {"date": "15 Jul 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Marrow Donor Program (Minneapolis, MN)", "Interview Descriptions": "The interview process began with a phone interview, following that was an interview where I met with my supervisor for the internship and was given a tour of the building in Minneapolis. The entire process felt more like a conversation and simply as though I was getting to know someone new and allowed for me to be more myself (instead of nervous or stressed). I was given the opportunity to meet others who worked for the foundation as well.", "Interview Questions": "Tell me about yourself"}, {"date": "23 May 2019", "title": "CRA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Marrow Donor Program", "Interview Descriptions": "Very structured.  Professional, some questions were tough, but majority of them were average. I had three interview before I was given an offer. Everyone involved in the hiring process was welcoming and very pleasant.", "Interview Questions": "What is one of your weaknesses? "}, {"date": "12 Apr 2019", "title": "Bioinformatics Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Marrow Donor Program", "Interview Descriptions": "I applied through an online job board and got an interview with the HR. She was amazing, asked me about my background, asked a few HR questions, told me about the projects and told me that she will get back to me in a week. She got back to me after a week for a second round interview. I was very interested, but  I had another offer by the time. I had a very positive experience.", "Interview Questions": "Tell me a little bit about your background. "}, {"date": "10 Sept 2021", "title": "Distinguished Events Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Marrow Donor Program in Mar 2019", "Interview Descriptions": "A few phone interviews. The interviewers were really nice and gave time for you to think through the questions. Enjoyable experience taking about the company and what they do for the state and community", "Interview Questions": "Tell us about an experience where you were under extreme pressure?"}, {"date": "6 Feb 2019", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National Marrow Donor Program (Minneapolis, MN) in Nov 2018", "Interview Descriptions": "Poorly organized, had to proactively follow-up with human resources when they would go radio silent, even missing the date of promised next steps, interviewers were late and not prepped properly. Job description and job expectations were not aligned or at the right level.", "Interview Questions": "Tell me about yourself."}], [{"date": "25 Jul 2018", "title": "Biorepository Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at National Marrow Donor Program", "Interview Descriptions": "A couple of days after applying, I was interviewed on the phone. \r\nAn HR person interviewed me. She let me know that there will be in-person interviews the next week. That week I followed up but she didn't reply. Until I got a you didn't get the job email a month later.", "Interview Questions": "What would your supervisor say are your best qualities? \r\nHow have you dealt with constant change in the past? \r\nDo you know that the job is in Bloomington and not downtown?\r\nWhy do you want to work at Be the Match?"}, {"date": "5 Mar 2018", "title": "Contact Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Marrow Donor Program", "Interview Descriptions": "Quick interview, broad questions. Interviewer seemed to be new to position because she stuttered every once a while and was late a few minutes to call for the phone screening.", "Interview Questions": "Do you have any questions for me?"}, {"date": "23 Mar 2018", "title": "Information Technology Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Marrow Donor Program in Mar 2018", "Interview Descriptions": "The interview was kinda simple. The first round was a telephonic conversation, focussing briefly on my projects and technical skills. Then a 2 -hour web interview was scheduled. The interview was divided into 4 slots of 30 mins, each had different recruiters come in. Asked simple behavioral questions, overview of my projects. Some technical questions on Java, AngularJS, and SQL", "Interview Questions": "Asked about my proudest work"}, {"date": "21 Sept 2017", "title": "Bioinformatics Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at National Marrow Donor Program", "Interview Descriptions": "Good relaxing employers are very nice I really enjoyed it HR was a bit confusing but I really enjoyed the interview process I had two interviews in total first one behavioral second technical both my employers are present", "Interview Questions": "Descript OOP"}, {"date": "2 Jul 2017", "title": "Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Marrow Donor Program (Minneapolis, MN) in Jun 2017", "Interview Descriptions": "Phone screen from HR with an in-person appointment with the hiring manager. Very good communication, fast, and efficient. Exactly what you would expect an interview process would be - no curveballs, no problems, very standard.", "Interview Questions": "Nothing unusual was asked - very typical questions about why I was interested and about my background."}, {"date": "8 Jan 2018", "title": "Senior Business Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National Marrow Donor Program (Minneapolis, MN) in May 2017", "Interview Descriptions": "3 interviews. First was over the phone with HR. Second was over the phone with the hiring manager.  Third was in person with the hiring manager, seasoned department employees and the department director.", "Interview Questions": " Experience in an agile workflow environment. "}, {"date": "28 Sept 2017", "title": "Client Service Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at National Marrow Donor Program (Los Angeles, CA) in Mar 2017", "Interview Descriptions": "Phone Screening with the hr rep was done to assess primary qualifications for the job I was applying for.  I first got an email from the organization.  The hr rep was very accomodating.", "Interview Questions": "Describe  why you can do this job?"}, {"date": "19 Apr 2019", "title": "Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Marrow Donor Program (Minneapolis, MN) in Mar 2017", "Interview Descriptions": "The hiring process was fairly typical. It included screening interview, phone interview, then an in person, panel interview onsite in Minneapolis. The people I met throughout the process were very mission-driven, kind and strategic.", "Interview Questions": "Why did you choose to apply?"}, {"date": "31 Jan 2017", "title": "Principal Software Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at National Marrow Donor Program (Minneapolis, MN) in Jan 2017", "Interview Descriptions": "First interview with HR followed by the second technical one\r\nThe first interview 30 min was not technical, just general review who I am.\r\nNext interview is  2 hours face to face with NMDP team", "Interview Questions": "What do you know about Microservices? "}, {"date": "24 Oct 2016", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Marrow Donor Program (Minneapolis, MN)", "Interview Descriptions": "Phone interview with HR followed by two in-person interviews. The first with the department manager and then the second with the manager and a few of the senior clinical research associates.", "Interview Questions": "There were no unexpected questions in this interview. It was pretty standard. Asked about previous experience, strengths and weaknesses. A questions was asked regarding whether or not traveling was an enjoyable experience and also where I've traveled to (international places including) since travel is a huge part of the position."}], [{"date": "25 Jan 2019", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National Marrow Donor Program (Minneapolis, MN) in Jul 2016", "Interview Descriptions": "The interview process with basically easy. I had over the phone interview with HR first and then moved on to interview with management who asked so good questions. I was nervous with one of the managers who seemed intimidating but she was professional and nice.", "Interview Questions": "They asked me how I deal with difficult donors or difficult people in general"}, {"date": "7 Aug 2019", "title": "IT Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Marrow Donor Program (Minneapolis, MN) in Apr 2016", "Interview Descriptions": "Phone interview with HR. It was basic experience questions. They were looking to gauge my experience against the responsibilities of the role. There were a lot of technical questions that felt like they would have been relevant to the role in my opinon.", "Interview Questions": "Are you expecting to grow outside of the position. I answered yes."}, {"date": "28 Feb 2017", "title": "Senior Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National Marrow Donor Program (Minneapolis, MN) in Apr 2016", "Interview Descriptions": "It was a series of casual interviews with the hiring manager, another manager in the same department, executives of the team you would support, and a group interview of peers.", "Interview Questions": "Describe how you would handle a situation in which you faced a challenge or difficulty.   Tell us about a time in which you had to provide bad news or a difficult message to a superior."}, {"date": "10 Feb 2016", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at National Marrow Donor Program (Minneapolis, MN) in Feb 2016", "Interview Descriptions": "This was a consulting position that could possibly be converted to FTE.  \r\nSpanish inquisition style interview.  They said it saves time for the interviewee.\r\nSeveral people yet to interview so no determination for a couple of weeks", "Interview Questions": "Overview my background in general.\r\nWhat in my background do I think is applicable.\r\nGenerally it was more of a chat\r\nThen it was my turn to ask questions which is where I got more information than I gave"}, {"date": "13 Oct 2015", "title": "Biorepository Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at National Marrow Donor Program", "Interview Descriptions": "Highly formulaic. Significant amount of time between interview and return call. HR seemed to come across as a major hold up to making a decision. Upon receiving the offer I had another interview scheduled the next day. The HR rep I spoke to was not pleased when I asked for a few days to consider my decision. This was somewhat off-putting.", "Interview Questions": "As boilerplate as it gets"}, {"date": "16 Dec 2019", "title": "Call Center Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at National Marrow Donor Program (Minneapolis, MN) in Aug 2015", "Interview Descriptions": "Standard interview process, meet with the Director, the other managers.  Have a tour of the areas you can enter while still protecting PHI.  Follow up was done quickly. Seemed like a nice group but for the salary I couldn't see making the drive across the city.", "Interview Questions": "What qualities do you think you could bring to the table that would benefit the call center. "}, {"date": "30 Jun 2016", "title": "Adult Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at National Marrow Donor Program (Santa Ana, CA) in Jan 2015", "Interview Descriptions": "The first part of the interview was a telephone interview. then I was contacted to do an in person interview that was an initial panel interview that later included employees I would have managed", "Interview Questions": "What is my management style"}, {"date": "5 Jan 2015", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Marrow Donor Program in Oct 2014", "Interview Descriptions": "very seamless and friendly HR staff.  Applied for position and the following week received a phone interview. The week after a face-to-face interview, and about 2 weeks after that I received an offer. Interview took around 30min.", "Interview Questions": "I can't remember specific questions but they interview using a set of behavioral questions such as \"tell me a time when you...\". you need to have examples for when you were proactive and when you worked well if other, and when you had a conflict but fixed it.  The questions are off general HR hiring form. I think they must ask all candidates the same questions regardless of field - they were sort of generic. "}, {"date": "7 Jul 2014", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at National Marrow Donor Program", "Interview Descriptions": "I had a phone interview thanks to a recruiting firm, however the interviewer called late. She did offer to reschedule, but I declined. She also put me on hold for at least 5 minutes due to another applicant calling in. Horrible interview.", "Interview Questions": "Just the generic questions of \"tell me a situation where you had a conflict with your co-worker or boss.\""}, {"date": "12 Mar 2014", "title": "Donor Contact Representative III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at National Marrow Donor Program", "Interview Descriptions": "I went through two interviews. One was a phone screen with the recruiter. The next was with the hiring manager at the center. The hiring manager let me know they would get back to me in a week, but the next day the recruiter called me to give me an offer. No real room for negotiations. Interview questions were pretty basic. Tell me about a time you had to deal with difficult person and how did you handle the situation.", "Interview Questions": "Review you resume because most likely you will be asked how your experience can contribute to the role you applied too. "}], [{"date": "19 Sept 2012", "title": "Quality Assurance Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at National Marrow Donor Program (Minneapolis, MN) in May 2012", "Interview Descriptions": "There is a phone screen which isn't so bad hr is actually OK. Do not work for Mary de foe David Allen is a good person to work for expect around four ppl to interview you and negotiate your salary well,make it clear what they want from you're what your expectation are as they changed it for me later and I remained unaware and underpaid . Do your research of their organization structure as you may be very well be made lead as soon as you're hired", "Interview Questions": "No different than other companies "}, {"date": "21 May 2012", "title": "Administrative Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at National Marrow Donor Program (Minneapolis, MN) in Apr 2012", "Interview Descriptions": "The NMDP uses \"behavior-based\" interview questions. It's normal to interview with more than one person in the room - for example, an HR rep, the hiring manager, and a team lead or co-worker. The people interviewing will have been given a multi-page sheet of sample questions, which they read off in turn. Questions will typically be multi-part questions. An example: Tell us about a time when you did (blank). (Maybe, managed a project from start to finish; or maybe, had a disagreement with a colleague.) The main question will be followed by more specifics: What was the situation? Who did you talk to? What was the end result? These types of interview questions rely on the principle that past behavior on the job is is the best predictor of future behavior. Try to be specific in your answers. Even if it's something that happens all the time, you'll be asked to pick one illustrative example to talk about. Don't get hung up on answering all the multiple parts, in order. The questions are not meant to be a memory test - they are meant to get you talking about yourself and your approach to your work. Be honest in your answers. If you, for example, tend to avoid conflict or smooth over awkward situations, that's real for you. If, however, you normally face a conflict head-on, then let them know that. Maybe they're looking for a \"smoother,\" or maybe they're looking for \"honesty,\" but either way, if you're not yourself, then both you and the NMDP will be unhappy with the hire decision.", "Interview Questions": "Have you had to convince your team to work on a project they weren't thrilled about? How did you do it?"}, {"date": "11 Jun 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at National Marrow Donor Program (Minneapolis, MN) in Dec 2011", "Interview Descriptions": "Prior to in person interviews, had mutiple phone conversations with Sr. Exec in charge of the position.  Interviewed, in person, with multiple Sr. Management staff.  Decision was made by consensus as far as I know.", "Interview Questions": "One interviewer told me the job had only been funded for one year and we'd see after that."}]]