[[{"date": "4 Jul 2023", "title": "Remote Medical Coder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Luke's University Health Network (Allentown, PA) in Jul 2023", "Interview Descriptions": "Very informative, supervisor was very thorough. She went over what a typical day would look like, explained the department scheduling, background about herself, what she expected out of this position", "Interview Questions": "tell me a little about yourself"}, {"date": "17 Mar 2023", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Luke's University Health Network", "Interview Descriptions": "Phone interview, in person, then a call with recruiter. Easy questions about a face paced environment. Need to be willing to compromise working later hours. Good job if you need one.", "Interview Questions": "How do you handle a stressful situation."}, {"date": "14 Mar 2023", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at St. Luke's University Health Network", "Interview Descriptions": "The hiring manager interviews applicants on-site. Then the rest of the hiring team one by one interview the applicants. it will take half day to complete the whole process. The hiring team is friendly.", "Interview Questions": "talk about your advantages, and what is the difficult situation and how to handle it"}, {"date": "14 Feb 2023", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Luke's University Health Network (Lehighton, PA)", "Interview Descriptions": "You had severa steps in this process first one was with HR then the next one was talking to the head nurse of the floor then next was meeting with them in person and seeing the unit where you might be workig.", "Interview Questions": "how woud I handel heavy work flow"}, {"date": "25 Apr 2023", "title": "Patient Access Representative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Luke's University Health Network (Quakertown, PA) in Feb 2023", "Interview Descriptions": "The interview process is very easy but the pre-employment tasks are many and time-consuming for a low-paying, stressful job. You are required to take a physical, background and fingerprints checked.", "Interview Questions": "They wanted 7 years of past work references."}, {"date": "16 Oct 2022", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Luke's University Health Network", "Interview Descriptions": "Basically sent up the interview with the unit manager through HR. It was more of a conversation than an interview. Very laid back. I was offered the position a couple days later.", "Interview Questions": "No direct interview questions. More of a conversation about my interests in healthcare."}, {"date": "28 Sept 2022", "title": "Physician Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at St. Luke's University Health Network", "Interview Descriptions": "The interview process was standard. First interview with a recruiter, then second with the manager of the dept. Flown out to see the facility after that. However, after the contract was signed, they attempted bait-and-switch by increasing responsibilities and lowering pay. Don't let them waste your time like they wasted mine.", "Interview Questions": "Tell us about a time you exceeded expectations"}, {"date": "30 Sept 2022", "title": "Medical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St. Luke's University Health Network (Allentown, PA) in Sept 2022", "Interview Descriptions": "Zoom interview. Multiple interviewers were on the call. Standard questions orientated to patient interactions and team-based practice. Very laid back. Make sure to have a ton of questions to allow for a flowing conversation.", "Interview Questions": "What would you do if a patient is acting rudely or starts a conflict?"}, {"date": "19 Oct 2022", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Luke's University Health Network (Allentown, PA) in Aug 2022", "Interview Descriptions": "It was pretty easy. They asked basic safety questions. Anyone with a security background can answer. Other than that it was the normal things, Show up on time, follow their parking rules and be respectful.", "Interview Questions": "Tell me about a time you had to de-escalate a situation. What was your role?"}, {"date": "17 Oct 2022", "title": "Certified Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Luke's University Health Network (Bethlehem, PA) in Jun 2022", "Interview Descriptions": "An online application submission first on their company website. Then, a telephone interview which lasted about 30 minutes. An in-person interview was requested if you were considered for the position.", "Interview Questions": "What kind of work experience do you have?"}], [{"date": "20 Apr 2022", "title": "Care Giver Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at St. Luke's University Health Network", "Interview Descriptions": "1st they call me as phone interview for 15 min\nThen they called me for  in person interview\nI was not that well prepared for interview\nI did my best and they asking a lot of questions by taking turn", "Interview Questions": "How deal with patient who is more aggressive?"}, {"date": "16 Mar 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at St. Luke's University Health Network", "Interview Descriptions": "Interview was held through teams online due to covid.  Lasted roughly 40 minutes. Questions were about real life experience and how tou would handle certain stressful situations. All in all not a bad experience", "Interview Questions": "Questions were to see how you handle conflict and difficult situations "}, {"date": "11 Feb 2022", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Luke's University Health Network", "Interview Descriptions": "The interview process consisted of telephone and Microsoft teams calls which assessed teamwork and problem solving skills. There were multiple rounds of phone call and teams interviews, as well as an onboarding procedure.", "Interview Questions": "How I work in teams."}, {"date": "30 Mar 2022", "title": "Laboratory Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at St. Luke's University Health Network (Allentown, PA) in Jan 2022", "Interview Descriptions": "Applied online and heard back requesting an interview within a few days. Interviewed first with HR and then a few days later with the Lab Manager. In the second interview, they mentioned that they would “get started with my onboarding”, so I figured it was safe to say I felt confident that I had the job. Both interviews were very short (under 20 minutes), generic interview questions, impersonal, and I asked the most questions to try to carry conversation. Now, it is two months since the second interview and haven’t received any word back, even after 3 follow-up emails. At this point, I assume it is a no, and I have accepted an offer elsewhere. 🤷‍♀️", "Interview Questions": "Salary expectations. Tell me about a time you solved a problem at work. Tell me about a time you worked as a team. Why this company? Why this job?"}, {"date": "8 Jan 2022", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Luke's University Health Network in Nov 2021", "Interview Descriptions": "Brief phone call with HR followed by an interview with the hiring manager. The hiring manager interview consisted of behavioral questions, work scenarios, employment history, and discussions around why I wanted to take the position and how it would fit. The hiring manager took the time to explain the day to day and the goals/vision for the department to see if the job was a good fit for both parties. After the hiring manager interview was a phone call with HR to discuss work history, background, and benefits. There was 1 more round after that, but we chose not to proceed.", "Interview Questions": "Why are you leaving your current company?"}, {"date": "12 Oct 2021", "title": "Vascular Technologist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at St. Luke's University Health Network", "Interview Descriptions": "The interview process was quite long..it took close to 5 months from start to finish. You will speak with the vascular manager/ Human Resources and technical director. It was worth it though. I really enjoy working at this hospital.", "Interview Questions": "A lot of technical questions "}, {"date": "20 Jul 2021", "title": "Plumber Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at St. Luke's University Health Network (New York, NY) in Jul 2021", "Interview Descriptions": "Never received a follow up, had to hound HR. Stopped receiving replies or return phone calls. Director of engineering seemed like a nice guy. Shame they can't just tell you one way or another", "Interview Questions": "how do you handle working with someone who is difficult to deal with"}, {"date": "13 Nov 2020", "title": "Compliance Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Luke's University Health Network", "Interview Descriptions": "Over the phone, the interviewer was very personable and friendly.  Easy dialogue and didn't feel pressure from other side.  Also told about hiring and training processes.  Asked about deadlines and adaptability.", "Interview Questions": "My experience and how I would fit in company"}, {"date": "24 Sept 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Luke's University Health Network", "Interview Descriptions": "Very positive interview process. Was contacted next day about scheduling an interview and were very nice throughout the entire process. As someone who gets pretty nervous for interviews, the interviewers made me feel less intimidated from the beginning.  Due to COVID-19, interviews were done virtually.", "Interview Questions": "Tell me about a time you received constructive criticism "}, {"date": "2 Sept 2020", "title": "Exercise Physiologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at St. Luke's University Health Network", "Interview Descriptions": "First met with HR for about a 30 min interview and then went to the site location to meet with the director of the program for another interview.  Following that, I was called back in to meet with one of the employees that oversees operations at that site and I had a very informal meeting with them for about 20 mins.", "Interview Questions": "Why do you want to work for St. Luke's?"}], [{"date": "19 Aug 2020", "title": "Physician Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Luke's University Health Network", "Interview Descriptions": "Very laid back and informative! Everyone was very kind and happy to answer all of my questions. The interview questions were based off of resume and expectations of the job itself.", "Interview Questions": "What are your top priorities in a job?"}, {"date": "21 May 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Luke's University Health Network", "Interview Descriptions": "Online application with personality questionnaire, then a short in-person interview with HR followed by an in-person interview with the unit manager.  I got my position offer about 2 days later.", "Interview Questions": "They asked me to share when I had been in charge of something that didn't go as planned and how I handled it. "}, {"date": "8 Mar 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Luke's University Health Network (Allentown, PA) in May 2020", "Interview Descriptions": "Consisted of three rounds of interviews conducted over Zoom during the beginning of Covid. Each were more formal and with more specialized questions. My final interview was with my now managers.", "Interview Questions": "Name a time when you faced an ethical deliemma at work and how you handled it"}, {"date": "21 Jan 2022", "title": "Graphic Designer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Luke's University Health Network (Bethlehem, PA) in Jan 2020", "Interview Descriptions": "Submitted an application online and heard back a week later. Despite the interview being first thing in the morning, I was left waiting over 20 minutes until I was brought back into an office to chat. \r\n\r\nI was under the impression I would only be meeting with one individual since they were the only one mentioned in the email, but there ended up being another person from the department as well. The interview took about 45 minutes, and I heard back close to a week later.", "Interview Questions": "What sort of marketing collateral have you designed in the past?"}, {"date": "21 Jan 2021", "title": "Graphic Artist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Luke's University Health Network (Bethlehem, PA) in Jan 2020", "Interview Descriptions": "I set-up a phone interview with HR, and after the interview they sent me the company policies/guideline/dress code. Later they helped set me up for an in-person interview.\n\nThe in-person interview was first thing in the morning, and I was left waiting for about 20 minutes or so (I think there was some sort of miscommunication where they admin assistant didn’t let the person know I arrived). When they finally took me back to interview, there were two people present which wasn't mentioned when scheduling. \n\nThe job description did not align with the tasks being described. It seemed less print-based and more digital, which was fine because I had experience with both. They had me walk them through my portfolio and describe my process. The whole thing lasted over 1 hour. Overall, it went well and the interviewers were very kind, but it seemed they were in the market for someone with a little bit more experience than I had.\n\nI applied early January 2020, two weeks later they reached out for the screening/interview, and I learned that they passed on me at the end of February.", "Interview Questions": "Tell us about your design process."}, {"date": "28 Jun 2019", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at St. Luke's University Health Network (Stroudsburg, PA)", "Interview Descriptions": "Applied online took an online assessment had an interview which went well with HR and then the unit director who said she would like to bring me on board.  Took weeks to hear back from HR and the unit director had no clue what the hold up was after 3 months of waiting to even get an email response I accepted another position elsewhere.", "Interview Questions": "Standard interview question?"}, {"date": "19 May 2019", "title": "Contact Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Luke's University Health Network", "Interview Descriptions": "Brief interview , ask basic questions such as , have you handle multiple lines, can you type, etc hiring process took a bit I applied online, after a week called Human Resources to confirm their receipt of my application a month later received a call for interview", "Interview Questions": "Do you know how to multitask "}, {"date": "9 Aug 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Luke's University Health Network (Bethlehem, PA) in May 2019", "Interview Descriptions": "Set up interview via phone call.  Interviewed with HR, then with floor supervisor/coordinator.  Interview lasted about an hour or so in total.  HR was a one-to-one, floor was a panel.", "Interview Questions": "How do you handle stress?"}, {"date": "14 Feb 2019", "title": "Mental Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Luke's University Health Network (Allentown, PA) in Jan 2019", "Interview Descriptions": "It was a smooth interview very straight forward and interesting, you won't get hired if you're a smoker and you can reapply in 6months so I suggest you stop smoking at least 4 weeks in advance.", "Interview Questions": "why do you think I should hire you, and how would you convince me to make you and offer of hired?"}, {"date": "21 Dec 2018", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Luke's University Health Network (Bethlehem, PA) in Sept 2018", "Interview Descriptions": "Online personality screening and onsite interview with multiple people. Interview process took about 2 weeks, took another 2 weeks to hear back. Standard template questions that the manager was able to choose from. Many questions seemed highly repetitive.", "Interview Questions": "What do you know about St. Luke’s?"}], [{"date": "30 Mar 2021", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at St. Luke's University Health Network (Allentown, PA) in Jul 2018", "Interview Descriptions": "The process is lengthy but the actual interview was not nerve-racking. First I received a call to schedule the interview. Then went in person to their main building for the interview. Never felt uncomfortable and I typically get nervous at interviews. After the interview, it took about 3 weeks to begin onboarding (epic training, going over benefits, etc)", "Interview Questions": "How would you deal with conflict at your place of employment?"}, {"date": "13 Feb 2020", "title": "Clerical Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Luke's University Health Network (Bethlehem, PA) in May 2018", "Interview Descriptions": "The interview at the office was very laid back and easy at the time I got hired. Then I had a pretty simple interview with HR as well. That was 7 years ago though, and now most interviews are with multiple managers at a time which can be intimidating.", "Interview Questions": "Name a time when you faced a difficult situation at work and what did you do to get through it successfully. "}, {"date": "25 Aug 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Luke's University Health Network in May 2018", "Interview Descriptions": "Originally applied online. Had one in-person round where I met with managers in different departments I would be working in to review internship and project scope. Asked a couple of basic questions and told them about myself.", "Interview Questions": "Tell me about yourself?\nWhat are you looking to gain from this internship? "}, {"date": "16 Jun 2018", "title": "Call Center Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Luke's University Health Network (Saint Louis, MO) in May 2018", "Interview Descriptions": "It was a phone interview they called and asked me about my experiences and about my past job history.  They also asked had I ever been employed with their organization. And also what type of chips that I expect to work and was I looking for full-time or part-time.", "Interview Questions": "Why did you leave your last job"}, {"date": "8 Feb 2018", "title": "IT Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at St. Luke's University Health Network", "Interview Descriptions": "Worked with a recruiter.  References are required prior to interviewing.  Completed phone interview and in person interview with 3 people (HR, Hiring Manager, and peer).  More conversational and informative then the standard interview questions.", "Interview Questions": "How you work as a team member? "}, {"date": "27 Dec 2017", "title": "Medical Receptionist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at St. Luke's University Health Network", "Interview Descriptions": "Very friendly. To me, it was a standard interview. I was comfortable answering all questions and nothing felt out of line. I made sure to dress properly and respect the interviewers.", "Interview Questions": "Why are you the one we should hire?"}, {"date": "7 Dec 2017", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Luke's University Health Network (Bethlehem, PA)", "Interview Descriptions": "First you interview with HR and then with the floor manager. Similar questions are asked in both interviews. Have questions prepared to asked that are more hr focused and then more to ask your floor supervisor.", "Interview Questions": "What makes you stand out compared to the others that also applied for this position? "}, {"date": "15 Apr 2018", "title": "HCM Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at St. Luke's University Health Network (Bethlehem, PA) in Dec 2017", "Interview Descriptions": "Good communication before interview, but I did not receive a call back or email when I was not selected. I was able to check a portal to see the status of my application. The interview was in a comfortable environment and the people that I spoke with were welcoming and put me at ease.", "Interview Questions": "What type of culture do you thrive in?"}, {"date": "22 Nov 2017", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Luke's University Health Network (Allentown, PA) in Nov 2017", "Interview Descriptions": "There was an initial phone interview with the HR person. She asked some textbook questions. The hiring manager decided on who to call for in person. I was called in. The day after the interview I received an email telling me what to bring to the interview. Several hours later received an email saying I wasn't selected. Seems to be HR issues.", "Interview Questions": "What do you know about St. Luke's\r\nWhy do you want to work here\r\nSalary requirements"}, {"date": "3 Nov 2017", "title": "Front Desk Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at St. Luke's University Health Network (Bethlehem, PA) in Sept 2017", "Interview Descriptions": "Had my initial interview which went very well, which lead to interviewing with the Doctors and Regional Managers at the location that I would be working at. Which went very well too.  It came down to- I've been a receptionist too long and make too much $ as a receptionist - so I would have to take a pay cut to get a better position. But I was offered the job.", "Interview Questions": "They asked me many questions, but the one that surprised me the most was \"what do you do for fun?\""}], [{"date": "15 Nov 2017", "title": "Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at St. Luke's University Health Network (Allentown, PA) in Jul 2017", "Interview Descriptions": "Quick turn around to call once I applied. Clearances and physical done in timely manner. Great email communication. Once hired, was invited to group Meet & Greet. Told specific days for orientation and training.", "Interview Questions": "What would you do if training class finishes early? "}, {"date": "22 Jul 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St. Luke's University Health Network (Allentown, PA) in Mar 2017", "Interview Descriptions": "Very professional . St Luke’s is a great health network to work for, they are professional and efficient. I loved working at St Luke’s. The HR department is hands down the most efficient HR I have ever worked with.", "Interview Questions": "List 3 qualities about yourself"}, {"date": "21 Feb 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at St. Luke's University Health Network in Feb 2017", "Interview Descriptions": "It was relaxed HR was friendly. Overall a good experience. After I met with HR I met with the nurse manager who was also very nice. They asked the common interview questions.", "Interview Questions": "When was a time you went above and beyond for a patient."}, {"date": "20 Apr 2017", "title": "Patient Access Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Luke's University Health Network (Bethlehem, PA) in Feb 2017", "Interview Descriptions": "I interviewed with the manager and one supervisor for a 20 minute interview. It entailed a question and answer session getting familiar with the job and the training that would be necessary.", "Interview Questions": "If I had computer experience "}, {"date": "11 Mar 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St. Luke's University Health Network (Phillipsburg, NJ) in Aug 2016", "Interview Descriptions": "It was casual. They wanted solid references. They gave me time to inquire about the position and benefits as well as my my potential coworkers. The we're flexible with start date.", "Interview Questions": "How would you respond in an emergency situation?"}, {"date": "8 Jan 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at St. Luke's University Health Network", "Interview Descriptions": "Met with Director of program as well as clinical coordinator.  I was already an employee as a CNA, so maybe my interview process went a little bit smoother.", "Interview Questions": "N/A"}, {"date": "1 Oct 2015", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Luke's University Health Network", "Interview Descriptions": "The process is like any other hospital job. You come into HR, and interview with an HR Representive. Afterwards, you interview with the manager of the unit you're applying for. They get back to you in about 2 weeks after reaching out to your references. Then when you're offered the position it's you're usual drug tests and paperwork.", "Interview Questions": "They mainly ask, name a time when..."}, {"date": "10 Sept 2016", "title": "Scheduling Hospice Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at St. Luke's University Health Network (Bethlehem, PA) in Oct 2015", "Interview Descriptions": "It was comfortable and easy they made you feel comfortable the interview was about and hour long, The were professional. They explained the job and what it all intailed. They waited about two weeks to say I got the job. Make sure you have your references so they can hire you quicker", "Interview Questions": "How do I handle stress? How many years have you been in the field? What is your strengths and weaknesses?"}, {"date": "23 Jun 2016", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at St. Luke's University Health Network (Allentown, PA) in Oct 2015", "Interview Descriptions": "Met with HR first, asked very generic interview questions. Relatively easy to go through, however they judge very strongly on the appearance and first impression. Once done with HR if they liked you they will introduce you to the RX manager who will ask you your experience and goals for the current job.", "Interview Questions": "How do you handle certain problems (they gave specific examples) that may arise throughout a regular work day?"}, {"date": "11 Nov 2015", "title": "Patient Care Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at St. Luke's University Health Network (Bethlehem, PA) in Jun 2015", "Interview Descriptions": "When I was called in they asked me to interview the next day after answering some prescreening questions.  The interview it self was going great, I was first interviewed by the HR department and then they asked if I would mind being interviewed by a board of directors, that same day.  During the interview with the board of directors, it was going great, until a woman abruptly came in, sat right next to me (very closely) and started firing questions at me.  It was nerve racking and very unproffessional.  At that point after answering questions as fast as I could for her, two directors stopped her midquestion asked her why she was being so strong.  The woman than got up looked at me and said she did not want a young person and walked out.  The board appologized to me and said that she is tough, however, I ended up explaining to them that that work environment is not going to be a suitable fit for me and I left. They called me two days later to ask if I wanted to come back in for another interview and I declined.", "Interview Questions": "What is going to be the biggest issue for the future with healthcare?"}], [{"date": "15 Nov 2015", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Luke's University Health Network (Easton, PA) in May 2015", "Interview Descriptions": "Apply online and take an hour test. After that apply to what positions you'd like and wait about two to three weeks to hear back from HR. Get interviewed by HR then go up to the floor and get interviewed by the floor manager. Wait a few more days for a phone call.", "Interview Questions": "Can you juggle multiple tasks? How do you deal with stressful situations?"}, {"date": "22 Oct 2014", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Luke's University Health Network", "Interview Descriptions": "Positive experience. Meet with HR first and then meet with managers of the specific dept. you are interviewing for. Everyone was extremely friendly and made the experience comfortable. Overall, it was good interview experience.", "Interview Questions": "What made you choose St. Luke's?"}, {"date": "29 Mar 2017", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Luke's University Health Network (Bethlehem, PA) in Sept 2014", "Interview Descriptions": "One on one. Friendly atmosphere. All lies. Nothing was true. Salary, location to work, hours, all untrue. When HR call was completely different story took HR forever to call me back.", "Interview Questions": "Where do u want to work"}, {"date": "9 Jul 2015", "title": "Telephone Operator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Luke's University Health Network (Bethlehem, PA) in Sept 2014", "Interview Descriptions": "Long, took two months before I was interview. Very slow process. Very non personal. Not enough questions on who I am . What I like. How were my other Jobs as Far as what i took from them, as tools to guide me to other jobs I was hired for , I think. When interviewing a potential candidate get to know a little about them. Before you ask the long list of questions about experience and why you left your job to seek the one your appling for , it's make you feel at ease and comfortable when being interviewed . Makes you feel human not robotic. This my opinion .", "Interview Questions": "Are you good with changes, things here change day by day, that told me it's not properly managed . "}, {"date": "29 May 2014", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Luke's University Health Network (Easton, PA)", "Interview Descriptions": "One on one with HR manager then one on one with nurse manager and charge nurse. Very nice people overall, very quick in and out. Usually once you interview the job is yours, they go off your credentials and background checks, interview is used to see your people skills and make sure you're not a complete slob.", "Interview Questions": "Why St. Luke's and not a neighboring hospital like Easton Hospital or Lehigh Valley"}, {"date": "3 Dec 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at St. Luke's University Health Network", "Interview Descriptions": "It takes anywhere from weeks to months after your apply initially to get called back by Human Resources. If you need a job immediately do not apply here as your primary job because you won't get a call back for months. The application process itself is pretty standard and comparable to what other employers of similar statute require.", "Interview Questions": "Why do you want this position as opposed to the other positions you applied for? What is your biggest weakness and how may it limit your ability to complete the tasks required of this position?"}, {"date": "25 Sept 2013", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at St. Luke's University Health Network", "Interview Descriptions": "Applied for numerous positions for several weeks. Finally heard from HR a few days ago for an interview. The interview went very well and the process after hiring went very smoothly.", "Interview Questions": "Strengths/Weaknesses"}, {"date": "21 Feb 2017", "title": "Inpatient Staff RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at St. Luke's University Health Network (Bethlehem, PA) in Apr 2013", "Interview Descriptions": "Will not hear from St Luke's for 4-6 weeks after interview.\r\nThe employee physical plan to be there a long time.\r\nOrientation is a large group with many forms required to be completed by the end of the day.\r\n30 minute lunch  break.  Make sure you leave and return on time.  Always smile.", "Interview Questions": "Standard interview questions.\r\nWith intentions of obtaining how many children, their ages, concerns when child is ill..."}, {"date": "5 Jul 2014", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Luke's University Health Network (Quakertown, PA) in Apr 2013", "Interview Descriptions": "very time consuming and the personality test is a little much for my taste but i scored well. Just answer the questions how THEY want them answered. its kind of like sweet talking, just say what you know they want to hear.", "Interview Questions": "why so you want to be apart of st lukes"}, {"date": "5 Feb 2016", "title": "Security Officer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at St. Luke's University Health Network (Philadelphia, PA) in May 2012", "Interview Descriptions": "meeting with hiring supervisor.taking a tour of the hospital with supervisor, a lot of paperwork to complete. questions to be answered on computer, getting a full physical and a TB test. filling out paper work to approve criminal back ground check and child abuse check drug testing. sit through an all day orientation with other potential employees .it was a lot to take in but some very helpful information overall it was a wonderful experience", "Interview Questions": "why i wanted to work there"}], [{"date": "13 Apr 2016", "title": "Nutrition Service Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at St. Luke's University Health Network (Bethlehem, PA) in Feb 2012", "Interview Descriptions": "On-line application and test then HR called to set-up interview. Second, the meeting was with HR and a test was involved, this was to  make sure you could read English. The next step was with the head of the department.", "Interview Questions": "Do you have another job? What are your schedule and availability?  Do you have any problems that would affect your job performance? How flexible are you with your hours? Is the salary we are offering okay? "}, {"date": "12 Apr 2010", "title": "Medical Records Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Luke's University Health Network (Bethlehem, PA) in May 2008", "Interview Descriptions": "I applied for a job with St. Lukes Hospital in Bethlehem as a medical records clerk. The interview process was painless and the recruiter was very nice which made it a little easier. It took a while for them to verify my employment though.", "Interview Questions": "I always hate the greatest strengths and weakness questions. "}]]