[[{"date": "19 Nov 2022", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Médecins Sans Frontières (Geneva) in Jun 2021", "Interview Descriptions": "In total 2 interviews with various people. Then I was asked for references. Each interview took about 1 hr. They scheduled interview via the email. The questions were behavioural based questions.", "Interview Questions": "N/A"}, {"date": "5 Dec 2020", "title": "responsable de projets rh Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Médecins Sans Frontières", "Interview Descriptions": "un test sur des connaissances générale rh, engagement de personnes étrangères, bases de salaires etc...", "Interview Questions": "sur quelles bases on détermine la rémunération?"}, {"date": "4 Nov 2020", "title": "Stagiaire Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Médecins Sans Frontières (Geneva)", "Interview Descriptions": "le processus a été rapide, quelques jours après avoir envoyé ma candidature j'ai eu un premier contact avec la RH qui m'a proposé par la suite un test écrit à rendre sous une semaine.", "Interview Questions": "j'ai eu un test écrit et d'autres questions RH assez simples."}, {"date": "8 Dec 2021", "title": "Change Management Lead Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Médecins Sans Frontières (Geneva) in Dec 2019", "Interview Descriptions": "c'etait pour un projet RH, un test avec un cas assez complexe directement en lien avec le poste a pourvoir, avant de pouvoir continuer. Investissement important demande. Pas de reel echange ni feedback. Pas apprecie.", "Interview Questions": "Svp expliquer la strategie adopter, dans une situation specifique au contrxte du travail. Comment s'y prendre au projet. "}, {"date": "8 Nov 2019", "title": "Réceptionniste Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Médecins Sans Frontières", "Interview Descriptions": "Connaissant déjà qqn au sein de MSF, l'entretien a duré 30 minutes et s'est déroulé de manière conviviale.\r\nLes questions posées par la coordinatrice du département concernaient mes expériences précédentes.", "Interview Questions": "N/A"}, {"date": "8 Nov 2019", "title": "Field Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 5 weeks. I interviewed at Médecins Sans Frontières (Geneva) in Mar 2019", "Interview Descriptions": "Entretien technique et mise en situation avec un responsable programme \r\nSélection sur critères et parcours et après un entretien RH\r\nLe processus se déroule en plusieurs temps après validation RH et pool manager puis validation des opérations", "Interview Questions": "N/A"}, {"date": "26 Jul 2019", "title": "Learning and Development Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Médecins Sans Frontières in Mar 2019", "Interview Descriptions": "Application via motivation letter and cv, phone interview, face to face interview. After the lengthy interview process, they decided not to fill the position at all. This was probably a good decision. It would be quite challenging for an external hire to manage projects at this organisation as timeliness are often not respected and the expectations not very realistic.", "Interview Questions": "Can you give an example of an energizer activity? "}, {"date": "3 Aug 2017", "title": "Social Media Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Médecins Sans Frontières (Geneva) in Apr 2017", "Interview Descriptions": "Rapid answer and planning of the interview - they accepted to see me on Skype instead of IRL because I was not able to go to their office. \r\nThe interview felt like a discussion about myself, my experience and my expectations of the position. It was casual, nice, informal. Very nice and open people, who immediately made me felt like I could be part of their team!", "Interview Questions": "What do you expect from this internship?"}, {"date": "3 Sept 2019", "title": "Nurse Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at Médecins Sans Frontières (Lignières) in Mar 2017", "Interview Descriptions": "Entetrien aen 5 etapes a valider avant d acceder a l etape suivante , Selection de la candidature , propostision de la date d entretien, entretien proprement dit ecrit et oral en francais et en anglais, confimation et invitation a la formation d avant depart.", "Interview Questions": "Accepteriez vous travailler dans un contexte a haute insecurite?"}, {"date": "20 Mar 2019", "title": "Administrateur Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Médecins Sans Frontières (Geneva) in Nov 2016", "Interview Descriptions": "Le processus requiert tout d'abord le fait de passer un test écrit, qui porte sur la gestion financière et des ressources humaines. Le test se déroule dans les locaux. Ensuite, le candidat est reçu en entretien par la responsable du pool finance.", "Interview Questions": "- Expérience dans la finance et RH ?\r\n- Capacité à vivre en mission à l'étranger, dans des conditions difficiles ?"}], [{"date": "22 Sept 2016", "title": "Medical Research Ntern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Médecins Sans Frontières (Geneva) in Aug 2015", "Interview Descriptions": "very easy - asked about my interest in MSF and health. General behavioral questions were asked too. Must be able to talk about MSF's values and know a lot about general NGO work.", "Interview Questions": "Why MSF?"}]]