[[{"date": "17 Jul 2023", "title": "Business Development Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at British Council (Beijing, Beijing) in Jun 2022", "Interview Descriptions": "Very rigorous interview process with multiple interviews, usually each time with a group of 2-4 people and there is expectation for very detailed answers with examples from your past and how you dealt with issues that came up.", "Interview Questions": "What was one time you struggled at work?"}, {"date": "2 May 2019", "title": "Exams Service Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at British Council (Guangzhou, Guangdong) in Apr 2019", "Interview Descriptions": "The interviewers are not that professional. Their oral english is awful. The way they dress is also less professional. The questions they asked are in a shorlist but not really related to my personal experience.", "Interview Questions": "what do you think it might be the biggest challenges in this new job?"}, {"date": "19 Jul 2018", "title": "Pretest Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at British Council", "Interview Descriptions": "All Behavioral questions, I am chinese, I was taking an interview with two chinese felmale interviewers, I don’t know why this interview will be in English. One of the chinese woman has bad accent.", "Interview Questions": "Why this role"}, {"date": "29 Oct 2021", "title": "Test Center Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at British Council (Shanghai, Shanghai) in Mar 2017", "Interview Descriptions": "This interview was being conducted structurally, I have been asked interesting questions targeting your experiences and skill-sets required by the job position itself. There was a panel and behaved all professionally, overall felt good about it.", "Interview Questions": "Been asked to start with a brief introduction about myself."}, {"date": "25 Jul 2016", "title": "Project Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Council (Shanghai, Shanghai) in Mar 2016", "Interview Descriptions": "Applied online and after 3 or 4 days after the deadline I'd been contacted that I was invited to the interview. there were 3 interviewers asked a lot of questions based on behavioural  interview questions", "Interview Questions": "what is your biggest challenge in your position ?"}, {"date": "28 Feb 2016", "title": "Exams Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at British Council (Shanghai, Shanghai) in Jan 2016", "Interview Descriptions": "I first applied online and was informed to take the interview after 3 weeks of the closing date of the role.\r\nThe interview lasted about an hour. I was interviewed by three local staff: the head of the team, a manager from another team and the HR. All core questions are related to your previous working experience and the duties of the role. You'll  need to give examples to demostrate how you meet the requirements of the role.\r\nThe interview was followed by a language skill test and the background check process.", "Interview Questions": "Tell us a hard task during your previous work and what you did to overcome this difficulty."}, {"date": "30 Oct 2015", "title": "Distribution Examination Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Council (Chongqing, Chongqing) in Oct 2015", "Interview Descriptions": "I was interviewed at Chongqing office by 2 Chinese staffs of BC Chongqing. One of them is the supervisor of the department Examination Distribution, the other is Art Manager. The interview lasted 45 mins, and they recorded the time. One thing I disliked in the interview was the interviewers were just reading a papersheet and asking you the questions on them word by word, it was really not interactive and feeling like face-to-face interview. It is more like a machine-man oral test, because they hardly gave you any direct/immediate responses to your answers, just moved forward to next question without any interlinks.....", "Interview Questions": "Majority of questions are related to your previous experiences. Highly suggested to learn the BC behavioral guidance. Your communication skill, teamwork skill, feedback skill and other position relevant skill can be asked to give correspondingly examples."}, {"date": "6 Sept 2015", "title": "Senior Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at British Council (Beijing, Beijing)", "Interview Descriptions": "If you are interviewing positions with any British Council office in China, it will be very focused on your CV submitted. Be sure to prepare your mock questions, and scratch your answers in advance. Good English is a much, and make sure you have good conversation with the interviewers, speak clearly is very important.", "Interview Questions": "Questions are usually based on your experiences. You will be asked to give examples for particular experiences in your CV."}, {"date": "7 Jan 2017", "title": "English Language Assessor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Council (Beijing, Beijing) in Jan 2015", "Interview Descriptions": "30 minutes by Skype with 2 interviewers.  Detailed application instructions were given beforehand that were matched to the BC core values to see if I qualified.  At least one interviewer was an examiner trainer.  The questions asked were fairly predictable.", "Interview Questions": "Why do you want to work as an English language assessor in China?"}, {"date": "6 Jul 2014", "title": "Senior Finance Officer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at British Council (Beijing, Beijing) in Feb 2012", "Interview Descriptions": "Only one round, all competency based, the interiewer were nice, but it seemed that they prefer internal candidates and someone with ACCA background. The HR was nice, the finance team was not very big, the working hours were quite normal, the salary was normally not negotiable and was disclosed in the job description.", "Interview Questions": "no difficult question, but testing the ability to respond appropriately"}], [{"date": "21 Jul 2011", "title": "Language Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at British Council (Nanjing, Jiangsu) in May 2009", "Interview Descriptions": "Sent in CV and Cover Letter.  Interview was laid back.  Asked about what challenges I foresaw when teaching in China and whether I had an ideas for lessons", "Interview Questions": "What difficulties do you think that are teaching in China?"}]]