[[{"date": "19 Apr 2016", "title": "Enrichment Teacher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Building Educated Leaders for Life (New York, NY)", "Interview Descriptions": "Nothing extensive. Quick questions and experience working with children, and how I enjoy it or not. Did I prefer to work in a particular borough? Working with others? Scheduling and pay rate. Training was mentioned and was informed I needed to attend.", "Interview Questions": "What group do I prefer to work with? My experience? Any particular place I want to work? "}, {"date": "30 Sept 2016", "title": "Human Resources Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at Building Educated Leaders for Life (Boston, MA) in Jan 2016", "Interview Descriptions": "It was the most organized interview I've ever been to. I was kindly greeted and offered coffee/tea. I met with the entire HR team, as well as the Director of HR. I never walked away from an interview so confident and sure.", "Interview Questions": "Why do you want to leave retail and join our HR team?"}, {"date": "1 Oct 2015", "title": "Enrichment Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Building Educated Leaders for Life (New York, NY)", "Interview Descriptions": "It is a group interview where candidates give demo lessons to display their skills. Candidates are required to bring in valid identification and must fill out tax information before leaving the interview, before receiving an offer letter.", "Interview Questions": "Instead of questions, you are given scenarios during a demo lesson to see how you would address behavior management within the classroom."}, {"date": "10 Jul 2015", "title": "Group Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Building Educated Leaders for Life (New York, NY)", "Interview Descriptions": "The interview process was fairly straightforward. It was a group interview. It seemed like they cared more about you as a person and what you brought than your teaching skills. There was a lot of paperwork though, before you were even offered the job they asked you to fill out tax information.", "Interview Questions": "N/A"}, {"date": "5 Aug 2014", "title": "Program Manager Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Building Educated Leaders for Life", "Interview Descriptions": "I had the initial interview over the phone.\r\nThey were pleasant and very engaging.  I think the key is to understand what they do, and of course, how they are different than the other programs.", "Interview Questions": "I don't recall the most difficult, but I do remember there was one that threw me for a loop. \r\nThey aren't your typical questions, so sit back, grab a camomile and do your best."}, {"date": "11 Jun 2014", "title": "Student Tutor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Building Educated Leaders for Life", "Interview Descriptions": "Group interview, basic questions, just trying to get a gauge on how you would work with kids. I was first recruited at a career fair at my school, then given a direct contact for an interview.  I still had to apply online, though.", "Interview Questions": "N/A"}, {"date": "9 Dec 2015", "title": "Teacher Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Building Educated Leaders for Life (New York, NY) in May 2014", "Interview Descriptions": "The group interview was conducted by two staff members. They took turns asking us questions, and we each had an opportunity to respond to each question. The questions were what you would expect applying to work with children in an educational setting. The interview felt more conversational than formal.", "Interview Questions": "What experience do you have working with children?"}, {"date": "7 Jan 2014", "title": "Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at Building Educated Leaders for Life (Boston, MA) in Dec 2013", "Interview Descriptions": "I immediately  got a call after submitting my resume the same day it  was sent.  The staff were very professional and  friendly.  I got a call from the site manager and then a call from the recruiter and had an interview by the end of the week.  As soon as the decision was made to hire me I began the online training which id very comprehensive.  If you have never  taught before or need a little refresher course this is it!  It was very well organized and quite comprehensive.  I look forward to helping improve the lives of my students.", "Interview Questions": "I am an experienced teacher so I never felt I got a question that was too difficult or unexpected.  All questions were direct and to the point as well as  important for the position involved. "}, {"date": "12 Jul 2013", "title": "Student Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Building Educated Leaders for Life (Bronx, NY)", "Interview Descriptions": "What makes you a credible candidate for the position of Student Tutor? What experiences do you have with children?", "Interview Questions": "How did you deal with an unruly child?"}, {"date": "31 Jul 2013", "title": "Teacher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Building Educated Leaders for Life (New York, NY) in Jun 2013", "Interview Descriptions": "It was too easy. They did a phone interview, and then I was set up to be interviewed the next day; it was a group interview. They had me fill out the longest job application in the world, including tax forms, which I found a little strange, since I wasn't even hired yet. We had to create 5 lessons plans for one Enrichment Program, which I completed, and they had us do a mock class which I thought was out of place for this position. The office looked empty, there was no sign of a business in this office. The excuse was it was new.", "Interview Questions": "There were no challenging questions. "}], [{"date": "31 Dec 2014", "title": "Enrollment Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Building Educated Leaders for Life in May 2012", "Interview Descriptions": "I applied to this position and within two weeks I received the call for an interview. After the interview I was immediately notified via phone that I received the position and I started training two days later. After two days of training I started working.", "Interview Questions": "During the interview I was asked if I  had any public speaking classes."}, {"date": "24 May 2012", "title": "Accounting Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Building Educated Leaders for Life in Jun 2008", "Interview Descriptions": "Contacted by a recruiter.  Next day had interview in the morning.  Spoke to direct leader.  Interview went well than spoke to the head of the department within the same interview session.  Standard interview questions.  Got offer the next day but contingent on credit check and criminal check.   Noticed the diversity within company immediately upon arriving.  Building had lots of outside light.", "Interview Questions": "List accomplishments from previous position."}]]