[[{"date": "13 Jun 2023", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Compass Health Network", "Interview Descriptions": "It was casual but professional. Laid back. The questions were appropriate and easy to answer but also challenging. I felt prepared. I was very happy to accept the position once it was offered by HR.", "Interview Questions": "My past experience as a therapist."}, {"date": "13 Mar 2023", "title": "Community Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Compass Health Network", "Interview Descriptions": "Friendly interviewing staff, they were very informative and I felt very comfortable asking questions of the positions. We had a zoom interview but it was definitely easygoing and the staff answered efficiently.", "Interview Questions": "What is a time you had a difficult problem at work and how did you handle it?"}, {"date": "30 Aug 2022", "title": "Crisis Line Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Compass Health Network (Saint Louis, MO) in Aug 2022", "Interview Descriptions": "Wasn't too bad. Mainly asked me to speak about myself and past experience.  Wasn't asked a lot of questions by the recruiter or the supervisor.  The interview was completed over Zoom, which can be annoying at times. Overall not a bad experience.", "Interview Questions": "What would you do if you had someone on the crisis line that was experiencing SI, but refused to provide you any information about themselves? \n\nWhat are some things you do to practice self care?"}, {"date": "20 Jul 2022", "title": "Integrated Health Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Compass Health Network (Lebanon, MO)", "Interview Descriptions": "After submitting the job application, I received a call from the hiring manager requesting to schedule an interview at the office. I was interviewed by the hiring manager and my direct supervisor. The interview was set up with basic questions (Tell me about yourself? Why did you leave your former job?) and behavioral questions with specific scenarios (working with a family, if X happened what would you do).", "Interview Questions": "Tell me about yourself, why did you leave your last job, what are areas that you hope to improve, and behavioral questions (specific scenarios, if X happened what would you do)"}, {"date": "13 Jun 2022", "title": "Integrated Health Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Compass Health Network in May 2022", "Interview Descriptions": "I was contacted by a recruiter and we set up a phone interview. The recrutier spent a lot of time sharing details about the job and asked about my experience in health and supporting others.", "Interview Questions": "How would you support a person on your case load that shares they are going to commit suicide and they have a plan?"}, {"date": "7 Apr 2022", "title": "School Based Clinician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Compass Health Network", "Interview Descriptions": "Screener interview was scheduled with a recruiter.  It was virtual. She asked a lot of basic questions, as well as job-specific questions. It was relatively in-depth for a screener interview.", "Interview Questions": "What brought you into this field of work?"}, {"date": "19 Apr 2022", "title": "Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Compass Health Network (Saint Louis, MO) in Apr 2022", "Interview Descriptions": "I applied at night and received an email from a recruiter to provide my availability so that we can set up an interview. I sent my availability and received an interview the following week.", "Interview Questions": "Q: what does substance mean to you?\r\nQ: what are your thoughts on medicated aided treatment?\r\nQ: tell me about a time you were under a lot of pressure and how you handled it.\r\nQ: Tell me about your proudest client moment and why\r\nQ: How do you feel about doing groups?"}, {"date": "23 Feb 2023", "title": "IHS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Compass Health Network in May 2021", "Interview Descriptions": "The interview process with Compass Health Network for the position described in this posting was not incredibly complex. It began with an over the phone screen and proceeded to a Zoom interview in the next few days.", "Interview Questions": "What drew you to this position?"}, {"date": "30 Dec 2020", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Compass Health Network (Branson, MO) in Nov 2020", "Interview Descriptions": "Interview was conducted via ZOOM. I was contacted within  week of applying. Interview was with HR recruiter and two other directors. Interview questions were typical and related to the position. The whole process from applying to getting hired was very smooth. I was impressed with how quickly they moved.", "Interview Questions": "Tell us about your current role\nWhat is your management style\nEthical questions\nWhy are you interested in this position?"}], [{"date": "5 Aug 2020", "title": "Integrated Health Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Compass Health Network (Lebanon, MO) in May 2020", "Interview Descriptions": "One interview over zoom. Very nice people, asked basic questions- strengths/ weaknesses, tell me about a challenge at work, etc.. took a few days to get back to me after interview.", "Interview Questions": "What are you strengths and weaknesses"}, {"date": "1 Jun 2021", "title": "Integrated Health Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Compass Health Network in Feb 2020", "Interview Descriptions": "The interview was approximately 30 minutes with the recruiter and direct supervisor for the team. Interview included questions regarding education and previous experience. The recruiter reviewed an example scenario and asked for specific steps in supporting the client.", "Interview Questions": "\"Tell me about a difficult situation and how you handled it?\""}, {"date": "14 Feb 2021", "title": "Psychiatry Mental Health Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Compass Health Network (Springfield, MO) in Dec 2019", "Interview Descriptions": "Met over lunch to discuss the position. I was informed about the company and benefits etc. I was given a folder that had all the information I needed. Interviewers were very friendly. It was very casual and laid back.", "Interview Questions": "This was very informal. None of the typical interview questions were asked. We just chatted over lunch and they got to know me that way."}, {"date": "21 Jul 2017", "title": "Children Behavioral Health Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Compass Health Network (Wentzville, MO) in Jun 2017", "Interview Descriptions": "I had the interview with the director of children's community services and a clinical staff member. They asked me about some regular questions. The most surprising thing is that they gave me a scenario on a paper and asked me to make a diagnosis and intervention plan.", "Interview Questions": "Tell me about an impressive client who you have ever encountered."}, {"date": "12 Apr 2017", "title": "Peer Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Compass Health Network (Wentzville, MO) in Apr 2017", "Interview Descriptions": "The interview was great. I felt at ease and not like I was being interrogated. It was sweet, short, easy, and no pressure. The interviewer was very courteous and friendly.", "Interview Questions": "What would I do if someone I knew was a client and started to cross professional boundaries?"}, {"date": "17 Aug 2016", "title": "Community Living Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Compass Health Network (Saint Charles, MO)", "Interview Descriptions": "Interview process can be intimidating if you have a problem with 2-3 people interviewing you at one time.  A background check & drug test is performed. Only one face to face interview was done for me. You will need to be certified in CPR/First Aid /Med level 1. All other training courses are offered in house.  Majority are taken on the computer", "Interview Questions": "If your client is having a behavior in public how would you handle the situation? "}, {"date": "16 Jun 2015", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Compass Health Network (Jefferson City, MO) in Feb 2015", "Interview Descriptions": "It was short. I had worked with them previously and did my inters hip under their parent company Compass Health. They knew me and I did not have to go through a traditional interview.", "Interview Questions": "Hoe do you handle confrontational clientele."}, {"date": "11 Apr 2014", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Compass Health Network (Jefferson City, MO)", "Interview Descriptions": "Interview was pretty easy.  Very relaxed attitude by interviewer.  I applied online and was called for interview  within two weeks.  The office staff was very courteous and helpful.  There were no interview questions  out of left field, and the process went smoothly.  The interview was centered around  the different aspects of community service.", "Interview Questions": "No difficult questions.  Standard questions, such as tell about your most challenging situation in a job.  Talk about your strengths and weaknesses.  I"}]]