[[{"date": "9 Feb 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Society (London, England) in Dec 2022", "Interview Descriptions": "I had three interviews. The initial interview was with the direct line manager, digital manager and a volunteer, which was a great idea and fantastic to help me understand how the organisation is run. The second was a quick interview with the potential direct line manager and the third was with peers. The interviewers were all really nice and put my interview nerves at ease. It sounds like a wonderful organisation to work for and I was disappointed I didn't get the role but wish the organisation all the very best. It looks like a lovely place to work and I was impressed with all the people I met in the process.", "Interview Questions": "What is the one thing you didn't say in the interview that you wish you had?"}, {"date": "5 Dec 2022", "title": "Public Affairs Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Society in Oct 2022", "Interview Descriptions": "Nice interviewers - the questions were very in depth and were asking for examples of a lot of experience they know I didn't have from my application. but they offered feedback session after I was unsuccessful which was incredibly helpful and appreciated", "Interview Questions": "Give an example of when you supervised volunteers"}, {"date": "6 Sept 2022", "title": "Research Communications Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Society", "Interview Descriptions": "1. Timed practical test of research communications skills - in this case, turning an academic paper into a blog post.\r\n2. Video interview with manager, head of team and, slightly unusually for this field, someone with lived experience of dementia who volunteers with the research involvement team. It was good to see this level of consideration of the needs of the beneficiaries of the charity.", "Interview Questions": "Standard questions about experience of research comms work and understanding of the field, including some on how to meaningfully involve people with lived experience of dementia in the research comms process."}, {"date": "23 Nov 2022", "title": "Associate Director, EDI Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Alzheimer's Society in Aug 2022", "Interview Descriptions": "Full on but great opportunity to meet people and understand the organisation. I didn't get the job but know this is an organisation I want to work for. Full credit to the design of the process", "Interview Questions": "I was asked about my biggest professional mistake and learning from this?"}, {"date": "3 Jun 2022", "title": "Head of Department Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Alzheimer's Society", "Interview Descriptions": "Give a 10 minute presentation on your first year in the job, followed by an interview with a panel of three people asking competency based questions. Opportunity to ask panel your own questions at the end. Done by Zoom.", "Interview Questions": "All competency based questions asked by a panel of three."}, {"date": "20 May 2022", "title": "Community Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Alzheimer's Society", "Interview Descriptions": "The interview involved a 10 minute presentation, the task was given beforehand. However, this task was only given late on Thursday and the interview was the following Monday, allowing 3 days to prepare. The rest consisted of 5 competency based questions. There was no warning of this interview style prior, which requires significant preparation. The competency questions were lengthy and communicated in a complex way. They were incredibly specific (not as generalisable as other competency-based questions which enable you to tailor them to your own experiences). Questions didn't apply to my CV, neither was there any flexibility to adapt. A very corporate structure which allowed for no individuality. Prepared to answer questions about the role - none of these questions aligned with what they had described the role required.", "Interview Questions": "Give us an example of a time that you influenced an organisation? "}, {"date": "26 Apr 2022", "title": "Stewardship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Alzheimer's Society", "Interview Descriptions": "Positive, very clear and transparent process including receiving questions and tasks within a week of interview, timely communications i.e. notified within 24 hours of interview whether i'd been successful or not, feedback provided by preferred means and really friendly panel", "Interview Questions": "Please tell us about your experience of working on multi-channel Individual Giving or\r\nFundraising campaigns, specifically stewardship, including the channels, processes and\r\ntechniques you’ve used."}, {"date": "1 Mar 2023", "title": "Reward Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Alzheimer's Society (London, England) in Apr 2022", "Interview Descriptions": "I had a virtual interview with Alzheimer’s Society which including a role based test. It was a very informal interview with a panel of two. The panel were friendly and encouraging and I felt very comfortable. I only had to wait a couple of days to hear that I had been successful.", "Interview Questions": "Standard interview questions, based on you giving examples of your experience/work."}, {"date": "23 Jun 2022", "title": "Employee Support Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Society (London, England) in Mar 2022", "Interview Descriptions": "Was invited for interview and had the interview over zoom two days later. Was still waiting for the invite link up until 5 minutes before. Was asked a few irrelevant questions   which had nothing to do with the role I applied for. One of the questions they asked was how much experince I had with HR systems in which the position I applied for was not a HR role and even the people who interviewed me said I would not be doing anything HR as they have a HR department. When I answered to the best of my ability I could tell by their faces they weren't really acknowledging the fact they asked me a stupid question. Interviewed by two people who wrote down eveything I said. Very robotic, no smiles just strict. Was told I would receive feedback which I did not receive anything just a generic email to say I had not been successful and since I did not have an interview they cannot offer individual feedback. I did have an interview. I tried to prepare for this interview but they give you no information about the interview or what it entails. I've never experienced an interview like it especially two people who are supposed to be encouraging me to work for the company but instead looked absolutely miserable.", "Interview Questions": "How would you offer help to someone that needs it?\r\nHow have you dealt with a difficult customer? "}, {"date": "23 Feb 2023", "title": "Dementia Adviser Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alzheimer's Society in Mar 2022", "Interview Descriptions": "Video call with three interviewers. 2 staff members and 1 service user. Friendly interviewers with plenty of time to answer questions. Questions were structured and pre set. Ample opportunity to ask questions at the end.", "Interview Questions": "TEll us about your previous work experience and skills that related to the position."}], [{"date": "27 Oct 2022", "title": "Dementia Adviser Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Society (London, England) in Feb 2022", "Interview Descriptions": "Friendly, straightforward. Asked a set number of questions. A bit off putting as 3 interviewers who were all writing as I answered my questions. Nice to see a service user on the panel.", "Interview Questions": "how does your past experience show ability to do the role."}, {"date": "9 Nov 2021", "title": "Business Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Society", "Interview Descriptions": "Clear and straightforward process with helpful staff. Nothing especially exciting or unique but nothing bad about the experience.  Interview was a task followed by formal interview with a panel of three. No second interview.", "Interview Questions": "How do you handle conflict"}, {"date": "31 Oct 2021", "title": "Events Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Alzheimer's Society", "Interview Descriptions": "I was first asked to order a contact database on an Excel spreadsheet. I was given around 30 minutes to complete 3/4 questions. I was then interviewed for 40 minutes by two people.", "Interview Questions": "How would others describe you to work with in a team."}, {"date": "5 Oct 2021", "title": "Policy Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Alzheimer's Society", "Interview Descriptions": "Online interview. Friendly team, made me feel comfortable. Six questions focusing on proving your competency for the role and fit for the company culture. Time to ask questions at the end.", "Interview Questions": "How would you build an effective relationship with a key sector stakeholder"}, {"date": "28 Oct 2020", "title": "Team Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Society", "Interview Descriptions": "The interview process consisted of one interview with a group of 3 employees. They asked a series of questions and took notes as they asked. They also asked about myself and my experience.", "Interview Questions": "They asked mainly about relevant experience and why I wanted the role. They also asked questions specific to the needs of the role."}, {"date": "3 Oct 2019", "title": "Programmer Delivery Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alzheimer's Society (London, England) in Sept 2019", "Interview Descriptions": "I was interviewed by 2 people,  they were both very friendly and nice. I was asked 4 competency based questions, so had to really go in depth and fully explain my answers. The interview lasted about 40 minutes.", "Interview Questions": "Tell us about a time you had to analyse a large amount of data to identify trends."}, {"date": "26 Jun 2019", "title": "Dementia Support Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Society (Leicester, England) in Jun 2019", "Interview Descriptions": "The worst interviewing techniques I've ever encountered, no engagement whatsoever,  as the panel of two were writing everything I said down, as said it.  I had to do a presentation and neither of them even looked at me because they were busy writing, totally unprofessional and unwelcoming interview.  I asked what a typical day in the job consists of and it was the only time I'd seen their faces! It was  totally weird answering questions to the top of heads and waiting minutes in between each question while they finished their scribbling, I started to feel guilty about the amount of writing they were doing and started to give shorter answers. Totally put me off, they should have sent me a copy of the questions and I could have submitted a written version for them, would have been a lot more comfortable.", "Interview Questions": "Generic questions, most of which I had already covered within my presentation, seemed more interested in getting the whole interview down word for word  on paper than anything I had to say"}, {"date": "28 Apr 2019", "title": "Side By Side Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Alzheimer's Society (London, England) in Apr 2019", "Interview Descriptions": "Short presentation about myself and then about 10 questions asked.  There were two interviewers and both of them were nice and friendly.  Interview questions were related the role. If you read job description carefully, it wouldn't be too hard. The interview took about 50 min.", "Interview Questions": "How would you measure the success of volunteer recruitment?"}, {"date": "25 Oct 2018", "title": "Mass Events Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Alzheimer's Society (London, England)", "Interview Descriptions": "2 in person interviews in 2 weeks - the first with a 2 person panel and second with 3 person panel. Written test at the beginning of 1st interview to do with events and what you would do in x situation.", "Interview Questions": "What is the most difficult scenario you've encountered planning an event and what did you do to fix it?"}], [{"date": "18 Dec 2018", "title": "Senior Policy Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Alzheimer's Society (London, England) in Oct 2018", "Interview Descriptions": "The recruitment process included an online application and two rounds of interviews - first round included a test and competency-based questions, 2nd round of interview was more about fit in the team.", "Interview Questions": "Test included questions around the NHS long-term plan and what opportunities and levers of influencing there are to get dementia on the agenda of the NHS."}, {"date": "16 Jul 2019", "title": "Senior Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Alzheimer's Society (London, England) in Sept 2018", "Interview Descriptions": "Quick turnaround, applied and heard back a few days later.  Offered interview - 1 round of interviews and offered the job following day.  The interview was approx 1.5 hours and around 8 qs", "Interview Questions": "Lots of q’s, come prepared with lots of examples of how you work"}, {"date": "19 Feb 2018", "title": "HR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Society (London, England)", "Interview Descriptions": "Competency based interview  (testing around 6/7 core competencies - each with approx. 2 questions). Followed by a presentation  to a panel (very informal - round table discussion) on what I believed the immediate priorities and challenges would be in the job for the first 12 months.", "Interview Questions": "Can you talk us through a time you had to influence a senior manager, what was the issue, your position and the outcome?"}, {"date": "1 Nov 2018", "title": "Dementia Trainer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alzheimer's Society (Manchester, England) in Dec 2017", "Interview Descriptions": "The job was advertised as a Northern Ireland role. When I was invited to interview the interviews were being held in Manchester and I had to fly to England at my own cost. This was not made clear in the job advertisement.  Due to the timing of flights I had to leave Northern Ireland at 4am in order to attend for interview and was therefore exhausted.\r\n\r\nI was asked to design and present a presentation on a training course that I could design and deliver.  I thought my presentation went very well.  There were two members on the panel (though there had been three members of the panel for the previous applicant - so no consistency there!)  One of the interviewers was pleasant and engaging, whilst the other looked like she did not want to be there at all.  I had some example training activities to show group participation.  The first interviewer enthusiastically took part whilst the other sat silently, refusing to take part. \r\n\r\nAfter the presentation an hour of interview questions followed.  The panel had a list of 20 or so questions and were debating in front of me, which ones to ask me. They changed their mind a few times.  There was obviously no consistency in the questions that different applicants were being asked. \r\n\r\nThe questions were the most difficult I have ever been asked but I had prepared well and felt I gave excellent answers.  I have performed badly in other interviews but know that I answered well for these questions. \r\n\r\nIn the end they did not offer the job to anyone and I asked for feedback.  The disengaged member of the panel phoned me to give feedback on my presentation and it was at this point that I was sure she hadn't listened to anything I had said.  The feedback was not representative of my presentation but I didn't bother to say anything as i realised that this would not be a good team to work for anyway.", "Interview Questions": "Tell me about other co-morbidities that may exist with dementia"}, {"date": "28 Aug 2017", "title": "Memory Walk Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Society (London, England)", "Interview Descriptions": "Initial task with scenario followed up by discussion of scenario and how you would proceed.\r\nTwo panelists- each asked four questions\r\nBoth panelists very friendly and interview was reasonably relaxed. Asked for feedback on interview but haven't yet heard back", "Interview Questions": "Give an example of a supporter journey you have worked on"}, {"date": "2 Jan 2018", "title": "Campaign Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alzheimer's Society (London, England) in Jun 2017", "Interview Descriptions": "I was interviewed by two senior employees. One from the Marketing team and another from the Policy and Campaigns team. It was fairly informal, very friendly and chatty. Beforehand I completed a test, which was around 45 minutes long, where I wrote copy for an email to supporters and a draft campaign comms plan. The spoken half of the interview was around 1 hour. Questions were mainly around my experiences and skills, mentioned in my application. I was also asked about the political landscape, examples of campaigns I liked, others I didn't. How I would analyse and evaluate campaigns. Both employees wrote lots of notes during the interview. I was contacted the following day with an offer. I accepted.", "Interview Questions": "Can you tell us about a campaign that you think works really well"}, {"date": "3 Apr 2017", "title": "Research Grant Office Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Society", "Interview Descriptions": "The interview was with a two people panel, preceded by a 45 minutes written test. Questions were the typical HR prepared question,  which don't always have a direct relation to the position. The process felt a bit meaningless,  and certainly didn’t give a feel what working for them would be like.", "Interview Questions": "What is your greatest achievement over the last 12 months?"}], [{"date": "13 Dec 2016", "title": "Network Research Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Alzheimer's Society", "Interview Descriptions": "Application sent to volunteer co-ordinator who then forwarded on my details to the Research Network Engagement Officer who reviewed my application. The Engagement Officer then emailed me a questionnaire for me to fill out and send back. this was very brief and asked only a few questions on my experience and knowledge of the role. Once this had been sent back to the Officer my details were then passed on to the Research Network Volunteer Area Manager in Northern Ireland who contacted me with a few brief notes as to what the role would entail.\r\n\r\nOverall the process was very brief and was more just to ensure my experience matched the job role.", "Interview Questions": "What experience/knowledge do you have do you have of dementia/caring for someone with dementia?"}, {"date": "17 Feb 2017", "title": "Regional Trainer NI Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Alzheimer's Society (Belfast, Northern Ireland) in Oct 2016", "Interview Descriptions": "I applied online and was offered an interview a week later.  I was asked to prepare a Micro Teaching Session on any subject lasting no more than 10 mins and this was to be based on Kolbs Learning Cycle.  I was also informed there would be a second presentation and I would receive this on the day.  When I arrived I was invited into a quiet room and the interview process was explained to me.  I was provided with a case study and provided flip chart paper to present to the panel.  This was a case study and 4 questions needed to be answered.  I was invited into the interview room 20 mins later and was introduced to the panel. I was made to feel very much at ease . I presented my micro session, my case study findings on flipchart and I was asked 8 questions.  The panel of 3 interacted well with my micro session (Just as well as I needed their participation). \r\nOverall I found it to be a positive experience, made to feel so welcome, good interaction with the panel and they made me feel relaxed and that they had a genuine interest in my skills, values and experiences.", "Interview Questions": "They asked about volunteer training and would I do anything different?"}, {"date": "10 Jun 2016", "title": "Regional Trainer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Society (Cardiff, Wales)", "Interview Descriptions": "Panel interview, including delivering micro training session prepared in advance and presentation prepared from information given just before the interview. The wall between the waiting area and the interview room was very thin, so I could hear the previous candidate being interviewed. When she left, I also heard what they said about her and about their other colleagues. What they were saying wasn't pleasant, and made me very sure I would not want to work for this organisation.", "Interview Questions": "Questions around working with volunteers and people with lived experience of Alzheimer's."}, {"date": "16 Nov 2016", "title": "Human Resources Business Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Alzheimer's Society (Reading, England) in Jun 2016", "Interview Descriptions": "A very through interview process, only one interview with a panel of 3 people. The interview involved some written assessment and took around 2 hours. Made to feel very welcome and comfortable, the process was made very clear at the start of the interview. After the interview I was contacted by the agency later the same day to give feedback and received an offer on the Monday (my interview was a Friday).", "Interview Questions": "Competency based questions around previous experience and developed around the organisations values and behaviours."}, {"date": "15 Aug 2017", "title": "PA Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Society (Belfast, Northern Ireland) in Apr 2016", "Interview Descriptions": "Long test before the interview started.  Manager and another interviewed me and I did not get a good vibe from them.  If I had been in a better situation jobwise, I would not have taken the job when it was offered to me.\r\n\r\nInterviews were not held in the office, but at NICVA which seemed strange at the time.  On commencing employment and seeing the state of the office, I could see why.", "Interview Questions": "They asked me to devise an induction plan for the office."}, {"date": "26 Sept 2016", "title": "Human Resources Operations Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Society (London, England) in Sept 2015", "Interview Descriptions": "There was a skills assessment prior to the interview that lasted about an hour. This was a written assessment. There followed a Panel interview with the Head of HR Operations, a regional business operations person and a legal/ER person which commenced with a presentation that I had prepared for at home. The topic was what they could expect me to deliver within the first 12 months.  The room was far too small to be able to present adequately and I felt like I was talking to the wall.  The panel asked questions in turn, about 15 in all and then I had the opportunity to ask questions some of which the Head of HR Ops struggled to answer.  I was offered feedback post interview which I was keen to arrange but after several calls and e-mails, it was never forthcoming.", "Interview Questions": "Tell us about recent or upcoming changes to employment legislation and how that would impact this company."}, {"date": "8 Oct 2015", "title": "Project Support Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Alzheimer's Society (London, England) in Aug 2015", "Interview Descriptions": "Was a friendly interview panel consisting of three managers who quickly explained the interview process and then took turns asking questions. Lasted 25 minutes and consisted of scripted HR-type questions that made answers somewhat restrictive. The panel would write down the answers as they were given. I received an answer by phone the next morning explaining why I wasn't successful.", "Interview Questions": "What is your experience with project management methodologies?  \r\n"}, {"date": "10 Jun 2016", "title": "Human Resources Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Alzheimer's Society (Horsham, England) in Jul 2015", "Interview Descriptions": "Sat in a room alone for 1 hour doing a paper based test with scenario questions. I was given brief instructions. Then in front of a panel of 3, firstly going through the test responses and then a panel interview.", "Interview Questions": "They asked for an example where I had advised/supported managers in a difficult situation"}, {"date": "25 Feb 2016", "title": "Events Organizer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Alzheimer's Society (London, England) in Feb 2015", "Interview Descriptions": "I was put forward for this position via a recruitment agency so did not need to follow application process. 30 minute interview at the HQ in the lovely St Katharine's Dock, Tower Hill, London. The interviewers were two senior members of HR and they were very friendly, warm and encouraging. They didn't ask any trick questions and made me feel at ease. The office environment seemed busy but relaxed, the other staff I came across were very chatty; generally it seemed a nice environment to work in.", "Interview Questions": "Tell us about an event you have organised.\r\nWhat stakeholders do you think would be involved in our events?\r\nWhat problems might you anticipate with an A.S. event?\r\nHow would you deal with any issues such as a late speaker?"}], [{"date": "9 Nov 2014", "title": "Locality Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Society", "Interview Descriptions": "I had one interview with 2 people on the panel. I was asked questions about data protection, being organised, using your initiative and meeting deadlines. The interview lasted 15-20 minutes. I didn't receive an offer and was put on a recruitment list.", "Interview Questions": "What do you know about the needs of alzheimers patients."}, {"date": "18 Mar 2017", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Alzheimer's Society (London, England) in Sept 2013", "Interview Descriptions": "I applied on line. They rang me up to ask me to attend an interview. It was a 45 minute talk, fairly informal. Plenty of time to go through my skills and experience. Two people on the panel.", "Interview Questions": "Talk us through your employment history."}, {"date": "18 Sept 2015", "title": "Event Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Alzheimer's Society (London, England) in May 2011", "Interview Descriptions": "One interview made up of face to face interview with two members of staff. Interview was made up of  standard questions e.g. tell us about your experience, talk us through a difficult situation etc, lasted approx. 45 minutes.\r\n10 questions followed by computer based competency test- 'how to plan an event'", "Interview Questions": "Why did you want to apply for this role?"}]]