[[{"date": "21 Apr 2023", "title": "Adminstrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hawaii Pacific University (Honolulu, HI)", "Interview Descriptions": "This was an excellent interview. It was well organized and I was treated with respect and dignity throughout the entire process. The interviewers were polite and respectful. I was introduced to all relevant stakeholders.", "Interview Questions": "Please tell us why you are interested in this position."}, {"date": "5 Apr 2021", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hawaii Pacific University (Honolulu, HI)", "Interview Descriptions": "It was Pretty informal. I Just met with one head of a small department . They needed to fill a class pretty last minute.  So basically wanted to know my schedule", "Interview Questions": "Asked about  my teaching  experience "}, {"date": "6 Dec 2020", "title": "Residence Life Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Hawaii Pacific University", "Interview Descriptions": "I met with the director and we spoke for about a half hour. She was very welcoming and allowed me to work as independently as needed, I felt trusted and empowered during my time there.", "Interview Questions": "Can you use Microsoft excel? "}, {"date": "16 Aug 2021", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hawaii Pacific University (Honolulu, HI) in Oct 2019", "Interview Descriptions": "Straight forward, nothing tricky. Overall just prepare for discussing what is relevant about your background and what you bring to the table. Focus on what you value you can bring to their org and not just tooting your own horn.", "Interview Questions": "Tell us more about you, why you applied here"}, {"date": "27 Jun 2020", "title": "Technical Analyst Assistant - Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Hawaii Pacific University (Honolulu, HI) in Jan 2019", "Interview Descriptions": "After I applied the manager reached out to me very quickly to schedule an interview. I arrived to the location and other employees helped me find her and the environment was kind of messy but in the organizing process. The face to face interview was very comfortable and quick.", "Interview Questions": "How do you deal with frustrated people?"}, {"date": "12 Oct 2020", "title": "Ogp Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Hawaii Pacific University in Mar 2018", "Interview Descriptions": "It was awesome  and easy first interview I got hired in during to covid and how bad they were hiring. Stephanie is really great and works with scheduling", "Interview Questions": "How many years have you had customer service experience?  "}, {"date": "8 Mar 2017", "title": "Admission Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hawaii Pacific University", "Interview Descriptions": "Notification of the interview was via email. The interview itself was with a panel of three people, two directors and one academic counselor. The offer was over phone with no room for any type of salary or benefit negotiation.", "Interview Questions": "Tell us about a difficult time at work and what you did to fix it?"}, {"date": "5 Feb 2017", "title": "Systems Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Hawaii Pacific University (Honolulu, HI)", "Interview Descriptions": "Two part process building from a local department interview, to a panel interview with the CIO in the lead chair. Somewhat informal interview process, but otherwise extremely professional and completely relevant and honest to the position.", "Interview Questions": "What do you look for when evaluating a future employers organizational culture, and what kind of culture/work environment to you hope to be a part of?"}, {"date": "8 Jan 2017", "title": "Foundation Marketing Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Hawaii Pacific University (Honolulu, HI)", "Interview Descriptions": "The interviewers took at least 3 months after the interview to tell me that I didn't get the job (and didn't seem to rush in getting this position filled). The two-people interview panel were nice enough. However, if I had known this position had a high turnover rate in over a decade, I would've thought twice before applying.", "Interview Questions": "Why did you apply for this job?\r\nWhat do you like best about event management?"}, {"date": "4 Jul 2016", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Hawaii Pacific University", "Interview Descriptions": "No interview required. I simply applied and that was it. Later I had to go to Human Resources in order to fill out some paper work and such. Other than that a fairly simple process.", "Interview Questions": "N/A"}], [{"date": "2 Dec 2017", "title": "Technical Support Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Hawaii Pacific University (Honolulu, HI) in Jun 2016", "Interview Descriptions": "I interviewed over the summer and their main recruitment manager had just left the department. I emailed with the manager of the IT department and came in for a brief interview after two weeks.", "Interview Questions": "Tell me about yourself."}, {"date": "21 Jan 2018", "title": "Admissions Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Hawaii Pacific University (Honolulu, HI) in May 2016", "Interview Descriptions": "The interview process was straightforward, having applied for the position off the main HPU website and filling out a simple application, I was contacted three weeks later and met the Assistant Director and Manager for a short 15 minute interview in a conference room. Typical questions about my work experience background and what is expected of the job position. Another two weeks would pass before hearing the decision about hiring me on, and doing all the standard paperwork at the university.", "Interview Questions": "What is one challenge you had to deal with and how did you overcome it?"}, {"date": "8 Jul 2017", "title": "Campus Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Hawaii Pacific University (Honolulu, HI) in Feb 2016", "Interview Descriptions": "Very easy-going, friendly staff. It was like talking with a friend, but at the same time, you had to sell yourself perfectly. If you're not confident in yourself, you will not get the job. You need to have a smile 100% of the time!", "Interview Questions": "Why do you want to be a tour guide?"}, {"date": "7 Oct 2015", "title": "Writing Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Hawaii Pacific University", "Interview Descriptions": "Not much, really. A discussion and a review of your written work. After all, you are just a student helping another student. Interviewer pretty much perused your material that you bring in or the one that was referred to them by another professor and asked some simple personality questions and stuff like why would you like to be a tutor.", "Interview Questions": "If a student has writers block and comes to your for help, what steps would you take to get them out of their funk."}, {"date": "1 Jun 2015", "title": "Writing Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Hawaii Pacific University (Honolulu, HI) in Jan 2015", "Interview Descriptions": "I was interviewed by two different people, my supervisor and the department head. They tried to make sure that they did not ask the same questions, but some of it overlapped. I had to wait between the two interviews so it took a while, but it was okay. The interview took place in their offices which was not too hard to find, especially since I was already a student at the school.", "Interview Questions": "What do other people mention as your strengths/weaknesses?"}, {"date": "16 Jul 2014", "title": "Assistant Professor, Humanities Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Hawaii Pacific University (Honolulu, HI)", "Interview Descriptions": "When I came on board as assistant professor in 2006, a different board of administrators was making decisions. Administration was pretty iffy, and I now know corrupt,  but the faculty members I met and the students were a lot of fun.  Everyone knows we are in an island environment.  I was happy to move here.", "Interview Questions": "Dean of the time offered me an entry level starting salary of $48,000, although I had nine years of teaching experience.  He was pretty awful and eventually was dismissed."}, {"date": "20 Jun 2014", "title": "Commuter Services Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Hawaii Pacific University", "Interview Descriptions": "It was a standard interview. They conducted a skype interview since I was on the mainland. There were 3 rounds of interviews for the position with staff from across university. Very long process.", "Interview Questions": "There are scenarios. "}, {"date": "12 Jun 2015", "title": "University Scheduler Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Hawaii Pacific University (Honolulu, HI) in May 2014", "Interview Descriptions": "This was a lateral move from another department.  It wasn't necessary to interview as I was doing the same job in another department.  I did a sit down get to know you with my future supervisor.", "Interview Questions": "What type of management do you like to work with?"}, {"date": "12 Mar 2014", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Hawaii Pacific University (Honolulu, HI) in Sept 2013", "Interview Descriptions": "I was called for an interview within a week after submitting my application. I didn't know what to expect as I didn't get many details over the phone. When I got there I actually had a board interview with the manager and 3 other current employees. However the atmosphere was relaxed and everyone was friendly.", "Interview Questions": "How was your relationship with your previous Supervisor?"}, {"date": "20 Apr 2015", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Hawaii Pacific University (Honolulu, HI) in Jan 2013", "Interview Descriptions": "Lag of time. No requirements for letters of recommendation, previous work, etc. A short technical presentation. They ran out of money so there was no campus visit, only Skype interview. They seem unorganized and lazy.", "Interview Questions": "Rather uninformative and not specific. No mentioning of academic outcomes, standards, grants, etc."}], [{"date": "28 Feb 2013", "title": "Education Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hawaii Pacific University in Jan 2013", "Interview Descriptions": "I submitted my application online and received a phone within a few days stating the date and times available for an interview if interested. I returned the call and scheduled an interview for the next day.\r\n\r\nThey have the job posting and requirements/specifications printed for you and allow you time to review it, if need be.\r\n\r\nYou are interviewed by 2 to 3 people: the person you are replacing, your future boss and their boss. They take turns asking questions and each person writes their comment on the paper with the questions. \r\n\r\nYou will get asked typical questions, such as:\r\n\r\n\"Why are you interested in this position?\"\r\n\"What is something you can provide for HPU?\" \r\n\"Would you rather be told all the details of a task or just a 'short-version'?\"\r\n\"Why should we hire you?\"\r\n\r\nThey'll ask questions to determine how you handle constructive criticism, mistakes, and/or any logistics issues, such as:\r\n\r\n\"Give an example of how you would handle a situation when it's brought to your attention that you are doing something incorrectly.\"\r\n\r\n\"What would be a reason you cannot make it to work on time?\"\r\n\r\nAnd you might get presented with a scenario or two, such as:\r\n\r\n\"It's lunch time, you haven't eaten yet and the deadline is coming up on a project for your boss soon. You are helping a customer, the phone rings, an angry customer comes in demanding help. Run through how you would handle this situation.\"\r\n\r\nIf you feel you didn't answer a question to the best of your ability, you can go back and explain or clarify your answer. They also allow room for your questions.\r\n\r\nYou will not get feedback right away, it's up to HR to get back to them and then they inform you. This process could take weeks.", "Interview Questions": "What kind of person do you have a hard time working with?"}, {"date": "8 Nov 2013", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Hawaii Pacific University (Honolulu, HI) in Aug 2012", "Interview Descriptions": "it was a part time student worker position in a faculty relate office. the interview questions was wrote on a piece of paper and interviewers took notes on my answer during interview. i think they can decide if they want hire someone or not but first few minutes.", "Interview Questions": "it was my first official interview with more than 3 interviewers, so i paused little when i was asked about weakness"}, {"date": "8 Apr 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Hawaii Pacific University (Honolulu, HI) in Nov 2011", "Interview Descriptions": "As with any higher education hire, this was a long process. In Hawaii it is best to be local. When looking for a job, already have a Hawaii address. The teaching portion of my interview process was waived as one member of the hiring committee had already evaluated me in a previous situation. This institution puts a very high priority on teaching ability", "Interview Questions": "You are aware that this will be a full-time position? You cannot hold any other positions whilst working here."}, {"date": "22 Oct 2012", "title": "MAIL ROOM Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Hawaii Pacific University (Honolulu, HI) in Mar 2009", "Interview Descriptions": "I was referred to opportunity to work in the mail room department by a fellow teammate and at that time a current mail room employee. The interview process was simple. I just met with the department head and answered a few normal questions. The school seems to always be more than willing to hire student workers if they are looking for work.", "Interview Questions": "Quite honestly i cant remember any difficult questions. We mainly chatted about what i do and what i studied."}, {"date": "5 Aug 2010", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Hawaii Pacific University (Honolulu, HI) in Jun 2008", "Interview Descriptions": "I met directly with the person that I would be working for if selected for the position. The person I interviewed with talked in generalities about the job duties, and I gave him an overview of how my previous experiences were similar to what they were looking for. The interview lasted about 30 minutes, and seemed to go well; however, I was not selected.", "Interview Questions": "How do you accomplish your daily duties when there are frequent interruptions?"}]]