[[{"date": "8 Jun 2023", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Loyola Marymount University", "Interview Descriptions": "I sat down with the manager and had a quick interview that probably lasted around 15 minutes. I went in at the beginning of the school year before other students were looking for jobs.", "Interview Questions": "What is your schedule like?"}, {"date": "17 Mar 2023", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Loyola Marymount University (Los Angeles, CA) in Feb 2023", "Interview Descriptions": "Very easy and straightforward! It asks you questions, but the questions truly invite you to show who you are firsthand. I would say, just be yourself! You definitely need to be honest in what you say, but your answers will show your morals, persona, and values.", "Interview Questions": "\"If you see a group of students drinking in their dorms--not allowed--what would you do?\""}, {"date": "3 Dec 2022", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Loyola Marymount University", "Interview Descriptions": "One meeting where I met with the assistant to the dean of students. I applied on the LEO page and she responded quickly. Every staff in the department is very nice and easy to talk too.", "Interview Questions": "Why are you interested in this position?"}, {"date": "4 Feb 2023", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Loyola Marymount University (Los Angeles, CA) in Dec 2022", "Interview Descriptions": "the head of sftv interviewed me, he is pretty nice, the interview went well and i got the job, nothing too complicated. I am happt with where i am right now.", "Interview Questions": "what can you bring to the department"}, {"date": "4 Nov 2022", "title": "Executive Assistant to the Dean, School of Education Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Loyola Marymount University (Los Angeles, CA) in Nov 2022", "Interview Descriptions": "Applied online. About a week later, I was excited to see an email from HR that they were considering my application. However, as I got to the end of the email they were requesting I complete three (3) lengthy, time consuming scenario assessments. (see them under interview questions) 'Submitted responses are evaluated using a rubric and selected candidates are then extended an invitation to interview for the second stage. Please do let me know if you do not wish to continue your candidacy for the position. The hourly salary budgeted for this position is projected not to exceed $35/hour with occasional overtime available.' I graciously emailed back thanking them but declined the assessment. Since my submitted Cover Letter and Resume highlighting my 10+ Years C-Suite support experience led you to reach out to me for this position, lets have a conversation (interview) and get to know each other. I understand you are looking for the right candidate but I need to equally make sure this is a good fit for me. They replied stating they've removed me from consideration . Sorry, but I do not work for free and no other well-versed EA should either. These assessments are time consuming, biased, and not personable. LMU is missing out on some incredible candidates with this method. I am interviewing at other companies that pay double (and salaried) and don't put candidates through BS assessments.", "Interview Questions": "ASSESSMENT QUESTIONS: PS1. Planning Skills, Taking Responsibility It is your first week on the job, and there is much to learn about the organization, your position, and your scope of responsibility. After welcoming you and showing you your office, your supervisor directs your attention to a set of School of Education (SOE) Box folders which includes an annual calendar of events and recurring work responsibilities pertinent to your role. You have joined the organization at a busy time of year for the SOE with several looming deadlines. What steps will you take to ensure you are aware of your and the organization’s responsibilities and deadlines? Prepare an email to your supervisor explaining the steps you plan to take to educate yourself and get started as well as what you need from him/her in order to proceed with confidence. PS2. Organization Skills, Core Knowledge One of the multi-step projects you will be coordinating for the SOE is an annual calendar for the SOE Board of Visitors. The BOV was recently reimagined as a working board with three subcommittees. The two new co-chairs, the dean and the associate dean of strategic initiatives are in the midst of planning for the year ahead, including receptions, board meetings, committee meetings, critical correspondence, etc. The new BOV will have three committees focused on: fundraising, leadership, and strategy. The Board meetings and receptions will be in person and the committee meeting will be held via zoom. Among the goals of this undertaking are: build community among the new members; keep the members informed of the SOE’s goals, initiatives and developments; and support committee effectiveness in helping the SOE thrive. Develop a 12-month plan for the Board of Visitors that supports these goals and ends Nov 2023 with a culminating event that captures the hard work and initial impact of the newly revised BOV. The plan should demonstrate your skills and knowledge in organization, planning, design, communication, outreach, analysis, and implementation. Please include key dates, information you will provide to and/or request from whom, organizing strategies and tools you would use, etc. LMU R4958 Page 2 of 2 PS3. Ethics, Judgement, Concern for Org Culture You received a warm welcome from the SOE staff and faculty. Five weeks after your arrival, a faculty member approaches you about a topic discussed in a leadership council meeting, which they are not a part of. The request seems rather benign. What do you do? Why?"}, {"date": "18 Aug 2022", "title": "Administrative Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Loyola Marymount University", "Interview Descriptions": "for a position with the disability support services office. it was about 40 minutes long with mostly behavioral questions and a couple of situations. i thought the interview went well, but it has been over a week with no response (I did follow up with thank you letters within 24 hours). there was 2 interviewers.", "Interview Questions": "tell us what you know about LMU and this role."}, {"date": "6 Jul 2022", "title": "Assistant Director (Admission) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Loyola Marymount University", "Interview Descriptions": "I was contacted for a zoom interview a month after I applied. At the end of the zoom I was told it may be a few weeks and that I would hear either way. It's now been a month and I haven't heard anything. I also sent a follow-up that was ignored. It would have been nice and considerate to hear something - even if it's a no.", "Interview Questions": "From what you understand, what does the role entail?\nWhat is a success or failure you experienced during COVID?"}, {"date": "13 Apr 2022", "title": "Account Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Loyola Marymount University", "Interview Descriptions": "Friendly people, clear explanation of job duties. It's a larger organization so it's more process oriented.  I like the location and love the idea of working on a college campus. Lots of red tape though and the pay doesn't seem great.", "Interview Questions": "What experience do you have in accounting?"}, {"date": "18 Oct 2022", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Loyola Marymount University in Apr 2022", "Interview Descriptions": "Went very smoothly, and really gives you the opportunity to express yourself. Very casual and felt at home during the interview. Had a lot of questions about how I envisioned the work contributing to college life.", "Interview Questions": "How do you work with stress and deadlines?"}, {"date": "9 Mar 2022", "title": "Director of Event and Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Loyola Marymount University", "Interview Descriptions": "In Person one-on-one interview process. Asked questions about the job and yourself. Talk about how to deal with a client and what would you do in the situation. Express yourself and your ability to work in a team and strengths and weaknesses.", "Interview Questions": "q: why is this job best for you?"}], [{"date": "3 Aug 2022", "title": "interntional orientation leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Loyola Marymount University (Los Angeles, CA) in Mar 2022", "Interview Descriptions": "The interview went great. The meeting started at the agreed time, the recruiters  did not have me waiting. They were polite and asked questions that helped me understand the type of employee that they needed.", "Interview Questions": "don't remember the specific questions"}, {"date": "18 Jan 2022", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Loyola Marymount University", "Interview Descriptions": "Had several interviews that were out of order. Unclear who the position reports to, job duties were not defined and no follow up. Same questions were asked and no thought of leadership. Sounds like the team is mismanaged and overworked!", "Interview Questions": "What’s your communication style like?"}, {"date": "20 Oct 2021", "title": "President Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Loyola Marymount University", "Interview Descriptions": "There was none, it was a club team in college. It was a good experience nonetheless. Thirty word minimum for sure. Although I am not there quite yet, this should do it.", "Interview Questions": "What was your experiences in the game called life?"}, {"date": "9 May 2022", "title": "Materials Science Lab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Loyola Marymount University (Los Angeles, CA) in Aug 2021", "Interview Descriptions": "Overall an easy interview, just was asked questions about my prior experience and what other lab work I had done. Then we talked about the technical skills required and how I could contribute to the lab. Overall it was very conversational.", "Interview Questions": "What was an experience that could prepare you for this opportunity? "}, {"date": "27 Jul 2021", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Loyola Marymount University", "Interview Descriptions": "There were several rounds of interviews with the same panel and similar basic interview questions. It's a month long of toll with reference check but no follow up at the end.", "Interview Questions": "How do you work in the team environment?"}, {"date": "28 Nov 2020", "title": "Orientation Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Loyola Marymount University (Los Angeles, CA)", "Interview Descriptions": "The interviewer asked good and thought-provoking questions,  the process was straightforward and stress-free. The questions were specific to the role/preference stated on the app form in regards to dept. within the orientation team and how special skill sets could be beneficial to the role.", "Interview Questions": "Describe a challenge in your life and how you overcame it. "}, {"date": "20 Aug 2020", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Loyola Marymount University", "Interview Descriptions": "Contacted me via email to set a time. We had a conversation about my academic interests and research experiences. This was used for them to determine if I was of value to the project.", "Interview Questions": "Tell us about your interests?"}, {"date": "2 Mar 2020", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Loyola Marymount University", "Interview Descriptions": "Asked basic questions abut previous experience, conflict management, and availability. The process was very informal and I was called within the day with a job offer. Also, I was asked if I was offered work study.", "Interview Questions": "Why do you want to work here?"}, {"date": "21 Nov 2019", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Loyola Marymount University", "Interview Descriptions": "Short interview with the head of the department, asked about previous tutoring jobs, sent an email later confirming the job - very simple process, straight forward. Head of department was easy to communicate with and relaxed", "Interview Questions": "Have you been a tutor before? explain."}, {"date": "17 Oct 2019", "title": "Assistant Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Loyola Marymount University (Los Angeles, CA)", "Interview Descriptions": "Meeting with faculty chair about background, experience, and personal goals. Discussion of courses, student admittance, and the work and course outcomes for the department. Followed up with conversation about self and what goals were for the future as well as candid convo about pay and position.", "Interview Questions": "Background "}], [{"date": "8 May 2019", "title": "Event Operations Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Loyola Marymount University", "Interview Descriptions": "Quick interview about 30 minutes with the boss as well as 1-2 current managers. As they already know you most of the questions refer to how you would fit as a manager.", "Interview Questions": "How would you set up an event given the schedule. "}, {"date": "6 May 2019", "title": "Institutional Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Loyola Marymount University (Los Angeles, CA)", "Interview Descriptions": "1) Submit online application 2) Hiring manager phone interview 3) in-person interview. The online form is straightforward. I answered standard questions on employment history and skills, I also had to submit a resume and cover letter. In the phone interview, the director asked about my skillset in more detail and about the Institutional Research and Higher Education industry. The in-person interview was with the rest of the office. I also met with a few other people at the university. Many of the same questions were asked across interviews.", "Interview Questions": "What is the role of Institutional Research in Higher Education?"}, {"date": "19 Jan 2019", "title": "Front Desk Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Loyola Marymount University", "Interview Descriptions": "Applied through mylmu for front desk assistant position at the freshman doorms. Was interviewed at the student housing office. Interview was casual, outside of the office talked more about my studies then work", "Interview Questions": "Why did I apply for this job?"}, {"date": "19 Jul 2018", "title": "Student Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Loyola Marymount University", "Interview Descriptions": "The interview process here at Loyola Marymount University for the position at the William H. Hannon Library was farily simple. Since it's a student position, they just want to know availability and work study allotment.", "Interview Questions": "What is your past work experience\r\nWhat are your hours"}, {"date": "15 Jun 2018", "title": "Senior Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Loyola Marymount University (Los Angeles, CA) in May 2018", "Interview Descriptions": "I applied online after finding the job posting. I scheduled an interview, which took a few weeks due to unavailability in their part. I interviewed with two managers and later spoke briefly with the department head. I came back for a second interview with the vice president of university relations.", "Interview Questions": "What do you have difficulty with?"}, {"date": "17 May 2022", "title": "Web Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Loyola Marymount University (Los Angeles, CA) in Jan 2018", "Interview Descriptions": "Interview was relaxed and casual with standard entry level web developer questions. Interviewer was friendly and explained the job well. Process was a bit slow; did not hear about results until several weeks later.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "10 Aug 2017", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Loyola Marymount University (Los Angeles, CA) in Jul 2017", "Interview Descriptions": "Very detailed and informative. Met with the director, vice provost, and admissions staff. Very long interview be prepared. Had to conduct an alma mater presentation and discuss resume and college experience.", "Interview Questions": "What is your definition of success for the first three months on the job?"}, {"date": "24 Jun 2017", "title": "HR Leader Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Loyola Marymount University (Telephone, TX) in Jun 2017", "Interview Descriptions": "After the application submission there was a paper review and recruiter screening \r\nThen a paper review by the search committee.\r\nAsked for references and transcripts.\r\nWas screened out at this part of the interview", "Interview Questions": "Why am I interested?"}, {"date": "13 May 2017", "title": "International Orientation Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Loyola Marymount University (Los Angeles, CA)", "Interview Descriptions": "First, attend an information session\r\nSecond, apply online\r\nThird, a percentage from the applicants is accepted and if you are accepted you need to schedule an interview \r\nForth, in-person interview\r\nFifth, final response", "Interview Questions": "Provide 3 skills that made me suitable for the job position. "}, {"date": "26 May 2017", "title": "Graduate Student Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Loyola Marymount University (West Los Angeles, CA) in Apr 2017", "Interview Descriptions": "the previous GA emailed me first and then she asked me questions on behalf of the professor who's teaching that class.  Also a professor of mine recommended me to the job.", "Interview Questions": "What would I do to teach the lab?"}], [{"date": "31 Jul 2018", "title": "Administrative Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Loyola Marymount University (Los Angeles, CA) in Jan 2017", "Interview Descriptions": "the interview was broken up into several parts. i first met with one person, then the entire team, then another individual. it was a positive experience and went relatively quickly.", "Interview Questions": "where do you see yourself in 5 years"}, {"date": "28 Jul 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Loyola Marymount University", "Interview Descriptions": "I had two in person interviews, the first with HR and two employees from the Dean's office. The second interview was with the direct supervisor and the former employee in that role who was being promoted within the department. Pretty standard interview process, they just want to make sure you are a right fit for the team.", "Interview Questions": "What are your career goals?"}, {"date": "16 Jul 2015", "title": "Departmental Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Loyola Marymount University", "Interview Descriptions": "the interview process was easy. Just 1:1 interview, which lasted for 15 mins and I got in . If you can start working as a departmental research assistant. Pay was good at that time and I enjoyed working with professors. very knowledgable professors and staff is very supportive too.", "Interview Questions": "when are you planning to graduate?"}, {"date": "26 Jun 2015", "title": "Grad Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Loyola Marymount University", "Interview Descriptions": "An email was sent to the entire class if desired to have a position and whoever responded had a phone interview with the professor. The phone interview was short and easy to answer.", "Interview Questions": "What are your strengths?"}, {"date": "19 Aug 2019", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Loyola Marymount University (Los Angeles, CA) in Mar 2015", "Interview Descriptions": "There were group interviews, then individual interviews. There were multiple group interviews in the same day, and it was difficult to get a word in or prepare well. Asking previous RA's for their insights is beneficial.", "Interview Questions": "How do you solve conflict between residents?"}, {"date": "23 Apr 2015", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Loyola Marymount University (Los Angeles, CA) in Mar 2015", "Interview Descriptions": "It started with a phone interview, then an interview with the Director and VP of University Relations. The final round was an all-day interview with various departments and team members. Very long process, but always transparent. It was a very welcoming and comfortable experience. Really great people at LMU and very passionate.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "22 Apr 2018", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Loyola Marymount University (Los Angeles, CA) in Jan 2015", "Interview Descriptions": "The interview was very relaxing. I walked in, told the receptionist who I was and who I was supposed to meet with, and then the interviewer came and got me. We walked back to her desk, and she asked me a few things related to my resume.", "Interview Questions": "Are you familiar with Excel?"}, {"date": "9 Jul 2015", "title": "Work Study Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Loyola Marymount University (Los Angeles, CA) in Jan 2015", "Interview Descriptions": "I was having trouble finding a work study job on campus and my friend told me that her current boss was hiring in the education department to take on an administrative role. I printed out my resume and walked in to meet with her boss, but she had left the office for a meeting. I left my documents with reception and heard back two days after. I had a quick phone interview and went into the office and I was told that I got the job! Great experience working in the Education department at LMU!", "Interview Questions": "What experience do you have in an Administrative role?"}, {"date": "15 Sept 2015", "title": "Senior Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Loyola Marymount University (Los Angeles, CA) in Dec 2014", "Interview Descriptions": "I was referred by another employee, so I was contacted by the director of the department to which I was applying to and we scheduled an in person interview. They were exceptionally kind and informed me about the benefits of working at LMU.", "Interview Questions": "When can you start?"}, {"date": "24 Mar 2014", "title": "Housing Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Loyola Marymount University", "Interview Descriptions": "Had to do a written application as well as an interview.", "Interview Questions": "N/A"}], [{"date": "13 Mar 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Loyola Marymount University", "Interview Descriptions": "Very pleasant interview. I was sitting in a room of three people, but it still felt very comfortable.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "3 Dec 2013", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Loyola Marymount University", "Interview Descriptions": "Each department interviews differently.", "Interview Questions": "List your worst quality."}, {"date": "4 May 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Loyola Marymount University (Los Angeles, CA) in Aug 2013", "Interview Descriptions": "I met with my employer and we discussed the expectations of the job as well as my qualifications that got me the interview. We then discussed my expectations for how i hoped to get out of the position.", "Interview Questions": "What other involvements do you participate in?"}, {"date": "20 Jun 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Loyola Marymount University (Los Angeles, CA) in Jul 2013", "Interview Descriptions": "I had an interview with one of the Deans who assessed my skills in event planning and clerical duties. He then decided to hire me because of my knowledge with organizing camps. I worked on the ACLU Deans convention and found that I had much flexibility managing and workload.", "Interview Questions": "How are you with research? "}, {"date": "2 Nov 2015", "title": "Community Relations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Loyola Marymount University (Los Angeles, CA) in May 2013", "Interview Descriptions": "I was contacted directly by the University about the position based on recommendations they received from an outside consultant.  I was asked to apply for the position on line which I did.  I followed up several times directly with HR and was promised an interview.  Ultimately they selected an internal candidate from another department and my in person interview never occurred.", "Interview Questions": "They wanted to know what I knew about the surrounding community."}, {"date": "12 Oct 2015", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Loyola Marymount University (Los Angeles, CA) in May 2013", "Interview Descriptions": "You fill out an application at the library and (if they are currently hiring) they will call you within the week. Met with the interviewer and was asked questions about my personal and professional life. The interview was very casual. One interview and I got the job. This is a student position.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "27 Jun 2016", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Loyola Marymount University (Los Angeles, CA) in Feb 2013", "Interview Descriptions": "There were two parts to the interview - the group session and the individual session.  In the group session, you sit in a circle with other candidates, and work through some scenarios that RAs may have to deal with that focus on prioritizing residents' needs, how to support them, and what makes a good RA.  The individual session focuses more on your ability as an individual to be a leader and solve problems.", "Interview Questions": "What do you think the hardest part of the job will be?"}, {"date": "27 Oct 2015", "title": "Student Shelver Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Loyola Marymount University (Los Angeles, CA) in Sept 2012", "Interview Descriptions": "it was pretty easy, I was asked to do a simple test to see how well I can understand the order of the call numbers in a timely manner, and I felt that was pretty easy", "Interview Questions": "I was asked how organized I was, and how good was my memory"}, {"date": "10 Jul 2015", "title": "Lions Athletic Fund Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Loyola Marymount University (Los Angeles, CA) in Aug 2012", "Interview Descriptions": "Was interviewed in person by the Assistant Director of Annual Giving (who would go on to be my boss/supervisor). Interview lasted about 20 minutes, after which I gave them my resume and left. Office responded at the end of the week saying that I had received the job. No other interviews took place.", "Interview Questions": "Why are you interested in this position?"}, {"date": "31 May 2015", "title": "Operations Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Loyola Marymount University (Los Angeles, CA) in Aug 2012", "Interview Descriptions": "Quick interview and selection process. I was led into a room and I talked to the hiring manager who determined whether or not I would be a good fit for the opportunity. They asked me a few questions to determine if I would fit with the culture of it. I waited a few days and was soon called and offered the job.", "Interview Questions": "What makes you a good fit for this job?"}], [{"date": "21 Apr 2012", "title": "Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Loyola Marymount University (Los Angeles, CA) in Apr 2012", "Interview Descriptions": "Initial call with a series of question. I pretty thorough phone interwiew. Folled by a panel interview, backgroud check and very thorough check of professional references.", "Interview Questions": "personal philophy"}, {"date": "23 Apr 2016", "title": "Adjunct In Chemistry Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Loyola Marymount University (Los Angeles, CA) in Jan 2012", "Interview Descriptions": "Interview was brief and easy, met with chair, was in classroom next week.  I think they needed someone fast.  It's an okay temporary position but they definitely treat adjuncts as just a cog in the wheel.", "Interview Questions": "Only what courses I had taught in the past."}, {"date": "10 Jul 2015", "title": "Admissions Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Loyola Marymount University (Los Angeles, CA) in Jan 2011", "Interview Descriptions": "The environment was very relaxed and more conversational than \"question and answer\" type interviews. You get the opportunity to really feel out the interviewer's personality and work style. Most of the Admissions Counselors are very nice people and always there to help, so being interviewed by them is not a stressful experience.", "Interview Questions": "What are you studying?"}, {"date": "16 Jun 2011", "title": "Student Affairs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 months. I interviewed at Loyola Marymount University (Los Angeles, CA) in Jan 2011", "Interview Descriptions": "Many interviews throughout the day (9am-8pm) with members of student affairs across campus for 45-60 minutes each. Lunch and dinner interviews with immediate future coworkers. Assigned presentation topic for 30 minutes including Q&A.", "Interview Questions": "Is there anything from the phone interview (2 months ago) that you would like to clarify or readress?"}, {"date": "28 May 2013", "title": "Manager - Client Services (IT) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at Loyola Marymount University (Los Angeles, CA) in Nov 2009", "Interview Descriptions": "Phone interview with supervisor\r\nOne-on-one with supervisor, in detail about the job, background, skills/abilities\r\nGroup interview with the team, looking at team/culture fit for the group, they gave feedback to supervisor\r\nInterview with Sr. Management/VP and Supervisor, quick red-flag check and fit check\r\nHR background check\r\nHR extended offer (they don't normally wiggle much from this from what I've seen, more take it or leave it since I've seen lots of other candidates pass)", "Interview Questions": "Not difficult, but someone always asks \"how have you failed and what have you learned from it?\"  You do need a good answer (and never say \"I've never really failed\") for this because many people form opinions based on the question.  Sometimes they will ask if you know about the Jesuit order or the history of LMU."}]]