[[{"date": "7 Mar 2023", "title": "Java Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at APA", "Interview Descriptions": "I interviewed with the American Psychological Association (APA) for a Java Enigneer role. It was your typical developer interview where the interviewers fire off pre-planned technical questions without much respect to the interviewee and are skeptical of any work experience you describe without any basis for being skeptical. The APA also has unrealistic expectations of wanting to hire a senior Java developer with greenfield experience but not labeling the opportunity as a senior position with greenfield experience required. At the same time, the APA only is offering a non-senior developer max salary of $120K for the role. The APA apparently justify the salary on the basis that they're a nonprofit organization. To make matters weirder, during the interview, the interviewers insisted that I was on camera for them without all of the interviewers being on camera in return. So if you want to work for a company that requires you to be on camera when other people aren't on camera and work for below market rates with unrealistic expectations, then the APA is the company for you.", "Interview Questions": "Questions related to Spring Security"}, {"date": "10 Oct 2022", "title": "Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at APA", "Interview Descriptions": "The process was not competitive . Also i can say fair. If you don't know the answer to the question so it means you should interview to an employee . Send someone who is capable of interview", "Interview Questions": "CV details are not appealing"}, {"date": "17 Mar 2022", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at APA", "Interview Descriptions": "First Interviewed by HR, then interviewed by manager and then a panel interview. The process was really quick and I am happy I got to learn a lot about the position. Thank you", "Interview Questions": "What factors are important to you in a position?"}, {"date": "29 Dec 2021", "title": "Designer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at APA", "Interview Descriptions": "Tell Me About Yourself?\r\nDescribe a situation in which you were able to use persuasion to successfully convince someone to see things your way.\r\nWhat do you consider your greatest strengths and weaknesses?\r\nDescribe a time when you were faced with a stressful situation that demonstrated your coping skills.", "Interview Questions": "N/A"}, {"date": "7 Jul 2021", "title": "HR-Executive Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at APA", "Interview Descriptions": "Provided contact of recruiter by senior member of APA. From that I provided details as instructed and then never heard anything back at all.  Absolutely no feedback.\r\nSurprised at the unprofessionalism especially considering the level of the role.", "Interview Questions": "Nobqurstions were asked as once contacted to provide details nothing further "}, {"date": "1 Jun 2021", "title": "Associate Auditor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at APA (Redding, CA) in May 2021", "Interview Descriptions": "A tag team event with three interviewers with different backgrounds and questions form technical, administrative and behavioral  scopes. Given different scenarios to answer. Able to ask questions about the work, training and company culture.", "Interview Questions": "Give an example of working for a difficult client."}, {"date": "3 Mar 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at APA", "Interview Descriptions": "The interview was very informal and the entire team asked great questions. Love the culture and overall feel of the building and those who work there. It was a good experience. Anyone looking for a challenging job should apply.", "Interview Questions": "What is a time you dealt with a difficult coworker?"}, {"date": "17 Jan 2021", "title": "Peer Review Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at APA (Washington, DC) in Dec 2020", "Interview Descriptions": "The job was originally posted in October, which was when I applied, but then it was reposted in December. I decided to revamp my resume with the hopes that a more concise resume will get past their ATS. And perhaps it did because they reached out to me for an interview two weeks later, but I can’t be sure of that—regardless, I was first contacted by Human Resources for a phone screening. But the first question was about my residency, APA hires people that live within the DMV nexus for tax purposes. I had to move out of the (D)MV because of the pandemic, so I was a bit thrown off because that was the first question. And there’s nothing you can do about that kind of situation without a job and salary. Even so, the phone screening went well but they moved forward with other candidates. I had to reach out and figure out the status of the timeline in mid-January in order to get this update.", "Interview Questions": "Name one strength and one weakness."}, {"date": "26 Sept 2020", "title": "Managing Editor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at APA", "Interview Descriptions": "Was contacted by the hiring manager well after business hours to schedule a very short information interview via video. Was asked a few questions, some professional/work related, others not. This raised several yellow flags for me. Was contacted again after business hours for a second interview and asked to put together a presentation using current APA materials and products for what was essentially a job audition.  Although the presentation was supposed to be \"high level\" preparing for that type of presentation would take 3 to 4 hours, at least. I was given 1 business day to turn the presentation around. This raised several red flags, including being asked for unpaid consulting, short timeframe of the ask, and no gaurentee that my intellectual property would not be used if I was not hired. In the future, I would avoid asking candidates for job auditions and remember that candidates are vetting you as an employer and boss just as much as you are vetting them.", "Interview Questions": "How would your friends describe you?"}, {"date": "22 Jan 2020", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at APA", "Interview Descriptions": "I received a call to come in to interview for the position I had applied for. The recruiter mentioned that it was short notice - they wanted me to come in that same week, 2 days from the day I received their call. While not the most convenient, I have experienced other organizations calling me in for an interview with short notice so it was not a huge deal, although not ideal. I had work commitments I could not cancel last minute, so the recruiter said he would follow up with more dates in the coming days. A couple days later, the recruiter followed up with potential dates and time slots for the following week and asked me to pick one. He specifically stated that he would follow up with a confirmation of the date and time once he received my response. I received no such confirmation. I followed up via email and phone and left a voice message, yet still no call back nor confirmation, not even on the day that I had selected as my interview slot. I could only assume the interview was not taking place as I had no idea where exactly the interview would be held, with whom I would be meeting, if the interviewers even had the interview on their schedule, nothing because I did not receive this information, even when asked for it. If I do receive some sort of follow-up or offer to reschedule, I'm not sure that this experience reflects well on the company and how much value they place on potential employees that spend a lot of energy and time applying and waiting for responses from potential employers.", "Interview Questions": "I wasn't asked any questions because the interview did not take place."}], [{"date": "13 Nov 2019", "title": "Human Resources Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at APA", "Interview Descriptions": "Just say briefly what I did, Why you want to this role, Why you came singapore, Do you mind to live SG longer, What do you pursue in your life, What kind of works did you do before.", "Interview Questions": "Tell me yourself"}, {"date": "18 Sept 2019", "title": "Developer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at APA", "Interview Descriptions": "Submitted application online and was interviewed a month later. It was just one phone interview with hiring manager and IT director. Not much technical. They just explained the work culture , but it was totally different from what was told in the interview. Overall its a neutral experience.", "Interview Questions": "No technical questions because the manger did not have much knowledge "}, {"date": "13 Aug 2019", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at APA (Washington, DC)", "Interview Descriptions": "It was very fast for me- I submitted an application via their online system on a Friday and was called the next Tuesday (four days later) offered an interview. I booked a time for that Friday. Spent about 20-30 minutes speaking with an HR person first about my prior experience, qualifications, education, etc and answered a few basic questions about why I wanted to work this job and with the APA. Then I interviewed with my specific hiring manager and we got on quite well, so it lasted a good 1.5 hrs. Very positive, open honest discussion about expectations on both sides, my qualifications, strengths, weaknesses, and what the job entailed. Was called back that very day to find out that I was a finalist and that they’d be checking my references. References are done electronically through the same application site. You input the contact info, name, title, etc, of the references, and then click a button that sends them a message asking them to fill out a pre-made reference form. Less than 10 days later, I got a verbal offer and after tentatively accepting, got the formal offer letter w/ salary and start date.", "Interview Questions": "Why do you want this specific job?"}, {"date": "4 Jun 2018", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at APA (Washington, DC) in May 2018", "Interview Descriptions": "I would describe the interview process as a good one. It was casual and I appreciated that.  Applied for the position online and the response time was quick. Phone interview was about thirty minutes.", "Interview Questions": "Describe yourself. "}, {"date": "2 May 2018", "title": "Manager Trainee Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at APA (San Diego, CA) in Apr 2018", "Interview Descriptions": "I found out about the job online and was contacted to come in for an in person interview. I am looking forward to learning more about the company and the position", "Interview Questions": "how are you"}, {"date": "19 Nov 2017", "title": "Event Steward Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at APA", "Interview Descriptions": "walk in interview with an assessment for job role then a brief discussion on what to expect after the interview if i do get the job e.g. induction day, uniform, code of conduct e.t.c.", "Interview Questions": "What is a steward?"}, {"date": "1 Oct 2017", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at APA (Washington, DC) in Sept 2017", "Interview Descriptions": "Brief interview with HR by phone and an in-person interview with he supervisor. Both were very comfortable and conversational. I think I answered most of HR's questions in my responses to their first two questions. The in-person interview followed a standard set of questions.", "Interview Questions": "Why APA? "}, {"date": "15 Jul 2017", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at APA (Washington, DC)", "Interview Descriptions": "HR manager called me to schedule an appointment. The interview took place at HQ  in Washington, DC. The process took me about 20-30 minutes. In two weeks, HR manager contacted me and asked if I am still interested to interview with executive director; she interviewed me approximately 15 minutes and my second interview was more casual than the first one.", "Interview Questions": "Why APA? "}, {"date": "8 Jun 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at APA", "Interview Descriptions": "Informal, comfortable. Based on my resume I had already received the internship, it is a competitive place to work in. Regardless, the environment was welcoming and I was given an overview of the many tasks I would have. In the end, I was asked if I would like to receive the position and given a tour.", "Interview Questions": "Why the APA?"}, {"date": "29 Mar 2017", "title": "Government Relations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at APA", "Interview Descriptions": "The online application was very creative, and asked a lot of questions to get a who the interviewee is.  It really made me think.  The in person interviews were mostly a series of pre-planned questions so that they could fairly evaluate each person.  The questions were interesting, but this did leave little time for any back and forth. Overall, I found it fun, though a bit nerve-racking because they were trying to be as deadpan as possible.", "Interview Questions": "What kind of physical work environment do I prefer."}], [{"date": "2 Nov 2016", "title": "Business Development Officer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at APA (Washington, DC)", "Interview Descriptions": "Monumental waste of time. Two in-person interviews with a total of 4 people, plus a request to submit an original writing sample and then radio silence... terribly rude treatment of job candidates. Have yet to hear back, but am not holding my breath. Even if I was made an offer, I would reject it.\r\n\r\nWatch out for these folks... APA played a large role in torture at Guantanamo Bay. If you don't believe me, just search the internet.", "Interview Questions": "N/A"}, {"date": "7 Sept 2016", "title": "Senior Technical Support and Applications Training Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at APA (Washington, DC)", "Interview Descriptions": "Applied internally since I was already employed by APA. I had an initial interview with HR, was invited to a second round of interviews within two weeks by several of the upper management, and was invited to a final round of interviews within a week by the Executive publisher. I was then offered the position.", "Interview Questions": "What do you think you will find most difficult about fulfilling the criteria of this job?"}, {"date": "15 Aug 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at APA (Washington, DC)", "Interview Descriptions": "I interviewed with the HR person and then with the hiring manager. I was called back for a 2nd interview with the rest of the team. Some questions were simple and others required more thorough answers. The people were really genuine and honest and the process went fairly quickly.", "Interview Questions": "How did you get into the industry?"}, {"date": "27 Jun 2016", "title": "Preliminary Review Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at APA (Washington, DC)", "Interview Descriptions": "Meet with HR for about 15 minutes.  They then send you to meet with the person who supervises the position.  After that met with the entire operations team and the head of the department.  The entire process occurred in one day and lasted about 6 hours. Overall the process provided good insight into the culture of the organization.", "Interview Questions": "What is the best tactic to manage people."}, {"date": "4 Dec 2016", "title": "Site Visit Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at APA (Washington, DC) in Oct 2015", "Interview Descriptions": "Met with my supervisor in a sit-down interview, with formal questions. I had the opportunity to ask questions. Most positions on the team go through a group interview as well, however, my interview was during the holidays, so nobody was around.", "Interview Questions": "What makes you qualified for this position?"}, {"date": "6 Jan 2016", "title": "Market Research Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at APA (Washington, DC) in Sept 2015", "Interview Descriptions": "I applied and received an email within a week. Set up the time for the interview. I first interviewed with HR and then I interviewed with the manager of the department. The interview was great, I felt relaxed and was able to answer all the questions. However, I didn't hear back until months after the interview and by that time I knew that I didn't get the position. Although, it would have been more considerate if they would have communicated sooner.", "Interview Questions": "Describe a time when you had a difficult situation at the workplace. How was it resolved?"}, {"date": "27 Jul 2015", "title": "Business Development Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at APA", "Interview Descriptions": "I submitted an application online and received a response within 24 hours stating I would not be considered as a candidate. Although disappointing, I appreciated the quick turnaround and communication of their decision.", "Interview Questions": "N/A"}, {"date": "3 Oct 2015", "title": "Customer Service Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at APA (Rochester, NH) in Jun 2015", "Interview Descriptions": "Freindly and courtious. Very nice environment.  Made you feel welcome. Not sure what else to write, because the interview process was not long, and I did not want to pursue this job position after certain questions that I had were answered.", "Interview Questions": "Are you reliable to get to work every day, and do you own your own vehicle  Are you able to make it to work on time every day?"}, {"date": "10 Jul 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at APA (Washington, DC) in Jun 2015", "Interview Descriptions": "I applied to the job about three weeks after it was posted. About a month later, after I presumed I wasn't in the running, they called me to offer me an interview. I went in and met with the HR business manager, who asked me a few very basic behavioral questions for 10-15 minutes or less. I then met with the hiring manager, who also asked very simple, \"what-would-you-do-if\" scenario questions. From there, it became more of a casual conversation where I asked about APA culture and an average workday and what the best things about APA are. I was doing pretty well, so they brought in the head of the department to meet with me to talk about the position and my interests, also fairly informal. I was free to go afterwards, the meeting spreading to about 45 minutes. Three days later, my HR rep contacted me to say she would be emailing my references. About two weeks passed (I think my HR manager was out of town for a week) and I received an offer over the phone.", "Interview Questions": "What are your strengths and weaknesses?\r\nHow do you stay organized?\r\nWhat is your experience with sensitive documents?"}, {"date": "26 Jan 2015", "title": "Site Visit Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at APA (Washington, DC) in Jan 2015", "Interview Descriptions": "I was called in my hiring recruiter. She asked me a few questions to make sure I met the minimum requirement. She then told me I would meet with the hiring manager for the position I applied for. We went to the hiring managers floor and she asked me a series of questions and told me about the position. I then met with her team which were five professionals who I would be working with.", "Interview Questions": "Why do you want to work for APA?"}], [{"date": "24 Sept 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at APA", "Interview Descriptions": "Process took one week, not very structured interview. Was given job right away without having to say much. Must have been looking for someone last minute-- continued to state that it would be a great opportunity for me. Discussed social media use on the job, although this was not what I was expecting to be doing with my background.", "Interview Questions": "None were difficult--mostly asked about my major and interests. Felt more like a casual conversation."}, {"date": "1 Sept 2014", "title": "Legislative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at APA", "Interview Descriptions": "Had a lengthy phone interview and was then contacted by HR that they were not moving forward with my application. The staff members seemed nice, but I was caught off guard when they turned to HR to reject me, when that was my first interaction with HR.", "Interview Questions": "All of the questions were pretty standard/expected."}, {"date": "7 May 2015", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at APA (Washington, DC) in Nov 2011", "Interview Descriptions": "Met with direct manager, human resources rep and group interview with team. Overall questions focused on ability to handle processes related to administrative duties. Two to three weeks between interview and job offer.\r\n\r\nMet with direct manager, human resources rep and group interview with team. Overall questions focused on ability to handle processes related to administrative duties. Two to three weeks between interview and job offer.", "Interview Questions": "How do you handle having to multi tasking?"}, {"date": "23 Aug 2010", "title": "Coordinator (Administration) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at APA (Washington, DC) in Aug 2010", "Interview Descriptions": "I interviewed with the APA a few weeks ago. It was a relatively easy interview process. First, I met with the HR Director; I actually shown up about 15 min. early for the interview and she had me waiting in the lobby for another 40 minutes! She was extremely nice though; she just looked over my resume and took down a few notes while making small talk. She then told me that I was to interview with my would-be supervisor. So, I waited another few minutes until my interviewer came to get me and take me to her floor. She was very nice and funny; although she read off a prepared sheet of questions, it was a very easy and relaxed interview. She asked me the usual questions: What were your responsibilities at your previous job? Why should I hire you over any other applicant? \r\nJust be prepared to answer questions about your job capabilities rather than so much about the company. However, you should read up on the specific office that you are interviewing for (i.e. education, women, accreditation, etc.). Each office has its own specific webpage seperate from apa.org.\r\nAfter interviewing with my would-be supervisor, she took me over to her boss' office for the final stage of the interview. Her boss was very sweet and asked me just a few questions, one of them being \"What would you do if you were in a situation at work in which a colleague had a differing opinion regarding how to handle a specific project?\" \r\nAfter the interview, my would-be supervisor asked me to write her an e-mail explaining why I wanted the job. She was very straight-forward and said it was to measure my follow-up and writing skills. About 10 days (which was a little longer than I should have waited) after sending the first e-mail I sent a second. I got a response right away saying that they were still in the interviewing process and I should expect a call soon. I know that they have called up at least one of my references, so I am hoping for a job offer this week.", "Interview Questions": "What kind of manager do you prefer?"}]]