[[{"date": "15 Jun 2023", "title": "Finance Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at White Plains Hospital", "Interview Descriptions": "This is the worst application I have ever been forced to fill out. The application process is so obnoxious and whoever created it should be fired. You should not have to give out such personal info and be required to jump through hoops just to fill out an application.", "Interview Questions": "What is your Social Security Number?"}, {"date": "1 May 2023", "title": "Account Payable Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at White Plains Hospital (White Plains, NY)", "Interview Descriptions": "half an hour with hr virtual. Then supervisor then manager. mostly behavior questions but you should def come prepared. took a while for an offer. first 2 interviews were virtual and last one was in person.", "Interview Questions": "Tell me something unusual about yourself 3 strengths and 3 weaknesses"}, {"date": "10 Apr 2023", "title": "Pharmacy Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at White Plains Hospital", "Interview Descriptions": "the interview was through zoom. the pharmacy manager and director conducted the interview, they were professional and they reached out to me, to ask me if i had any questions or concerns,", "Interview Questions": "What is you availibility look like what was your previous expereince."}, {"date": "9 Jan 2023", "title": "Nursing Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at White Plains Hospital in Jan 2023", "Interview Descriptions": "HR set up a 30 minutes virtual meeting followed by a set up virtual meeting with Nurse Manager after a few days. During interview with the nurse manager, peer interview also occurred", "Interview Questions": "Describe my Strengths and Weaknesses in the field"}, {"date": "20 Mar 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at White Plains Hospital (New York, NY) in Jul 2022", "Interview Descriptions": "Submitted application through hospital site HR reached out to me to schedule an interview Met with unit manager on zoom Met with 2 RNs for a peer interview also on zoom HR reached out to me with the decision from the unit and an offer letter", "Interview Questions": "What are your strengths/weaknesses? How can you work on the weaknesses and use the strengths to your benefit?"}, {"date": "5 Jun 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at White Plains Hospital", "Interview Descriptions": "Interviewed for the operating room. The process was extremely longer than it had to be and felt very condescending. I thought I did not get the job at the end and they want you to go through at least a year of med surg (which you really don't need) before being in the OR", "Interview Questions": "IF I can be an animal what would I be and why?"}, {"date": "31 May 2022", "title": "Nursing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at White Plains Hospital (New York, NY) in May 2022", "Interview Descriptions": "It was very quick and efficient. I had an interview with HR on Wednesday and after the interview, HR set up an interview with Nurse Manager for Friday. I heard back the following Tuesday (Monday was a holiday).", "Interview Questions": "HR: Why did you choose nursing as a career? Tell me about your career aspirations. What is an error you made and how did you fix it? Why did you apply for this position? What is a time you went above and beyond for a patient? \r\nNurse Manager: tell me about the job you applied for. if a new admit was in front of you, what would you do. tell me about a time you dealt with a difficult patient \r\n"}, {"date": "19 Apr 2022", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at White Plains Hospital (New York, NY) in Oct 2021", "Interview Descriptions": "HR was very quick to email back and starting hiring process within one week. Met with the nurse manager and did two evaluations wit a nurse and a nurse technician", "Interview Questions": "How do you deal with death?\n"}, {"date": "22 Aug 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at White Plains Hospital", "Interview Descriptions": "I was invited to come in for an interview (pre-COVID) a few days after submitting my resume.  I met with HR managers, hiring manger, and another manager all on the same day.", "Interview Questions": "Typical, standard interview questions:  Tell us a little about myself, why am I interested in this position, what type of task that I least enjoy, etc."}, {"date": "11 Mar 2021", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at White Plains Hospital", "Interview Descriptions": "Didn’t make it past the Phone interview.  Received rejection email within two weeks after. The process was basic and straight forward. Why WPH? How would your supervisor and colleagues describe you etc.", "Interview Questions": "Describe how to handle Difficult situation at work "}], [{"date": "22 Mar 2021", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at White Plains Hospital (White Plains, NY) in Jan 2021", "Interview Descriptions": "Straight forward. The environment is very nice, they really make it feel like you are at home. They asked why I wanted to become a PCA and if I had any goals to progress my career. They asked me why they should pick me other than other people. They asked about my personal strengths and weakness, a story where my emotional intelligence was used and what would I do if a patient becomes agressive.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "15 Dec 2020", "title": "Nursing Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at White Plains Hospital", "Interview Descriptions": "Not bad. Spoke with nurse recruiter (standard interview questions) then had an interview with nurse educator the next day. Nurse educator wanted to get to know me more, my goals, and if I understand the job that I am applying to. After  interview offer was extended to me.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "9 Jan 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at White Plains Hospital (White Plains, NY) in Dec 2020", "Interview Descriptions": "received a phone call from HR rep very soon after completing application for a phone interview. In person interview scheduled soon after followed by an interview with unit manager.  Very efficient process", "Interview Questions": "Describe a time that you made an error and how did you correct it? "}, {"date": "12 Nov 2020", "title": "Ultraviolet Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at White Plains Hospital", "Interview Descriptions": "Very easy and straight forward. You must be eager to learn. Its a plus if you have worked in a hospital before but it is not necessary.  Be positive and be willing to work as soon as possible. You need at least 3 references.", "Interview Questions": "How soon are you available to work?"}, {"date": "25 Jun 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at White Plains Hospital (White Plains, NY) in Jun 2020", "Interview Descriptions": "Interviews were very nice and they were interested to see what you know about the hospital. They also wanted to get to know you as a person with a lot of descriptive characteristics with examples behind them.", "Interview Questions": "What do you know about the Hospital"}, {"date": "10 Aug 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at White Plains Hospital (White Plains, NY) in Mar 2020", "Interview Descriptions": "I applied and first did a phone interview followed up by an in person interview. Then two other interviews that day. ( First was with HR, second was with unit manager, third was with the team). They told me salary, benefits, tentative start date,  and didn't get hired.", "Interview Questions": "Why White Plains?\nWhat can you tell me about WPH?\nWhat would your employer say about you?\nWhat would your coworkers say about you?\nWhat would patients say about you?\nName a time you went above and beyond to help a patient.\nWhy are you wanting to leave your current job?\nDiscuss a time you had to solve a conflict between coworkers.\nWhere do you see yourself in 5 years?\n\n"}, {"date": "7 Nov 2019", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at White Plains Hospital", "Interview Descriptions": "Applied online, emailed first to set up phone interview,   need to get references checked, invited to set a date for In person interview with HR recruiter and manager", "Interview Questions": "Why WP?\r\nWhy this position?\r\nHow do you deal with conflict with your colleague?\r\n"}, {"date": "16 Oct 2019", "title": "Registered Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at White Plains Hospital in Oct 2019", "Interview Descriptions": "I was first given a phone screen and then asked to come to set up an in-person interview. I was then interviewed by a very nice woman in the HR department. I then met the Dietitian staff. I was offered the position about a week later.", "Interview Questions": "Tell me about a time you encountered conflict and how you resolved it? How would your co-workers/managers/patients describe you? "}, {"date": "4 Sept 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at White Plains Hospital", "Interview Descriptions": "Got an email from HR  to set up a phone interview the following week. Phone interview lasted about 10 minutes and I was invited to set up a date to visit the hospital for an in person interview", "Interview Questions": "Why White Plains? "}, {"date": "26 Aug 2019", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at White Plains Hospital (White Plains, NY) in Jul 2019", "Interview Descriptions": "Total backwards process. References, benefit review, excel test.  Then no feedback. I have been waiting five weeks and have heard nothing. I see the job is still posted. Very unprofessional follow up.", "Interview Questions": "Basic budget skill and past role review."}], [{"date": "15 Jun 2019", "title": "Nurse Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at White Plains Hospital (White Plains, NY) in May 2019", "Interview Descriptions": "I was emailed by HR for a phone interview. During the phone interview a different position was suggested for me. I agreed and a in person interview was set up for me the following week. I first met with HR and was asked basic interview questions. I was then sent to the hospital to meet with the manager of the department. I felt I was asked basic questions. I have previous hospital experience so I had specific department and job duty questions for her. She mentioned to me she was a nurse for just five years prior to becoming a manager.  After my interview with the manager I sat with two nursing technicians. When this interview ended the nursing technicians were looking for the manager to see me out. One of the nursing technicians decided to walk me to the elevator. Before getting in I heard the manager make a joke about me to the nursing technician and laugh about it! I knew right then I was not getting the position. I left disappointed because that was very unprofessional. A few days later I sent a follow up email to the manager because I felt this was proper and I received no response. \r\nHR was great and professional as well as the nursing technicians. But the manager, does she laugh at her staff?, and most important, how about the patients? Again, very unprofessional and disappointing.", "Interview Questions": "What is one of your weaknesses?"}, {"date": "25 Mar 2019", "title": "Learning & Organizational Development Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 5 days. I interviewed at White Plains Hospital (White Plains, NY)", "Interview Descriptions": "Job application was rejected almost immediately despite being submitted on a Saturday evening. When I called to follow up the only person I was able to reach was an answering machine. After not hearing a word after several days, I called and left a second message and was asked to come in for an interview. Four days later, after submitting my references, my interview was cancelled because the department chose to hire another applicant, even though they had not even interviewed their full applicant list. Horrible waste of time.", "Interview Questions": "N/A"}, {"date": "4 Mar 2019", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at White Plains Hospital (White Plains, NY) in Mar 2019", "Interview Descriptions": "I spoke on the phone with the HR person and after several questions, he asked me to send him my recommendations. I filled out all my recommendations and now I have to wait", "Interview Questions": "why white plains hospital "}, {"date": "10 Apr 2019", "title": "Nocturnist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at White Plains Hospital (White Plains, NY) in Mar 2019", "Interview Descriptions": "First there is a preliminary phone interview then you meet with the recruiter who is employed by the hospital. You then meet with the head of HR Mr. Bigham and he explains the hiring process. Then you meet with hospitalist director and assistant director. Then a tour and you are done.", "Interview Questions": "Asked me to tell them about myself. \r\nAsked me a recent difficult situation I’m in. \r\nAsked me something I’ve accomplished that I’m proud of. "}, {"date": "10 Feb 2020", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at White Plains Hospital (White Plains, NY) in Jan 2019", "Interview Descriptions": "Phone interview and then in person. Met with Human Resources then with hiring manager. overall great interview everyone was very professional. Waiting in references, background and drug screen. So far good, good luck", "Interview Questions": "What are 3 things you can improve on?"}, {"date": "17 May 2018", "title": "Nurse Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at White Plains Hospital in May 2018", "Interview Descriptions": "I applied and the HR manager emailed me for a phone interview. The phone interview lasted about 20 minutes with basic questions. Then I was called to set up an in person interview where he asked a few more questions. Afterwards, I was sent to meet with a nurse manager on a unit that had a position opened. The nurse manager was very sweet and we spoke briefly before she gave us a tour.", "Interview Questions": "Tell me a time when you had to deal with conflict? "}, {"date": "2 Nov 2017", "title": "Medical Laboratory Technologist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at White Plains Hospital (White Plains, NY)", "Interview Descriptions": "HR was quick to respond to my application.  HR interview went very well.  However, the interview with the lab supervisors (Blood Bank) was not a positive experience. I was not impressed by their overall appearance and the labs appearance.", "Interview Questions": "They did most of the talking.  They never asked me any questions about my professional experience and knowledge.  They were trying to sell me on working there.  "}, {"date": "8 Nov 2017", "title": "Financial Analyst and Budget Decision Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at White Plains Hospital (White Plains, NY) in Oct 2017", "Interview Descriptions": "I applied online for this position and received an email (after almost 1 month) from HR for a phone interview. Then I scheduled for an onsite interview. On the interview day, first I met with  HR manager and then had another interview with the Assistant financial director.  The process was smooth, but I was asked about every detail of my responsibilities on my previous job. I also had a test for skill review at the end of my interview. Every step of their process is very slow and I am still waiting ...", "Interview Questions": "Tell about any conflict in the job and how did you solve it. "}, {"date": "11 Sept 2016", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at White Plains Hospital in Sept 2016", "Interview Descriptions": "I met with a HR recruiter, they were super nice, relatable and made me feel comfortable.  Questions were rapid and intense though.  Then was sent to the main hospital to meet with the nurse manager of the unit I was applying to.  She came down from the unit to the lobby to meet me which I thought was incredibly hospitable.  She was assertive about what she was looking for but pleasant.  Then I did a simple peer interview with 2 nurse technicians that worked on the floor, that was pretty impressive to me.  Got to ask them questions while they did the same to me. Overall it was a very pleasant experience that took about an hour and 15 minutes.  Also they validated parking.", "Interview Questions": "What was a time you were faced with a difficult person and how did you deal with it?"}, {"date": "11 Aug 2016", "title": "Medical Assistsnt Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at White Plains Hospital (White Plains, NY) in Aug 2016", "Interview Descriptions": "Interviewed for a position which went great and was offered to meet the manager of the dept in which I applied. Upon waiting for an additional 30 min post my first interview. I was told that the lady couldn't be reached and that I will be contacted to set up a time to meet her. This has been a week now and haven't heard anything from anyone. Reached out via email and still nothing. \r\n\r\nThis is a frustrating and discouraging feeling and very bad how if this is how they operate.", "Interview Questions": "Why White Plains Hospital ?"}], [{"date": "11 Aug 2016", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at White Plains Hospital (White Plains, NY) in Jul 2016", "Interview Descriptions": "The interviews were short and covered all of the expected questions. I first had a phone screening with HR, the.  I met with HR and the nurse manager in person and am waiting to hear back. The nurse manager took me for a tour and explained the unit well. They were very friendly which calmed my nerves a bit! Hoping to hear back!", "Interview Questions": "Give an example of a conflict you had while working and describe how you resolved it..."}, {"date": "1 May 2016", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at White Plains Hospital", "Interview Descriptions": "Communicated through email first. Set up am interview to meet in person. Everyone was very nice. Do your research. Know the hospitals mission statement and goals. They were prompt. So make sure you're there on time", "Interview Questions": "How do you maintain professionalism"}, {"date": "24 Oct 2018", "title": "RN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at White Plains Hospital (White Plains, NY) in Feb 2016", "Interview Descriptions": "It was smooth and efficient. Everyone I came into contact with was great. The facility was beautiful. It was smooth and efficient. Everyone I came into contact with was great. The facility was beautiful", "Interview Questions": "About a conflict"}, {"date": "21 Dec 2015", "title": "Nurse Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at White Plains Hospital (White Plains, NY) in Jan 2015", "Interview Descriptions": "I submitted my resume and after being reviewed was called into a more formal interview.  The representatives in HR of the program were super kind and wanted to get to know me on a personal and semi-professional level.  I never felt uncomfortable.  They were very welcoming and kind.  I recommend professional attire, a smile and a nice handshake with eye contact.  They told us later during the internship that those things are key!", "Interview Questions": "Tell us about an experience in nursing school where you felt rewarded."}, {"date": "15 Mar 2014", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at White Plains Hospital", "Interview Descriptions": "Not organized i waited 40 minutes past the time of my scheduled meeting.", "Interview Questions": "I would not call my meeting an interview at all. The folks I met with did not appear to want to work there. They were afraid of losing their jobs when the hospital was sold. They are probably correct, the potential buyer would not see the point in having duplicate positions."}, {"date": "26 Mar 2016", "title": "Patient Services Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at White Plains Hospital in Sept 2013", "Interview Descriptions": "I was interviewed and was on my way home afterward when they called me and offered me the job. I did my hospital physical and paperwork and was in orientation frst thing in the morning the next day", "Interview Questions": "Why did I chose their facility"}, {"date": "22 Dec 2017", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at White Plains Hospital (White Plains, NY) in Sept 2013", "Interview Descriptions": "I was referred by an employee, that's how I got my foot in the door. Nurse manager and assistant nurse manager were welcoming. They asked the typical behavioral questions. Be prepared to ask questions.", "Interview Questions": "How do you handle stress?"}, {"date": "30 Oct 2009", "title": "Nursing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at White Plains Hospital (White Plains, NY) in Aug 2009", "Interview Descriptions": "Initial meeting with HR.  Follow up meeting with nurse manager and tour of the unit.  Everyone was very helpful and informative.  Questions were all answered.  Very welcoming environment.", "Interview Questions": "Please give an example of how you would handle a conflict with a nurse on the unit."}]]