[[{"date": "27 Mar 2023", "title": "Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Hospital Association", "Interview Descriptions": "Very quick and friendly. I received rapid emails to schedule interviews and moved through quickly. A little hard to juggle while also working. Met with various groups and some single interviews. The offer came quickly, and they expected an answer very quickly.", "Interview Questions": "What makes you suitable for this role."}, {"date": "15 Feb 2023", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at American Hospital Association", "Interview Descriptions": "Participated in four interviews with different team members. The AHA team was very positive and responsive throughout the process. Interviews generally consisted of a conversational interview style. Understandably, it was a lengthy process.", "Interview Questions": "Q: What are you looking to get out of this position?"}, {"date": "24 Sept 2022", "title": "Program Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at American Hospital Association", "Interview Descriptions": "They require a panel interview where the interviewee puts together a PPT presentation on a project type they request. They give you some time to put this together, but not a lot.", "Interview Questions": "Q: Tell us how you can contribute to this team "}, {"date": "31 May 2022", "title": "Director, Business Management Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at American Hospital Association", "Interview Descriptions": "3 interviews with executives.   All classic interview questions and conversation:  tell me about yourself, strengths, weaknesses, etc. After 3 interviews, some with multiple people, HR called to explain they are no longer filling this position.", "Interview Questions": "Strengths, Weaknesses, Why would you be good in the position, Concerns about position"}, {"date": "7 Apr 2022", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at American Hospital Association", "Interview Descriptions": "I had a very positive interview experience! It was via google meet, and lasted about 45 minutes. My interviewer was very personable and transparent. The turn around time from interview to hiring decision was about 7-10 days.", "Interview Questions": "How do you hold your team accountable to meeting deadlines?"}, {"date": "11 Jul 2022", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at American Hospital Association (Fairfax, VA) in Jan 2022", "Interview Descriptions": "I was really excited to interview for this role but it was honestly the most disrespectful,  unprofessional process I have ever been through.\r\n\r\nI was happy to move on.", "Interview Questions": "Why do you want to work in the healthcare space?"}, {"date": "16 Sept 2019", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at American Hospital Association", "Interview Descriptions": "Pretty simple interview process where they ask your background and problem solving skills. Explain your approach to building a or solving something. Go through your academic courses, skills and projects.", "Interview Questions": "Explain a problem or your approach to a problem"}, {"date": "19 Jun 2019", "title": "Account Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at American Hospital Association (Chicago, IL) in Jun 2019", "Interview Descriptions": "Recruiter phone screen. Once you pass this you are moved along to a panel interview. You give a 15 minute presentation on what you feel are the 3 most important things to generate net new sales. 45 minutes Q/A. 30 minutes 1:1 with manager.", "Interview Questions": "How would you sell me this pen? Why were you able to generate $x year over year? "}, {"date": "26 Feb 2019", "title": "Data Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American Hospital Association (Chicago, IL)", "Interview Descriptions": "Applied online. Within 2 days, the recruiter did a phone screening which lasted almost 50 minutes. Was told that the next step would be a panel interview. After 2 days, received instructions to prepare a presentation for the interview which was to be immediately followed by a 1:1 with the hiring manager. Received an email less than a week later stating that other more qualified candidates were being pursued. The process is poorly designed since candidates spend significant time preparing for the presentation whereas a phone call with the hiring manager would be more beneficial at such an early stage of the interview process.", "Interview Questions": "Tell me what relevant skills and experience you bring to this role?"}, {"date": "18 Feb 2021", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at American Hospital Association (Chicago, IL) in Feb 2019", "Interview Descriptions": "Applied to the job online, which was a timely process as the HR portal wasn't user friendly.  I subsequently was called for a screener (phone) interview by Marianne De Leonardis.", "Interview Questions": "Typical questions trying to figure out if I was a match for the job."}], [{"date": "1 Jul 2018", "title": "Senior Associate Director, Media Relations Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 6 weeks. I interviewed at American Hospital Association in Jun 2018", "Interview Descriptions": "Not sure what this org. is trying to achieve but they have been trying to fill this position for about a year. I was a highly qualified candidate albeit older than the hiring manager. Had two formal interviews including one formal presentation. It was a fair amount of work to prepare so I was disappointed that I was not hired. I wonder what they are looking for because clearly having skills and experience was not adequate.", "Interview Questions": "Please write a press release based on a report we give you. Tell us how you have built a successful communications department."}, {"date": "10 May 2018", "title": "Membership Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Hospital Association (Chicago, IL) in Apr 2018", "Interview Descriptions": "My experience began with a phone interview was rushed and unprofessional.  The interviewer did rapid-fire questioning in the span of 17 minutes when there were actually 30 minutes allotted for the interview. During every answer I was cut off and another question was asked. Questions were not clearly stated or clarified when requested. I was not offered an opportunity to ask additional questions. The phone interview left me feeling uneasy and uncertain about continuing with the process, I moved forward thinking the HR person was not a representation of the time. \r\nThe in person interview was much better and well organized. It began with a presentation from me to a panel consisting of an HR person, two team members, and the hiring manager. All questions were answered, I was giving more than enough time to ask questions as well. \r\nFollowing the interview I received two follow up emails from HR letting me know the process was ongoing despite having been told I'd hear something within one week these emails actually came approximately one and two weeks after the interview respectively. \r\nFinally, at almost one full month since the interview I followed up to inquire about the status and request an update. I was told the job opening had been closed due to restructuring. I had not received any communication about this and likely would not have known if I hadn't reached out.", "Interview Questions": "In your current role, describe how you work with teams and the role you play."}, {"date": "17 Jan 2018", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at American Hospital Association (Chicago, IL)", "Interview Descriptions": "HR was kind enough to rush the interview process due to a competing job offer. The whole process took 1 week from the first phone interview to the extension of an offer.", "Interview Questions": "Why do you believe you'll be effective in this role?"}, {"date": "28 Aug 2017", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Hospital Association (Chicago, IL) in Mar 2017", "Interview Descriptions": "The interview process was quite lengthy. In this order: I applied online, did two phone interviews with the recruiter, one phone interview with the hiring manager, and an hour long in-person interview with 5 people in which I had to present for 20 minutes on a specific topic. \r\n\r\nOver 10 weeks, I spent a lot of time preparing for these interviews and also spent money throughout the process (new suit jacket, printed color copies of my presentation and work samples). \r\n\r\nIn the end, they barely followed up with me to let know the final decision. I had to email and call the recruiter a few times to find out I was not selected (which was obvious after the first few emails).  \r\n\r\nAs one of the final candidates, I'm surprised they weren't more respectful and courteous. I would not consider applying with the AHA again due to this and the antiquated nature of the company.", "Interview Questions": "They asked for work and writing samples and you have to take a personality test (they don't share the results with you). "}, {"date": "22 Feb 2017", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Hospital Association", "Interview Descriptions": "Was a telephone interview that asked me to walk through my experience. The interview process was very detailed and precise when it came to the questions. All and all the interview was short and to the point.", "Interview Questions": "What can you bring to the position?"}, {"date": "6 Feb 2017", "title": "Marketing Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Hospital Association", "Interview Descriptions": "Phone interview and then called in for a group panel interview. They submit to you a questionnaire and you have to create answers and present it during your interview. Most of the questions were pitching ideas of how you would enhance their group or association. The interview was painless and everybody seemed nice. The process was really informal. However, I noticed when I wasn't picked I would re-visit their website and see that they were using the ideas that I pitched to them. I thought it was an insult that I wasn't good enough to work for AHA; however, my ideas were good enough for them to use. Because of this, I would never apply to this company again.", "Interview Questions": "Describe at time where you had to work with difficult people."}, {"date": "3 Mar 2017", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American Hospital Association (Chicago, IL) in Jul 2016", "Interview Descriptions": "Had a brief phone interview with an HR recruiter. The following week I had an in person panel interview with two people from the work unit I'd be in, as well as two people in comparable positions in other work units.", "Interview Questions": "Provide an example of a project you worked on that directly relates to one of the functions of this position"}, {"date": "23 Dec 2016", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at American Hospital Association (Chicago, IL) in May 2016", "Interview Descriptions": "There were three rounds for the interview process; a phone interview, and an in-person interview with two different managers. They asked me about everything on my resume to make sure the information was accurate. They wanted more information about my experience in mobile app development and questions about my personality.", "Interview Questions": "Basis OOP questions about what is a instance field (variable) and inheritance"}, {"date": "31 Mar 2016", "title": "Project Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at American Hospital Association", "Interview Descriptions": "Process went fairly quickly, involves a panel interview - generally with a presentation required.The response time was within an acceptable period - that may have changed, but at the time contact was made with the hiring manager relatively timely.", "Interview Questions": "What was the biggest challenge you've faced in your career and how did you handle it?"}, {"date": "2 Mar 2016", "title": "Program Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American Hospital Association (Chicago, IL) in Feb 2016", "Interview Descriptions": "I had 2 phone interviews. The first one was with hr and the second was with 2 hiring managers in the program I applied for. Both went fairly well. A week later I was contacted by hr again to come in for an in person interview. They sent me required paperwork to sign and fill out as well as guidelines I needed for my PowerPoint presentation. The in person interview  was \na power point presented in front of people. After they asked questions?", "Interview Questions": "What is your workload management process?"}], [{"date": "28 Dec 2015", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 months. I interviewed at American Hospital Association", "Interview Descriptions": "The interview consisted of a panel presentation followed up by a 1 on 1 with the hiring manager. I found the panelists to ask thoughtful questions and were very hospitable. However the hiring manager was distracted on their mobile device and frequently chimed in with gotcha questions in a confrontational manner. I left the interview feeling incredibly belittled and did not want the opportunity there even if offered the job.", "Interview Questions": "Why would you do that? That makes no sense to me."}, {"date": "22 Sept 2015", "title": "Marketing Communications Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at American Hospital Association (Chicago, IL)", "Interview Descriptions": "All positions (at any level) have to create and present a power point presentation. This requirement is not relevant to many positions within the organization yet its standard in the interview process. The hiring process is very slow and the HR department seems very unorganized. At any given time they have multiple temps working in the HR department, many of which do not understand the position or business goals.", "Interview Questions": "How do you handle employee conflict?"}, {"date": "12 Sept 2015", "title": "Marketing Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Hospital Association", "Interview Descriptions": "I had a phone interview and was brought for a panel interview group. I had to do a presentation for the panel on the group I wanted to get a job with. The panels were informal. However, I was told that they would be making a decision that Tuesday, but they never got back to me which I think is rude.", "Interview Questions": "Why do you want to work at AHA?\r\nWhat are some of your strengths"}, {"date": "21 Mar 2016", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Hospital Association (Chicago, IL) in Aug 2015", "Interview Descriptions": "Phone screen and in-person meeting with multiple staff members and director. Phone screen was lengthy. HR rep was extremely helpful and forthcoming. \r\nThey asked for additional information to be sent via email as well as a presentation in person.", "Interview Questions": "Asked for work samples and presentation"}, {"date": "25 Apr 2017", "title": "Associate Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at American Hospital Association (Chicago, IL) in Jan 2015", "Interview Descriptions": "I met with HR first and they brought me to a room to present a powerpoint I prepared in front of a couple of employees and manager about experience. The powerpoint was based on questions they sent to me beforehand.", "Interview Questions": "What's your experience reporting technical information "}, {"date": "9 Oct 2014", "title": "Research Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Hospital Association", "Interview Descriptions": "I was contacted through email that I was selected for a phone interview. In this email, I given a list of questions that had to answer and email back. My first interview was over the phone with the HR Manager who asked a few general interview questions. I was told that if I was selected for a second interview, I would be contacted in the next two weeks. After a month, I received an email that they would like to invite me for an in-person panel interview. For this interview I had to prepare a 15 minute presentation about myself that covered 8 questions that they provided. In the interview, four people were physically present and one person was on the phone. The interview was informal and everyone made me feel very comfortable and relaxed. After the presentation, the panel asked general questions about things I mentioned in my presentations as well as other questions for about 30 minutes.Then, I had a one-one interview with a Director that was also on the panel interview. These questions were more detailed technical questions related to research.", "Interview Questions": "How do you manage working on multiple projects at the same time? Did you implement a new process to any of your previous positions? How do you go about researching a topic in which you have no prior knowledge?"}, {"date": "18 Jul 2014", "title": "Marketing Communications Specialist Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American Hospital Association", "Interview Descriptions": "The association contacted me both via phone and email, then scheduled for phone interview. Initially, I found that the  interviewer's description of this job online were quite different from what he described to me over the phone. The interviewer was also very disorganized. After our initial phone interview, he said that he would follow-up with me in the next week. Instead, he followed-up weeks later only to ask \"where we were\" in the process. During this conversation, his notes on me were also inaccurate. It was as  if he had notes on another candidate. After hearing me rehash our original conversation, his voice was less excited and I knew then that I would probably not get another call back. And, yes, I never heard back from them since. I found the whole process to be unprofessional and frustrating.", "Interview Questions": "I cannot recall the most difficult question, because I felt like the whole process was awkward. "}, {"date": "20 Mar 2014", "title": "Senior Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Hospital Association (Chicago, IL) in Mar 2014", "Interview Descriptions": "Applied online, was contacted for a phone interview with HR shortly after and had a 20 minute interview with the HR rep. The manager for the position followed up with another phone interview several days later. \r\n\r\nI was then invited to Chicago for an in-person panel presentation and one-on-one interview. I was given a pre-work assignment with four questions to cover in the 10-15 minute presentation. I Traveled to Chicago two weeks later for the interview, gave the presentation and answered questions from a group of approximately 10 people for 45 minutes. This was followed by a one-on-one interview with the hiring manager. I was told that I would have a decision by the end of that week. My references were contacted the next day and I was offered and accepted the job two days later.\r\n\r\nOverall, it was a very positive experience. The format was very thorough and gave me the opportunity to meet the team I would be working with and get a feeling for the duties and responsibilities required by the position.", "Interview Questions": "What is the difference between assigning and delegating tasks? How do you handle mentoring those who report to you?"}, {"date": "4 Jun 2015", "title": "Senior Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at American Hospital Association (Chicago, IL) in Feb 2014", "Interview Descriptions": "I was contacted for a twenty-minute phone interview by a recruiting officer first and asked to fill out a fairly detailed set of questions about my experience (five questions with sub-questions). \r\n\r\nAfter that interview, I was told that I would be interviewing with a five-person panel and then have one-on-ones and that they wanted me to prepare a 20-minute presentation (powerpoint suggested) to the panel. I was told that the presentation should include answers to another set of detailed questions. I was also asked to bring a portfolio of my work.", "Interview Questions": "Present a project that showcases your skills. Describe the strategy behind the concept, why the approach was appropriate to the audiences, and how you produced the project elements on time and within budget. What were the challenges? What were the results?"}, {"date": "17 Apr 2015", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Hospital Association (Chicago, IL) in May 2013", "Interview Descriptions": "Phone screening with HR first and then you get an invitation for a panel interview to present a previous project and additional questions provided by AHA. The position needed to be filled immediately, so the process was smooth and quite timely.", "Interview Questions": "What do you think are the risks of taking this position with AHA?"}], [{"date": "17 Apr 2013", "title": "Senior Communications Specialist Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at American Hospital Association (Washington, DC)", "Interview Descriptions": "I received the following email today: \r\n\r\n\"Thank you again for applying for the Sr. Communications Specialist.  Given the date you applied we may or may not have reviewed your resume.  We wish to inform you that we have currently filled the Sr. Communications Specialist position.\r\n\r\nBest wishes with your job search and we hope you will consider future employment with the American Hospital Association. Please feel free to review current Job Opportunities on the aha.org website.\r\n\r\nSincerely,\r\n\r\nHuman Resources\r\nAmerican Hospital Association\"\r\n\r\nI can't believe they would send something out like this. I find it to be really lazy and unprofessional. And the insinuation that \"based on when I applied\" my resume wasn't even reviewed, as if the fault laid with me in responding to their vacancy announcement. (I applied when they first advertised the position).", "Interview Questions": "N/A"}, {"date": "24 Aug 2012", "title": "Client Satisfaction Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at American Hospital Association (Chicago, IL) in Aug 2012", "Interview Descriptions": "There was an initial phone interview where they asked about previous experience and how it would help me in this role.  A few days later, there was an in-person interview/presentation in front of a group of people (about 5).  They asked some questions for clarification and about experience.  They seemed nice and very interested.", "Interview Questions": "I was asked if I would rather work in health administration since this is what I received my masters in."}, {"date": "6 Aug 2014", "title": "Account Executive Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at American Hospital Association (Chicago, IL) in Sept 2010", "Interview Descriptions": "Several Interviews.  Review of porfolio.  Questions about \"how would you...\"  Just not professional.  Could have had only one interview.  Did not negoitiate salary.  Had a line of people to take the job and told you that - so take it or leave it.", "Interview Questions": "\"Describe you negative traits\" - really - no bull - they asked this."}]]