[[{"date": "20 Jun 2023", "title": "BDM Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catch22 (London, England)", "Interview Descriptions": "Organised, through teams, they were not really interested in me though, they haven't actually asked any question to find out about my personality, similar questions were repeated numerous times. I had to follow up 2 weeks after the interview about the outcome, when I was rejected and offered further feedback that I have asked for but never received.", "Interview Questions": "Loads of describe a time when this and that happened."}, {"date": "31 Aug 2022", "title": "Recovery Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catch22 (London, England) in Aug 2022", "Interview Descriptions": "The process has been quite easy and relaxing. I started with an online application where I had to express my interest and elaborate on why I wanted to work with Catch22. After that, I had one interview with two senior members, which lasted 55 minutes, where they asked me 7 questions.", "Interview Questions": "What made me apply for Catch22 and why?\r\n\r\nWhy is multi-agencies work important, and how could I contribute to it?\r\n\r\nHow can I protect myself, and what boundaries do I set when working with clients? How do I maintain that?"}, {"date": "5 Apr 2023", "title": "NCS Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catch22 (Hereford, England) in Apr 2022", "Interview Descriptions": "One-on-one interview before a group interview with different scenarios you must work through and describe how you'd deal with the situation. One-on-one interview has general interview questions. Very informal and friendly with icebreakers.", "Interview Questions": "'Describe a time you faced a difficult situation and how you delt with it'."}, {"date": "16 Aug 2020", "title": "Practitioner (Substance Misuse & YP Risk Service) Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Catch22 (London, England) in Jul 2020", "Interview Descriptions": "I received an email informing me that I had an interview under a week after I'd applied. The interview was scheduled for the following week. I was interviewed by 3 team seniors. The interview only lasted around 20-30m and I was asked around 7 questions in total. The questions surrounded my CV and application, risk based scenarios, YP engagement strategies, drug types and my understanding of child exploitation. I was then given the opportunity to ask my own questions. I received a phone call just over a week after my interview offering me the job. Shortly after I was sent a conditional offer letter, HR forms etc and a request for ID, document/certificate, DBS and reference check.", "Interview Questions": "How would you protect yourself out of office hours when meeting with a client?"}, {"date": "22 Sept 2019", "title": "Support Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Catch22", "Interview Descriptions": "Telephone Interview discussing experience and role followed by assessment day which involved playing and running icebreakers and team games and discussing safeguarding issues. Handed in documentation and gave availability so that contracts could go out immediately if offered the job", "Interview Questions": "Experience of working with young people, why catch 22 is the company I chose\r\n"}, {"date": "7 Aug 2018", "title": "Resettlement Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Catch22 in Jul 2018", "Interview Descriptions": "40 minute interview containing 7 marked question and one unmarked. Interview is conducted by 2 people who were very friendly. Was quite informal but because it is marked it is based on whoever gets the most points during the interview", "Interview Questions": "Why is multiagency work important and how can you do it effectively?"}, {"date": "26 Nov 2018", "title": "NCS Seasonal Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catch22 (South Shields, England) in Jun 2018", "Interview Descriptions": "Fairly standard. I applied online and submitted my CV. Took a few weeks to offer an interview in their south shields office. Interview consisted of being sat in front of 2 people and consisted of 9 set questions that were the same for every candidate.", "Interview Questions": "Give one example of when you have looked after someone"}, {"date": "24 Feb 2019", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Catch22 (London, England) in Jan 2016", "Interview Descriptions": "One interview applied online. Was very simple and easy stress-free. Just do your background research on their values etc and therefore it does make it very easy.   Probably maybe one of the more easier interview processes I have been through.", "Interview Questions": "Previous Experience? "}, {"date": "10 Oct 2017", "title": "Resettlement Case Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Catch22 (London, England) in Jul 2015", "Interview Descriptions": "Sat in a room with two members of management asking various questions about the position. Had about 10 questions which was randomly asked by the two member panel.  was a comfortable atmosphere.", "Interview Questions": "What expeience do you have within the criminal justice system"}]]