[[{"date": "27 Jun 2023", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Broward Health (Fort Lauderdale, FL)", "Interview Descriptions": "It was great , I really liked the people. Looking forward to an answer. Thank you for asking again. The managers seem to be very nice and outgoing hopefully I get picked for the position", "Interview Questions": "What are my challenges rn"}, {"date": "8 Apr 2023", "title": "Nurse Extern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Broward Health (Fort Lauderdale, FL) in Mar 2023", "Interview Descriptions": "Straightforward interview with a tour around the unit. Talk about pay was brief but was able to understand 18/hr. Seems very interested and will reach out to you if you are a qualifying student.", "Interview Questions": "Do you know what unit you want to work in?"}, {"date": "6 Oct 2022", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Broward Health", "Interview Descriptions": "Easy, questions were read off a form. I was given a tour of the units soon after the interview. Very laid back interview with easy interview questions. Very general interview questions.", "Interview Questions": "Where do you see yourself in 5 years? Why do you want to work here?"}, {"date": "8 Jul 2022", "title": "Patient Care Assistant (PCA) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Broward Health (Miami, FL)", "Interview Descriptions": "great fair. Ask questions about previous employer\r\nwhat would you do in a dilemma scenario, etc. Why choice of profession. What are your weakness? What are your strengths? Tour of the floor.", "Interview Questions": "do not remember it was a lot of scenarios"}, {"date": "5 Aug 2021", "title": "Patient Tranporter Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Broward Health (Pompano Beach, FL)", "Interview Descriptions": "Interview was very easy. Talking with supervisor really didn't really ask any questions. Only question asked was what hours was I available to work. Felt very comfortable talking with supervisor", "Interview Questions": "What hours was I available to work?"}, {"date": "17 Jul 2021", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Broward Health (Fort Lauderdale, FL)", "Interview Descriptions": "Horrible. Before even sitting down for a face to face interview, they put you in a small office sitting across from a total stranger, you can literally touch, and make you do work, email, calendaring, excel spreadsheets. This took over an hour.  They WATCH you do it. Very unnerving and disorienting.  Then you get an intensive 1 hour interview after that. They eliminated me as a candidate without even a simple email notifying me.  Terrible way to treat a candidate.", "Interview Questions": "They make you actually sit there for an hour and do work they have prepared for you.  Without even knowing one thing about what the position requires."}, {"date": "7 May 2021", "title": "Physician Office Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Broward Health", "Interview Descriptions": "Interview process was very open and straight forward. It was basically them trying to get to know me and get a feel of my personality. No questions from a piece of paper were thrown at me. Just from the heart conversation", "Interview Questions": "Tell me about yourself and experience "}, {"date": "16 Mar 2021", "title": "Child Life Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Broward Health", "Interview Descriptions": "This was several years ago. After an initial HR screening I had a phone interview with the team I would be joining (out of state job candidate). Fairly similar to interviews for internships. Interview lasted about 30 minutes.", "Interview Questions": "What is your philosophy of child life?"}, {"date": "19 Jan 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Broward Health", "Interview Descriptions": "Applied, had an interview with two nurse managers. Heard back a few days later. Had to wait for the interview and was interviewed same day as several other applicants.  Not a bad experience but not the greatest either", "Interview Questions": "Why did you want to become a nurse"}, {"date": "20 Feb 2021", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Broward Health (Miami, FL) in Jan 2021", "Interview Descriptions": "Interview 1 - was with the hiring manager and seemed good\nInterview 2 - was a panel, one person seemed to not be interested in me before I even spoke.  \n\nIt was a different experience than I have had or have provided as an interviewer.  One thing was clear - they really didn’t sell the organization or team to me.  I think some people forget half the interview is selling the company to the interviewee.", "Interview Questions": "Why are you leaving your current role"}], [{"date": "15 Dec 2020", "title": "Clinical Applications Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Broward Health", "Interview Descriptions": "I received a phone call 1 week after applying to schedule a screening interview. The phone screen was conducted after 2 days, followed by a virtual interview with the team of analysts in the following week. The screening interview mostly focused on my past experience with the interviewer asking questions based on my resume. The analyst interview was 45 minutes long with 15 minutes reserved for my questions. I was mostly asked scenario-based and time management related questions. I was informed 3 weeks later of the decision.", "Interview Questions": "How do you manage your time?\nGive an example of a time you had to work with a resistant user and how did you handle the issue.\nAre you a leader or follower?"}, {"date": "14 Jul 2021", "title": "Mental Health Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Broward Health in Nov 2020", "Interview Descriptions": "It was easy. Just say good things about your prior experience and you will be fine. Coworkers are nice and they love to work in groups. This hospital is big and have a lot of staff", "Interview Questions": "Tell me about your prior experiences in the field "}, {"date": "20 Jul 2019", "title": "Cardiac Cath Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Broward Health (Fort Lauderdale, FL) in Jul 2019", "Interview Descriptions": "Very efficient and focused interview by a four member team that worked in the department I applied for (no HR rep was present). Many standard interview questions that I was scored on.", "Interview Questions": "Tell me about a time you worked on budgeting in a previous job and how you overcame shortfalls or issues."}, {"date": "14 May 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Broward Health", "Interview Descriptions": "Easy, personable and with the Director who is fantastic and down to earth. No nonsense and straight to the point. The process took a few weeks as most hospital turn around times do. Great place to work!", "Interview Questions": "EKG strips. "}, {"date": "20 Sept 2018", "title": "Data Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Broward Health", "Interview Descriptions": "I applied online and was contacted by a recruiter after about a week and a half. We spoke on the phone about the position. The interviewer was very nice and friendly. There were no trick questions. Pretty basic questions overall.", "Interview Questions": "Tell me about yourself"}, {"date": "28 Jul 2018", "title": "Physician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Broward Health (Davie, FL)", "Interview Descriptions": "Long and tedious.  Not helpful during hribterqctions etc  I tried to comply no other input to give you really. Not sure what else I can say. Apparently this is par for the course there ?", "Interview Questions": "My weaknesses "}, {"date": "8 Apr 2018", "title": "PICU RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Broward Health", "Interview Descriptions": "Met with a panel. Nurse manager, assistant nurse manager, and another nurse.  The interview lasted about an hour. A lot of the questions were to gage your personality and how you work with others.", "Interview Questions": "tell me about yourself, Strength, weakness, how do you deal with stress, hardest decision you had to make"}, {"date": "14 May 2018", "title": "Director, Internal Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Broward Health (Fort Lauderdale, FL) in Apr 2018", "Interview Descriptions": "The interview process was great. I received calls from my potential hiring managers (one direct and one dotted line) and was able to learn more about the opening and their expectations. I was contacted within a few days with an in-person interview date. On the date of the interview, I met with both leaders. They asked about my strengths and weaknesses, as well as my experience in this specific role.  A week after the interview, I was contacted by the Talent Acquisiton department with an informal offer of employment. She took the time to discuss benefits and next steps. I received a formal offer of employment later that day.", "Interview Questions": "Which aspects of your current role do you like, and which ones do you dislike?"}, {"date": "22 Jan 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Broward Health", "Interview Descriptions": "Basic scenarios, how would I describe myself. Sat with manager and ANM. Asked questions specific to floor like stroke scenarios, what labs and procedures I would expect. Met other members of the staff", "Interview Questions": "How do you handle stress"}, {"date": "21 Sept 2017", "title": "RN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Broward Health in Sept 2017", "Interview Descriptions": "I was asked general, computer assessment (psych) and clinical questions. Within each question there were sometimes  4-5 more questions. So that was a tough part for me. Some of the clinical questions were situational", "Interview Questions": "what could lead to signs of confusion in post-op patient"}], [{"date": "1 Jun 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Broward Health (Pembroke Pines, FL) in May 2017", "Interview Descriptions": "My interview was great. I was interviewed by the Supervisor of the unit. She is a very nice lady and made me feel very comfortable. When we were done interviewing she took me on a tour of the unit and introduced me around.", "Interview Questions": "She asked me to tell her about my previous experience and jobs."}, {"date": "17 Dec 2016", "title": "Targeted Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Broward Health (Orlando, FL) in Dec 2016", "Interview Descriptions": "Interview was challenging; great questions.  Taught me they care about their staff. Relax atmosphere. I did not had to wait to long and everyone was very respectful and friendly.  They took their time to get to know me and I thought the interview went well.  I felt comfortable during the process.  The only thing is that they told me they will let me know if I was hired or not and  have not heard from them.", "Interview Questions": "Real Case Studies"}, {"date": "31 Mar 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Broward Health (Pompano Beach, FL) in Nov 2016", "Interview Descriptions": "manager called me and asked question then scheduled a panel interview. manager, asst manager and rn part of panel. Panel was welcoming and asked me several questions and then asked me if i had any questions.", "Interview Questions": "asked why i wanted to be a nurse, what to do or expect if pt has mi, stroke, critical thinking questions like what to do if pca calls for help to clean a pt and charge nurse tell you another patient acting strange at the same time."}, {"date": "11 Nov 2016", "title": "Patient Care Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Broward Health (Fort Lauderdale, FL) in Nov 2016", "Interview Descriptions": "I was called for an interview on a Wednesday at 5 pm, the interview was scheduled for Friday at 8 am with the Manager. The interview was great, the Manager explained the position to me and walked me around the facility and informed me how they work and what was expected of me.", "Interview Questions": "I was asked about my qualifications."}, {"date": "28 Nov 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Broward Health (Fort Lauderdale, FL) in Nov 2016", "Interview Descriptions": "I first had a phone interview by a charge nurse and then it was followed up by a in person interview one week later. After the in person interview I was given a tour of the floor and waited two weeks until HR recruiter called for the job offer.", "Interview Questions": "Interviewed by a panel of four; two charge nurses and two current employees. I was asked situational questions i.e.: what would you do if you followed und your patient who was initially stable with no medical history suddenly become lethargic and unresponsive?"}, {"date": "21 Jul 2016", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Broward Health in Jul 2016", "Interview Descriptions": "First, I had a phone interview, then I was asked to come for a face to face interview. Interview was with 3 people. Face to face interview was held 3 days after phone interview. Lasted about 15 minutes.", "Interview Questions": "Tell me about yourself? How do you handle stress? Where do you see yourself in 5 years? Why do you want to work here? How do you handle conflict with coworkers?"}, {"date": "3 Jul 2018", "title": "Social Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Broward Health (Fort Lauderdale, FL) in Jun 2016", "Interview Descriptions": "I initially met with the case management supervisor for my first interview, and then the following week with some members of the team for a second interview. The entire experience was relaxed and laid back.", "Interview Questions": "Why do you want to work here?"}, {"date": "7 Jan 2016", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Broward Health", "Interview Descriptions": "Phone call interview followed by panel interview.  Overall good experience.  Do a little research into the background of the company, as the information is useful as grounds to relate with the panel.", "Interview Questions": "What is one experience that has provided you with skills relevant to this position?"}, {"date": "8 Jan 2016", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Broward Health (Fort Lauderdale, FL) in Jan 2016", "Interview Descriptions": "Took a few weeks (maybe because I applied toward the end of 2015 during holiday season). Manager called me and conducted a slight phone interview then proceeded to ask me for a in person interview.", "Interview Questions": "When was there a time you had to do something your manager should have done but didn't?"}, {"date": "18 Aug 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Broward Health in Jan 2016", "Interview Descriptions": "I met with the floor nursing manager and spoke with her. Then we toured the floor. I was able to ask her questions about staffing and duties. \r\n\r\nShe did ask me a few knowledge questions, but they were basic. S&s of diabetes and stroke.\r\n\r\nDuring orientation you do have to take a large written exam based on scenarios in videos that you watch before hand. The test is graded by outside parties based on your current experience level. If you fail you have to retest a few months into your employment. You can be let go if you don't pass the second time.", "Interview Questions": "What is your experience? What are your goals?"}], [{"date": "13 Jun 2016", "title": "Case Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Broward Health (Fort Lauderdale, FL) in Jan 2016", "Interview Descriptions": "It is a panel interview process.  The setting is informal as everyone is seating around a conference table.  It is not an intense interview, however, you should prepare yourself as you would for any position.", "Interview Questions": "Strengths, weaknesses, and how do you handle the homeless population."}, {"date": "9 Jun 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Broward Health", "Interview Descriptions": "Applied online and that same week I received a phone call from the manager to set up a meeting with herself and the assistant manager at the time. They asked a series of questions mostly situational questions and asked why I wanted to work there, etc.", "Interview Questions": "Describe a difficult situation you had with a patient and/or patient's family and how did you handle the situation"}, {"date": "27 May 2015", "title": "Medical Records Clerk Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Broward Health", "Interview Descriptions": "average interview. They asked the basic interview questions. Management seems to not know how to properly interview a candidate. Seemed like they just were winging it. Interviewer was not dressed professionally and they didn't know much about the position they were offering.", "Interview Questions": "basic questions asked on every interview"}, {"date": "21 Jun 2015", "title": "Human Resources Compensation Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Broward Health (Fort Lauderdale, FL) in May 2015", "Interview Descriptions": "Applied for the position and was contacted the same week for an interview. Managers seemed impressed and was given a tour of office, introduced to team members, and even shown work cubicle. Provided a 3 week time frame when decision would be made. Contacted 3 weeks and was told still interviewing. Got a call from a staffing agency about the same position. Badly mislead that I would receive a job offer.", "Interview Questions": "Where do you see yourself in the next 5 years?"}, {"date": "11 Aug 2015", "title": "Social Service Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Broward Health (Pompano Beach, FL) in May 2015", "Interview Descriptions": "You will be interviewed by a group of employees and management. They will ask you about your passed experience and ask you how you would handle issues with patients. They will ask you about your past experiences and computer skills.  Employees during interview appeared rude and not interested in the process.", "Interview Questions": "They asked me to explain my passed experience. Some of the staff were rude in their interviewing skills. Some question where: what kind of computer skills do you have, how much experience do you gave working in hospitals, what kind of clients have you worked with in the pass, what was your case load like in the pasted."}, {"date": "1 Jun 2015", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Broward Health (Fort Lauderdale, FL) in Mar 2015", "Interview Descriptions": "great and professional panel. applicable staff doing the interviewing and was relevant to job position. questions were fair and geared appropriately. Don't have much to say more please apply you won't be disappointed.", "Interview Questions": "why are you a good candidate?"}, {"date": "1 Oct 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Broward Health (Fort Lauderdale, FL) in Mar 2015", "Interview Descriptions": "Applied online for the Finance Department. Received a call on the phone for a phone interview a few days later. Was invited for an in person group panel interview with HR and upper level finance officials. Heard back 2 weeks after that saying I had been offered an intern position in m my desired department.", "Interview Questions": "Tell us about a time you dealt with conflict and what you learned."}, {"date": "24 Mar 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Broward Health (Coral Springs, FL) in Feb 2015", "Interview Descriptions": "somlpe only one person not bda very quick one on one nothing much not bad bo bad a lot of questions were asked kind of friendly one on one interview should have included a pane", "Interview Questions": "why ypou want to work for us"}, {"date": "3 Aug 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Broward Health (Fort Lauderdale, FL) in Jan 2015", "Interview Descriptions": "There is an online personality assessment done at the time of applying that is reviewed during the interview. Interview was an hour long with the manager in her office. The manager was very laid back and asked question appropriate to the unit. After the interview I was given a tour of the unit by a nurse.", "Interview Questions": "Asked multiple questions about clinical scenarios and what my interventions would be? Ex. Interventions done for pt with new onset stroke symptoms, Alcohol withdrawal, chest pain."}, {"date": "17 Dec 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Broward Health", "Interview Descriptions": "Fairly strait forward, application, interview, job offer. I met with a panel of two administrators and the department manager. The interview was around 40 minutes. I was offered a position at that time.", "Interview Questions": "The typical what are your strengths and weaknesses"}], [{"date": "9 Jul 2015", "title": "Senior Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Broward Health (Fort Lauderdale, FL) in Dec 2014", "Interview Descriptions": "It involved being asked questions about how you would do things in certain situations. After that I met the people who would be my coworkers and had a chance to see how things ran in the pharmacy.", "Interview Questions": "How would you handle receiving a stat IV order when you're working on a regular IV order."}, {"date": "1 Sept 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Broward Health", "Interview Descriptions": "You meet with a group of employees and they ask you various questions. It's pretty simple, just stay positive and smile. They ask you questions about your work ethics and future goals.", "Interview Questions": "What are your weakness?"}, {"date": "9 Jul 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Broward Health", "Interview Descriptions": "There was a phone interview with manager and then in-person interview with a panel of nurses and PCAs including managers. They all had a chance to ask questions. They let me know immediately I was offered the position and then had to come into Human Resources to start the paper work.", "Interview Questions": "Technical nursing questions."}, {"date": "14 Jun 2014", "title": "Senior PM Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Broward Health", "Interview Descriptions": "Endless screening, with slow, glacial movement. Want all employees to relocate on their own dime, no re-lo, and very low pay (a 50% cut for me).  Lack of transparency for full time benefits.  Lots of turnover--have had the same role sent to me numerous times over the last two years.", "Interview Questions": "Would I be pleased to relocate on my own dime from another state?"}, {"date": "7 Aug 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Broward Health (Fort Lauderdale, FL) in Jan 2014", "Interview Descriptions": "In-depth interview with representatives from several departments that the position interfaces with.  Approximately 12 people in my interview.  It lasted approximately 1 hour.  They made sure I was relaxed in the interview and they were nice people.", "Interview Questions": "Scenario questions to find out how I would interact with coworkers."}, {"date": "3 Jun 2013", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Broward Health (Fort Lauderdale, FL)", "Interview Descriptions": "Initially had a short, standard  phone interview with a recruiter after submitting my resume.  Was scheduled to meet with the hiring manager and others working in the department within one week.  Had a group interview which was not disclosed prior to my arrival.  Interviewers had obviously not been trained how to interview.  Was mainly told how things were in the deparment versus being asked about my background.  Dismissed it after the interview, but was offered the position about 2 weeks later.", "Interview Questions": "The most difficult part for me was not even being asked about any of my accomplishments or experience.  "}, {"date": "10 Jan 2013", "title": "Provider Relations Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Broward Health (Fort Lauderdale, FL)", "Interview Descriptions": "HR will contact you and set up a date on when to meet in person with the department head. The interview was a 3 panel interview. You will meet with the dept manager, claims manager, medical director. They discuss your resume thoroughly and will drill you with questions.", "Interview Questions": "I asked if they offer training or career pathing and I received a laugh in return and a quick response."}, {"date": "21 Apr 2015", "title": "Provider Relations Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Broward Health (Fort Lauderdale, FL) in Oct 2012", "Interview Descriptions": "Was a very fast interview. Lasted about 10 minutes. I got the impression they were just going through the motions. I feel that they were not really interested in me.", "Interview Questions": "Was my experience field based or in office? "}, {"date": "19 Jun 2013", "title": "Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Broward Health in Apr 2012", "Interview Descriptions": "I submitted an application and heard back fairly quickly.  I had a face to face interview with 2 managers, and then met the director of my program.  I was offered the job a couple days later via phone by HR rep.", "Interview Questions": "Lots of random questions as well as typical interview questions.  Practice your questions."}, {"date": "28 Apr 2016", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Broward Health (Fort Lauderdale, FL) in Feb 2012", "Interview Descriptions": "Interviewed after referral from someone who had previously worked there. The interview was in-person with the hiring manager, and then the offer came shortly thereafter. The questions were all pretty skill based, but they made it obvious they were also looking for someone to assist another employee in the same work and training would be provided.", "Interview Questions": "How would you go about presenting data from your research to management?"}], [{"date": "29 Mar 2015", "title": "Patient Care Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Broward Health (Fort Lauderdale, FL) in Oct 2011", "Interview Descriptions": "It was pretty simple. Seems as though they were prepared to hire me before I arrived. They were impressed with my résumé. I was moving, so I spoke with HR both over the phone before moving, and then met with them after my move. They didn't want to do an official interview until I was in the area. It was a smooth process overall.", "Interview Questions": "How much experience do you have?"}, {"date": "16 Jun 2015", "title": "Lead Cook Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Broward Health (Fort Lauderdale, FL) in Jun 2011", "Interview Descriptions": "application done online, potential employee called in for interview, interviewed by manager hired in 2 weeks. i was given a walk through of the facility and my work station, also introduced to other emo\\ployees.", "Interview Questions": "how is my job attendance"}, {"date": "15 Oct 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Broward Health (Fort Lauderdale, FL) in Apr 2011", "Interview Descriptions": "Panel Interview, consisting of Nurses, Assistant Nurse manager, Manager and Unit secretary. The interview is somewhat informal, it usually takes place in their office and last 10-20 minutes and ends with a tour of the unit.", "Interview Questions": "What would you do if a doctor was demanding you take out a tube at the bedside that you are unfamiliar how to remove it. What would you do?"}, {"date": "2 Sept 2010", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Broward Health (Fort Lauderdale, FL) in Aug 2010", "Interview Descriptions": "Was called in for an interview.  Only had 1 interview and it was a panel interview pretty organized.   The interview took place with several mangers.  Any candiates applying should know some about the hospital and healthcare in general.  The managers took turns asking you questions and each one asked 3 to 4 questions.  They were scoring the interview as they were asking the questions.", "Interview Questions": "What is ISCSI?"}, {"date": "13 Sept 2010", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Broward Health (Fort Lauderdale, FL) in May 2010", "Interview Descriptions": "Interviewed with CEO of hospital who redirected me to the Human resources department for the official \"internship\" program.  Very congenial staff who were more interested in getting to know the applicant.  Very low stress with questions about general background information and desire for working with the company.  No curveballs and heard back quickly in regards to final decision.", "Interview Questions": "Why are you interested in this opportunity?"}, {"date": "19 Jan 2010", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Broward Health (Fort Lauderdale, FL) in Dec 2008", "Interview Descriptions": "i had a phone interview with the team lead and manager about my skill sets.  The interviews were laid back and i felt very comfortable. If you understand Cerner and IT you should be fine throughout the interview.", "Interview Questions": "tell me about your experience"}]]