[[{"date": "21 Nov 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at San Antonio Regional Hospital in Nov 2022", "Interview Descriptions": "The manager and nurse educator made you feel comfortable without any pressure. It was a formal conversation interview. I felt comfortable without any stress or discomfort talking to both of them. I thought I knew them for a while.", "Interview Questions": "give me examples of your strengths?"}, {"date": "14 Aug 2022", "title": "Computed Tomography Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at San Antonio Regional Hospital", "Interview Descriptions": "Very easily interviewed. Be as honest as possible. Stick to what you know and ask questions. Don't be to overconfident. Pay attentions when being spoken to.  Don't ask for salary unless you prioritize this as the main issue.", "Interview Questions": "What kind of person are you?"}, {"date": "13 Mar 2022", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at San Antonio Regional Hospital (Upland, CA) in Feb 2022", "Interview Descriptions": "Interview went well with the department director and the nurse educator of the department, and it was a great non stressful type of interview. A week after interview I was contacted to meet with HR department and accept offer of employment.", "Interview Questions": "Scenario based questions, experience, and why did I choose San Antonio Regional Hospital."}, {"date": "4 Mar 2022", "title": "ICU Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at San Antonio Regional Hospital (Upland, CA) in Feb 2022", "Interview Descriptions": "Very professional and kind. Three people in my interview . Director of sicu, manager and educator. All very nice and answered all the questions I had. Also very honest. They made me feel comfortable and welcome.", "Interview Questions": "Please Tell us about yourself "}, {"date": "25 Jan 2022", "title": "ER Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at San Antonio Regional Hospital (Upland, CA) in Jan 2022", "Interview Descriptions": "The questions were more focused on the why the ER which was easy enough for myself to answer. The interview went smoothly and quickly. I didn’t feel pressured by the person interviewing me, just nervous myself because it’s been a long time since I’ve been in an interview. I haven’t accepted nor declined yet but am listing as accepted due to needing more information before I accept.", "Interview Questions": "Why choose the ER Department "}, {"date": "31 Aug 2021", "title": "ED Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at San Antonio Regional Hospital (Upland, CA) in Aug 2021", "Interview Descriptions": "Two interviews, one with nurse manager and the other with the HR rep. Both had quick responses and were courteous. The whole process went smoothly and the questions were straightforward. Typical interview questions, but a lot were asked. Nothing too difficult.", "Interview Questions": "What do you know about the history of San Antonio Regional Hospital?"}, {"date": "14 Jul 2021", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at San Antonio Regional Hospital", "Interview Descriptions": "I was quickly interviewed by one person, asked a couple of simple questions, and was moved to a different room with a panel. The questions weren't too out there. Had to take a quick dosage calc test at the end.", "Interview Questions": "Was asked a couple of quick questions about where I wanted to go and to name several medications. I was asked about a time I made a mistake and how I learned from it, as well as to name some qualities that I had to offer to the unit."}, {"date": "28 Jan 2021", "title": "Registered Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at San Antonio Regional Hospital", "Interview Descriptions": "simple interview with the clinical manager for the dietary department with a brief case study to complete. upon completion the manager went over the case study and provided feedback and asked why choices were made.", "Interview Questions": "of you had too many pt's assigned in one day how would you approach your work"}, {"date": "19 Jan 2022", "title": "New Grad RN Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at San Antonio Regional Hospital (Upland, CA) in Jan 2021", "Interview Descriptions": "Did 3 each different. 2/3 had 2 interviewers and 1 was a panel of about 6. Very friendly staff. Typical questions. Be prepared to take med math test if chosen for stepdown unit.", "Interview Questions": "What is something you have been asked to do, but were not comfortable doing it?"}, {"date": "27 Jul 2019", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at San Antonio Regional Hospital (Upland, CA) in Jul 2019", "Interview Descriptions": "Initial interview consisted of 2 managers from the floor. The second interview was a panel interview.  The staff were extremely nice and made the interview process very comfortable.", "Interview Questions": "Why are you passionate about nursing?"}], [{"date": "13 Jul 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at San Antonio Regional Hospital", "Interview Descriptions": "Typical interview, introduction of interviewers and interviewees, two people from management leading the interview, I was the only person being interviewed at the time, clinical questions as well as ethical questions", "Interview Questions": "Steps to medication pass"}, {"date": "18 Nov 2018", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at San Antonio Regional Hospital (Upland, CA) in Jun 2017", "Interview Descriptions": "I met with the nurse recruiter who talked about the hospital and the work environment, benefits, etc. We then walked to the hospital and I met with the unit supervisor and a charge nurse. After asking me their questions, they asked if I had any for them. The interview took place in an office on the unit.", "Interview Questions": "Describe a situation where you feel you could have provided safer patient care."}, {"date": "7 Feb 2017", "title": "New Grad RN Emergency Department Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at San Antonio Regional Hospital (Upland, CA) in Dec 2016", "Interview Descriptions": "After a highly credible staff member at San Antonio Regional Hospital provided me with information about the upcoming New Grad ED RN program, and put me in contact with an ED Manager/Educator, I was scheduled for an interview in December 2016. A panel interview was conducted by three members of ED staff. Comfortable environment but some questions were not geared towards a New Grad RN. \r\n\r\nWhen taking time to answer a difficult question (and not sound stupid), I was told on multiple occasions to \"just think of something\" and felt rushed. I was also interrupted on quite a few occasions and two of the panel members decided to have a side conversation towards the end of the interview. In addition, after sending all of my documents (resume, cover letter, certs/license, etc.) to a specific ED staff member three or more times, it was obvious that none of the information had been viewed beforehand.\r\n\r\nOverall, the entire experience gave the feeling that candidates had already been chosen for the program and that I was most likely interviewed so the hospital could maintain a good relationship with my reference. Even applying for additional New Grad RN/Entry Level positions after this experience, it seems like the hospital tends to hire those New Grad RNs who came through their facility during clinicals or hires those who have a STRONG connection to the hospital (relatives, financial donors, etc.). Best of luck to those applying!", "Interview Questions": "Why did you want to become a nurse?"}, {"date": "25 Jun 2016", "title": "Social Worker Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at San Antonio Regional Hospital", "Interview Descriptions": "The first interview was with the director of social services which lasted just under 2 hours.  Questions varied from prior internships to thesis conducted at prior internships. In between interviews was about a month before the second interview was scheduled. The second round was with social workers whom work with the hospital.", "Interview Questions": "What clinical theory do you utilize while working with patients?"}, {"date": "14 Jan 2020", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at San Antonio Regional Hospital in Jan 2016", "Interview Descriptions": "I submitted application/resume. My application was sent to the hiring department. I received a calll from hiring manager and set up an interview appointment. Met with Manager. The HR office called me and made me an offer for the position. I met with the HR representative. HR represtative explained all the benefits and the onborading process. I Went through background, referecnes and physical. Went to new hire orientation. Started in my job", "Interview Questions": "Why do I feel qualified for the job?"}, {"date": "26 Jan 2016", "title": "Unit Clerk PT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at San Antonio Regional Hospital in Jan 2016", "Interview Descriptions": "I felt that the interview went well. Spoke with 2 RNs.  Very personable. Honest about what was needed and what the possibilities were.  It was explained how busy the position is and how the schedule will vary. Told I would hear something Monday Afternoon and I was contacted 2 hours after the interview to meet with HR", "Interview Questions": "How do you deal with stress?"}, {"date": "30 Jan 2015", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at San Antonio Regional Hospital", "Interview Descriptions": "The hospital is under construction so the front entrance is kind of hidden. They have an employee out front directing you where to go. The interview is done by a panel of 3 people. Nice hospital.", "Interview Questions": "What is your greatest weakness?"}, {"date": "14 Jan 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at San Antonio Regional Hospital in Jan 2015", "Interview Descriptions": "Took over a month to get an interview but once I got an interview I was called the next day to meet with HR. Met with hr the following week and accepted an offer", "Interview Questions": "Discuss a time there was an interdepartmental conflict and how was it resolved."}, {"date": "6 Aug 2015", "title": "Cst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at San Antonio Regional Hospital (Fountain Valley, CA) in Jan 2011", "Interview Descriptions": "I Was a Traveler there for 2 months, did a   phone interview  showed up and started work the next day when traveling it's impossible  to have face to face interview  with employer they take recruisers word for it", "Interview Questions": "How many times in a year did you call in"}]]