[[{"date": "22 May 2023", "title": "Human Resources Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Little Sisters of the Poor (Richmond, VA)", "Interview Descriptions": "There were two rounds of interviews after a phone interview. I met with the leadership team during the 2nd round. I would describe it as a typical structured interview. The questions were reasonable and the feedback was quick.", "Interview Questions": "How would you handle conflict?"}, {"date": "20 Nov 2019", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Little Sisters of the Poor", "Interview Descriptions": "Simple online or paper application. Was not hard to get an interview. Received a call back within one week. Really pleasant experience so far. Very good experience and exciting opportunity.", "Interview Questions": "What interested me in the company"}, {"date": "28 May 2018", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Little Sisters of the Poor (Denver, CO) in Mar 2018", "Interview Descriptions": "The interview went very well with the supervisor and Human Resources. I interviewed and was given the job on the spot and was required to do a drug test and background check, I did shadowing the next day by the 3rd day I had orientation and started training the following week.", "Interview Questions": "What would you do if you found a resident on the floor bleeding?"}, {"date": "1 Oct 2015", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Little Sisters of the Poor (Cincinnati, OH) in May 2015", "Interview Descriptions": "Thorough process.....4 rounds....very nice and welcoming people.  I felt so at ease and so needed.  The process really made me feel like I was given a fair shot at presenting my talents and my ideas for success in the position.", "Interview Questions": "What is my faith life work balance?"}, {"date": "28 Jun 2016", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Little Sisters of the Poor (Denver, CO) in May 2014", "Interview Descriptions": "The interviewer’s job is to hire the best person for the position. Most of the candidates that make it to the interview stage are qualified for the job. The winning candidate must be more than qualified, especially in a very competitive job market.\r\nEvery hire is a risk for the company. Your interviewer will also be taking a personal career risk in recommending a particular candidate to hire. If the candidate performs well, Mr. Interviewer looks brilliant and gets a pat on the back (and maybe a bigger annual bonus).", "Interview Questions": "Why should we hire you?"}, {"date": "20 Mar 2017", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Little Sisters of the Poor (Chicago, IL) in Apr 2014", "Interview Descriptions": "I went through catholic charities so I just received a call to meet for an interview at a local bank. After passing the first interview with HR I was interviewed I think 3 more times ( by two of the sisters and once more with the mother) before officially having the job.", "Interview Questions": "One thing that always stuck with me was during the interviews when that they really want you to let them know about your kids/babysitter situation."}, {"date": "8 Sept 2015", "title": "Nurses Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Little Sisters of the Poor (Enfield, CT) in Jun 2011", "Interview Descriptions": "It was very easy. Interviewed by a sweet nun, who is no longer there. Process was not long at all, I was offered the job immediately after the interview. I was happy with all the questions and the personality of the interviewer", "Interview Questions": "I was asked how i would handle certain emergency situations that may happen at the nursing home. Possibly like 5 different scenarios. The interviewer was great and did not make you feel rushed or intimidated at all. "}], []]