[[{"date": "9 Aug 2022", "title": "Project Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sustrans", "Interview Descriptions": "The interview process consisted of a single interview with a set of interview questions. You had to prepare a 5 minute presentation on how you would create an active travel scheme.", "Interview Questions": "Why do you want to work for Sustrans"}, {"date": "25 Nov 2021", "title": "Senior Communications Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sustrans", "Interview Descriptions": "Straightforward process with timely responses. The interview was about 45 minutes long, done online through Microsoft Teams. The two interviewers were very friendly and professional. Overall it was a positive experience.", "Interview Questions": "Why do you want to work for Sustrans?"}, {"date": "27 Oct 2021", "title": "Learning Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Sustrans", "Interview Descriptions": "Very supportive interview process with Sustrans - solid questions, included a timed task to be completed during the interview which was tricky but certainly gets to the core of whether candidates have the skills they claim they have.", "Interview Questions": "How do you design an inclusive learning task?"}, {"date": "27 Jan 2021", "title": "HR Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sustrans (Bristol, England) in Jan 2021", "Interview Descriptions": "Pretty straight forward process  and online interview,  Interviewers were kind and polite. Mainly scenario based questions asked i.e \"Tell me a time when...or give me an example..\"", "Interview Questions": "Q. Tell me a time when a customer was angry and how you dealt with that?\r\nQ. Give us an example of a time that you helped a colleague complete an important project?"}, {"date": "24 Apr 2022", "title": "Service Delivery Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sustrans (Maidstone, England) in Oct 2020", "Interview Descriptions": "On Microsoft teams. There were 4 people on the panel. One was quite senior, the others were more chatty and approachable. It was quite informal and easy going but with serious questions interspersed", "Interview Questions": "Will you cycle to work"}, {"date": "22 Feb 2019", "title": "Evaluation Support Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sustrans (Bristol, England) in Feb 2019", "Interview Descriptions": "I applied via an online application form which involved writing a personal statement outlining why I was suitable for the role. Around a week later I was invited for interview via email. At the interview I had to complete a 30 minute task which involved data entry / analysis on Excel and brainstorming how I would conduct a focus group with school children, the things I would ask etc. I had to discuss both of this during the interview. I was in a room with one interviewer and the other called via Skype. The interview lasted about 45 minutes. I was unsuccessful and was informed of this through a telephone call three days later. They said I should have had a greater knowledge of Excel and shown a greater awareness of the role and company. However, I don't believe the interview gave me the opportunity to demonstrate the research I had conducted surrounding the company. They said I should also practice the STAR technique to structure my answers, which I had done so I found that pretty frustrating. However, they liked my answers around team work and focus groups. Overall, it wasn't a bad experience.", "Interview Questions": "Give an example of a time when something went wrong and how you overcome it"}, {"date": "5 Apr 2019", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sustrans (Bristol, England) in Mar 2018", "Interview Descriptions": "The interview started with a 20 minute written task, which was followed by about an hour of questions. The interviewers were very friendly and clearly wanted me to feel comfortable.", "Interview Questions": "How would you assess your success in this role after a year in the post?"}, {"date": "29 Jan 2018", "title": "Project Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sustrans (London, England) in Jan 2018", "Interview Descriptions": "Applied via online portal. Confirmed interview 3 days later, with interview booked for 2 weeks time. INTERVIEW TASK - Prepare an answer to present on the following, using any medium, up to 500 words: What scheme would you introduce to increase levels of walking and cycling in London if you were Mayor? NOTE: THEY DIDN'T ASK ME ANY QUESTIONS ON MY PRESENTATION AND INSTEAD MOVED STRAIGHT TO INTERVIEW QUESTIONS", "Interview Questions": "Why this role?"}, {"date": "22 Jul 2019", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Sustrans (Lewes, England) in Aug 2017", "Interview Descriptions": "Standard questions,  3 people panel, scenario based questions. \r\n\r\nPut at ease by interviewers but formal style , not a conversational interview. Phoned in person to let know whether job offered . It was nerve wracking as all interviews but panel very friendly. Was second choice so was initially phone to say incident get the job, then to say I did..!", "Interview Questions": "Dont remember sorry. Bit lots of 'give me a example of a time'.. questions \r\n\r\nGive an example of a successful project that you delivered.\r\n\r\nHow would you promote xyz\r\n\r\n"}, {"date": "22 Oct 2018", "title": "Travel Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at Sustrans (Taunton, England) in Apr 2017", "Interview Descriptions": "It was through a recruitment agency, Meridian Business Support. The lady at this agency has put me on a few assignments over the years, so she contacted me through email asking whether I was interested in this role. I said yes, then got contacted by her to say I had an interview in about a week or so's time.", "Interview Questions": "Do you know the local area (South Taunton)?"}], [{"date": "16 Feb 2017", "title": "Evaluation Support Office Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sustrans in Feb 2017", "Interview Descriptions": "I applied using their online form. The screening process was slow and I didn't hear that I'd been invited to interview for ~10 days, although I was informed of this delay. The interview was with 2 Senior Evaluation Officers, one of whom was located in another office so we used video calling (this led to some difficulties as we lost the line a couple of times when I was in the middle of an answer. \r\n\r\nThe interview also included a 30 minute task which involved some basic data analysis in Excel, planning a focus group with school children and picking out some quotes from an interview transcript. It was a lot to do in 30 minutes and I messed up the Excel part a bit but the interviewers said that if I could explain what I should have differently that was fine. \r\n\r\nThe interviewers had sheets in front of them with a standard template of questions which they worked through. Most of these were the normal questions you would expect in an interview, however some of them seemed to be quite poorly worded and it was hard to know exactly what the interviewers were looking for. This was particularly true for the questions around teamwork, which I found quite confusing. \r\n\r\nIt was really helpful to have read some of Sustrans' reports, especially because some of the questions were about what makes a good report. They seemed pleased that I had read this material.\r\n\r\nIt took a week to hear back after my interview, which was longer than they had suggested and quite nerve-wracking. My feedback for the interview was that I hadn't demonstrated that I would be willing to consult line managers in situations where I was unsure of something. I felt that this was an unfair assessment as none of the questions had focused on this, but obviously it is something that they are looking for candidates to mention.", "Interview Questions": "How would you contribute to the positive, pro-active attitude of the team?"}, {"date": "4 Nov 2017", "title": "Household Canvasser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Sustrans (Cardiff, Wales) in Jul 2013", "Interview Descriptions": "The interview was very quick - lasted about 15 minutes - and very informal. I arrived in smart-casual attire and the girl who would become my supervisor asked me some very simple and straight-forward questions.", "Interview Questions": "Whether I like cycling"}]]