[[{"date": "N/A", "title": "Student Nurse Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Baptist Memorial Health Care", "Interview Descriptions": "It was very professional and fast. The recruiter and nurse manager were very professional and informative. It was a breeze to apply and interview for the position. I really appreciate how they anticipated my questions. I highly recommend this company", "Interview Questions": "Behavioral interview questions, based on past situations"}, {"date": "29 Apr 2023", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Baptist Memorial Health Care (Columbus, MS)", "Interview Descriptions": "Basic interview questions. Not much of an interview. It was more of a “hey, let me show you around” kind of deal. You’ll meet with the office manager and the Admissions admin", "Interview Questions": "How do you deal with confrontation?"}, {"date": "10 Apr 2023", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baptist Memorial Health Care (Memphis, TN)", "Interview Descriptions": "I arrived late due to parking, but both manager and supervisor were understanding. Interview was through and not too lengthy, they explained to follow up process and I left feeling confident and with clear expectations.", "Interview Questions": "Why do I want to work there"}, {"date": "17 Mar 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Baptist Memorial Health Care", "Interview Descriptions": "Really good interview process! The DON was present and very informative about the on boarding process! I enjoyed how easy going it was! I highly recommend this company if you want a work family!", "Interview Questions": "What makes you a good fit"}, {"date": "21 Mar 2023", "title": "Nurse Residency Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Memorial Health Care in Mar 2023", "Interview Descriptions": "In person interview at job hiring fair is how they hire most applicants. They highly encourage that you can find a time to attend this. If you are unable to make it, they can contact you for a virtual interview, but it all depends on their current applicants.", "Interview Questions": "Why do you want to work here"}, {"date": "2 Nov 2022", "title": "Certified Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Baptist Memorial Health Care (Southaven, MS) in Nov 2022", "Interview Descriptions": "I got a phone call from the director, she was very sweet, attentive, honest and respectful. We discussed the position and set up an interview just like that and all it took was for me to go to a Baptist Job Fair for a different hospital and speak with a recruiter.", "Interview Questions": "Not available at the moment."}, {"date": "20 Oct 2022", "title": "Application Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Baptist Memorial Health Care", "Interview Descriptions": "The interview was fairly straight forward, mostly discussing about prior job experience and why the specified position would fit you. It was not very tech heavy. Had a good experience overall.", "Interview Questions": "So what are your prior job experiences?"}, {"date": "7 Sept 2022", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baptist Memorial Health Care", "Interview Descriptions": "The interview process was basically a series of questions to see how one would handle different situations. I was interviewed by the Admissions Manager as well as the Supervisor. After my interview, I was given a tour of the office.", "Interview Questions": "Can you tell us about yourself?"}, {"date": "3 Jul 2022", "title": "Housekeeping Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Baptist Memorial Health Care", "Interview Descriptions": "The Interview was quick and easy and staff was really nice.  They showed me where everything is. And where to get more supplies. And when picking up laundry where you are suppose to put the dirty laundry.", "Interview Questions": "What made me a good fit for the position "}, {"date": "23 Jan 2022", "title": "Physician Referral Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Baptist Memorial Health Care", "Interview Descriptions": "They asked very easy questions. They were not intimidating. The interview process was very professional and quick with simple questions asked. I provided them with straight forward honest answers. Only did one interview and submitted a resume as well.", "Interview Questions": "How do I feel about team work?"}], [{"date": "2 Jan 2022", "title": "Staff RN II Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Baptist Memorial Health Care", "Interview Descriptions": "Interview was extremely informal and mainly consisted of introductions and unit overview. Was told everything else is covered by HR/Education, but there were still many questions upon hiring that went unanswered", "Interview Questions": "No questions asked by interviewer"}, {"date": "14 Mar 2022", "title": "Information Technology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Baptist Memorial Health Care in Jan 2022", "Interview Descriptions": "I completed 3 different interviews before receiving an offer. The interview process wasn’t complicated. They are just thorough with all of the questions they ask. They do want you to ask them questions as well.", "Interview Questions": "Why are you leaving your current position/place of employment?"}, {"date": "18 Nov 2021", "title": "Therapy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Baptist Memorial Health Care", "Interview Descriptions": "I had an interview with therapy heads. I also had peer interview. It was scheduled very quick and clear questions asked. Staff was approachable to speak to. I would recommend preparing for questions about experience and examples of strengths and weaknesses.", "Interview Questions": "What is your favorite ice cream flavor"}, {"date": "2 Jul 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Memorial Health Care", "Interview Descriptions": "Haven't received an interview yet. Still waiting for BMH to set up an interview. I applied exactly one week ago. I did call before applying and spoke with a recruiter.", "Interview Questions": "So tell me about yourself."}, {"date": "17 May 2021", "title": "Certified Surgical Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Memorial Health Care", "Interview Descriptions": "I spoke with a recruiter over the phone who then passed my information along to the OR director where a second interview is set up either by video call (facetime, zoom) or in person.", "Interview Questions": "Would I be willing to move ?"}, {"date": "6 Sept 2021", "title": "Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Baptist Memorial Health Care (Memphis, TN) in May 2021", "Interview Descriptions": "when I applied for the position this was during Covid-19 pandemic. The interview process was easy but there was one question that got me and I wanted to share. \n\nThere was three employees in my interview, At the end they asked me what was my best day at work and what was my worst day at work?", "Interview Questions": "What was the worst day at work and what was your best day at work? "}, {"date": "17 Aug 2022", "title": "Staff Accountant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Baptist Memorial Health Care (Carthage, MS) in Mar 2021", "Interview Descriptions": "Interview was conducted over the phone. Basic knowledge questions were asked. Very friendly interaction and follow up. Pay and schedule were discussed up front. The conversation was casual and non-intimidating.", "Interview Questions": "Q: what is your familiarity with account principles as they relate to general ledger entries"}, {"date": "1 Feb 2021", "title": "Sales Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Memorial Health Care (Memphis, TN)", "Interview Descriptions": "Great, extremely fair and thorough process.  Interviewed three times.  Twice with Executive Director and once with round table, which included all Baptist sales employees.  Quick response time from Baptist, also.", "Interview Questions": "Why are you a good candidate for this job?"}, {"date": "14 May 2021", "title": "Human Resources Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Baptist Memorial Health Care (Memphis, TN) in Feb 2021", "Interview Descriptions": "The interview process was professional and timely. Interviewees were engaging and asked great questions. The team was transparent and answered all of my questions regarding the position, expectations, and culture of the company.", "Interview Questions": "Is there a difference in talent acquisition and recruitment? If so, what is it? "}, {"date": "25 Nov 2020", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Memorial Health Care in Nov 2020", "Interview Descriptions": "I called the Baptist Memorial Human Resources to ask a simple question (if the role was open to telecommute) before spending my time on an application & wasting the company's resources. I left a voicemail for the recruiter. I didn't hear a response back for a few days, so I e-mailed the recruiter to ask the same question and then finally heard back. He told me to apply anyway since it depends on the manager (shouldn't this be a HR policy?). Anyway, I decide to send the time applying as instructed. I wait nearly a month and I don't hear anything back - when I follow up with recruiter to see if he can provide an update, I get the generic HR system \"Thank you for your interest, but the position has been filled\" e-mail.\n\nIf you don't mind a horrible interview experience, being strung long for the ride, and finally being ghosted by HR - I would encourage you to apply to positions at this organization. If you value your time, consider other healthcare organizations.", "Interview Questions": "Does this role allow for a  remote/telecommute work?"}], [{"date": "19 Jul 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Baptist Memorial Health Care (Memphis, TN) in Oct 2020", "Interview Descriptions": "The interview process was as expected. \"Tell me about yourself.\" \"what are your goals?\" \"where do you see yourself in 5 years.\" It was very simple. I also did student clinicals at the place of hire so they already knew me before I was interviewed. Most baptist locations are family. Memphis is not however. You are treated like a pawn there.", "Interview Questions": "What are your strengths and weaknesses "}, {"date": "19 Aug 2020", "title": "Patient Care Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Baptist Memorial Health Care", "Interview Descriptions": "I filled out an online application. It was pretty simple. I filled out a few pages worth and uploaded my resume. My application was submitted for review and I am still awaiting to enter the next phase which I am assuming is an interview.", "Interview Questions": "I have not had an interview quite yet. "}, {"date": "7 Aug 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Memorial Health Care (Union City, TN) in Aug 2020", "Interview Descriptions": "I applied online for the position approximately 1 week ago and  received a call for an interview. The interview was scheduled with the nurse manager for the unit, charge nurse, and a staff nurse.", "Interview Questions": "Do you feel you would be comfortable floating to other areas of the hospital if you were hired? "}, {"date": "14 Aug 2020", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Baptist Memorial Health Care (Memphis, TN) in Aug 2020", "Interview Descriptions": "It was very simple and ordinary to every other interview, asked the basic interview questions and she described the position and if I felt comfortable with it. She also introduced me to another supervisor.", "Interview Questions": "How well do you handle stress? \nHow do you handle gossip?"}, {"date": "4 Apr 2022", "title": "Health Screener Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Memorial Health Care (Memphis, TN) in Jul 2020", "Interview Descriptions": "The interview process was a breeze. The person who I interviewed with wanted to make sure I was comfortable and felt at ease. They showed me around the areas in which I would work and introduced me to some of the staff that worked there. All of them were pleasant.", "Interview Questions": "Asked about previous experience, what I saw myself doing if I stayed with the company after the pandemic, life goals, how comfortable I was with doing the job that I was interviewing for. "}, {"date": "29 Mar 2020", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Memorial Health Care", "Interview Descriptions": "It was a very relaxed interview. Just a few 'interview' type questions & then just talking about different things. The manager I was interviewing with met me in the lobby & showed me around the hospital & floor.", "Interview Questions": "Tell me about yourself"}, {"date": "17 Feb 2022", "title": "Certified Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Memorial Health Care (Memphis, TN) in Feb 2020", "Interview Descriptions": "It was a very easy going interview. I spoke with the managers over the department for PRN position. They had a questionnaire to answer before the interview started. It was basic medical assistant questions. Like asking what is the normal blood pressure measurement, what os a normal pulse range, etc", "Interview Questions": "What are your strengths as a MA?"}, {"date": "24 Oct 2019", "title": "Diagnostic Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Memorial Health Care (Memphis, TN) in Oct 2019", "Interview Descriptions": "Informal interview with both the manager and Human Resource for Stern Cardiology to see how well you would fit in with the team since it is such a small team and office.", "Interview Questions": "How do you handle stressful situations at work? "}, {"date": "23 Aug 2019", "title": "Patient Care Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Memorial Health Care in Aug 2019", "Interview Descriptions": "The interview process I went through at Baptist was absolutely terrible. I got there 20 minutes early, but the manager didn't get me for the interview until 30 minutes after the scheduled interview time due to a meeting. Another manager ended up interviewing me and she only asked me 1 question, tell me about yourself, because she had another meeting to go. The interview itself lasted for only 5 minutes. The whole process was extremely unorganized and unprofessional and I hope no one else has to go through something like this.", "Interview Questions": "Tell me about yourself."}, {"date": "26 Jun 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Baptist Memorial Health Care (Jacksonville, FL)", "Interview Descriptions": "The interview process was a very pleasant experience . Easy to follow. Everyone involve were informative and helpful. The Emergency Department manager /assistant manager employees were all pleasant helpful and just great people.", "Interview Questions": "Why you chose this company"}], [{"date": "6 Apr 2019", "title": "Customer Service Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at Baptist Memorial Health Care (New York, NY)", "Interview Descriptions": "I applied for the position and received a call for an interview two months later. My interview was with the hiring manager. The interview was on a Friday, and I received an offrr the following Monday. I request that a benefits package be sent to me before making an offer and was told that it was not possible. I went ahead and accepted the offer after the recruiter stated we needed to move quick so I could start orientation at the end of the month. Well, I didnt hear anything until about a month and a half later. They do not call to verify your employment.  I received a call stating that an employer from 2012 could not be verified, so my original offer amount would decrease if I didn't proved them with proof. When I called my previous employer, I was told that if the recruiter called, she would have been given the instructions to verify the information.", "Interview Questions": "Why did you decide to apply with Baptist?"}, {"date": "1 Apr 2019", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Baptist Memorial Health Care (Southaven, MS) in Nov 2018", "Interview Descriptions": "The woman giving the interview was very laid back and easy going.  She did most of the talking. She answered almost all of planned questions right off the bat. She let me know i had the job before leaving the interview.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "20 May 2022", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Baptist Memorial Health Care in May 2018", "Interview Descriptions": "HR interview, director report (CFO), then COO.  Also met with HR, in person, where they explained benefits.  Also met with Executive Directors of various areas.  Good review of area, to include lunch and a tour of the general area.", "Interview Questions": "What type of reports do you use to decide on next steps?"}, {"date": "17 May 2018", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Baptist Memorial Health Care in May 2018", "Interview Descriptions": "It went smoother than I expected. Although it was still very nerve racking. They greeted me and then proceeded to ask the questions such as, why do i feel qualified for this job, state some things about myself, strengths and weaknesses.", "Interview Questions": "Strengths "}, {"date": "29 Apr 2018", "title": "Housekeeping Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Memorial Health Care (New York, NY) in Mar 2018", "Interview Descriptions": "It was a really good interview. They made me feel very comfortable. We talked about my future plans. She told me what would be my day to day .  gave me some history on the company. I really wished i could have excepted", "Interview Questions": "why did i want to work there? where do i see myself in 5 yrs"}, {"date": "10 Apr 2018", "title": "Help Desk Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Baptist Memorial Health Care (Memphis, TN) in Jul 2017", "Interview Descriptions": "Very weird interview , I was asked only hypothetical questions that was not related to behavioral  nor technical experience. I was also asked to writ an essay about the interview ( Is this even legal for a help desk position.  One interviewer asked me did my previous employer finish construction at the facility. \r\n\r\n\r\nThe interview was one phone interview  and a  three person panel onsite interview.", "Interview Questions": "Why do you want to work at Baptist, a company that laid you off, you should be mad.  "}, {"date": "20 Dec 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Baptist Memorial Health Care (Jonesboro, AR)", "Interview Descriptions": "First there was a phone interview with HR that was lengthy and very open. Afterward I was called into the department for a one on one interview with the 2 department heads. I am a non traditional applicant (new nurse in my later years). I never felt my age was an adverse consideration in the interview process. The response was fast, and despite the fact I was a new grad, the staff has always been very supportive.", "Interview Questions": "My personal feelings about nursing and the relationship between nurses, the hospital, and patients"}, {"date": "21 Nov 2016", "title": "Intern II Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Memorial Health Care in Nov 2016", "Interview Descriptions": "The interview was very conversational and informative. It was also relaxed. It lasted about 30 minutes. I was able to ask any questions that I had about the hospital. I also was given a tour of the area and facility.", "Interview Questions": "Tell me about yourself."}, {"date": "28 Feb 2017", "title": "Patient Assistance Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Baptist Memorial Health Care (Memphis, TN) in Jun 2016", "Interview Descriptions": "Panel Interview, with Lead, Supervisor, & Director.  They all read over the resume as if it was just printed minutes before. They asked questions pertaining to your previous job and the next person would ask the same question just word it differently.", "Interview Questions": "Your Career Goals . "}, {"date": "5 Mar 2019", "title": "CVICU Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Memorial Health Care in Feb 2016", "Interview Descriptions": "informal meeting with the unit manager and head nurse. the interview lasted about thirty minutes. the manager and head nurse asked questions. the questions included tell us about a difficult situation you have had to deal with another coworker and how did you handle it. the overall experience was pleasant.", "Interview Questions": "name a weakness"}], [{"date": "27 Aug 2015", "title": "Respiratory Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Baptist Memorial Health Care (Memphis, TN) in Jun 2015", "Interview Descriptions": "I was interviewed by two people, very easy interview. I was only asked a few questions which were easy. The interviewers mostly talked about the position and how they scheduling would be.", "Interview Questions": "Why should we hire you as opposed to other candidates"}, {"date": "9 Jul 2015", "title": "Chief Financial Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Baptist Memorial Health Care (Jonesboro, AR) in Jun 2015", "Interview Descriptions": "Short interview with executive Director about CFO position requirements. Their focus was on what needed to be done in the position right away. They were focused on Physician compensation above all else.", "Interview Questions": "What I had done and What their priorities were"}, {"date": "26 Aug 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Baptist Memorial Health Care (Covington, TN) in Mar 2015", "Interview Descriptions": "one on one interview with the CNO and department director and was called back for a panel interview that seemed poorly prepared for by the facility manager. Only one staff nurse came in and it felt rushed.", "Interview Questions": "experience"}, {"date": "6 Oct 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Baptist Memorial Health Care (Memphis, TN) in Jan 2015", "Interview Descriptions": "Very laidback and interested in making you happy with your Job putting you in a place you want to be. Interested in your goals and how they can facilitate them while providing excellent care to the patient. Very much faith based which is refreshing to find in an employer not just a Christian name that actually follows it and prays.", "Interview Questions": "What made you want to become a nurse"}, {"date": "11 Nov 2014", "title": "Housekeeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Memorial Health Care (Oxford, MS) in Jul 2014", "Interview Descriptions": "I received a phone interview and following that I received an in-person interview and after that I waited a month for the next hiring process. After that I was contacted through the human resources lady and I started the hiring process which was: taking a health test, drug-screen test, TB skin test, background test, FBI fingerprint test, and after that I waited an additional week for everything to clear and to be notified that everything came back bad or good.", "Interview Questions": "What have you done at a previous employer that you wish you hadn't done or wish you would've done differently?"}, {"date": "18 Oct 2013", "title": "Customer Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Baptist Memorial Health Care (Memphis, TN) in Mar 2013", "Interview Descriptions": "Received a phone call from a recruiter a week after I applied online. The next I had an interview and was offered the position  two days later", "Interview Questions": "None, same questions... Ex. Tell me a time when you had to calm a customer down . "}, {"date": "3 Aug 2013", "title": "Psychiatric Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Memorial Health Care (Union City, TN) in Feb 2013", "Interview Descriptions": "I was interviewed by all the main bosses on the floor at one time. I was asked questions pertaining to my work ethic, beliefs and other basic info. I went through about two weeks of training.", "Interview Questions": "What was my worst quality?"}, {"date": "22 Jul 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Baptist Memorial Health Care in Jan 2013", "Interview Descriptions": "Nurse manager called me for the interview, offered me the job in 2 weeks and started the job in 4 weeks. They were very friendly and open to my answers", "Interview Questions": "Where do you see yourself in 5 years? Tell us about yourself, your family, and your experience!"}, {"date": "18 Nov 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Baptist Memorial Health Care in Aug 2012", "Interview Descriptions": "The interview process was very well orchestrated and went smoothly.  I met with the immediate director, CFO, and assistant administrators.  All were very respectful and complementary.  I interview first by phone and then in person.", "Interview Questions": "What would you do in your first 90 days? "}, {"date": "29 Jan 2016", "title": "Technical Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Baptist Memorial Health Care (Memphis, TN) in Aug 2012", "Interview Descriptions": "My interview process was very fast paced (two weeks with two in-person interviews). I went through two in person interviews and I felt that they were pretty thorough. The first interview was very laid back and asked me about my knowledge base and it helped that I had interned there earlier in the year. The second interview was more of a get to know me type of interview as well a description of the job I was applying for since the position was new.", "Interview Questions": "This interview took place a little over three years ago so it's kind of hard to remember the questions that was asked back then, but I think one of the questions was, where do I see myself in the next five years."}], [{"date": "27 Oct 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Memorial Health Care (Memphis, TN) in Aug 2012", "Interview Descriptions": "Asked some situational questions like what what would you do if... also asked what are plans and goals for the future... and why you want to work here. Have to contact the recruiter first", "Interview Questions": "Why Aldo you want to work here"}, {"date": "23 Apr 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Baptist Memorial Health Care in Jul 2012", "Interview Descriptions": "I met with the manager of the department and had a comfortable easy-going interview, in which she asked me basic questions about my previous job experience and my interest in the sub-specialty in which I would be embarking on by accepting her offer.  I discussed with her some strengths and weaknesses in my nursing experience and skills, and she briefed me of some job expectations.", "Interview Questions": "In the past, how have you addressed conflict in the workplace?"}, {"date": "24 Feb 2012", "title": "IT Auditor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Baptist Memorial Health Care (Memphis, TN) in Jan 2012", "Interview Descriptions": "I applied for the job in mid-December of 2011, but did not receive a call until January 2012.  Once I received a call, I scheduled an interview for the next week.  After the 1:1 interview/group interview, I was told that the process would take at least 3 weeks due to scheduled vacation time for the decision makers.  The interview was professional but relaxed and they seem  like a great company to work for.  There were a few difficult questions but they were not unreasonable concerning software and decision making.  Four weeks later I received an email stating that I had a good interview but was not selected for the position.", "Interview Questions": "What is your experience with ACL software?"}, {"date": "24 Nov 2015", "title": "AUC Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Baptist Memorial Health Care (Oxford, MS) in Sept 2011", "Interview Descriptions": "The process was very slow. I applied; then two weeks later I had an interview; then I went downstairs and had a blood test done, a drug test, a tb test; then I waited for a month before they called me to tell me when to come for orientation; I had orientation about a week later. Overall the whole process took almost two months.", "Interview Questions": "What makes you more likely to stay here over other people?"}, {"date": "17 May 2015", "title": "Technical Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Baptist Memorial Health Care (Memphis, TN) in May 2011", "Interview Descriptions": "Phone call, face-to-face interview, usual screens then hired. Onboarding took about a week and the interactions were professional and courteous enough.  HR seemed to do that much fairly well.", "Interview Questions": "What is a technical problem that you fixed?"}, {"date": "26 Jul 2015", "title": "Pharmacist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Baptist Memorial Health Care (Memphis, TN) in Apr 2011", "Interview Descriptions": "lengthy interview process; took a few weeks from initial interview to official hiring; it started with a meeting with recruiter and then a group panel of current employees; I appreciate the portion of the interview where I could talk and ask questions of the staff minus the presence of management; management (at the time) was very helpful and answered any questions that I had following the interview", "Interview Questions": "How would you handle a difficult co-worker?"}, {"date": "7 Jun 2013", "title": "Admitting Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Baptist Memorial Health Care (Knoxville, TN) in Jul 2009", "Interview Descriptions": "Your typical interview describing your background and experience.  There was a behavioral and compatibility test, very easy, some questions were asked multiple times in different ways testing your honesty.  There was one interview with the manager.  There is the standard drug testing and employment elligibility verification process.  They do not hire any smokers.", "Interview Questions": "There weren't any unusual questions. "}, {"date": "9 Jun 2010", "title": "Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Baptist Memorial Health Care (Memphis, TN) in Jan 2008", "Interview Descriptions": "Very simple interview", "Interview Questions": "What are your interests in nutrition"}]]