[[{"date": "24 May 2023", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at RNIB (Brighton, England)", "Interview Descriptions": "ok lots about CQC, and personalisation, staff retention and recruitment, budget management, change, inclusivity, activities, volunteers. can i travel to meetings, training, building good relationships with outside organisations. what do i know about sight loss.", "Interview Questions": "how will you manage a difficult staff team."}, {"date": "28 Mar 2023", "title": "Customer Experience Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at RNIB in Mar 2023", "Interview Descriptions": "The opening questions are pretty general and about why you've applied for the role and why you want to work for RNIB (including any relationship to sight loss, though that isn't a requirement!) and then the rest are competency based. The competency-based questions come directly from the person specification in the job spec, with a particular focus on how you overcome challenges and complex stakeholder management. The", "Interview Questions": "Tell us about a time you used data and insight to inform improvements to a customer journey and/or experience."}, {"date": "7 Apr 2023", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at RNIB (London, England) in Jan 2023", "Interview Descriptions": "Lots of interviews I’ve attended feels like an interrogation session but they really put me at ease. I felt they were trying to get the best out of me and it really helped.", "Interview Questions": "Why do you want to work for us?"}, {"date": "27 May 2021", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at RNIB", "Interview Descriptions": "Was asked to prepare a Powerpoint presentation but then taken to a room with no laptop or projector, which seemed strange.  The room was full of old fax machines which wasn't a great first impression1", "Interview Questions": "Competency-based questions, one for each essential criteria on job description. "}, {"date": "13 Jun 2022", "title": "hr recruiter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at RNIB (London, England) in Mar 2021", "Interview Descriptions": "Was a simple interview but no specific feedback other than the interview was strong but nothing else  given to the recruiter. Hopefully the process has improved since I last interviewed with them.", "Interview Questions": "Talk to us about your work background and history "}, {"date": "16 Jan 2023", "title": "HR Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at RNIB in Apr 2020", "Interview Descriptions": "An online application form, 1 interview and a decision was made the same day . Great interview panel, made me feel comfortable. Questions asked What are your experiences What you know about RNIB", "Interview Questions": "What experience you have About you Dealing with a difficult situation Being aware with disabilities."}, {"date": "1 Dec 2019", "title": "Insights Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at RNIB in Nov 2019", "Interview Descriptions": "There was a formal interview and test. Two people on the panel. One member was yawning throughout and the other was aggressive and disinterested. \r\nReally negative experience and completely put me off the company.", "Interview Questions": "Skills you need to motivate a team in a negative working environment"}, {"date": "9 Sept 2019", "title": "Trainer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at RNIB (London, England) in Apr 2019", "Interview Descriptions": "Formulaic questions; panel interview; interviewers had little understanding of skills or experience required.  Suspicion that candidate had already been selected and panel were going through the motions.  Not the most satisfactory experience.", "Interview Questions": "experience."}, {"date": "24 Dec 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at RNIB", "Interview Descriptions": "really positive experience interview was very good and in the interview I was asked many amazing questions which caused me to enjoy it and it was a successful interview so overall I can only descrive it positively very positively indeed", "Interview Questions": "Why do you want to work for RNIB?"}, {"date": "22 Mar 2021", "title": "AFM Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at RNIB (Glasgow, Scotland) in Nov 2018", "Interview Descriptions": "standard charity interview, presentation and competency questions. 3 panel members. not too formal, really nice people made to feel at ease. was offered role the next day and received good induction on starting role.", "Interview Questions": "presentation on flagship product, competency questions."}], [{"date": "16 Nov 2017", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at RNIB", "Interview Descriptions": "Very laid back, submit application, go in for a competency based interview. Largely informal but it does depend on the manager in question. Prepare examples, you may have to give a presentation - make sure you have the new RNIB branding and not the old one.", "Interview Questions": "Why do you want to work at RNIB?"}, {"date": "21 Oct 2017", "title": "Assistant Human Resources Business Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at RNIB (London, England) in Oct 2017", "Interview Descriptions": "quick simple process, call to interview, first interview with standard competency based questions. Comforatable and put at ease. Second interview with head of department and other business partner. quick response and feedback offered. Contract and offer details took longer to arrive", "Interview Questions": "experience for this job?"}, {"date": "31 Jul 2017", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at RNIB", "Interview Descriptions": "I completed a standard application online. The interview itself was informal and friendly. It was one of the easiest interviews I've attended. Staff are friendly. I received a call straight after the interview to offer me the job.", "Interview Questions": "They asked about my experience."}, {"date": "9 Mar 2017", "title": "Sales Ledger Clerk Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at RNIB (Peterborough, England) in Feb 2017", "Interview Descriptions": "I was interviewed by two senior members of staff, they gave me an overview of the job content and some RNIB company background and history.\r\n\r\nBoth had question sheets and they started to ask questions but neither were writing answers, I found this strange. After the first couple of questions the interview went off the scripted questions and turned into a very informal chat, we talked about my previous experiences and some small-talk about this and that, it was like being in the pub with work colleagues, I got the distinct impression that I wasn't what they were looking for. They were both very polite and saw me out of the building. \r\n\r\nI didn't hear anything from them and decided to chase up and request an outcome and some feedback, to date, I'm still waiting, I guess that means I was unsuccessful.\r\n\r\nThis isn't the first time I've experienced this and my advice to employers is, if someone makes the effort to shower, shave, don a suit and travel to your offices, please have the courtesy to inform the candidate of the outcome and offer some feedback for their personal development.", "Interview Questions": "Why do you want to work for the RNIB?"}, {"date": "22 Nov 2017", "title": "Production Team Leader Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at RNIB in Apr 2016", "Interview Descriptions": "I had high hopes for this job role and the interview seemed to be going well. Around 25 minutes into the interview one of the interviewers said she had to leave to catch her train in order to pick up her children! Her colleague looked very uncomfortable and carried on with the interview. I complained about this behaviour and they couldn't apologise enough a couple of days later. I subsequently had another negative experience with this organisation so lesson learned - I won't put myself through that again!", "Interview Questions": "How do you work within a team?"}, {"date": "7 Oct 2016", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at RNIB (Bristol, England) in Apr 2016", "Interview Descriptions": "An interview was arranged with my Team Leader and 2 other Team Leaders from other teams. It lasted for an hour and I was asked a group of approximately 4 questions per team Leader on a rotation. The questions were mostly based on my previous work experience and giving real life examples of how I have managed certain situations that arise during my work life. I was also asked questions around where I wanted my career with Action for blind People to go in the future. I was also asked questions around my personal interests and hobbies.", "Interview Questions": "What was my reasons for wanting to work for Action for Blind People?"}, {"date": "25 Feb 2016", "title": "Sales Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 6 weeks. I interviewed at RNIB (Peterborough, England) in Dec 2015", "Interview Descriptions": "Initial telephone interview followed by a structured face to face panel interview with set questions and including a presentation to two people. All RNIB interviews have to be panel interviews with pre-screened questions.", "Interview Questions": "What you are you presented with a monthly, or quarterly target, what would be your startegy and how would you prepare to achieve target?"}, {"date": "28 Nov 2017", "title": "Information Security Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at RNIB in Dec 2015", "Interview Descriptions": "Very laid back and informal, although technical in nature. I was nervous at the  start, but the two managers were very supportive and quickly calmed me down. Kindly answered questions I have asked and never tried to pressure or make me uncomfortable.", "Interview Questions": "Tell us about an event where you had to deal with an angry customer."}, {"date": "27 Aug 2017", "title": "Technical Consultant Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at RNIB (Liverpool, England) in Jan 2015", "Interview Descriptions": "Applied through a campus ad, chatted with the recruiter on phone. Then when to the site and interviewed with the recruiter, had my documentations checked. The whole process took 3 month before I received my offer.", "Interview Questions": "Have you got any technical or computer background?"}, {"date": "20 Aug 2018", "title": "Public Affairs Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at RNIB (Cardiff, Wales) in Nov 2014", "Interview Descriptions": "Standard interview which followed a written test.\r\nThe questions were fine, nothing out of the ordinary.\r\nRegrettably the RNIB never got back to me following my interview. I emailed the Welsh CEO who was on the panel a week after my interview and still heard nothing back.", "Interview Questions": "Standard competency questions based on the JD."}], [{"date": "18 Oct 2012", "title": "Data Import Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at RNIB (London, England) in Jul 2010", "Interview Descriptions": "Straight forward 1 to 1 interview although the long application form was a pain.", "Interview Questions": "All straight forward Qs"}]]