[[{"date": "12 Jun 2023", "title": "Adult Career Scholars Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at ACC (Austin, TX) in Jun 2023", "Interview Descriptions": "An emailed invitation to interview was sent about a week or so after I applied. Interview was a panel of 6 people. I based my prep on the job description. There were several questions about data analysis, interpretation, and an emphasis on working with external partners. None of which were mentioned in the job description, which I thought was a big misalignment and not exactly fair.", "Interview Questions": "How do you juggle multiple deadlines/priorities? What is your biggest accomplishment? Describe a time you used data to make a programming decision involving external partners?"}, {"date": "4 May 2023", "title": "Accessibility Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ACC (Austin, TX) in Apr 2023", "Interview Descriptions": "Formal. Great opportunity to support student while learning on the job at various campuses. Straight forward interview. They provided the questions before the interview via email. Interview was held via Google classroom.", "Interview Questions": "Why are you interested in this role?"}, {"date": "27 Mar 2023", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at ACC", "Interview Descriptions": "It is a 1 step process. An hour-long interview. There were two people. One of them was an HR representative and the other was a mathematics professor. Questions about my teaching philosophy, background and experience.", "Interview Questions": "Explain a concept of your choice and one chosen by the committee."}, {"date": "8 Mar 2023", "title": "Assistant, Student Affairs Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ACC in Feb 2023", "Interview Descriptions": "They were able to meet over zoom. There was a small committee. I followed up after a month of not hearing anything. I checked less than three weeks later and they posted the job again. I was ghosted.", "Interview Questions": "What is your super power?"}, {"date": "22 Jan 2023", "title": "Program Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ACC", "Interview Descriptions": "Took nearly four months to offer me a job. How is that a reasonable timeline? I applied in October, interviewed END of November, got reference requests in December and was offered a job in January.", "Interview Questions": "What experience do you share that is similar to the demographic you will serve?"}, {"date": "10 Feb 2023", "title": "Web Designer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at ACC (Austin, TX) in Dec 2022", "Interview Descriptions": "It was a pretty standard \"behavioral interview\" in tech. We started with introductions and then each one of them took turns asking me questions in a popcorn format with each member of the team asking a particular question.", "Interview Questions": "Tell us about yourself and how you came to be a \"web designer.\" 2. Tell me about a time you worked on a tech team and what was your role? 3. What is your favorite web design tool? 4. What is one thing that you need from team members in order to be successful? 5. What is one thing that you need from a supervisor in order to be successful? 6. How organized would you say that you are and what's your style? 7. Tell me about one of your favorite projects that you've ever worked on, why, and what was your role? 8. What is your skill level with WordPress specifically and can you elaborate on any other Content Management Systems that you're familiar with? 9. Can you tell me what web accessibility means to you and why is it important? 10. Can you tell me about a time when things didn't go the way you expected and wha"}, {"date": "12 Oct 2022", "title": "Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at ACC (Austin, TX) in Aug 2022", "Interview Descriptions": "very friendly. informative. met with several members of staff for over 30 minutes. great questions. made me feel very comfortable and free to ask my own questions. very clear on job description and timeline of search process.", "Interview Questions": "What is a professional mistake you have made."}, {"date": "11 Aug 2022", "title": "Telecommunications Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ACC in May 2022", "Interview Descriptions": "Very organized and structured.  Interview was a diverse panel round robin.  The employer also provided a professional follow-up after the interview process was complete. Therefore, candidates were not left hanging for weeks on end.", "Interview Questions": "Structured, outlined & consistent delivered in a diverse platform."}, {"date": "5 Jan 2023", "title": "Network Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at ACC (Austin, TX) in Jan 2022", "Interview Descriptions": "The interview process at this company was extremely lengthy and it took an excessive amount of time to receive a response on whether or not I received the job. This was a major inconvenience and caused a lot of unnecessary stress and uncertainty. I would not recommend this company to job seekers due to their slow and inefficient hiring process.", "Interview Questions": "what is the difference between an MDF and an IDF. what systems would you expect to find in each."}, {"date": "3 Dec 2021", "title": "Recruitment Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ACC (Austin, TX)", "Interview Descriptions": "ACC generally conducts interviews via Group panel interview, usually 5-8 interviewers per interview. Typically one-round. Depending on the team, usually standard behavioral interview questions.  Typically 10-15 questions followed by Q&A.", "Interview Questions": "Tell us more about your background and why it's a good fit for this role?"}], [{"date": "17 Jul 2021", "title": "Substitute Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at ACC", "Interview Descriptions": "Very clear steps and friendly people. Be prepared for a panel interview and give a short sample lesson. Pick a narrow topic and practice with peers first! It will take time to get through the paperwork and training, but the job is worth it.", "Interview Questions": "What do you love about teaching?"}, {"date": "17 Apr 2021", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at ACC", "Interview Descriptions": "A few months after applying for an adjunct pool, I got an email to set up an interview for three weeks later. There was a (zoom) panel of 4 instructors from different departments. It was a very simple 5 question interview with basic questions about strengths/weaknesses and teaching experience.  The interview itself was straightforward, but afterward it was very difficult to get any basic information about 1) whether or not I had actually been hired/added to the pool, and 2) how to get assigned classes to teach.", "Interview Questions": "Which specific college classes have you taught, and for how many semesters?"}, {"date": "7 May 2022", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ACC in Mar 2021", "Interview Descriptions": "I applied and it took roughly 2-3 weeks to schedule the interview. It was an online panel of about 4 people from the department via Zoom. Make sure to apply before the deadlines, they hire for the next year in January.", "Interview Questions": "They asked pretty standard questions like greatest strength, weakness, what's my greatest teaching triumph, when have I had a struggling student, hardest teaching moment and what I learned, and how I deal with behaviors in the classroom."}, {"date": "17 Apr 2023", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at ACC (Austin, TX) in Jul 2020", "Interview Descriptions": "Typically a panel interview consisting of 3-5 interviewers. Round table approach to ask questions. Demonstration may be required depending on job. Usually for instructors or other student facing roles. Why do you want to work here or in this position.", "Interview Questions": "Tell me about your strengths and weaknesses."}, {"date": "17 Feb 2020", "title": "Software Engineer(Internship) Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at ACC", "Interview Descriptions": "Video interview for screening . Later a phone call . Asked general behavioural questions and then did resume grinding. Be sure about your resume and whatever you put in it . Skim through the qualifications and be prepared", "Interview Questions": "N/A"}, {"date": "20 Feb 2020", "title": "Financial Aid Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ACC in Feb 2020", "Interview Descriptions": "Within 2 weeks of the job post closing I received an email invitation to interview. Interviews for a position are conducted all on the same day. By the end of the day, the panel of 4-6 will decide on a candidate and HR will email you if you are selected for the position.", "Interview Questions": "Describe how your last 3 jobs relate to this position."}, {"date": "2 Dec 2019", "title": "Financial Aid Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at ACC (Austin, TX)", "Interview Descriptions": "I applied for position and received a call from the Hiring Manager about a week and a half after applying. We scheduled a face to face interview the following week. I live in a different city so I drove to a few hours to the interview. I interviewed with a panel of five all except one worked in the relevant department. Everyone was kind, and the standard questions were asked. After about a week I emailed the gentleman leading the interview and he responded rather quickly saying that although they all felt I was a strong candidate they choose someone who was a better fit, he recommended I monitor other positions in the department. A day later I got the email from HR.", "Interview Questions": "What is one thing you can improve about yourself?"}, {"date": "3 Jul 2019", "title": "Graphic Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ACC (Austin, TX) in Jun 2019", "Interview Descriptions": "Very engaging and informative from both sides. Consists of an interview in front of a committee based from members from a variety of offices, each asking a broad, formal \"Tell us about yourself\" etc. type question. They just go around the table.", "Interview Questions": "How do you deal with changes to a project at the last second?"}, {"date": "23 Feb 2022", "title": "Business S Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at ACC (Austin, TX) in Apr 2019", "Interview Descriptions": "The ACC building is the worst building I have ever interviewed in. It is located in the East side of Austin in a very undesirable area. The building looks about 80 years old. The interview room had a standing fan since the air conditioning does not work. The wall had a hole in it where the TV was removed. The carpeting smelled wet and very old. The desks were about 3 feet wide and there was little free space. This was the absolute worst place I have ever been to.", "Interview Questions": "How soon I could start"}, {"date": "19 Nov 2019", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at ACC in Dec 2018", "Interview Descriptions": "Panel interview in person.  Not flexible on time or date.  10 difficult questions from various management regarding subject matter and general experience in education.  Cold, very little emotion or humor in the interview.  Very to the point and finished in less than an hour.", "Interview Questions": "Why are you leaving your current job."}], [{"date": "27 Jul 2018", "title": "Media Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at ACC in Jul 2018", "Interview Descriptions": "panel style interview with five people plus a follow up interview with the lead from the department.  Very long process to decide who is right for the job.", "Interview Questions": "Tell us about yourself"}, {"date": "16 Oct 2022", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ACC (Austin, TX) in Feb 2018", "Interview Descriptions": "Two interviews with the a mix of members of the facilities team. All at a round table . They have a set list of questions . Very nice and welcoming !", "Interview Questions": "How do you handle demanding clients ?"}, {"date": "9 Mar 2018", "title": "Programmer Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ACC (New York, NY) in Jan 2018", "Interview Descriptions": "short interview, couldnt give any more info , lots of tricky poop questions , i just want to view a salary on this website. when will i have the few little 20 words already", "Interview Questions": "your ambitions"}, {"date": "21 Jan 2018", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at ACC (Kalamazoo, MI) in Dec 2017", "Interview Descriptions": "After reviewing this website and determining potential questions for interview got to say 100% spot on still waiting for interview 3 but pleasant experience overall and would apply again because recruiter seems pleasant and. Opportunities seem promising", "Interview Questions": "Why did you choose this company?"}, {"date": "27 Nov 2017", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ACC", "Interview Descriptions": "The interview was with the department head.  It involved a series of questions to determine if you're suited for higher-education teaching.  They want to know if you had any experience teaching in a classroom setting, describe your teaching approach, strengths and weaknesses, how would you handle different situations in the classroom.  After the interview, I had to keep contacting the department head in order to actually get the job.", "Interview Questions": "Why do you want to teach?"}, {"date": "17 Aug 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ACC", "Interview Descriptions": "I was called and told I was selected for an interview. They had me fill out a background check consent form and bring it. It was a panel with 6 people I think. 25 questions. Most were pretty straightforward, some I had to think about. Some fun ones.", "Interview Questions": "Describe setbacks at your last three positions. "}, {"date": "14 Apr 2021", "title": "English Adjunct Professor - Early College Start Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ACC (Austin, TX) in Aug 2017", "Interview Descriptions": "I submitted an application on the ACC website. I received a call within a week to meet with the head of the English department.\r\n\r\nFor the interview, I went to the downtown campus and spoke to the head of the English department for about 15 minutes about my experiences as a teacher. I did not have to perform an in-person teaching sample.\r\n\r\nI was hired that same day, which may have been because the interview took place a week before the Fall semester.", "Interview Questions": "What were classes that you have taught before? \r\n\r\nHow do you typically run a class? \r\n\r\nHow do you handle diverse student populations? "}, {"date": "23 Dec 2016", "title": "Devops Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at ACC (New York, NY)", "Interview Descriptions": "30 minutes technical phone interview, very nice people, if you know Linux and scripting it will be super easy. \r\n\r\nThen I had to go for face to face interview with the team lead and hiring manager. Very cool environment", "Interview Questions": "What is AWK in Linux "}, {"date": "16 Oct 2016", "title": "Frontend Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at ACC (Austin, TX) in Sept 2016", "Interview Descriptions": "It was a single round interview where I was interviewed by a panel. They asked behaviorial questions and about my projects. I got a call and they invited me on-site within a short notice. I was very confident and answered all the questions. Saddest part is they didn't update me anything until I called them and enquired.", "Interview Questions": "about my projects"}, {"date": "10 Aug 2016", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at ACC (Brown, TX)", "Interview Descriptions": "Fin lots of questions interaction very thero very informative allowed to view systems allowed to very site floor and meet all the staff employees payroll discusses and benefits were brought up", "Interview Questions": "Have you worked in customer service before"}], [{"date": "4 Jul 2016", "title": "Webmaster Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at ACC (Austin, TX)", "Interview Descriptions": "I knew my boss before I was hired, so I felt like a shoe-in. And I was. We met in his office, I sat across from him, and it was a very casual conversation. However, this was only for an hourly position. I know that for part-time or above, ACC employs a panel interview, and they can be tough.", "Interview Questions": "I was asked if I knew how to make websites, and if I had any examples of my work. I was also asked to verify that I had graduated college."}, {"date": "17 Apr 2016", "title": "Administrative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at ACC", "Interview Descriptions": "Saw job posted on ACC website. Applied. Several weeks later contacted via phone. Scheduled interview for about two weeks out. Flew myself in to Austin for interview and was asked to prepare a 15-minute presentation, and I was not told to whom I would be presenting. It was a fairly involved interview that required quite a bit of preparation. When I was notified that I did not get the job, they told me via a form email from the HR department, which I thought was tacky. If you ask someone to fly in from another state and/or put together a presentation, you can at least send an individual email letting them know they did not get the job.", "Interview Questions": "Q: Describe a time that you enacted a plan that went well.\r\nQ: Describe a time that you enacted a plan that did not go so well. "}, {"date": "28 Jul 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at ACC (Austin, TX) in Jan 2016", "Interview Descriptions": "Basic Questions like where do you see yourself in 5 years and why do you want to work for ACC. Dress up really nicely. Remember to bring a resume. Phone screen first. Background check and criminal history upon offer.", "Interview Questions": "Why do you want to work here?"}, {"date": "23 Apr 2017", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ACC (Austin, TX) in Jan 2016", "Interview Descriptions": "I met with my potential supervisor and one of her other instructors. They asked me several questions, and I asked some as well. They also had me do a skills demonstration component, for one of the classes I would have potentially taught.", "Interview Questions": "What is your experience working with older students from diverse backgrounds? "}, {"date": "24 Sept 2015", "title": "Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ACC", "Interview Descriptions": "There was a scheduled interview at the campus I was meant to work at if hired. There were a total of 5  people at once from multiple departments who each asked a single question 2x. Interview lasted 25-30 minutes and it was very professional.", "Interview Questions": "What was a difficult situation you handled at your previous job, and how did you handle it?"}, {"date": "23 Jan 2016", "title": "Northridge Campus Chair Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at ACC (Austin, TX) in Aug 2015", "Interview Descriptions": "When you apply, you fill out a form online at <sites.austincc.edu>.  This form is not very formal, so it's OK to have some fun filling it out... as long as it's work appropriate.  You will receive a phone call or e-mail to arrange an interview, if the position has not already been filled.  In some cases, they will still arrange an interview for you to see if you'd be a good fit for volunteering for a semester before moving into the Campus Chair or other paid position.  During the physical interview, you answer approximately 7 brief questions regarding your ideas and hopes for Student Life to a panel of 2 to 3 people.  They are gauging that you want to help with student life, are motivated to do so, and have the creative capacity to carry out any hopes and dreams you have for Student Life.  In the case of the Campus Chair position, this will all be while leading a team of approximately 15+ of your peers.", "Interview Questions": "If you could be any super hero, who would you be?  (A variation is if you could have any super powers, what would they be?)"}, {"date": "12 Sept 2015", "title": "Senior Buyer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at ACC (Austin, TX) in Jul 2015", "Interview Descriptions": "I was contacted and informed that I need to show up for an interview. There was almost no notice and inquired about having a Skype Interview and they rejected that idea. I flew out the day before the interview and met with 3 people. I was not told who I would be interviewing with and all three people were asking questions. The interview lasted roughly 2 hours.", "Interview Questions": "1.Describe your background and experience related to this position\r\n2. Describe your most challenging or difficult procurement / project\r\n3. Give example of how one works under pressure\r\n4. What is my interpretation of Excellent Customer Service\r\n5. Tell me about a time you encountered change in work process\r\n6. Describe a situation one negotiated a contract\r\n7. Give example of leadership\r\n8 Give example of how one would give proper training\r\n9 Give example of difficult information one has had to analyze"}, {"date": "23 Oct 2014", "title": "Admissions Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ACC", "Interview Descriptions": "After submitting around 40 applications, and slightly hounding HR personnel and hiring managers, I was finally contacted for an interview for the following week. It was such a routine that I would apply for every new posting before I could even realize it. It's seriously a numbers game, it took over a year before I was contacted for an interview. After my interview it took a few weeks to hear back from compensation with an offer. Once we agreed on a salary, I was able to choose my start date that was in the following month.", "Interview Questions": "Typical questions, nothing out of left field. Honestly, there isn't one that stands out as difficult. \"Tell us about a time you had a difficult customer and you handled the situation.\" Those types of questions. "}, {"date": "6 Sept 2015", "title": "Learning Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at ACC (Austin, TX) in Sept 2014", "Interview Descriptions": "Short. A can you do this? Yes I can. The coordinator was cordial and offered to meet me right then and there in their office for a quick summary of experience working with students with developmental delays. I mentioned my vendor experience with state clients over the last six years, and this helped solidify the decision to hire.The overall experience of the interview was 'concise' and 'helpful' on both sides of the coin.", "Interview Questions": "What was your previous experience working with students with developmental delays?"}, {"date": "22 Jul 2017", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ACC (Austin, TX) in Jul 2014", "Interview Descriptions": "The interview was pretty straightforward. I met with the Dept. Chair of English in her office and she asked me several general questions about my teaching methods. After about ten minutes she said for me to walk over to the main secretary and fill out my employment information (I was hired).", "Interview Questions": "What was a challenging teaching situation? How did you overcome the challenge?\r\nWhat was a breakthrough you had with a student?\r\nWhat is your teaching style?"}], [{"date": "22 Feb 2014", "title": "Adjunct Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ACC", "Interview Descriptions": "I met with three full-time professors in the department. They asked me fairly standard questions, and then they asked me to do a lesson demonstration (I had been told of this beforehand and was given the opportunity to prepare). The professors acted like the most challenging students they could think of.", "Interview Questions": "A professor, in the role of a confused student, couldn't \"understand\" my explanation no matter how many times/ways I restated, diagrammed, modeled, etc. The challenge, of course, was to see how patient I was and how creative I could be with teaching to different learning styles or disabilities."}, {"date": "6 Jan 2014", "title": "Science Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ACC", "Interview Descriptions": "Panel of people asking questions and you have to take a simple test to see if you know the general calculations of the job", "Interview Questions": "Why should we select you for the job"}, {"date": "19 Jun 2016", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at ACC (Austin, TX) in Jul 2013", "Interview Descriptions": "Face to face panel interview. Asked easy questions. the team was very casual. Taught one lesson to class. It was a good experience for me. I appreciated the candor of the team,.", "Interview Questions": "The usual questions , nothing special or hard."}, {"date": "15 Sept 2015", "title": "Alummi Affairs Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ACC (Austin, TX) in Mar 2013", "Interview Descriptions": "The interview process consisted of a panel interview with approximately 10 interviewers. It was informal and the interviewers represented a wide range of departments and roles. Each interviewer asked a question. Most of the questions were situational- ie \"How would you handle this?\" The interview lasted about an hour and it was a comfortable experience.", "Interview Questions": "What is the first thing you would do in this position?"}, {"date": "26 Sept 2013", "title": "Student Services Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ACC (Austin, TX) in Jun 2012", "Interview Descriptions": "Applied online.  Closing dates on the application acceptance is very strict.  Be sure and apply exactly on time.  Generally they are also only available for a week or two when they do come out.  When I got the phone call to interview, interviews were pretty much that same week with only 1-2 days open to interview.  Really small window.  Hiring at ACC is all by committee.  Depends on the position.  Depending on how up the chain the position is, the larger the interview committee.  Generally 6-8 people will ask questions.  Anywhere from 30-60 minutes and presentations may be required.  Hard to get foot in the door at ACC but once in, positions are great. Acceptances can take another 2-3 weeks at a minimum.  Once the hiring committee agrees on a candidate, they send it to HR, who then does background checks and references.  Depending on time of year, it can take weeks before an offer comes through.  Quite a long, tedious process.", "Interview Questions": "Suppose you were the only one to open the advising center and there was a line out the door, the phone was ringing off the hook and an instructor adamantly needed copies or information all at the same time.  How would you handle the situation?"}, {"date": "29 Feb 2016", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at ACC (Austin, TX) in Jan 2012", "Interview Descriptions": "I had to go in and talk to the tutor center manager. I was given a set of skill review question and she went over my background. There was a second set of interview in which she explained to me the role I would be carrying as a tutor and the responsibilities that the job entailed.", "Interview Questions": "What would I be a good fit?"}, {"date": "9 Sept 2012", "title": "Lab Tech II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at ACC (Austin, TX) in Nov 2011", "Interview Descriptions": "You will be interviewed about your previous work experience, questions about things shown in resume. Very friendly interview.", "Interview Questions": "how much salary do u expect?"}, {"date": "15 Jul 2015", "title": "Help Desk Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at ACC (Austin, TX) in Nov 2011", "Interview Descriptions": "Committee interview, typically 4 - 5 people. It can take up to a couple months from beginning to finish (application to job offer). It is typically a laid back environment. It may be intimidating interviewing with a panel, but the people are laid back and easy to talk to.", "Interview Questions": "The typical interview questions. Tell me about yourself, how did you handle a difficult situation, job related technical questions."}, {"date": "14 Dec 2015", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at ACC (Austin, TX) in Jun 2011", "Interview Descriptions": "Fill out an online application.  Called for an interview. Interview was a panel of 5 or 6 employees. Each asked a question. It was a total of at least 10 questions.  After interview, I was called within a week with a job offer. The whole process took about 3 weeks.", "Interview Questions": "I don't remember any actual questions, but they were all pretty specific to the job for which I was applying."}, {"date": "23 Aug 2015", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at ACC (Austin, TX) in Jun 2011", "Interview Descriptions": "Asked a few questions and then I had to teach on a subject. As this was a political science interview I was asked to teach on the Legislative Budget Board process for Texas Government. I spoke for around 20 minutes and then they followed that with a few questions about how I would over come certain challenges in the classroom since ACC is a very diverse population.", "Interview Questions": "Tell us about your teaching style"}], [{"date": "9 Oct 2013", "title": "CCNA Lab Tech/Student Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at ACC (Austin, TX) in Dec 2010", "Interview Descriptions": "I was a student and was referred by my CCNA instructor to management for a position at ACC.  I turned in my application for employment and had one interview and I was hired at that point.", "Interview Questions": "Where do you see yourself in 5 years."}, {"date": "22 Nov 2011", "title": "Senior Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at ACC (Austin, TX) in Sept 2010", "Interview Descriptions": "The interview committee consisted of a panel of 6 interviewers who all took turns asking questions - 18 questions total, not including follow up questions. I got the impression that they already had someone in mind as they committee seemed very disinterested in my answers. The questions were tough. One in particular that blew my mind was \"Name your three best traits and your three worst traits.\" I was prepared for one bad trait, but three? Within a week I received the email letting me know I didn't get the job, something I was pretty certain about when I left the room anyhow.", "Interview Questions": "Name your three best traits and your three worst traits."}, {"date": "5 May 2011", "title": "Media Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at ACC (Austin, TX) in Sept 2010", "Interview Descriptions": "I've been through several now for several different positions.  Usually you wait for a pretty long time after you apply before you get the call to come in for an interview. Its always a panel of people from different areas of the college and they have a list of standard questions - \"what are you strengths\", \"what are your weaknesses\", \"describe a situation in which you performed well\", etc.  The questions are not terribly difficult, but I can imagine it would be intimidating having to sit in front of a panel of people.  \r\n\r\nAfter the interview, I find it's hard to know if it went well or not because of the number of people you are dealing with.  It takes a really long time to hear back afterward.  If you contact them and ask about it, usually they will redirect you to HR and you'll get a vague answer.  Just when you are about to give up hope altogether, that's when HR calls and says you got it.  If you aren't quite as fortunate you'll get an email saying you didn't get it.  You always hear one way or the other.", "Interview Questions": "Describe a situation related to your job that was particularly challenging and describe how you overcame it."}, {"date": "4 Oct 2014", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ACC (Austin, TX) in Aug 2010", "Interview Descriptions": "The hiring process is partly driven by the requirements for an accredited institution so that getting hired does mean that you have some academic achievements. PhD is not required, but of course, as it's the gold card of the profession, having one helps. The HR department checks applications against position requirements and your application must, repeat much, meet or exceed them. The interview process is by a committee and the same questions are asked of each of the interviewees in each session. Followup questions are sometimes allowed but generally, the answers you give for each question will determine if you are in the running.", "Interview Questions": "I didn't think any of the questions were particularly difficult; the one unexpected one was \"What would you do if a student in the class got out of control?\""}]]