[[{"date": "30 May 2023", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Crisis Text Line", "Interview Descriptions": "No interview process but you have to do a training course. You get acceptance pretty quickly. The course is quick and you get great feedback on your last assignment. Once you complete the course you can start volunteering.", "Interview Questions": "No interview questions they just make you do a course if you get accepted"}, {"date": "22 May 2023", "title": "Research ML Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Crisis Text Line", "Interview Descriptions": "3 Interviews. 1) With the recruiter about the job and the process. 2) With 2 researchers about them, me, the job in detail and some technical questions and one problem 3) A presentation about something I did and lots of questions. In the 2nd interview, they told me I was the strongest candidate and they were very excited with the process. Everything was friendly, and what I really liked about the job was the opportunity to help people. Other aspects like their technology were not the strongest point, tbh. I knew it, but I decided to listen to them and discover more about the organization. Until this moment they answered quickly the questions and all I needed (via email). In the last interview, I did my presentation, it was about something innovative and I answered all the questions. They decided not to continue with the candidature which is ok, maybe they wanted another thing. This is not the first time and won't be the last this happens, however, the problem is that they disappeared. Is ok if they wanted something else or simply if they don't like the candidate, but is not to ghost the candidates and send an automatic response after all the communication and interviews. Is disrespectful to the work done and childish as an organization. They demonstrated to be very immature and not taking care of the people they have around, which in the end, was my main interest, so I suppose this happened for the best. Companies need to understand that giving feedback is the minimum in a process, I asked specifically for it and didn't receive any answer...", "Interview Questions": "To answer some questions about a case that had partial information."}, {"date": "30 Mar 2023", "title": "Volunteer Crisis Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Crisis Text Line", "Interview Descriptions": "Application process was straightforward but long. They do guide you through the process really well and make it easy to understand. It’s really rewarding and the training is really good.", "Interview Questions": "How have you handled crisis situations in the past"}, {"date": "2 Mar 2023", "title": "Crisis Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Crisis Text Line", "Interview Descriptions": "There was no interview process, there was only the self paced training modules that took about 30 hours to complete. The hiring process was a fully online interview and training process", "Interview Questions": "How many hours will you commit to this role?"}, {"date": "8 Dec 2022", "title": "Crisis Counselor Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Crisis Text Line (New York, NY)", "Interview Descriptions": "I applied via their website. A few weeks later, I received an email from the recruiter. At first, it was a phone screening to learn more about the company. A week later, I had an interview with the clinical manager. After that interview, I received a google suite assessment. The last interview was with the director of the clinical supervisor. I like the last interview; it felt more like a conversation than an interview. Due to the holidays, it was a delay but they were always in contact with me.", "Interview Questions": "Do you have supervisor experience?"}, {"date": "16 Nov 2022", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Crisis Text Line", "Interview Descriptions": "Starts off with a phone screening to learn more about your background and for you to ask basic questions. From there, the interviews were conducted via zoom. These interviews were not stressful at all, but should know alot about the company as well as crisis intervention.", "Interview Questions": "Questions asked included tell me about your crisis background? Also asked how I handle making decisions under pressure."}, {"date": "22 Sept 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Crisis Text Line in Jul 2022", "Interview Descriptions": "CTL was quick to set up an interview after the submission of materials. Off the bat, the interviewer seemed massively disinterested and was a bit disorganized. Additionally, I was shocked that for a company that just went through a massive social reckoning regarding ADEI/JEDI issues, they didn't ask a single question related to DEI.", "Interview Questions": "Typical management-related questions (tell us about a time you managed people, how would you handle X situation, etc.)"}, {"date": "7 Apr 2023", "title": "Learning Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Crisis Text Line (Los Angeles, CA) in Jun 2022", "Interview Descriptions": "Applied through POCIT in April. Was contacted by someone at Crisis Text Line to choose an interview date within a 2 week window. Didn't get a confirmation or anything. So I reached out to a recruiter at Crisis Text Line that I found on LI. He checked into it . Finally, someone reached out to confirm. On the morning of the interview I was contacted and told that they had to cancel. I scheduled a different date for 2 weeks later and again on the morning of the interview was told there was a snag. My interview got pushed back to June! I finally had what I thought was a good interview and they never even contacted me after I had sent a thank you note to the hiring manager and the woman who initially organized each interview. I waited 20 days! I then contacted the recruiter I had badgered before on LI and then finally, a few days later I got the impersonal rejection email. I'm sure I dodged a bullet. The ironic thing is this place claims to help with mental health, but caused me so much mental distress that I can't imagine they are seriously helping anyone.", "Interview Questions": "The usual: Tell me about yourself."}, {"date": "13 Jul 2022", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Crisis Text Line in Apr 2022", "Interview Descriptions": "Several steps to the interview, including the review of a design portfolio (or a design task in the case of not having a portfolio available). There was a uite a long wait in hearing back; this made it difficult to pursue other opportunities due to the uncertainty of whether the role would work out.", "Interview Questions": "Walk us through your instructional design process."}, {"date": "20 Jan 2022", "title": "Senior Product Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Crisis Text Line (Raleigh, NC) in Jan 2022", "Interview Descriptions": "The process started well enough, but ended terribly. During the interview process I received another offer but made it very clear that I was very interested in pursing a career at CTL. The interview schedule was moved up to accommodate my timeline, and I did everything to keep the other company that offered at bay while I completed CTL's process.\r\n\r\nThe day before my deadline to make a decision on the other offer, I was contacted by the company and told a decision would be made the next day and I would be informed of a decision. The morning of I was told I'd have a call before 11 which didn't happen. I had to follow up multiple times and even have a friend that works there remind the company that they had promised to follow up.\r\n\r\nWith 30 minutes to go before a deadline that I had communicated well before, someone contacted me and told me that the team wanted to continue to look at other candidates and that they didn't have a reason for wanting to look further. I was also told that there may have been concerns about the interview process, which was agreed to by senior leadership at CTL. I felt as though I shouldn't be penalized for following a process set forth by the hiring company with multiple approvals along the way.\r\n\r\nRejection is a normal part of any job search, and there are countless other Product people as equally or more qualified and better fits for any organization than I. However, there is a certain level of communication, clarity, and transparency expected from both sides. While I made every effort to be transparent and communicative, I was not afforded the same. Remember than no matter how noble a company's mission ( and certainly CTL has a life-changing mission), as a job seeker you are expendable and replaceable and nothing is guaranteed.", "Interview Questions": "How would you promote Justice, Equity, Diversity, and Inclusion on your team?"}], [{"date": "19 Dec 2021", "title": "Crisis Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Crisis Text Line", "Interview Descriptions": "Doesn’t take long for background check. Then the training is time consuming, however once you’re done, its all good. There is prominent help along the way. Even once you have the job, there is easy access for help.", "Interview Questions": "Have you ever committed a crime?"}, {"date": "20 Jun 2021", "title": "Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Crisis Text Line", "Interview Descriptions": "Two rounds of interviews that both went very well.\nI received a vague email stating that they would not be moving forward with my application.\nSurprising since both interviews had been left on a very positive note and the email did not seem to match that feeling.", "Interview Questions": "How do you practice self care?"}, {"date": "10 Dec 2021", "title": "Volunteer Experience Coach Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Crisis Text Line in Jun 2021", "Interview Descriptions": "I had to follow up with this organization several times about my job application and scheduling my first interview, which turned out to be an email black hole. Two people who interviewed me (separate interviews) weren't prepared for questions or the interview itself. I have 3+ years of volunteering with this organization and was turned down after the second interview, with no explanation. They are a non-profit all about making money for the organization, which is quite unfortunate.", "Interview Questions": "How do you work under stress?\n"}, {"date": "25 Jun 2021", "title": "Manager, Clinical Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Crisis Text Line in Apr 2021", "Interview Descriptions": "I was contacted less than a week after applying for the position. My first interview was scheduled for a week and a half out. The interview was wonderful - lasted for an hour and I felt the individual I interviewed with and myself connected over the work. I was told thinfs were \"promising\" and I was given a date I would hear back by (\"You'll hear back by then either way.\") It's been over a month since that date and I have not heard back. My attempts to follow up have been ignored. I imagine a better candidate was found, which certainly happens - It's very disappointing to have it handled in such a non professional manner though.\n\nIt does seem like a wonderful place to work with a great mission, but based on my interview I worry about their communication.", "Interview Questions": "What is your supervisory style?\n\nDescribe a scenario where you handled a professional disagreement well."}, {"date": "23 Feb 2021", "title": "Volunteer Crisis Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Crisis Text Line", "Interview Descriptions": "Fill out form and say why you want to do it, they get back to you as soon as they have looked it over, also a personality test that is pretty straightfoward.", "Interview Questions": "How are you with pressure"}, {"date": "20 Feb 2021", "title": "Learning Experience Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Crisis Text Line in Feb 2021", "Interview Descriptions": "I was contacted to set up an interview within two weeks of applying for this position, and the recruiters were helpful and kind. The first screening took place on Zoom, and the hiring manager was lovely, gave a great overview of the role and the team, and did a great job at making the interview feel more comfortable than the typical stale process. It is too early to know if I will move on in the process, but I feel my experience merits a positive review at this stage.", "Interview Questions": "*This* stood out on your resume. Please talk a little more about it."}, {"date": "28 Jan 2021", "title": "Volunteer Crisis Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Crisis Text Line", "Interview Descriptions": "The interview process focused on whether or not I was an individual who possessed the characteristics of compassion, empathy, and patience in order to give the clients the help they deserve", "Interview Questions": "Are you an empathetic person?"}, {"date": "17 Feb 2021", "title": "Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Crisis Text Line in Dec 2020", "Interview Descriptions": "I had my first interview for a Crisis Text Line Supervisor on Dec 24th, 2020. It went great! She moved me on to the final round with some homework to do. I had my final interview on Dec 30th. Overall, I thought it went well. The gentlemen who interviewed me told me I would hear something the following week (by Wednesday-no later than Friday). Fast forward to Friday, I had to send a follow up email to both individuals who interviewed me to see if I would know something by that day so I could give my current job the proper two weeks  before the training process began on Jan 25th, 2021 if I were to get the job... I get an email from the gentlemen stating that they were experiencing delays in their hiring process due to the holidays and their on boarding was full, and for me to schedule a call with the hiring manager. This was completely different information than I had originally received, not to mention both my interviews were in the middle of the holidays so they would have known if their process was backed up. I decided to talk with the hiring manager, she proceeded to tell me that it was backed up but they were still moving forward with my hiring process and would have more information for me in the coming weeks. I asked if I would be communicated to about delays, and timeline, she said of course.... Fast forward a month later, I had to email her to get an update. She then tells me they are moving forward with other candidates. I probably never would have received anything if I didn't reach out... I am a volunteer Crisis Counselor for CTL and before this hiring process I really thought this company was amazing. I have noticed so much wrong with the way they run after this. I would not recommend interviewing for this company due to their lack of communication, lack of empathy for the people interviewing, and how unorganized they are. I truly thought this was a dream job but I was wrong and I am honestly happy the process went this way so I did not take a job working for this company.", "Interview Questions": "Tell me about yourself? What is your coffee order, what are your pronouns?"}, {"date": "28 Jan 2021", "title": "Digital Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Crisis Text Line in Nov 2020", "Interview Descriptions": "Just like the reviewer below me on Dec 17, I had the same terrible experience. Did a sizeable project for their team for free, had a number of interviews with team members, and was eventually told they would be moving forward with other candidates right before the final round. Never had any single HR point-of-contact, and worst of all, when I asked for feedback about why they weren't moving forward with me, the HR person told me it was due to an interview that I NEVER HAD. We were supposed to have scheduled a foreign language assessment, but because of their extremely disorganized process, it never happened. The feedback was that I wasn't at the level they needed in the foreign language assessment interview - which again, never happened. I called out this fact to the HR rep - she responded once, confused - then ghosted me. Worst interview process I've ever been a part of, which is a shame.", "Interview Questions": "How would you handle writing about such sensitive topics to our community?"}, {"date": "10 Sept 2020", "title": "Crisis Counselor Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Crisis Text Line (New York, NY) in Sept 2020", "Interview Descriptions": "I actually never applied here. I was contacted by one of their supervisors via LinkedIn; she thought my background experience was impressive and asked if she could contact me the same day to speak more about the position. I agreed and she was able to answer all my questions thoroughly. The same day I was told I had moved on to the 2nd interview, out of the 3, including the phone screening. The 2nd interview consisted of the same person that contacted me the day before and another supervisor. It felt more like a conversation rather than an interview which was great; they were also ready to answer more questions. Later that evening I was given a G-Suite Competency Drill  and told I had moved on to the third interview. For the final and third interview I was interviewed by the head of supervision, I believe, she was very friendly as well and wrote down certain things while we interviewed, which she told me she would do when we started. I had told them in the second interview that I had to give 4 weeks of notice in my current job if I were to be selected for the position. They told me they would figure out how to be respectful of that since the next on-boarding date was for mid-september. By the third interview they had told me I would be about to start the first week of October, if selected for the position in order for me to be able to give the 4 weeks of notice. It was a pretty fast process as I was able to get my interviews back to back and they even squeezed in my third and final interview for the same week because they knew that if I interviewed the following week, I wouldn't be able to give the 4 weeks notice and start by the date in October that they had. I was given an offer on Tuesday of the following week! There was an error in salary in the offer letter which I contacted them about before accepting and they quickly corrected it and resent the offer. It was a positive experience overall and they stated you will receive training for two weeks when you start and you are eligible for the all company paid health insurance within 30 days of hire. Benefits seem great, but I have yet to start.", "Interview Questions": "How did you handle a time when there was a policy/rule in your job that you did not agree to?"}], [{"date": "17 Dec 2020", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Crisis Text Line (New York, NY) in Jul 2020", "Interview Descriptions": "Chaotic and unorganized process. Team not professional on zoom and phone (eating on the phone, weird backgrounds etc). Demanding process then ghosted by recruiter until I reached out for update weeks later then was finally told about the outcome. I’m not sure if I would have received an update at all if I hadn’t reached out. I think I dodged a bullet at this company", "Interview Questions": "Please tell us about yourself?"}, {"date": "29 Jul 2019", "title": "Product Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Crisis Text Line", "Interview Descriptions": "Very long and extended interview process that took close to 2 months from first contact to final decision -- went through 3 phone/video calls, 1 design exercise, and 2 on-site interviews.", "Interview Questions": "The take-home design task was to revamp a part of the Crisis Text Line platform. \r\n\r\n It is industry practice to not have hiring exercises be usable for the business, as that's asking for free labor from candidates."}, {"date": "11 Apr 2019", "title": "Crisis Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Crisis Text Line (Boise, ID) in Mar 2019", "Interview Descriptions": "Three letters of reference and a background check. There was a specific form for referrals to be completed online. You were updated when references arrived and background check was started and completed.", "Interview Questions": "How would I provide adequate self care after a shift"}, {"date": "7 Feb 2023", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Crisis Text Line (Miami, FL) in Feb 2019", "Interview Descriptions": "Answered about 5 written questions about the main reasons you want to participate and be a crisis counselor and then completed a training that took a few hours in order to get to volunteer.", "Interview Questions": "Why do you want to be a crisis counselor?"}, {"date": "20 Nov 2018", "title": "Product Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Crisis Text Line (New York, NY) in Nov 2018", "Interview Descriptions": "The process was delightful… until it wasn't. It's easy to describe what went wrong but difficult to understand; I had a very positive phone screen with the Head of Product, and was then brought in to meet several members of the team, and then nothing. All my interactions went well, and while I'm certainly somewhat biased I brought what seemed to be bountiful relevant experience to the table. I followed up afterwards and was cheerily told I'd hear back the following week… and I was genuinely optimistic! Sadly, after trying unsuccessfully to elicit feedback (or any reply for that matter) into a 2nd week, I had to withdraw from consideration. Fortunately I took another offer, but was taken aback by the lack of communication of any kind. Just plain rude and unprofessional, which is a shame and seemed out of character for the organization.", "Interview Questions": "Questions were fairly routine, par for the course for a product position interview really."}, {"date": "21 May 2018", "title": "CTL Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Crisis Text Line in May 2018", "Interview Descriptions": "The process started off great! There were 3 rounds and the Supervisor Manager was very professional throughout the first two steps. I moved quickly to round 2, and then was invited back to the 3rd interview. However, after scheduling coverage for my job and taking a half day (with short notice) I got a call at 11:30 (the exact time of my interview) to be told that I could not interview with the Chief Medical Officer because she had something else planned, I was then asked if I had a Masters (which it clearly was stated on my resume that I did not).  I told the Manager that I did not but because I was involved with the agency since day 1, and because I got an email from a previous manager of Operations that 3 - 5 years of Crisis can replace a Masters, I thought I would still be in consideration. The Supervisor told me she would get back to me by the end of the day. What shocked me most, is the lack of consideration and  unprofessionalism that took place when you have pretty much decided it was not a good fit.  I know of MANY supervisors and Coaches who lack the educational credentials and get hired. I also know many people who get hired because of who they know. I think Corporate needs to have better oversight of applicants.", "Interview Questions": "Have you ever Supervised Staff?"}, {"date": "18 Apr 2018", "title": "Crisis Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Crisis Text Line", "Interview Descriptions": "There was no interview, there was  just an application. Here I am trying to meet this word count. But that is really all there is to say. I had to get two recommendations as well.", "Interview Questions": "They asked me if I struggled with mental illness before"}, {"date": "27 Apr 2018", "title": "Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Crisis Text Line (New York, NY) in Apr 2018", "Interview Descriptions": "A very lengthy interview process - initial interview with head supervisor, multitasking assignment, interview with CMO, and finally interview with current staff members. Truly an awful experience from start to finish and took a month to complete with them ultimately not offering me a position citing a short-term career goal that I did not indicate and \"leadership concerns\" which sound very discriminatory at best. They claim to love hiring volunteers for this position, yet I have volunteered ~150 hours and 2 years of my time plus enduring a month long interview process for them to decide that I was a \"poor fit\". Not sure who exactly is the ~right~ fit seeing as I have strong clinical, research, and supervisory experience in  the past. HIGHLY disappointed with the whole experience as it came down to misinterpretation on their end and it appeared that they were actively searching for reasons to not hire me. I can only imagine what a nightmare the company culture is if they haze you during the interview process. Would not recommend applying for any position at this organization after this experience.", "Interview Questions": "What do you do for self-care, what do your personal relationships look like, do you have former supervisory experience... etc."}, {"date": "25 Jan 2018", "title": "Crisis Counselor Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Crisis Text Line in Nov 2017", "Interview Descriptions": "I spent 45 minutes completing a phone interview with a hiring manager. She was very kind and it was a very positive experience. I received an email later stating that they wanted to move forward with the process. She was going to put my resume towards another position too. Excited about the opportunity, I emailed her right back expressing my interest in moving forward. She had a list of questions that i had to write an essay for. I sent a few pages with detailed answers back to her and again she said they would like to move forward. I responded asking about the next processes and communicating that I was certainly still interested and grateful for the opportunity. Then I never received another email or any form of contact after that. It's so disrespectful to tell someone you are interested in moving forward and then just drop them. I have tried following up once, but she still never responded. It's fine that you choose another candidate, but at bare minimum an email should have been sent back in confirmation. Very rude and very unprofessional!", "Interview Questions": "Scenario Based Questions"}, {"date": "11 Apr 2017", "title": "Marketing Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Crisis Text Line", "Interview Descriptions": "Imagine the most racist questions you can ask someone. That's it. Thats the whole interview. This company is extremely racist. I would highly urge not interviewing because this company is extremely offensive and tone deaf.", "Interview Questions": "N/A"}], [{"date": "25 Sept 2021", "title": "Summer Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Crisis Text Line (New York, NY) in May 2017", "Interview Descriptions": "After applying the process was entirely seamless. I was connected with the right people immediately and the agility of a smaller organization became apparent by how quickly next steps were actioned.", "Interview Questions": "Please share one experience where you succeeded in a highly collaborative environment."}, {"date": "21 Mar 2017", "title": "Crisis Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Crisis Text Line (Minneapolis, MN) in Jul 2015", "Interview Descriptions": "The process was easy. You first fill in some questionnaire on the website and then submit a short video to briefly introduce yourself and tell them why you want to work there. And you also need to provide two references. I think that's pretty much it.", "Interview Questions": "Tell us about yourself"}, {"date": "31 Mar 2016", "title": "Supervisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Crisis Text Line (New York, NY) in Jun 2015", "Interview Descriptions": "Three rounds included a phone screen, a video call and practice conversation, and finally a group interview. Everyone I spoke with was smart, kind, and clearly loved their work. Fast paced but fun experience!", "Interview Questions": "Lots about my personality, work/life balance, and drive."}]]