[[{"date": "12 Mar 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Covenant Health (Tennessee)", "Interview Descriptions": "The interview process was relaxed and easy. The hospital wanted to hire people, as long as you didn’t show up like a jerk they treated you with respect. I was hired on the spot.", "Interview Questions": "Why do you want to work in mental health?"}, {"date": "30 Aug 2021", "title": "Emergency Room Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Covenant Health (Tennessee)", "Interview Descriptions": "The interview was calm and easy. I felt comfortable with the staff and they answered my questions and made Sure I was Fully informed. It was a very pleasant interview process and I would interviews with them again in the future.", "Interview Questions": "Asked about past work experience "}, {"date": "22 Jun 2021", "title": "Human Resources Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Covenant Health (Tennessee)", "Interview Descriptions": "Thorough and welcoming interview team. Opportunity to be more professional by speaking well of other divisions. Very thorough in explaining the function of the job and how it supports quality healthcare.", "Interview Questions": "How do you support HR in your current organization?"}, {"date": "24 Mar 2021", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Covenant Health (Tennessee)", "Interview Descriptions": "I interview with them, had 2 interviews and then I received an offer. Pretty standard interview process where a recruiter contacts you first, then you get to interview with a manager and then with a higher level manager.", "Interview Questions": "Describe your accumulated work experience"}, {"date": "21 Mar 2021", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Covenant Health (Tennessee)", "Interview Descriptions": "I applied for a different position than what I was interviewed for. I was told about the position, what they were looking for, and the work environment. Negative comments were made about previous employees. I never heard back even though I was told that covenant believed it was important to let people know where they stand in the hiring process.", "Interview Questions": "They asked me if I thought I could do the job. "}, {"date": "17 Mar 2021", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Covenant Health (Tennessee)", "Interview Descriptions": "Very straightforward and professional interview process. Onboarding was adequate for the job title and description. Culture is in tune with patient needs and team aspect. Overall satisfied with the process.", "Interview Questions": "Name a time when when you went above and beyond your job expectations."}, {"date": "12 Feb 2021", "title": "RN II Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Covenant Health (Tennessee) (Chattanooga, TN) in Jan 2021", "Interview Descriptions": "The interview was a panel of management and peers. The regular interview questions. The atmosphere was icy, but overall easy questions. Seems like a team oragnized staff. Caught a few red flags from management such as", "Interview Questions": "Where do you see yourself in five years."}, {"date": "10 Feb 2021", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Covenant Health (Tennessee) (Knoxville, TN) in Jan 2021", "Interview Descriptions": "The entire interview process was very organized from the first step to the final step. I did not meet one person that had a negative attitude or outlook. Everyone was very nice and very informative regarding culture, work-life balance, and expectations of the job.", "Interview Questions": "How do you handle stress?"}, {"date": "6 Dec 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Covenant Health (Tennessee) (Knoxville, TN) in Dec 2020", "Interview Descriptions": "The interview process was very short but the interviewers for the department were very friendly! I enjoyed the interview process it was not stressful and they focused on education. I would recommend preparing for the interview as all departments differ.", "Interview Questions": "Tell us about yourself. \r\nWhy this department."}, {"date": "15 Oct 2020", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Covenant Health (Tennessee)", "Interview Descriptions": "Team interview. Fantastic process. Everyone seemed to love their job there and were excited to share about it. They asked a lot of the standard interview questions, but were very interested in my answers and shared their own experiences as well.", "Interview Questions": "Was there a time you allowed a decision to move forward that you did not agree with and why?"}], [{"date": "1 Feb 2021", "title": "Clinical Social Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Covenant Health (Tennessee) (Knoxville, TN) in Aug 2020", "Interview Descriptions": "Relatively easy interview process. They asked great questions and provided me with time to ask about the position and any challenges. It was a group setting, so the manager and two other employees were there to ask me questions.", "Interview Questions": "Interviewers asked about my experience with case management and community resourcing. "}, {"date": "6 Nov 2019", "title": "ER Tech Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Covenant Health (Tennessee)", "Interview Descriptions": "I am an internal candidate, I work on a different floor in the hospital. I applied for the ER Tech position at Parkwest and exchanged emails with the hiring manager to set up a time for an interview. When I arrived on-time for the interview, the manager had already left for the day, apparently she forgot. I emailed her to find out if we could set up a new time and she never responded, she also ignored my phone calls.", "Interview Questions": "There were no questions, because the hiring manager of the ER at Parkwest stood me up for our scheduled interview."}, {"date": "11 Sept 2019", "title": "Department Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Covenant Health (Tennessee)", "Interview Descriptions": "Very streamlined, and not too long. Took about a week, plus two weeks for training and drug testing. The whole process took about 3 weeks in order to be interviewed, hired, and trained.", "Interview Questions": "Stereotypical questioning pertaining to work history, etc"}, {"date": "9 Mar 2019", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Covenant Health (Tennessee) (Morristown, TN) in Mar 2019", "Interview Descriptions": "Best interview I have had thus far. The manager was straight forward and approachable. I walked in for an interview on career day and left with an offer. I can’t wait to start working.", "Interview Questions": "How do you handle work conflict?"}, {"date": "30 Apr 2019", "title": "Staff RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Covenant Health (Tennessee) (Sevierville, TN) in Mar 2019", "Interview Descriptions": "Met with manager and 2 others where they all took turns asking questions.  They were pleasant and informative.  They gave me a tour. Explained the benefits, and I had lunch with some of my potential co-workers.", "Interview Questions": "How would I get along with someone who is not helpful?"}, {"date": "18 Feb 2019", "title": "Student Nurse Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Covenant Health (Tennessee) (Knoxville, TN) in Jan 2019", "Interview Descriptions": "I met my boss at the tree in the lobby, and we went back to their office to interview. They were very nice and welcoming, and when I left, they asked me if I would accept the offer if given to me. I heard back the very next business day!", "Interview Questions": "What can I contribute to the team?"}, {"date": "24 Jul 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Covenant Health (Tennessee) (Oak Ridge, TN)", "Interview Descriptions": "Relatively easy, applied online and heard back within the week with an interview lined up.  Was able to meet manager on the floor and get a tour of the unit and meet people the same day.", "Interview Questions": "What do you feel you could improve on"}, {"date": "12 Mar 2019", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Covenant Health (Tennessee) (Oak Ridge, TN) in May 2018", "Interview Descriptions": "Overall the experience was good. I interviewed with three nurse managers and they were all very friendly. I learned a little about each of their floors and was told that I could float to other floors if I wanted to.", "Interview Questions": "Why do you want to work at Methodist Medical Center?"}, {"date": "26 Dec 2017", "title": "Patient Care Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Covenant Health (Tennessee)", "Interview Descriptions": "Briefly chatted with me about my past experiences and talked me through a typical day on the job. Made sure I understood the job responsibilities and requirements. Interview involved job shadowing with a person in the position which was incredibly helpful in the process.", "Interview Questions": "Describe your past experiences that are relevant to the position"}, {"date": "14 Nov 2017", "title": "\"Lab Technician\" Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Covenant Health (Tennessee) (Knoxville, TN) in Nov 2017", "Interview Descriptions": "The job's advertisement on the companies' website was poorly described. I applied for a clinical laboratory technician position, but when I arrived to the interview, the two interviewers were interviewing me for a part-time phlebotomist position. I live in Florida and feel that minimal attention was paid to their own job posting, my application, and my curriculum vitae.", "Interview Questions": "\"Do you have any phlebotomy experience?\""}], [{"date": "13 Sept 2021", "title": "Recruiting Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Covenant Health (Tennessee) (Knoxville, TN) in May 2017", "Interview Descriptions": "Unfortunately, this interview wasted my time. Within the first five minutes, I was told that I was not right for the position - that the personnel member saw me doing something different - continued to talk about himself for over an HOUR. And tell me how smart and valuable I would be to a company. \n\nHowever, I believe this person has moved on to a different company now. I have heard this organization is wonderful to work for. I don't hold that experience against them.", "Interview Questions": "Why would you be a good fit for this position?"}, {"date": "14 Dec 2016", "title": "Health Information Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Covenant Health (Tennessee) (Knoxville, TN)", "Interview Descriptions": "I had a really bad experience interviewing with a staffing agency they work with, Staffing Solutions. They were very rude to me and didn't even look at my resume before asking me questions.", "Interview Questions": "I was asked why I left my past my last positions."}, {"date": "4 Jan 2019", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Covenant Health (Tennessee) (Morristown, TN) in Sept 2016", "Interview Descriptions": "Attended a job fair where I was able to interact and speak to several managers in different departments.   I was given a general overview of each unit, was able to ask questions and was made aware of specific positions and shifts which were available.", "Interview Questions": "Name a time when you had a difficult patient and how you handled that patient "}, {"date": "29 Aug 2017", "title": "Certified Surgical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Covenant Health (Tennessee) (Knoxville, TN) in Sept 2016", "Interview Descriptions": "I sat in a room with the Floor Manager. Two charge nurses for night shift. and two of the other night shift techs. They all just asked me questions. and they decided that they wanted me. I thought that was a good idea to let me meet some of the staff before making their decision.", "Interview Questions": "Since it was nightshift. Did I have reliable childcare."}, {"date": "28 Aug 2019", "title": "CT Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Covenant Health (Tennessee) (Morristown, TN) in May 2016", "Interview Descriptions": "Off site personal interview. Great interview. Great chief tech in radiology dept. Seems I was s great fit for this CT DEPT. a very reasonable work schedule with a great team. Team team always provided excellent care in an excellent hospital setting", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "29 Feb 2016", "title": "Certified Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Covenant Health (Tennessee)", "Interview Descriptions": "Ever covenant health office I have interviewed with have been amazing. They really have a great company with great benefits. They were very informative on any question I asked. I look forward to hearing from covenant for other positions I applied for and hopefully I will hear something about one of the positions.", "Interview Questions": "Why should we consider you for this job."}, {"date": "25 Jul 2020", "title": "RN UM Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Covenant Health (Tennessee) (Knoxville, AR) in Jan 2016", "Interview Descriptions": "Called for interview, went in , spoke with manager, couple peers, and team supervisor, was a laid back atmosphere, at the end I was interviewing them, got a  offer before I left that day", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "12 Oct 2015", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Covenant Health (Tennessee) (Knoxville, TN)", "Interview Descriptions": "I attended a job fair. I was contacted by HR and was given instructions for my background check, which I completed. I was contacted by a nurse manager at the hospital and set up an appt for an interview. After the interview it was approximately a week before I heard anything. I was contacted via email (later in the day by phone to confirm I received my email offer) with an offer and instructions to accepting the position. I followed all steps and started training within 4 weeks.", "Interview Questions": "Why do you want to work for a hospital as opposed to a physician's office?"}, {"date": "7 Dec 2015", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Covenant Health (Tennessee) (Knoxville, TN) in Oct 2015", "Interview Descriptions": "It was great, explained everything , answered all my questions and was very nice. I got a email asking whena good time for me to come interview was, I told them. Set up a day, came to my interview and talked to them , viewed the work place and then a couple weeks later I got the call for my job offer", "Interview Questions": "Flexibility"}, {"date": "11 Feb 2016", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Covenant Health (Tennessee) (Knoxville, TN) in Jul 2015", "Interview Descriptions": "Interview with two members of management and a staff member. Interview with total of three employees across a table from you. Each person asks various questions about skills, experience, and knowledge of the field itself. After the sit down interview a tour of the Radiology department is guided. At this time you are provided a short meet and greet with other technologist.", "Interview Questions": "Each ask questions about your career, history, patient care ability,  and a few personal questions. Examples: What are you most proud of in your career. Tell about a time you failed and what you did to resolve it."}], [{"date": "14 Oct 2016", "title": "CN III Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Covenant Health (Tennessee) (Knoxville, TN) in Mar 2015", "Interview Descriptions": "I went to their open house and met the other manager who gave me oncology floor manager's name and phone number. And my resume was sent to the manager. The manager later called me and set up an appointment for interview. I saw the manager at the floor and talked not more than 20 minutes and she offered me a job. It was very easy going because I was certified oncology nurse and had infusion certification as well which they were looking for. Then she introduced me to the co workers and showed me the entire floor.", "Interview Questions": "The manager asked me more details about what were written in my resume.\r\nAlso wage negotiation went on."}, {"date": "6 Jan 2015", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Covenant Health (Tennessee) in Jan 2015", "Interview Descriptions": "I was contacted within a day off applying for a Registered Nurse position and was asked to come in the following day for an interview. I was interviewed by 2 people together that worked on the floor. It was a great interview! They asked me questions like \"Tell me about yourself\" and \"What kind of experience are you looking for and what are your goals?\" Also \"What were your favorite and least favorite parts of nursing school?\" I enjoyed the more laid-back atmosphere of this interview compared to some of the interviews I have been on in the past. Very pleasant experience.", "Interview Questions": "\"Tell me about a time when you dealt with an unappreciative patient. How did you handle the situation?\""}, {"date": "30 Dec 2015", "title": "Houskeeper Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Covenant Health (Tennessee) (Knoxville, TN) in Jun 2014", "Interview Descriptions": "took about 3 weeks had to TAKE A PHYSICAL AND PASS A BACKGROUND CHECK AND DRUG TEST. I got the job and get a free fu shot every year as part  of my benefits", "Interview Questions": "normal ones"}, {"date": "28 Jul 2016", "title": "Patient Admission Support Specialist (Registration) Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Covenant Health (Tennessee) (Knoxville, TN) in Jun 2012", "Interview Descriptions": "The interview with the PAD was nice.  She was very nice within the interview, but when I was sent to be interviewed by my potential manager -- not so much.  She stayed on her computer the entire time and asked me about CNN.  She then had other ER clerks coming in and out asking me questions and being very unprofessional.", "Interview Questions": "Do you watch the news?"}, {"date": "31 Jul 2015", "title": "Clinical Laboratory Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Covenant Health (Tennessee) (Oakridge, TN) in Dec 2011", "Interview Descriptions": "Overall interview was short but thorough. Asking basic questions about my experience as a laboratory technician and my availability. Was not turned off by the fact that I had no clinical experience.", "Interview Questions": "Ask about my experience as a laboratory technician"}]]