[[{"date": "8 Apr 2023", "title": "Call Center Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNHCR", "Interview Descriptions": "It was an online interview with three panel members from the protection team. They were are very friendly and welcoming. They each asked me one questions and three sub questions related to the main one which were mostly about communication and how I can handle conflicts with people coming from different backgrounds.", "Interview Questions": "How I communicate with people with different backgrounds?"}, {"date": "25 May 2022", "title": "Interpreter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNHCR", "Interview Descriptions": "Good and friendly staff\nThe written exam stage was very easy\nThe interview was a little bit difficult\nInterview and the written exam was done via zoom\nEach candidates had to talk about different topic or situation", "Interview Questions": "They asked about my nationality"}, {"date": "10 Apr 2023", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNHCR (Ankara) in May 2022", "Interview Descriptions": "The interview was conducted online and the interviewers asked me some basic questions about asylum seeking, refugees, IDPs etc. I was also asked why I was interested in this position.", "Interview Questions": "What's the definition of a refugee?"}, {"date": "15 Nov 2021", "title": "Protection Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNHCR (Ankara)", "Interview Descriptions": "The interview process is a joke. They already assigned who to hire and just follow this process as a protocol. They hire people they know or referrals. \r\nThey usually require to take a test for their first phase, which answers are provided to the ones to be hired.", "Interview Questions": "Case study on refugee family and prioritize the need assessment "}, {"date": "9 Nov 2021", "title": "Protection Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at UNHCR", "Interview Descriptions": "You start with a written 2 hours interview and if you pass that, you move forward with an oral interview. After the oral interview, you receive an offer. The oral test was difficult and stressful", "Interview Questions": "The interview asked about general policies & procedures of the country regarding the refugees and 2 additional questions. The last question was a case question about a protection case, I don't remember the following. "}, {"date": "22 May 2021", "title": "Senior Protection Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNHCR (Gaziantep)", "Interview Descriptions": "First written test with technical questions and measuring you knowledge about the operation and the if you pass, invitation to interview online or face to face. The procedures can take very long sometimes more then 6 months (from publishing till receiving answer)", "Interview Questions": "Mostly competency based questions, but also technical like what are challenges that refugees are facing, the operations activities etc. Which skills do you bring for this position, how would you adapt your communication towards refugees "}, {"date": "11 Apr 2021", "title": "Project Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNHCR", "Interview Descriptions": "It was online and almost six people were there and half of them joined the interview with closed camera. It was very uncomfortable. They also did not send any rejection e-mail after the interview although it has been 4 months.", "Interview Questions": "How do you manage your time?"}, {"date": "19 Nov 2022", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNHCR in Mar 2021", "Interview Descriptions": "They mailed me a couple days ago. I interview with two persons. They were kind. I answered the questions in general but it is hard to understand how and why they choose one person.", "Interview Questions": "Questions related to what is migration, what does unhcr do, its roles, why do you want to work with us, a problem that you faced and how you solve it"}, {"date": "5 May 2022", "title": "Protection Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNHCR (Ankara) in Jan 2021", "Interview Descriptions": "I attented a written test which is created 4 question and I could pass it. The questions were about case studies, national law and referral mechanism. The expectation was about your field experience.", "Interview Questions": "Whey we are hireyou ?"}, {"date": "13 Jun 2023", "title": "Inspector/Inter-agency Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNHCR (Gaziantep) in Jan 2021", "Interview Descriptions": "It was a one-hour interview starting with general questions. The last questions were practical ones and they told me to ''role play'' and offer a project to the municipality. The project was based on the report they had already sent me before the interview to study. They asked questions based on previous experience examples.", "Interview Questions": "Can you act as the coordination assistant and offer a project to gaziantep municipality in Turkish?"}], [{"date": "24 Sept 2021", "title": "Senior Protection Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNHCR in Apr 2019", "Interview Descriptions": "It took one month for the interview process. I have been interviewed at UNHCR office. Comptetency-based interview has been conducted. After applying for the job, the HR Unit reached out to me in 3 weeks and invited me to a face to face interview. The interviewers were positive an  helpful.", "Interview Questions": "Competency-based interview:\r\nQuestions about conflict management, planning skills, teamwork"}, {"date": "27 Aug 2019", "title": "Interpreter Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNHCR (Ankara) in Mar 2019", "Interview Descriptions": "Shortlisted, invited to sit for a written test, passed the test and invited for an interview. Offered and accepted the position. The whole recruitment process is a positive personal experience.", "Interview Questions": "Questions were mainly job-related questions testing the qualifications and expression skills of the candidate."}, {"date": "22 Sept 2020", "title": "Stagiaire Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNHCR (Istanbul) in Jun 2018", "Interview Descriptions": "- Envoi du CV et la lettre de motivation \r\n- Entretien individuel \r\n\r\nLes questions d'entretien étaient faciles et le recruteur était vraiment gentil. L'entretien était d'abord en turc et puis en anglais.", "Interview Questions": "Pourquoi vous voulez faire ce stage ? "}, {"date": "12 Jan 2021", "title": "Senior Project Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNHCR (Ankara) in Dec 2017", "Interview Descriptions": "I have been interviewed for the position in 2017 in Ankara Office. The interview were solely based on competency-based interview were they have asked relevant questions although I should say due to their cooperation with Migration Directorate, there was a liaison from them who was literally trying my patience concerning my political or world views. That impacted the outcome as I have gotten the impression from the faces of the UN officers. \r\n\r\nI would say, the UN part was particularly great but the other part is unnecessarily unprofessional and politically oriented. \r\n\r\nThe interview was in English and Turkish and I have realized that the liaison didn't get what I have been talking in English at all as it shows the other side of the unprofessionalism from their side.", "Interview Questions": "Could you explain us about your experience concerning Temporary Protection measures?  "}, {"date": "14 Dec 2017", "title": "Senior Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNHCR in Nov 2017", "Interview Descriptions": "The UN Staff was too welcoming and I needed to shift from English and Turkish all the time as the position requires to have communication skills in both languages. Though, there was a DGMM person who disliked me and I have got that feeling as I have answered questions in Turkish contra-government and it changed the situation. \r\n\r\nThey ask literally competency based questions and i had my answers previously that I had a pretty much same interview with UNDP that's why it was more easy.", "Interview Questions": "how you can handle the conflicts in different organizational contexts"}, {"date": "8 May 2017", "title": "Field Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNHCR", "Interview Descriptions": "I interviewed for CBI programmes. The written exam questions involved programming, protection and technical aspects of CBI. The interview was more relaxed and looked more into how I express myself.", "Interview Questions": "Why do you think you are a good fit?"}]]