[[{"date": "1 Jun 2023", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vital Strategies (New York, NY)", "Interview Descriptions": "Got back to me within 3 weeks from submitting my application. Interview was about 1 session. The questions were relatively easy and to people interviewed me. Didn't make it to the next round.", "Interview Questions": "Standard questions related to the job posting."}, {"date": "8 Aug 2022", "title": "Communication Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Vital Strategies", "Interview Descriptions": "Interview process was smooth and quick. I first had a 30-minute phone conversation with HR and then an hour long video interview. They got back to me within a month for the initial interview, and the video call was scheduled a week later.", "Interview Questions": "Describe yourself in 3 words. \nWhy do you want this position?\nI only had partial experience, so they asked to explain what makes me stand out compared to other candidates. "}, {"date": "20 Jan 2022", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vital Strategies", "Interview Descriptions": "Standard interview questions: why are you interested? tell us about a time when...? where do you see yourself in 5 years? Study up on the standard interview questions and bring some personality", "Interview Questions": "Tell us about a time when you made a mistake at work"}, {"date": "22 Feb 2022", "title": "Analista De Comunicação Senior Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vital Strategies in Jun 2021", "Interview Descriptions": "Entrevista on line com a participação de três gestores. Todos muito educados. Pensei que seria informado sobre o status do processo seletivo, conforme eles mesmos mencionaram, mas isso não aconteceu. Fiquei com uma estranha sensação de que, ao serem descartados, os candidatos à vaga servem apenas como meros coadjuvantes.", "Interview Questions": "Nada além do padrão em entrevistas."}, {"date": "14 Jan 2021", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vital Strategies", "Interview Descriptions": "Very friendly and the process consisted of two interviews - one screening interview and then a group interview with program staff and HR. Asked typical questions of an interview about skills and motivation", "Interview Questions": "Tell us about a situation where something went wrong at work and how did you handle it"}, {"date": "27 Dec 2020", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vital Strategies", "Interview Descriptions": "Was contacted by talent team and then I scheduled a time for interview. The interview happened over zoom. It was very conversational and relaxed. Just asked questions about my interests, my career goals, etc.", "Interview Questions": "What time zone would you be working in."}, {"date": "9 Mar 2021", "title": "Community Engagement Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Vital Strategies (New York, NY) in Dec 2020", "Interview Descriptions": "I applied in early December 2020 for a grant position funded through November 2021.  I was told that the position would be filled by the second full week of January. \n\nI did a one on one interview in late December,and told I would be contacted for a second interview after Christmas. I was finally contacted to complete a panel interview in the middle of  January. Again I was told I should hear back in a week. \n\nIn the middle of February, they I was contacted for a third interview. Due to connectivity issues we had a voice only conversation.  I asked to due another interview the following week so they could see \"what I looked like.\"\n\nI was told the final decision would be made in a week.  A month later I was told that they decided to not fill the position I had been interviewing for. \n\nI completed five interviews, taking an hour off work for each.  The questions began to feel like they wanted someone to give them a plan, but not pay them.  I got nothing from this, but lost work time. I suspect they got the the information to complete an engagement plan without having to hire an employee.", "Interview Questions": "How would you outreach immigrant communities to encourage the to get vaccinated against COVID?"}, {"date": "13 Jan 2021", "title": "Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vital Strategies (New York, NY) in Dec 2020", "Interview Descriptions": "I had two rounds of interviews- the interviewers were great and very warm. However, the issue began when HR later reached out to me and asked for my reference contact saying that my chances are most positive. I enthusiastically provided them with the contact and they also scheduled a call with both my references who were kind enough to reserve their time for giving my recommendation. Last-minute, the HR cancelled the calls with them saying the position is suddenly kept on hold. I was never contacted, I came to know through my referrals, and it was very humiliating! I tried to contact the HR thrice and even contacted the interviewers but no one responded. I was basically ghosted without any explanation.", "Interview Questions": "Why this position and tell us about your past experience"}, {"date": "9 Jul 2021", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vital Strategies (São Paulo, São Paulo) in Oct 2020", "Interview Descriptions": "A entrevista foi agendada por e-mail e realizada por videochamada. Todo mundo em home office, por razão da pandemia. \r\nEram dois entrevistadores: um homem e uma mulher. Ambos estavam em Nova York e falavam inglês. O homem tinha origem russa. \r\nO homem falou mais. Apresentou verbalmente o trabalho da organização e a função do(a) profissional que pretendiam contratar. E me  fez perguntas sobre meu histórico profissional e envolvimento com os temas com os quais a Vital Strategies trabalha. \r\nRespondi fluidamente, em inglês, confiante de que minha experiência estava bastante alinhada com o que eles buscavam. Meu inglês é ótimo, e isso ajuda.\r\nA mulher, que era provavelmente a pessoa responsável pelo RH, perguntou sobre minha pretensão salarial. Perguntei se queria um valor em reais ou dólares, e ela disse que tanto fazia. \r\nDisseram que entrariam em contato dali a algum tempo. Mais tarde, recebi email comunicando que o processo seletivo havia sido suspenso. A vaga havia sido fechada.", "Interview Questions": "Conhece o trabalho das organizações parceiras?"}, {"date": "22 Nov 2020", "title": "IT Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Vital Strategies in Aug 2020", "Interview Descriptions": "The interview happened on Zoom call. But I had a very bad experience with Vital strategies. \r\n1. At first when I received the first call from the recruiter I told her about my expectation (salary Expectation too) which they agree.\r\n2. My hiring process took 2 months of time, and when the final discussion day comes to their so-called HR officer played a different game altogether.  She offered me a salary which is way less than the current salary even they agreed in the initial stage. No one informed me that it would be the Contractual position and She informed me in the final discussion after 2 months of the long interview process and She conveyed all the wrong information to management coz she was not agreeing to the salary we had agreed with the Recruiter, Hiring Manager.\r\n3. I didn't expect such unprofessional and full of political behaviour from them at this early stage. \r\n\r\nBut in the end, I would like to thank HR Officer who helped me by explaining why you should not join Vital strategies as my next Organisation else I would have put my career into a doomed situation.", "Interview Questions": "Why you want to join our organization."}], [{"date": "14 Oct 2021", "title": "Communications Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Vital Strategies (New York, NY) in Jul 2020", "Interview Descriptions": "I had two rounds of interviews, one with the comms team and one with the technical team leads. Everyone was friendly, recruiter was very proactive and on time with next steps and reaching out.", "Interview Questions": "How do you build relationships with key stakeholders ? "}, {"date": "5 Nov 2019", "title": "Summer Legal Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vital Strategies (New York, NY)", "Interview Descriptions": "First there was 10 minute phone interview just getting to know you, then an in person interview at their NYC office. The interview had a 30 minute activity portion where they had you familiarize yourself with basic policy and answer a hypothetical email and prioritize a list of tasks. Then the 20 minute regular interview after was pretty standard. They are prompt with their responses after that.", "Interview Questions": "What would be one thing a past employer would say you should work on?"}, {"date": "5 May 2019", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vital Strategies", "Interview Descriptions": "I had applied by sending my CV and cover letter to the e-mail address.  I had heard back after a few weeks and had a good interview. However, I had not heard whether I made it to the next round or not for months..", "Interview Questions": "How is it like working on a team with you?"}, {"date": "25 May 2019", "title": "Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vital Strategies (New York, NY) in Jan 2019", "Interview Descriptions": "Very laidback, hiring managers were not very serious.  Asked if I want anything, then interview with the manager, followed by the HR. Kept asking repetitive questions that I have previously answered.", "Interview Questions": "Why you want to join us?"}, {"date": "30 Nov 2018", "title": "Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Vital Strategies", "Interview Descriptions": "One with HR person, two separate in-person interviews. All went well, was told they wanted to fill the position quickly and my samples of past work were \"perfect.\" Took time off work to attend interviews, prepare, etc. Sent thank you notes to all I spoke with, got encouraging notes back. Then nothing for 4 weeks despite emailing both people I interviewed with, HR person (each twice). Finally left a phone message from HR person and two days later got email from her and hiring manager saying they had gone with someone else.  Seemed like I was a top candidate, just pretty rude to completely drop the ball on notification.", "Interview Questions": "What work in the past have you done that relates to this job"}, {"date": "8 Oct 2018", "title": "Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Vital Strategies (New York, NY)", "Interview Descriptions": "2 months, 5 interviews - writing test that took me hours. \r\n\r\nUnresponsive when I continued to ask what the timeline was for hiring. Several interviews and each time said I would be a great fit - huge waste of time.", "Interview Questions": "If I follow politics? Where I've traveled?"}, {"date": "25 Jun 2018", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Vital Strategies in Mar 2018", "Interview Descriptions": "I interviewed for the EA role for the CFO. This was the weirdest and unpleasant interview I had. The CFO and the other employee that held the interview did not have a sense of humor, or any face expression.\r\n\r\nThis was an intimidating interview. The CFO and the other employee kept asking me the SAME question, and expecting a different answer.\r\n\r\nThe interview was very dry and unpleasant. I think they are looking for someone that graduated from Harvard with a 6.0 GPA and completely perfect. Good luck to whoever fills that position. I think I dodged a bullet with this one.\r\n\r\nAlso, this was a 2 on 1 interview.", "Interview Questions": "What formulas did you use in excel?\r\nHow would you handle a situation in which multiple people want you to complete a high priority deadline?\r\nHow do you stay organized?\r\n"}, {"date": "17 May 2018", "title": "Senior Research Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Vital Strategies (Gurgaon, Haryana) in Mar 2018", "Interview Descriptions": "Very engaging and interesting. Given adequate opportunity to express and explain. Not biased  as their few other relevant people talking and understanding the skill sets. I have rarely experienced such openess and making the candidate comfortable with the process.", "Interview Questions": "About research methods, studies handled, data handling and analysis skills."}]]