[[{"date": "29 Jan 2023", "title": "Patient Service Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwest Community Hospital/Healthcare (Sterling Heights, MI)", "Interview Descriptions": "Interview was great and easy, asked a lot of questions typically asked during and interview. Left after two years because of management and being unfulfilled in the work. However the interview was fast and easy and was hired shortly after", "Interview Questions": "Work ethic Responsibilities Past jobs"}, {"date": "15 Nov 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwest Community Hospital/Healthcare", "Interview Descriptions": "Asks what you know about the hospital and their merger with NorthShore, why you want to work there and how you’d contribute to the team. Asks about scheduling and any pervious commitments that require days off.", "Interview Questions": "Tell me about a time you went above and beyond for a patient"}, {"date": "15 Mar 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Northwest Community Hospital/Healthcare in Nov 2022", "Interview Descriptions": "The interview process was clearly stated. The persons interviewing me were respectful and receptive to what I had to say. I was asked a few questions that were very detailed and thoughtful that showed the integrity of the managers.", "Interview Questions": "What safety or quality measure do you think matters most in patient care?"}, {"date": "18 Mar 2023", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwest Community Hospital/Healthcare in Apr 2022", "Interview Descriptions": "Very smooth interview process. Responsive HR department and department manager. Everyone was very professional and kind. Fast response time throughout the interview process. Interview was over zoom due to covid but still was personal and professional.", "Interview Questions": "What made me want to apply to NCH"}, {"date": "9 Sept 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwest Community Hospital/Healthcare", "Interview Descriptions": "Send application online \r\nHuman Resources phone screen \r\nPreferred availability Salary you are looking for \r\nIn person interview with hiring manager and team educator \r\nTour of floor/unit \r\nOffer and phone call to describe details", "Interview Questions": "Describe a time a patient was unsatisfied with you care \r\nWhat’s the hardest transition you’ll have to make here \r\nSituational and what what you do \r\nWhat’s one thing you’ll miss about your current job \r\nWhat is your mannerism when overwhelmed "}, {"date": "30 Dec 2021", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Northwest Community Hospital/Healthcare (Arlington Heights, IL) in Aug 2021", "Interview Descriptions": "Friendly, welcoming manager. I got a tour of the unit and introduced to other staff members. We then sat down for some standard interview questions and allowed me to lead the end of the interview with my questions regarding the unit.", "Interview Questions": "How to handle a difficult patient "}, {"date": "22 Mar 2021", "title": "Practice Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Northwest Community Hospital/Healthcare", "Interview Descriptions": "Phone screen with recruiter and then video interview with hiring team. Interview was late in the day after business hours. Team did not seem engaged in the interview, like it was a bother to them.", "Interview Questions": "They asked about experience and standard interview questions."}, {"date": "13 Feb 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Northwest Community Hospital/Healthcare", "Interview Descriptions": "Many questions about, \"what would you do\" if this happened, and past experience with customer service skills. Nice manager. It took a few weeks to hear back but was eventually offered the job.", "Interview Questions": "How would you handle and upset patient or family member?"}, {"date": "2 Feb 2021", "title": "Supervisor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northwest Community Hospital/Healthcare", "Interview Descriptions": "phone, web, and in person. I was first screened via phone call. Then 2 different web meetings took place with various team members. I then interviewed with the surgeons and office staff.", "Interview Questions": "They never met my salary expectation"}, {"date": "8 Dec 2020", "title": "PRN- Rehabilitation Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwest Community Hospital/Healthcare in Nov 2020", "Interview Descriptions": "The interview took place during the COVID-19 pandemic. I was given a quick tour of the facility and then interviewed by three people: the hiring manager, an OT, and the current technician. Question were conversational and I loved the atmosphere and environment of the office. After the initial interview, an opportunity to come back and shadow the clinicians was offered.", "Interview Questions": "Why do you want to go into PT?"}], [{"date": "20 May 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northwest Community Hospital/Healthcare (Arlington Heights, Cook, IL) in Sept 2020", "Interview Descriptions": "initial interview from the HR (general questions, tell me about yourself, strength and weaknesses) then interview from hiring manager and educator (scenarios and situational also history of employment, what are your roles) took only probably a week", "Interview Questions": "what is your edge compared to other candidate"}, {"date": "5 Jun 2020", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Northwest Community Hospital/Healthcare", "Interview Descriptions": "It took over a month for HR to contact me after applying, but once they contacted me to set up an interview the process was very fast. The interview is a lot of questions, mostly general interview questions along with some technical questions. I was offered the position by HR later that same day.", "Interview Questions": "Prioritize these tasks."}, {"date": "8 Feb 2020", "title": "Anonymous Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwest Community Hospital/Healthcare", "Interview Descriptions": "Very unwelcoming and unfriendly experience from start to finish.  I've never felt so uncomfortable in an interview setting. They all seemed unhappy to be there and barely introduced themselves or said goodbye after the interview. Very disappointing experience as I've always held NCH in very high regard.", "Interview Questions": "How do you handle prioritizing?"}, {"date": "9 Jan 2020", "title": "Cerified Phlebotomist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Northwest Community Hospital/Healthcare", "Interview Descriptions": "I heard back from them in a week for a video interview. I thought it was waaay easier than United. I didn't get to fill in the time limit but i wss able to complete each answer in between a minute which was allowed. I think I did great now playing the waiting gam", "Interview Questions": "I heard back from them in a week for a video interview. I thought it was waaay easier than United. I didn't get to fill in the time limit but i wss able to complete each answer in between a minute which was allowed. I think I did great now playing the waiting gam"}, {"date": "9 Oct 2019", "title": "Specimen Processor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwest Community Hospital/Healthcare", "Interview Descriptions": "The admin assistant contacted me to set up the interview. I met with her first, then the laboratory manager interviewed me. He said he would let me know the outcome in about a week. Never did. It's understandable that you won't get every position you interview for, but they didn't even bother to send me a rejection email.", "Interview Questions": "Tell me about a time when you had to make a decision that usually would have been made by authority. What happened?"}, {"date": "21 Aug 2019", "title": "Engineer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northwest Community Hospital/Healthcare (Arlington Heights, IL) in May 2019", "Interview Descriptions": "It took a long time after first contact to have a interview with the department manager and his band of assistants?  It was in a lunchroom for a Q and A session followed by questions of a box of what old junk parts were. Unprofessional at the least.", "Interview Questions": "Box of parts I remember the  most."}, {"date": "5 Nov 2018", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Northwest Community Hospital/Healthcare (Chicago, IL) in Nov 2018", "Interview Descriptions": "It was average. It didn't take that long. Most interview questions were from Glassdoor. It was really helpful. I did end up getting the position as PCT and it was worth it.", "Interview Questions": "How would your friends describe you?"}, {"date": "6 Dec 2017", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Northwest Community Hospital/Healthcare (Buffalo Grove, IL) in Dec 2017", "Interview Descriptions": "I applied to the company online though their website. In 3 weeks I received a phone call from the HR department to schedule an interview in person. \nI had my first interview that same week with the HR representative and then another meeting with the unit floor manager I would be working for right after. We toured the unit and talked about my experiences in health care. I guess they have a process where the HR rep screens you out first and then approves you to go on to meet with the unit manager second. \nLiterally, the very next day, I got a call back from the HR department with a job offer and orientation date. \nEveryone was very friendly and very informative. All of my questions were answered. The process was very smooth for me.", "Interview Questions": "When do you plan on starting nursing school?"}, {"date": "18 Dec 2017", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northwest Community Hospital/Healthcare (Arlington Heights, IL) in Dec 2017", "Interview Descriptions": "I applied online in late October and was contacted in early December via phone call. They asked me a few questions about why I was interested in working for NCH (phone interview). I was scheduled to come in a for an in-person interview the following week on a Thursday. I was given a tour of the unit. I was then interviewed by the Nurse Educator, a staff nurse from the unit, and the charge nurse that day.  The interview lasted about 30 minutes. They told me they would be making a quick decision and would be contacted sometime the following week about whether or not I got the job. I was contacted the following Tuesday (4 days later) about the job offer!", "Interview Questions": "Why do you want to work for NCH?"}, {"date": "14 Nov 2017", "title": "Patient Access Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Northwest Community Hospital/Healthcare", "Interview Descriptions": "I had been applying to work for this hospital for almost two years. They're always posting between 5-10 jobs a day, but I think they're mostly phantom posts because there is no way the company can actually budget for as many positions as they have listed. Nevertheless, when I finally got an opportunity to be considered by someone from their HR, I was told that--while I'm qualified--my salary expectations were too high and said expectations were the reason why I wasn't getting an actual interview. Interestingly enough, though, when I eliminated said expectations and applied for a similar job, I never heard from HR again. I've heard from many individuals that there are very few employees of color at this company and that such exclusion is not by mistake. Unfortunately, I now think that it is true. I will be applying to work with equal opportunity employers from here on out.", "Interview Questions": "N/A"}], [{"date": "2 Aug 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Northwest Community Hospital/Healthcare (Arlington Heights, IL) in Jan 2017", "Interview Descriptions": "HR called to set up an interview. I met with the HR lady firs and then went on to meet with the floor manager. everyone at the location is super friendly and welcoming!", "Interview Questions": "What is the most difficult part about being a nurse?"}, {"date": "22 Dec 2020", "title": "Dietary Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Northwest Community Hospital/Healthcare in Oct 2016", "Interview Descriptions": "It was very straight to the point, but the interviewer had a good energy that was easy to work with. They gave me an offer the same day after the interview.", "Interview Questions": "I was asked about my strengths and weaknesses "}, {"date": "25 Aug 2016", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Northwest Community Hospital/Healthcare (New York, NY) in Aug 2016", "Interview Descriptions": "HR screen was beyond rude. Asking my current salary  (I said no), without giving a salary range. She replied that would be a hard question to answer since she did not know my background or skill level. Funny you have my resume and just spoke to me about my past experiences. I have a MBA, RHIA two coding credentials. She cut me off during questions, treated me like a second class citizen bc I'm asking about a salary range?? I've been flown to many interviews, interviewed many time locally with small and large companies and have never had such a negative experience. I'm not sure if they are broke or what the problem is, but you won't attract top talent if you don't know what your willing to pay.  I've never seen anything like that before. This just saves time for all involved that's why it's a range. She wanted me to \"go first\" which is hard since I know nothing about the job or its requirements, not to mention the benefits. I would beware if you get an opportunity here. Barbara was her name.", "Interview Questions": "Do you have exp with inpatient coding?"}, {"date": "23 Feb 2016", "title": "Room Service Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwest Community Hospital/Healthcare (Arlington Heights, IL) in Feb 2016", "Interview Descriptions": "The interview part was great, it was just after it was awful. They never called me back, so I followed up a week later, and HR said that they loved me, and I got the job, but would call me back with the salary information. 4 days later and still haven't received any call back, I called again and got HR's voicemail, so I left a message mentioning again that I was giving a follow up, and kindly asked to call me back while listing my cell phone number. It has now been 6 days so I called again to get hung up on, and then I called right after to get HR's voicemail yet AGAIN. I guess they don't need me since this guy can't even call me back. I've never been involved with such an unprofessional hiring process, and at a hospital of all places. I guess I am not working here", "Interview Questions": "Tell me about you're previous experience"}, {"date": "23 Nov 2015", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Northwest Community Hospital/Healthcare (Arlington Heights, IL) in Oct 2015", "Interview Descriptions": "The hiring process was straight forward. After you apply you get a call from HR and they ask you basic questions about the you and the position you are applying for. Than they will call you to come in and speak with someone in HR. This is also basic interview questions about yourself and the job. After that, you interview with someone from the Department. It was a smooth transition and everyone is friendly.", "Interview Questions": "Asked about why you want to work here and also asked to state relevant experience pertaining to the job."}, {"date": "27 May 2015", "title": "Temporary Position - Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Northwest Community Hospital/Healthcare (Arlington Heights, IL)", "Interview Descriptions": "Very brief phone screening and then an interview that followed a week or so later. Was asked questions about previous experiences and to explain a relevant example of doing specific, applicable work. Offer was extended immediately following the interview.", "Interview Questions": "Why do you feel you are a good candidate for this roll? "}, {"date": "23 Mar 2015", "title": "Benefit Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northwest Community Hospital/Healthcare (Arlington Heights, IL) in Feb 2015", "Interview Descriptions": "the interview process was good, I was called directly by the hiring manager and had a great talk. A face to face was set up for the week following. There, I had a meeting with 2 members of the team", "Interview Questions": "how many FMLA's did I handle at my previous position, how many Workers comp. Specific but no questions about training, motivation or work ethic. They down-played my previous position."}, {"date": "11 Jan 2019", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Northwest Community Hospital/Healthcare (Seattle, WA) in Jan 2015", "Interview Descriptions": "The interview began on time and felt professional from beginning to end. The questions asked by the manager were typical and not difficult to answer. First, there were introductions, small talk, a gathering of information, asking questions about my experience and background, etc.", "Interview Questions": "Why do you want to work here"}, {"date": "15 Nov 2016", "title": "CMA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Northwest Community Hospital/Healthcare (Schaumburg, IL) in Sept 2014", "Interview Descriptions": "Application Submitted, Call back within a few days to set up a phone interview, Phone interview a few days after that, and then you set up your initial interview. Easy interview basically discussing your skills, assessing your personality and abilities, you get asked questions relevant to the job, and problems solving questions, get a tour of the facility, introduced to all of the employees and doctors that same day, and then wait to hear if you have a job offer. Once you are offered a job via email or phone call, THEN you have to set up a time for an \"internship\". Basically you have to completely re-train in their office on their policies, equipment, all clia waived testing, injections, EMR, PPD, and basically everything you learned in MA school but a quick interview to see your competence. We also had to read through this huge MGU (Medical Group University) checklist/textbook and finish all exercises until considered either competent or not. you get pair $12hr for this training, and its long days sitting in an office (not fun). After that if you passed (you better after graduating your MA school) they offer you a job. At that point I was offered a whopping 14.95 an hr. I was under the impression from a former employee that I would be getting atleast 17/hr. not the case and they wouldn't budge. I stuck it out because I really liked the office environment, the other staff members and all of the patients. Plus I was getting experience under my belt, but it was quite a long drive for me (hour-hour and a half) depending on weather, so I had very little time at home to be with my children. Got pretty burned out after only a few months and eventually had to leave because of a sick family member that needed me to care for them in home.", "Interview Questions": "How do you handle a situation where you notice unethical treatment of a patient, and its a superior of yours that was responsible?\r\nDo you work well with others especially females because the office is filled with them.\r\nMany other easy to answer ethics questions and procedural questions. What to do's what not to do's certain laws, HIPAA examples and whether its been violated or not etf."}, {"date": "1 Feb 2014", "title": "Practice Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northwest Community Hospital/Healthcare in Jan 2014", "Interview Descriptions": "Initial communication was a phone call and then an email.", "Interview Questions": "Where would you see yourself in five years, If you could be anything?"}], [{"date": "17 Jun 2013", "title": "Director Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Northwest Community Hospital/Healthcare", "Interview Descriptions": "The process is very informal and cold until you get to the department level. Then you get a feel for the great culture among the departmental staff members. You learn quickly that the interviewer cares much more about your personality and its fit into the Northwest Community Hospital culture than your experiences.", "Interview Questions": "N/A"}, {"date": "12 Dec 2016", "title": "Acute Care Staff Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Northwest Community Hospital/Healthcare (Arlington Heights, IL) in Apr 2012", "Interview Descriptions": "First I had a phone interview, then I was\r\nInvited to come in- interviewed\r\nWith HR first then I interviewed with the director\r\nThe same Day. I was offered the job after meeting with the director. The interview questions were somewhat difficult. What makes you perfect for this role? Why\r\nDo you want to be apart of Northwest Community Hospital?", "Interview Questions": "What makes you perfect for this role?"}, {"date": "11 Jun 2013", "title": "Pct Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Northwest Community Hospital/Healthcare (Arlington Heights, IL) in Jan 2012", "Interview Descriptions": "Applied on line. Received a call within a couple weeks. Interview was set up with unit manager. Question were based on experience. Last for about 45 minutes", "Interview Questions": "They really prefer people that can work weekends and nights."}, {"date": "16 Nov 2011", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Northwest Community Hospital/Healthcare (Arlington Heights, Cook, IL) in Oct 2011", "Interview Descriptions": "The company and the employees are very organized and the culture of inclusiveness is apparent, even during the interview process.  I had a phone interview, then a 1:1 interview, then a group interview, then another phone interview, then a meeting with HR, then was made an offer.  Everyone was helpful and welcoming and the process was easy and timely.", "Interview Questions": "Describe a difficult situation you encountered at work in the past and how you addressed it. This may not have been the most difficult question, but it is one I remember, anyhow."}, {"date": "29 Oct 2012", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Northwest Community Hospital/Healthcare (Arlington Heights, Cook, IL) in Jun 2010", "Interview Descriptions": "There were two interviews. One with Human Resources, and the next with the department I would be working in. The HR person was a bit cold, but it seems he/she acts that way toward everyone. In any case, I was approved for the next interview. It all happened from application to being hired very quickly, within a week.\r\n\r\nOrientation was thorough and I got to know people in charge of education and administration through that.", "Interview Questions": "What is one situation where you and another coworker had a difference in opinion, views, or a disagreement, and how did you handle this?"}, {"date": "26 Feb 2011", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Northwest Community Hospital/Healthcare (Baltimore, MD) in Apr 2010", "Interview Descriptions": "The hospital worked with me around my working schedule, very accomadating", "Interview Questions": "Was not difficult do not remember exact questions. Was a very intense interview with many levels of disciplines"}, {"date": "17 Jan 2013", "title": "Acute Care Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Northwest Community Hospital/Healthcare (Arlington Heights, Cook, IL) in Dec 2009", "Interview Descriptions": "I applied online and was interviewed by the director and the manager of the unit. The interview lasted about 30 minutes and I received a tour of the units as well. I was offered the position and started a few weeks later. They have a detailed orientation process and residency program for new grads.", "Interview Questions": "What would you do in ________ situation? As a new grad nurse, never having practiced, I had no experience as to what I might do....I don't like hypothetical situation questions."}]]