[[{"date": "25 Apr 2023", "title": "Verpleegkundige Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UZ Gent (Ghent)", "Interview Descriptions": "- online invullen van gegevens + opladen CV en motivatie - gesprek dat peilt naar motivatie - gesprek met hoofdverpleegkundige waarbij een casus moet worden opgelost dat peilt naar de kennis van de kandidaat verpleegkundige.", "Interview Questions": "Wat maakt jou een meerwaarde voor het team?"}, {"date": "6 Apr 2022", "title": "Administatief medewerker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UZ Gent (Ghent) in Mar 2022", "Interview Descriptions": "1. testen via pc, persoonlijkheidstesten, excel en word oefening, cognitieve testen. \r\n2. screening cv en motivatie\r\n3. competentie gericht gesprek + case die je ter plaatse moet voorbereiden en via gesprek moet verdedigen. De case was een mail van een collega die je verder moest opvolgen, een verslag typen, een tabel maken in Excel en de verbeterpunten van collega aanhalen.", "Interview Questions": "- Waarom wil je voor het UZ Gent werken\r\n- Het is een functie met heel veel afwisseling, zie je dat zitten? \r\n- Wat doe je als de hoofdverpleegkundige niet blij is met wat je hebt gedaan. + ze begint te roepen. Hoe reageer je hierop?\r\n- Hoe ga je, als je ziet dat de dienst een aantal verbeterpunten heeft, dit aanbrengen? \r\n- Wat als ze dit toch niet doen? \r\n- Hoe ga je ze motiveren? "}, {"date": "4 Aug 2021", "title": "Applicatiebeheerder Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UZ Gent (Ghent) in Mar 2020", "Interview Descriptions": "Opsturen cv, motivatiebrief en vereiste diploma's via jobsite\nSelectieprocedure\n Deel 1: CV-screening\n Deel 2: Computergestuurde proeven die peilen naar je analytische en admiistratieve vaardigheden \nDeel 3: Competentiegericht interview waarin ook gepeild wordt naar je motivatie en expertise", "Interview Questions": "Waarom kiezen voor UZ Gent?"}, {"date": "16 Jan 2020", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UZ Gent (Ghent)", "Interview Descriptions": "Toegangsexamen maken op de computer. Er waren vragen bij in verband met exce, word en powerpoint. Daarnaast nog enkele andere vragen Die te maken hebben met de job. Als je daarvoor geslaagd bent , wordt je uitgenodigd om op gesprek te komen. Dan volgen er 2 gesprekken met de leidinggevende.", "Interview Questions": "Waarom kiest u voor deze job?"}, {"date": "25 Jun 2019", "title": "Mobiele Equipe Administratie Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at UZ Gent (Ghent) in Apr 2019", "Interview Descriptions": "Opsturen diploma, motivatiebrief en cv. Dan word je uitgenodigd voor de testen. De testen worden afenomen op computer bestaan uit drie onderdelen. De testen nemen ongeveer 2 uur in beslag.  Indien geslaagd interview met recruiter en afdelingshoofden. Eerst nog een test over Microsoft Office.", "Interview Questions": "Waarom wil je werken in UZ Gent"}, {"date": "6 Nov 2020", "title": "Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 months. I interviewed at UZ Gent in Apr 2019", "Interview Descriptions": "Een combinatie van objectieve & subjectieve aspecten. (kijkstage, graad diploma, presentatie, Q&A, interview)\r\nUiteindelijk waren de subjectieve parameters (e.g. hoe je in de groep valt) belangrijker dan de objectieve (graad diploma, presentatie). Buikgevoel geeft prioriteit aan kwaliteiten", "Interview Questions": "* Wat zijn 3 positieve & negatieve eigenschappen\r\n* Wilt u doctoreren\r\n* presentatie-gerelateerde vragen"}, {"date": "13 Aug 2018", "title": "Wervingsreserve Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UZ Gent", "Interview Descriptions": "CV en motivatiebrief via de jobsite ingediend, hierna uitgenodigd voor een gesprek. Gesprek  met twee hoofdvroedvrouwen en een hr-medewerker. \r\nNa het gesprek kreeg ik onmiddellijk feedback en kreeg ik te horen dat ik geslaagd was en in de wervingsreserve werd opgenomen.", "Interview Questions": "Standaardvragen (Wie ben je en wat brengt je hier, welke voorbereiding op gesprek, hoe ga je om met fouten?...)\r\nCasus relevant voor de functie"}, {"date": "8 Jun 2016", "title": "Secretaris Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at UZ Gent", "Interview Descriptions": "Er was een gesprek met 2 secretariaatsmedewerkers, diensthoofd + iemand van rekrutering. Eerst meegedaan aan algemeen examen voor secretaris (moeilijk!) maar gezien ik hiervoor geslaagd was kon ik solliciteren voor elke functie van die graad binnen UZ. Ik ben wel nog steeds niet statutair ondanks ik geslaagd ben voor examen. Ik werk nu steeds met contracten van bepaalde duur.", "Interview Questions": "wat zijn je sterke / zwakke punten? Wat heb je al gecreëerd in je vorige job?"}, {"date": "15 Aug 2016", "title": "Medisch Laboratoriumtechnoloog Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at UZ Gent (Ghent) in Jun 2016", "Interview Descriptions": "Gesprek met 3 verantwoordelijken + theoretisch examen\r\nNa een telefonisch gesprek werd ik uitgenodigd op gesprek. Nadien werd een theoretisch examen uitgeschreven waar ik aan deel nam. Daarna werd ik telefonisch op de hoogte gebracht dat ik aan de slag kon bij UZ Gent.", "Interview Questions": "Algemene vragen over persoonlijkheid + nadien theoretisch MC-examen"}, {"date": "5 Dec 2016", "title": "Verpleegkundige Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UZ Gent (Ghent) in Feb 2016", "Interview Descriptions": "Een vrij klassiek sollicitatiegesprek volgens het boekje.  Een korte voorstelling van jezelf en je motivatie om in het UZ Gent Te werken. Een korte eenvoudige test in het bijzijn van een selectieadiviseur, een departementshoofd, een hoofdverpleegkundige van een van de diensten waarvoor je hebt gesolliciteerd. Dit in het bijzijn van een afgevaardigde van een vakbond\r\nEr werden mij referenties gevraagd en die zijn ook gecontacteerd geweest", "Interview Questions": "- wie ben je en wat brengt je hier?\r\n- test: ochtendshift van een verpleegkundige: je moet patiënten verzorgen\r\n      * 1patient ligt op sterven en zal waarschijnlijk deze voormiddag overlijden\r\n      * 1 patiënt komt om 8u binnen voor chemo\r\n      * 1 patiënt krijgt een slecht-nieuws gesprek in de loop van de voormiddag\r\n      * 1 patiënt: chemo loopt verder, hulpbehoevend voor de verzorging\r\n      * 1 patiënt staat om 10u op de OK-planning voor plaatsing PAC\r\nIn welke volgorde ga je de patiënten af werken en waarom. \r\n"}], [{"date": "5 Sept 2016", "title": "Verpleegkundige Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UZ Gent (Ghent) in Jun 2014", "Interview Descriptions": "Kort iets over uw persoonlijkheid en visie, waarom je voor dit ziekenhuis kiest. Het grootste deel bestaat uit een casus die je verder moet vertellen, wat je gaat doen, waarom, aandachtspunten, acties,...", "Interview Questions": "Patiënt komt onstabiel binnen op intensieve zorgen na een operatie, wat ga je doen"}, {"date": "17 Jul 2016", "title": "Verpleegkundige Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at UZ Gent (Ghent) in Mar 2014", "Interview Descriptions": "Sollicitatie ingediend via internet na stage op een dienst Pediatrie. Daar gevraagd door hoofdverpleegkundige om te solliciteren voor deze dienst. Hierop ingegaan door sollicitatie - en motivatiebrief in te dienen.\r\nDaarna contact via email door UZ Gent met mogelijke sollicitatiedatum. \r\n\r\nZeer vlotte contactname met dienst rekrutering en selectie.\r\n\r\nSollicitatie zelf gebeurde met drie personen (dienst rekrutering en selectie; hoofdverpleegkundige en zorgmanager). Aan de hand van een casus werd de kennis getest. Ook nog enkele persoonlijke vragen.\r\n\r\nEr werd telefonisch contact opgenomen wanneer je door de selectieronde was.\r\n\r\nNa een drietal maanden contactname met het nieuws dat ik mocht beginnen werken in het UZ Gent.", "Interview Questions": "Een reële patiëntencasus uitwerken."}, {"date": "21 Apr 2016", "title": "Verpleegkundige Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3+ months. I interviewed at UZ Gent (Ghent) in Feb 2012", "Interview Descriptions": "examen, met jury van 5 mensen (vakbond bij)\r\nEr waren een aantal basic vragen over verpleging, bepaalde casussen die jij moet oplossen tijdens je gesprek. Die moet je dan weerleggen, jouw motivatie weergeven.\r\nOok persoonlijke vragen komen aan bod. Ze kijken of jouw visie aansluit bij die van UZ Gent.\r\nsollicatietatiegesprek duurt ongeveer 40 min en je weet de dag zelf al of je erdoor bent of niet.", "Interview Questions": "Vind jij dat een hoofdverpleegkundige noodzakelijk is op dienst?\r\nNoemt 5 positieve punten bij jezelf en 3 negatieve.\r\nCasus:  Patient ligt op de grond, heeft centraal infuus ontkoppeld- wat doe je?"}]]