[[{"date": "14 Jun 2023", "title": "Senior Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PHFI", "Interview Descriptions": "Applied via website. Notified by hiring manager for interview. One interview with the team. Panel interview for 30 mins. They asked questions about research, data analysis and other technical, behavioural questions", "Interview Questions": "Why do want to work with us"}, {"date": "19 Apr 2022", "title": "Account Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at PHFI", "Interview Descriptions": "We have to go through 3 round . Last round is to much practice based you need to share practical experience and then panel will ask any thing like question based", "Interview Questions": "Practical based how to overcome from the situation is no one is supporting you at the particular stage"}, {"date": "23 Mar 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at PHFI in Feb 2022", "Interview Descriptions": "It was a telephonic interview more like a discussion, the interview process was smooth and quick. I was interviewed by the Project Coordinator and who later clearly explained the project they were working on, the kind of work I'll be doing, whom to report to, etc.", "Interview Questions": "Which is your strength: quantitative research or qualitative research?"}, {"date": "21 Jun 2021", "title": "Associate Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at PHFI", "Interview Descriptions": "The panel was polite and made me feel comfortable. They asked basic questions and were not focused on information based questions. They asked some basic questions about my previous work experience and education and about my professional goals.", "Interview Questions": "About the covid pandemic and its implications"}, {"date": "3 Mar 2021", "title": "Senior Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PHFI", "Interview Descriptions": "Telephonic and video call interview,  three panelists,  Principle investigator, consultant and HR . they were  genuine  and soft-spoken, the process took 2 weeks in total, very approachable and helpful HR staff", "Interview Questions": "About yourself, experience, qualification  etc. "}, {"date": "28 Dec 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at PHFI in Mar 2021", "Interview Descriptions": "It took more than 20 days from selecting the resume to assign the internship, the process was to slow and hr was also not replying to my answers and asked some questions which had no relevance with the job", "Interview Questions": "About last experience in ML"}, {"date": "4 Feb 2023", "title": "Asst. Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at PHFI (New Delhi) in Jul 2019", "Interview Descriptions": "Great interview with experts, lasted about an hour with technical as well as behavioural questions asked ... overall a good experince... Highly recommend the organsaion for anyone wanting to buld carer in academia", "Interview Questions": "reserach agenda for 5 years"}, {"date": "15 Jun 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PHFI (Gurgaon, Haryana) in Jan 2017", "Interview Descriptions": "It's not that difficult. Just read the project for which you have been called properly and present your knowledge and skills in that light. They usually put up questions related to your background like your research projects, thesis etc.\r\nThe hiring process although takes time.", "Interview Questions": "A deadline to a task is approaching and your team members have a conflict. How will you handle?"}, {"date": "29 Aug 2017", "title": "Assistant Manager-HR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PHFI (Gurgaon, Haryana) in Dec 2016", "Interview Descriptions": "Interview shall be more from your previous experiences and work profile. Brush up basics from domain. Confidence shall play a vital role. \r\nGenerally there would be 2 round of interviews.", "Interview Questions": "Basic questions from domain"}, {"date": "2 May 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PHFI (Thiruvananthapuram) in Jul 2016", "Interview Descriptions": "The first round of interview was telephonic. Basically, questions revolving around CV. The next round was with HR and after that one face to face interview at office. In the face to face interview, basic questions regarding your research experience. Specifically, the data analysis in my project. Also, questions regarding the various steps conducted for data collection and analysis. Then regarding how will I go about if I am hired in managing the project. There were three aspects to this -regarding team management, other sites co-ordination and research process.", "Interview Questions": "One thing they were particular about was previous job experience"}], [{"date": "11 May 2016", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at PHFI", "Interview Descriptions": "Telephonic interview discussing about my past experience and the thesis topic. Key skills, past research experience, ease with handling large volumes of data and working in the field etc.", "Interview Questions": "It was a normal interview starting with tell us about yourself."}, {"date": "5 Jun 2018", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at PHFI (New Delhi) in Mar 2016", "Interview Descriptions": "Telephonic followed by face to face,in the telephonic interview,they asked me about my background and few data related questions.In the face to face they gave some situations and asked me how would i proceed i those situations.", "Interview Questions": "Regarding the project, situational"}, {"date": "25 Apr 2017", "title": "Program Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at PHFI (Gurgaon, Haryana) in Dec 2015", "Interview Descriptions": "Cordial and Smoothly conducted. The process was very transparent and all the timelines were adhered to. The panel consisted of project professionals and institutional heads who asked technical questions related to project and how i could also contribute to organisational growth.  HR related questions were asked by HR executive and were standard salary and notice period related questions", "Interview Questions": "How would my work experience and research training in addition to other qualifications contribute to smooth functioning of the position that I was interviewed for?"}, {"date": "18 Nov 2015", "title": "Project Coordinator-Evidence Based Diabetes Management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at PHFI (Gurgaon, Haryana)", "Interview Descriptions": "Had applied through devnetjobs and an interview was scheduled within weeks. The entire process was highly unprofessional. The admin guy who contacted me wasn't sure about the position for which I had been shortlisted( I reminded him that I have applied for two different positions). And then to my horror , he was surprised at my arrival , did not have my CV with him . It all looked that these people had to interview me unwillingly , just because I had landed at their doorstep against their wishes. The interview was a 5 minute affair with general introductions- consisted of two people-Project head and a HR person. I wasnt asked any technical stuff either . As expected , the company did not bother to contact me later!! :D", "Interview Questions": "Are you married? Why do you want to switch?"}, {"date": "29 Aug 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at PHFI (Gurgaon, Haryana) in May 2015", "Interview Descriptions": "The interview was smooth with direct questions mostly, they asked me about my background interests etc. They asked me about my quantitative skills how good i was with STATA etc. The position required a lot of field work so regarding that.", "Interview Questions": "They explained the job profile and then asked me question as to how technically sound i was."}, {"date": "8 May 2014", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at PHFI (Chennai) in Apr 2014", "Interview Descriptions": "Posted in Dev Net jobs, call for the interiview through a mail. A panel of 3 members. Interivew lasted for a  hour. Interiew wan on 20th April but it is nearly 20 days, still no info to any interviewed candidates.", "Interview Questions": "Questions were mostly based on the relevant experience"}, {"date": "11 Apr 2016", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at PHFI in Aug 2013", "Interview Descriptions": "I applied by mail, sending my CV to the designated address. There was a telephonic panel interview of about 30 minutes with questions around my previous work, reasons for applying for this position, basic knowledge on the mental health policy situation in India, some questions on previous research work and willingness to relocate. After this, there was one round of telephonic interview separately with HR to finalize the offer.", "Interview Questions": "They asked about the project relevant policy (mental health), some practical questions about rural health facilities and some questions on my previous research work."}, {"date": "30 Mar 2016", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PHFI (New Delhi) in Jul 2013", "Interview Descriptions": "Great as this organization is good for researchers in public health arena especially if you want to study more. Great work environment. supportive senior staff and numerous opportunities for skill development.\r\nFlexible working hours\r\nOpportunity to write credible research papers based on the experience of working in various high impact projects", "Interview Questions": "N/A"}, {"date": "9 Apr 2014", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at PHFI (Ahmedabad) in Jan 2013", "Interview Descriptions": "Hiring depends on the need of the project with the organisation. And the interview process is also based on similar thiings. It is preferred if the job seeker has a masters degree relevant to the job, fluency in gujarati, has good analytic and writing skills", "Interview Questions": "Please try to understand the objective of the project and answer honestly to the questions. Give details about your experience and learning relevant to the project or the PI interviewers."}, {"date": "8 Oct 2012", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 6 months. I interviewed at PHFI (New Delhi) in Apr 2009", "Interview Descriptions": "Rather chaotic interview process with poor structure, poor sticking to timelines and rather unimpressive questions. There is a shortage of gravitas that leads to questions that lack depth or perspective or insight.", "Interview Questions": "Nothing really."}]]