[[{"date": "11 May 2021", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Loyola University New Orleans (New Orleans, LA)", "Interview Descriptions": "Pretty basic interview questions. The interview felt more like a conversation, which was refreshing. 1:1 interview and group interview in same day. I received an offer two days later. Overall, pleasant experience.", "Interview Questions": "Tell me about yourself. Why higher Ed? Why Loyola?"}, {"date": "6 Feb 2021", "title": "English Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Loyola University New Orleans (New Orleans, LA) in Jan 2021", "Interview Descriptions": "They were super professional and nice. The interview was only 30 mins. They asked how I would design a course with my research, where I see my research going, how I would teach writing in a literature class through one writing activity, how I would contribute to digital humanities.", "Interview Questions": "They asked how I would design a course with my research, where I see my research going, how I would teach writing in a literature class through one writing activity, how I would contribute to digital humanities."}, {"date": "24 Mar 2021", "title": "Assistant Director of Account Services Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Loyola University New Orleans in May 2019", "Interview Descriptions": "Interview was in 2019 and before the pandemic. Fill out Loyola’s application form. If given an interview, you first meet with the Chief Communications Officer and then round table with the communications staff.", "Interview Questions": "Describe your prior work\r\nWhat was your favorite project you’ve completed"}, {"date": "11 Nov 2021", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Loyola University New Orleans (New Orleans, LA) in Aug 2018", "Interview Descriptions": "The interview process was very positive. Being a student I was able to get the position quite easily from my professors. They just asked me for my availability. All went well.", "Interview Questions": "How does your availability look?"}, {"date": "4 May 2017", "title": "Communications Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Loyola University New Orleans", "Interview Descriptions": "Applied via email. They replied within a week or so set up phone interview. Phone interview was easy, asked about background, responsibilities. They then set up and in person interview. Talked to two people then met a third. Was asked about tactics I'd take on specific projects. Overall very nice, informative.", "Interview Questions": "Talk about a difficult project that you had to manage. "}, {"date": "17 Jul 2016", "title": "Public Affairs Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Loyola University New Orleans (New Orleans, LA) in Jul 2016", "Interview Descriptions": "After submitting my resume, I was asked to come in for an interview the following morning. The interview lasted for about 50 minutes, and began with the interviewer asking me to describe my career experience in general, and then to talk about why I wanted this particular job. It was a fairly relaxed, one-on-one interview.", "Interview Questions": "Why Loyola?"}, {"date": "20 Aug 2015", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Loyola University New Orleans (New Orleans, LA)", "Interview Descriptions": "Went in to ask if they were hiring, they were and I had an interview on the spot and was hired on the spot. Very casual. More of a conversation than an actual interview.", "Interview Questions": "What experience do you have?"}, {"date": "29 Jan 2015", "title": "Assistant Director for Student Activities Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Loyola University New Orleans", "Interview Descriptions": "Phone interview first with 2 staff, then invited for a Full day of interviewing with multiple committees, students and faculty. Similar to other university interviews. Tiring and a bit repetitive. Best part was meeting students. Interviewers answered my questions about culture, work load, work life balance. Offered the job at the end of the interview day. Salary was comparable to national average.", "Interview Questions": "Describe best teacher in college and why"}, {"date": "6 Jan 2016", "title": "Accounting Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Loyola University New Orleans (New Orleans, LA) in Jan 2015", "Interview Descriptions": "Just like every other interview process with the typical questions. The interviewer was very friendly throughout the process, which only lasted about two days and was completed in person and over the phone. Nevertheless, an employee referral really helped me get through with the process as quickly as possible. The interview went very well!", "Interview Questions": "Strengths and weaknesses?"}, {"date": "27 Jan 2017", "title": "Police Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Loyola University New Orleans (New Orleans, LA) in Nov 2014", "Interview Descriptions": "I had applied online and received an emailed response. An interview was set up with the Chief of Police at Loyola University, as well as with the Captain. Both were very polite and made me feel very comfortable during the process. After the interview I was scheduled for a psychological testing and for a health screening. As a police officer, I also had to have all of my current Louisiana P.O.S.T. certifications up to date.", "Interview Questions": "Why do you want to work for Loyola University?"}], [{"date": "26 Mar 2014", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Loyola University New Orleans (New Orleans, LA)", "Interview Descriptions": "No process, do well in class and ask the professor later. You will likely get the job", "Interview Questions": "N/A"}, {"date": "17 Aug 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Loyola University New Orleans (New Orleans, LA) in May 2013", "Interview Descriptions": "The professor picks you if they believe you have what it takes. You do not go to them, they come to you. They either send you to upper management or they themselves ask you in what way can you contribute. One of the options is to write for them. It really all depends on the professor and what field they cover.", "Interview Questions": "Would you like to work for me?"}, {"date": "9 Sept 2015", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Loyola University New Orleans (New Orleans, LA) in Mar 2012", "Interview Descriptions": "We first had to submit a video, and then had group interviews- a group of candidates worked on a specific problem or game and interviewers walked around and took notes. The next round of interviews involved going into three separate rooms alone and being interviewed, each with about 5 people interviewing.", "Interview Questions": "Name a time that you failed"}, {"date": "20 Jun 2010", "title": "Finance Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Loyola University New Orleans (Chicago, IL) in Feb 2009", "Interview Descriptions": "phone interview and alot of talking to the people that hire", "Interview Questions": "nodad"}]]