[[{"date": "8 Jun 2023", "title": "Adminstrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chapman University", "Interview Descriptions": "They invited me in for a team interview with a panel. I interviewed with three individuals in the beginning, then a panel of 10, and finally the director of the department.", "Interview Questions": "They asked about my leadership and teamwork experience. Why I wanted the job and how it related to my future goals."}, {"date": "24 May 2023", "title": "Data Analytics Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Chapman University", "Interview Descriptions": "Applied for the role online. after two weeks, received an invitation for a zoom interview. Interviewers do not know anything other than excel yet hold high level positions, yes you heard it right. and Yet they were judging me, an advanced python user with a half a decade of direct experience. According to them, 3000 rows with a few hundred columns is a big data. I straight told them that it is not and they were not happy to hear it. and I corrected their data validation steps and again they were not happy to hear it because it made them look unknowledgeable. All in all, i would say to you all to stay away from this place.", "Interview Questions": "tell us a time you managed people? tell us how you analyze data?"}, {"date": "14 May 2023", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Chapman University", "Interview Descriptions": "Ask behavioral questions regarding teaching techniques, philosophy, and past experiences. For example: What is your teaching philosophy? What do you enjoy most about teaching? Walk me through how you would structure your class.", "Interview Questions": "Walk me through how you would structure your class. What is your teaching philosophy?"}, {"date": "18 Apr 2023", "title": "Career Peer Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Chapman University (Los Angeles, CA)", "Interview Descriptions": "I interviewed with Career Advisor from Crean College. The interview was very conversational. The interview was about 30 minutes long. We first went through my resume and previous experience and then she asked several questions. I was asked probably about 5-6 questions.", "Interview Questions": "What are your 3 strengths?"}, {"date": "25 Jun 2022", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Chapman University", "Interview Descriptions": "My whole interview and job talk process was virtual or included a phone interview. First, I had the phone interview and then made it to the zoom interview that was one day schedule full of zoom meetings", "Interview Questions": "What do you research or study? "}, {"date": "3 May 2022", "title": "Guest Relations Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Chapman University", "Interview Descriptions": "I went in and interviewed with one the Leads, who was also a student. An extremely chill interview and the people were very nice. Asked basic questions like \"strengths and weaknesses\" and other questions similar to that.", "Interview Questions": "Q: Strengths and weaknesses\r\nQ: if you had to bring something to a deserted island what would it be? "}, {"date": "7 Mar 2022", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Chapman University", "Interview Descriptions": "The interview was in-depth and I learned a lot about work-life. They ask questions about what you think it would be like to work there. It was very friendly and I was at ease", "Interview Questions": "What are some of your expereiences"}, {"date": "28 Feb 2022", "title": "Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Chapman University", "Interview Descriptions": "It was pretty easy.  Just be positive and honest about your experience at the school and you'll do fine.  Show that you are friendly and can converse well with people", "Interview Questions": "Tell us about your time here so far"}, {"date": "2 Feb 2022", "title": "Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Chapman University", "Interview Descriptions": "phone interview, then in person if you pass the phone round. Super fun and casual questions, but be prepared to talk about campus and your experience! It is a fun interview", "Interview Questions": "What is your favorite spot on campus?"}, {"date": "8 Mar 2022", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chapman University (Orange, CA) in Feb 2022", "Interview Descriptions": "Very great interview process. Flexible with your availability. Pretty standard interview questions. Definitely come with questions of your own. Everyone was extremely nice and made it a wonderful interview environment.", "Interview Questions": "Tell me about yourself.\n\nHow would your current work experience bring value to this role? \n\nWhat do you wish you could have done more of in your current role?"}], [{"date": "10 Mar 2022", "title": "Payroll Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Chapman University (Los Angeles, CA) in Feb 2022", "Interview Descriptions": "Virtual Interview. HR Director and HR employee took interview. One by one they were asking questions. They were writing down my answer while I was speaking. Interview took 30 minutes. They were continually asking questions and I prepared that’s why I was able to answer all the questions smoothly.", "Interview Questions": "How do you Manage Stress?"}, {"date": "9 Nov 2021", "title": "College Peer Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Chapman University", "Interview Descriptions": "A written application including resume and cover letter, and availability.  Then I went through one interview online. About 5 questions.  After hiring took a couple of weeks to process paperwork and do training.", "Interview Questions": "Strengths and weaknesses \nprevious experience "}, {"date": "28 Oct 2021", "title": "Barista Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Chapman University", "Interview Descriptions": "Normal. It was for starbucks so they wanted to know if  I could make coffee and asked some behavioral as well.  Starbucks makes great coffee so i hope I get a return offer.", "Interview Questions": "they asked for my Gpa and resume"}, {"date": "14 Jul 2021", "title": "TA for Organic Chemistry Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Chapman University", "Interview Descriptions": "Teacher came to me and asked if i wanted to be interviewed after class. Interviewed then had me fill out an application after. The process was easy and very quick within a matter of days.", "Interview Questions": "What makes you  qualified for this job?"}, {"date": "25 Jun 2021", "title": "Assistant Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chapman University", "Interview Descriptions": "For this specific job, I found the interview process to be unprofessional and drawn out. I did not feel respected during the process by the interviewer. It was a drawn out process.", "Interview Questions": "Why are you interested in this position?"}, {"date": "7 Jun 2021", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Chapman University", "Interview Descriptions": "Basic interview, hiring manager was hiring and they asked me questions that were very basic.  Including, why do you want to work here. I answered and then the interview continued.", "Interview Questions": "Why do you want to work here. "}, {"date": "8 Mar 2022", "title": "Project Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Chapman University (Orange, CA) in Apr 2021", "Interview Descriptions": "Met once with the department of research over Zoom. Discussed my experience and interest in the position. They then went into questioning. I met with 4 people in the Department of Research. All were happy to discuss their interests and qualifications.", "Interview Questions": "Familiarity with grant writing and research methodology."}, {"date": "14 Mar 2021", "title": "Library Administrative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chapman University", "Interview Descriptions": "The interview took an hour and a half. I was interviewed by many individuals. They had many scenarios in their questions and felt very professional. I just didn’t like that they did not send me a rejection letter after the interview. It should be courtesy with the time and emotional investment preparing for the interview.", "Interview Questions": "Why are you interested in this position?"}, {"date": "17 Nov 2020", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chapman University", "Interview Descriptions": "I applied online and received an email inviting me to sign up for an interview slot. Very welcoming interviewer, conversational interview style.  About a week later I was offered the job.", "Interview Questions": "What sparked your interest in this position? "}, {"date": "12 Aug 2020", "title": "Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Chapman University", "Interview Descriptions": "Zoom interview, basic questions about qualifications and education background. People were friendly and welcoming. The University did the best they could with a distance interview. Words and Words words and words.", "Interview Questions": "Do you work better on your own or in a group?"}], [{"date": "1 Jul 2020", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chapman University", "Interview Descriptions": "You have to send a follow-up email to your application to be considered. Interviews are simple but thorough. They ask about your experience on campus and prior. If you are a freshmen, you will talk more about high school. Most colleges will not hire you if you are a senior, so make sure to secure a job while younger.", "Interview Questions": "What is your biggest weakness? "}, {"date": "27 Feb 2020", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Chapman University", "Interview Descriptions": "Interviewed with the head of the entrepreneurship center at the time and the assistant to the director. Overall it went by smoothly, they were looking for someone with a lot of communicational skills since the job required constant communication with various team members at the center. I had one on one meetings with the head of the department and then the assistant to the head of the department.", "Interview Questions": "Walk me through your resume."}, {"date": "24 Oct 2019", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Chapman University (Orange, CA)", "Interview Descriptions": "Very informal interview with the department head. Asked questions related to my previous experience as a TA in graduate school and we discussed our teaching philosophies. We also discussed topics related to the courses I would be potentially teaching.  In addition, we discussed university wide policies and we discussed some about benefits available to faculty.", "Interview Questions": "What is your teaching philosophy?"}, {"date": "22 Oct 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Chapman University", "Interview Descriptions": "First interview about 30 min learning in more details about job description and day to day expectations, sharing about my background.  Call back interview was meetings with several department team members.", "Interview Questions": "Have you ever had a disagreement with a boss or coworker,  how did you handle it? \r\nHow do you handle strict deadlines with competing priorities? "}, {"date": "29 Sept 2019", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Chapman University", "Interview Descriptions": "applied online -> few weeks later randomly got blindsided by a call to interview on the spot without a prior scheduling. It was an unusual phone interview and unstructured as well. \r\n1st question I was asked was to specify my salary expectations. Despite answering i'm negotiable the phone interview would not proceed further and hence I gave a range of salary  per the market.   A month later I got a call stating they were looking for a junior level role which was never clear in the Job description and they said my salary expectations were above their budget.", "Interview Questions": "What salary do you expect?"}, {"date": "13 Sept 2019", "title": "Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chapman University (Placentia, CA)", "Interview Descriptions": "The interview process itself was positive, but it ended with the most undervalued offer I’ve ever received. We’re talking WAY below market value.\n\nHere’s the story:\n\nI received a phone call confirming that the position was seeking someone with 4-5 years’ experience and masters degree preferred (which I meet). Phone call went very well, followed by a very positive panel interview with five people.\n\nThe next day, I received an offer that was 63% of the market value for this position. I was flabbergasted. I politely expressed concern that this is well below the salary I’m seeing for comparable jobs and also well below the salary I already earned. (It was actually barely above what I made at my first job out of college with zero experience and no masters).\n\nThe response I received sounded almost alarmed that I would seek to ask “that” much. I thanked them for the experience but let them know I definitely can’t take an entry level salary with over 4 years of experience and an advanced degree. \n\nThe final straw was when they tried to sell me on it being a benefit to work for a big name school, which at this point bordered on insulting. (Is the name going to allow me to afford living in Orange County? Probably not.)\n\nDespite the conversations going well and everyone involved being pleasant, I was dumbfounded at the offer and at the insinuation that it was somehow fair or standard. \n\nA few weeks later, I received an offer almost 60% higher than this one, asking for similar experience and with no mention of an MA degree. This was right on par with market value.\n\nMy advice is this: do not expect to see an offer at market value here. Maybe PhDs are paid fairly here or something, but certainly, by the looks of it, not staff. If you do interview, don’t let them tell you that the industry or nonprofit status means you have to accept what’s barely a living wage. The offer I ended up accepting is also a nonprofit. \n\nMaybe I’m just a tad bit salty, but it’s hard enough to get by in such an expensive place, and to see successful institutions so severely undervalue qualified young applicants is just so discouraging to see.", "Interview Questions": "What are your strengths? What would coworkers say about working with you? What kind of management style do you work well with?"}, {"date": "7 Sept 2019", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chapman University", "Interview Descriptions": "It was overall rather casual. It was strict in a sense that you have to check-in by the receptionist desk and print out your own name tag and get an email confirming that. You wait for the interviewer to come and follow interviewer to their office. The interviewer told me they seek out people with particular technical experience and the whole process involves interviewing in person with the researcher, followed by another interview and then a lab tour to decide the candidate.", "Interview Questions": "Did you have experience with Western Blot?"}, {"date": "6 Mar 2019", "title": "Resident Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Chapman University (Orange, CA)", "Interview Descriptions": "The interview process consisted of 1 group interview and 1 interview with the current staff.  They had us play team building games in the first interview.  The second interview, they asked me questions about my resume.", "Interview Questions": "What is a difficulty you faced and how did you overcome it?"}, {"date": "16 Jan 2019", "title": "Front of House Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chapman University", "Interview Descriptions": "The interview was really informal. I basically walked into the office, got asked some questions, and was told that I'd hear back in a couple of days. Tanya was super nice and is an awesome person. I'm normally super nervous in interviews, but I felt super comfortable in this one.", "Interview Questions": "What's one of your weaknesses?"}, {"date": "23 Jan 2019", "title": "Client Services Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Chapman University (Orange, CA) in Jan 2019", "Interview Descriptions": "Barron and his team welcomed me and introduced themselves in a professional manner. They were prepared with a list of questions regarding my experience, goals and personality. There wasn’t a dull moment in the interview which was a great feeling as some IT companies don’t come off so professional with their interview process.", "Interview Questions": "If I noticed another co worker was not performing as satisfactory a job as myself, how would I handle the situation?"}], [{"date": "5 Oct 2020", "title": "Student Mail Room Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Chapman University in Aug 2018", "Interview Descriptions": "It was very easy for me because I was never interviewed. I applied to 11 different chapman jobs and not a single one got back to me. Then the supervisor of mail services emailed me and I got this job. My other co-workers told me they got interveiwed.", "Interview Questions": "Do you have work study?"}, {"date": "21 Jun 2022", "title": "Post Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Chapman University (Orange, CA) in Jul 2018", "Interview Descriptions": "Took about 3 months between my first interview snd my actual first day on the job. You meet with roughly 7 people.  Interviews last about an hour each time after waiting at least 30 minute In the reception area", "Interview Questions": "N/A"}, {"date": "28 Jun 2022", "title": "Employee Relations Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chapman University in Apr 2018", "Interview Descriptions": "The interview process began with a phone call, followed by an in-person interview at the career center. The in-person interview consisted of being interviewed by several members of the team, an office tour, and meeting the staff.", "Interview Questions": "Why are you interested in working at Chapman University?"}, {"date": "3 Mar 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Chapman University", "Interview Descriptions": "Sat with the head of the department where he asked me specifically about the operations of the center. Asked about my previous knowledge regarding the position and how I can apply them.", "Interview Questions": "What did you use to do before and how can you apply it?"}, {"date": "18 Feb 2018", "title": "Graduate Writing Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Chapman University", "Interview Descriptions": "Applied online and received an email for an interview appointment. Fairly easy. Email to show up with ID.  The interview was about 15 mixtures. The professor is kind and listens intently to your answers. He does look at resumes and takes in your experience as a huge factor.", "Interview Questions": "Just a few questions about myself and my philosophy on tutoring and student mentorship. The professor wanted to gauge how I would treat students and how I would foster their growth, "}, {"date": "22 Feb 2021", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Chapman University (Irvine, CA) in Dec 2017", "Interview Descriptions": "Interview was straightforward and was completed over multiple days. \n\nThe initial was via Skype with the Director of the Program. The second was an in-person interview with the team and employees in the department as a meet-and-greet.", "Interview Questions": "1. Describe your current work and projects?\n2. How did you hear about this position?\n3. What do you consider to be your weakness?"}, {"date": "23 Oct 2017", "title": "Adjunct Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Chapman University", "Interview Descriptions": "I was referred by a current staff member. Since I was qualified for the position, the interview was rather brief. I feel that I needed to appear professional and capable.", "Interview Questions": "The interviewer explained the current environment and what was required of the teacher and what the students needed to learn. "}, {"date": "11 Aug 2020", "title": "Financial Aid Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Chapman University (Orange, CA) in Oct 2017", "Interview Descriptions": "Straight to the point. Asked about strengths and weaknesses. Described duties. Asked if I had any questions. They were very casual and welcoming. Gave a tour of the office. Overall a great experience!", "Interview Questions": "What did you do before this?"}, {"date": "16 Nov 2017", "title": "Staff Accountant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Chapman University (Orange, CA) in Oct 2017", "Interview Descriptions": "I applied through their website. I've been watching for this position for a few years. 1. Test: excel & accounting (very hard) 2. 1st interview 1:2 3. 2nd interview 1:2 (Director of accounting and senior Accountant). Reference check: they asked to check references from your immediate supervisors of your previous jobs. I failed my reference check due to they couldn't get a hold of one of my contacts who is super busy, but he did call them back but they didn't pickup the phone. After so many attempts, I called them back and they told me that they moved to different directions. They reopened the position and sorry for disappointing.", "Interview Questions": "There are about 20 hard interview questions. Job and personality related. They did admit they are hard."}, {"date": "20 Feb 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Chapman University (Orange, CA) in Apr 2017", "Interview Descriptions": "It was friendly and easy. Normal questions to get a personality sense. Bring your resume with you! It was a great opportunity to find out more about the position. They just look for people who are willing to learn and commit to the job!", "Interview Questions": "What are you looking for in an internship?"}], [{"date": "29 Nov 2016", "title": "Mail Clerk II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Chapman University (Orange, CA)", "Interview Descriptions": "It was easy once you get an interview, but you better follow up on it yourself. HR is a little shady, so if you know someone you have a better shot at getting hired. You will have to wait a little while because they have to leave the posting up for 5 days. The questions for my job were more based on my personality than experience.", "Interview Questions": "Have you ever worked in shipping or receiving"}, {"date": "1 Nov 2016", "title": "Campus Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chapman University", "Interview Descriptions": "The interview was pretty straightforward, they want to know your skills and your personality better. They ask a couple of questions about how you manage conflict, they basically want to know more about how you work in a group and if you would be a good fit. At the end they ask you quick fast questions similar to the ones on the Chapman application, these are meant to be fun and you shouldnt prepare an answer. They ask you to prepare a brief presentation about anything on campus (can be a program, building, etc) then you have around 10 minutes to answer a fake email using information from the website.", "Interview Questions": "If an angry parent called you asking why their child wasn't admitted to Chapman, how would you respond?"}, {"date": "2 Jun 2017", "title": "Student Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Chapman University (Orange, CA) in Sept 2016", "Interview Descriptions": "Submitted application online, met up in person with the department head to schedule a interview, was hired on the spot, interview was 20 minutes one on one. The boss was extremely nice and asked a few questions on why we wanted to tutor, and what kind of availability we had. We were able to change our availability depending on if our class schedule changed, and also if we wanted to tutor different subjects. Bear in mind that some subjects are more in demand than others, therefore if you want to tutor a common subject, you may not get hired and vice versa", "Interview Questions": "Why do you want to be a tutor?"}, {"date": "20 May 2016", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chapman University (Orange, CA)", "Interview Descriptions": "Small interview panel (3 people). It was over pretty quick (20 minutes). The interview also included am exam that tested my skills with MS Word, Excel. They use PeopleSoft now. I wasn't asked about PeopleSoft but I was asked about their old system.", "Interview Questions": "What are your qualifications? Why do you want to work at Chapman University?"}, {"date": "21 Apr 2016", "title": "Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Chapman University (Orange, CA)", "Interview Descriptions": "Phone call, followed by in person interview, followed by second in person interview with a team. I was asked many different questions about my skills, my approach to working with others, and how I'd handle difficult situations. It was basically par for the course for interviews I've had. I recommend dressing very conservatively for your first interview and taking cues from the person conducting the interview about how to dress at the second interview. Allow ample time to find parking as it's a challenge in the area.", "Interview Questions": "How did you hear about Chapman? Why do you want to work at Chapman?"}, {"date": "12 Jul 2017", "title": "Teaching Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chapman University (Orange, CA) in Apr 2016", "Interview Descriptions": "I applied only and then 20 days later, received a message from them, asking me for certain details and time for phone interview. After 5-6 days I received a call for an in-person interview. I met 5 people for the interview and they asked me different questions relating to the role.", "Interview Questions": "Have you had any experience teaching before"}, {"date": "28 Apr 2017", "title": "Career Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Chapman University (Orange, CA) in Apr 2016", "Interview Descriptions": "It was 3 interviews with staff but over all was great, it was very intense on the demonstration of skills and programming side.  However, I was able to speak to my own assets and my previous experience.", "Interview Questions": "How would you advise a difficult student? "}, {"date": "22 Mar 2016", "title": "Resident Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Chapman University (Orange, CA) in Feb 2016", "Interview Descriptions": "Application online through org sync and then go in for interview. Check in at check in table and the wait for interview part 1 with a professional staff member and staff member where 4 questions are asked. Then interview part two with different professional staff memb member and student staff member ask a different set of four questions.", "Interview Questions": "What characteristics do you have that would make you a good fit for this position"}, {"date": "6 Apr 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Chapman University (Orange, CA) in Aug 2015", "Interview Descriptions": "I sent my resume to be reviewed. \r\nHeard back within a week. I had one phone interview mainly to go over information.\r\nI was called to schedule an in person interview a week later.\r\nI had my face to face interview that lasted 45 minutes and was sent an offer one day after interview.", "Interview Questions": "Tell me about a time you had to work with student organizations? \r\nWhat is a challenge you experienced when implementing a change in an organization? "}, {"date": "11 Jun 2015", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Chapman University", "Interview Descriptions": "I was referred by a friend who was graduating and I directly spoke to the supervisor if they had any positions open. He was friendly, had a little chat and said he was looking for help in the lab. It dint feel like an interview. It was more like a conversation.", "Interview Questions": "I was asked me a little about my background."}], [{"date": "11 May 2015", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Chapman University", "Interview Descriptions": "Every department is different for the more managerial roles there is usually a presentation that needs to be given to a large group, then there are a couple of individual interviews.  The process is usually a phone interview and then it get narrowed down to 5-6 applicants, then you are called in for a full day interview process described above.", "Interview Questions": "N/A"}, {"date": "26 May 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Chapman University (Orange, CA) in May 2015", "Interview Descriptions": "I was told by a professor to apply for the position.  I went on to the employment section of the university's website and filled out the necessary information, including have to make a profile with the university and answering a variety of yes or no questions.  Finally, I submitted my resume, the application that was required, as well as a cover letter.", "Interview Questions": "What is my background and experience in research"}, {"date": "8 Jan 2015", "title": "Phonathon Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Chapman University", "Interview Descriptions": "I found the interview for the phonathon position to be relaxed and to have normal questions. It felt a bit long in fact I found it to be a little unnessisarily long. At least the interviewers were nice.", "Interview Questions": "I didn't think they were hard"}, {"date": "9 Aug 2019", "title": "Digital Marketing Production Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chapman University (Orange, CA) in Jan 2015", "Interview Descriptions": "Relaxed environment, interviewed with staff and student workers. They allowed me to share a lot of my previous work and demonstrate my skills through videos/presentations. They also shared some upcoming projects that I would be working on to help generate some new ideas.", "Interview Questions": "Previous Experience"}, {"date": "14 Nov 2015", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Chapman University (Orange, CA) in Jan 2015", "Interview Descriptions": "Straightforward, simple, easy. It wasn't really an interview just a way to make sure that you are a normal person. They want all the tutoring help they can get. So I wouldn't worry too much about the interview. Honestly don't worry about any of the process.", "Interview Questions": "Explain a concept to me in simple terms"}, {"date": "7 Jan 2016", "title": "Digital Arts & Animation Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Chapman University (Orange, CA) in Dec 2014", "Interview Descriptions": "I had 2 interviews. The first was your standard, \"they ask you questions and you answer\" interview. The second was ambush style... i didnt know it was coming and no one informed me that it was an interview until i was in the room.", "Interview Questions": "Why did i want to leave my current job and accept this position?"}, {"date": "6 Jun 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Chapman University in Sept 2014", "Interview Descriptions": "Applied online and received an email shortly after asking me to come in for an interview. Questions were very basic and mainly focused on my prior office experience. Also very focused on availability since a lot of people have busy class schedules. It was very short and informal. I got an email a couple days later offering me the position.", "Interview Questions": "What is your prior office experience?"}, {"date": "12 Sept 2017", "title": "Special Projects Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Chapman University (Orange, CA) in May 2014", "Interview Descriptions": "A painfully slow process. Expect 3-4 interviews that last about 30-60 minutes with about 6-8 different people over the course of 3-4 months. Pretty much the same questions over and over", "Interview Questions": "Since it's a university, they are mostly interested in your personal education rather than your work history"}, {"date": "2 Jan 2017", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Chapman University (Orange, CA) in Apr 2014", "Interview Descriptions": "They overlooked me several times, even though I have excellent student ratings as an adjunct. They keep hiring people from the industry with no teaching experience! The faculty is good though.", "Interview Questions": "Industry experience in an outdated field"}, {"date": "28 Feb 2014", "title": "Student Library Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Chapman University", "Interview Descriptions": "Submit online application through online job portal, then they call you for an interview and later you get a call on whether or not you got the job.", "Interview Questions": "How you deal with rude patrons"}], [{"date": "2 Oct 2012", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Chapman University (Orange, CA) in Mar 2011", "Interview Descriptions": "Commenced with phone interview, followed by several panel interviews.", "Interview Questions": "What would you do if you realized a co-worker was cutting corners?"}]]