[[{"date": "25 Jul 2023", "title": "Assessor/Trainer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Shaw Trust (London, England)", "Interview Descriptions": "simple competency based questions, two interviewers, clear and concise questions time given to demonstrate answers, virtual interview with very relaxed interviewers explaining the benefits and goals of the company and long term career growth", "Interview Questions": "what can you bring top the role"}, {"date": "17 Jul 2023", "title": "Employment Advisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Shaw Trust (London, England)", "Interview Descriptions": "Questions not made easy for the actual job. Very lack of supervision once you get recruited. Only goal based - no much humanisation . No care for the actual applicant. Lack of communication and supervision. The interview is very difficult. The line of thought and what they are expecting is unnecessary for the job itself. Not relevant", "Interview Questions": "Goal target - 2 examples"}, {"date": "19 Jul 2023", "title": "Employability Trainer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Shaw Trust (Birmingham, England) in Jul 2023", "Interview Descriptions": "The interview was conducted professionally with good questioning mainly about safeguarding and confidentiality. Great atmosphere and the place looked very well managed and felt safe and welcoming. The team were sociable and were happy to offer any assistance.", "Interview Questions": "What do you understand about safeguarding?"}, {"date": "14 Dec 2022", "title": "Employment Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Shaw Trust (Ashford, Kent, South East England, England) in Oct 2022", "Interview Descriptions": "Despite Shaw Trust boasting of being a Disability Confident employer, their interview techniques exclude non neurotypical people, such as those with autism, from progressing to employment. This is because certain questions are not clearly defined to extract the KPIs which may candidates clearly have.", "Interview Questions": "Bearing in mind the person-centred approach, how best would you deliver a IPS service."}, {"date": "26 Jul 2022", "title": "Employment Adviser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Shaw Trust", "Interview Descriptions": "3 rounds of interviews, talked to two people who were really friendly and talkative. it was on okay interview- i think i do well with interviews so it wasnt difficult. Just show passion", "Interview Questions": "how would you handle a pressurized situation "}, {"date": "15 Jun 2022", "title": "Service Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Shaw Trust", "Interview Descriptions": "Competency based questions over zoom - an interview panel of around 3 candidates, very cold and uninviting. I have spoken to other people who have undergone this process and we are all somewhat okay/glad to not have the role", "Interview Questions": "Questions around success in a job"}, {"date": "28 Feb 2022", "title": "Contact Center Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Shaw Trust", "Interview Descriptions": "One interview - lovely people and more interested in getting to know you and seeing if you’re the right fit. HR ask for info prior, proof of right to work, ID etc so be aware of that", "Interview Questions": "What does safeguarding mean to you?"}, {"date": "9 Mar 2023", "title": "Criminal Justice Support Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Shaw Trust in Feb 2022", "Interview Descriptions": "I applied on indeed, then a few days/ week later I received an email scheduling me for a face to face interview. The location was the Hub activity centre. It was a nice pretty chill location. The staff were nice. They asked about 30 questions and ran through the company who they are and what they offer. However they did say they would get back to me by a specific time in which they never.", "Interview Questions": "What is safeguarding and who is responsible for safeguarding?"}, {"date": "3 Jan 2023", "title": "Online Coach Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Shaw Trust (London, England) in Jan 2022", "Interview Descriptions": "After the application process I was offered an interview which consisted of having to prepare a presentation on how to use Microsoft teams, to then present to 2 interviewers during a 2 part interview via Microsoft teams. This was followed by answering competency based questions.", "Interview Questions": "Tell us about a time you adapted coaching for someone."}, {"date": "29 Nov 2021", "title": "Careers Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Shaw Trust (Birmingham, England) in Nov 2021", "Interview Descriptions": "I applied for the role at The Prospect Group. However, I wasn't aware until after i accepted an interview they were now part of The Shaw Trust.\r\n\r\nThe two people who interviewed me were not enthusiastic at all and came across as though they didn't want to be conducting the interview. \r\n\r\nDespite doing research, I wasn't asked anything about the organisation. They went straight into questions about the role.\r\n\r\nWhen I asked about diversity within the company,  they seemed very reluctant to answer the question and kept saying \"I encourage diversity in my team\". I have had interviews where the company has been very comfortable telling you the ethnic diversity and gender diversity....This one doesn't.\r\n\r\nI also asked about work life balance and was told everything we do is for the client. Red flag. They clearly don't cater for the wellbeing of staff. Despite their own values saying so.\r\n\r\nI made my mind up then I wouldn't accept an offer if I was given one.", "Interview Questions": "What challenges do you think you would face in the role?"}], [{"date": "4 Oct 2021", "title": "Trainee Careers Adviser Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Shaw Trust", "Interview Descriptions": "Short telephone interview followed by a slightly longer interview with two people from Prospects. Very friendly and fairly straightforward questions, all directly related to the role itself. Very quick to get back with their final decision.", "Interview Questions": "Why are you changing career to this role?"}, {"date": "17 Aug 2021", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Shaw Trust", "Interview Descriptions": "Did a short exercise - reading scenarios and which ones I would prioritise.\n\nWas interviewed by two people who were very approachable and seemed friendly. Asked me why I would like the role and about teamwork.", "Interview Questions": "* Why would you like to work here?\n* What can you bring to the role?\n*How can would you promote the company?"}, {"date": "22 Aug 2021", "title": "Director of Policy Institute Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Shaw Trust in Aug 2021", "Interview Descriptions": "I enjoyed the process, I had an informal discussion with the hiring manager first, followed by a panel interview. It involved drafting an article for review as well. The questions were very fair, including a mix of behavioural and technical questions.", "Interview Questions": "How to account for social value"}, {"date": "1 Nov 2021", "title": "Employment Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Shaw Trust in Aug 2021", "Interview Descriptions": "5 min presentation of my CV then competency based questions. \nThe interview was for a panel of 2 people via microsoft teams. \nThey didn't bother to inform me that I was not successful.\n\nI tried to contact them to request feedback and I am still awaiting for feedback, which is poor considering the organisation is about helping people get in to employment.", "Interview Questions": "1.\tWhat does excellent customer service mean to you?  How would you apply this to your role?\n\n2. How do you build and maintain effective working relationships in your work?\n"}, {"date": "12 Jul 2021", "title": "Employment Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Shaw Trust in Jun 2021", "Interview Descriptions": "5 min presentation of my CV then competency based questions. Your answers are then marked and if you score high enough you may be offered the role. They do not tell you how the answers are scored and therefore it's difficult to answer in the exact format they are looking for, I perhaps thought that they were hoping for answers using the STAR method but they did not inform me before hand if that was the case- most employers would do this. \r\nThe interview was for a panel of 2 people via microsoft teams. One of the panel members seemed very disinterested which was off putting. \r\nThey didn't bother to inform me that I was not successful, I had to call and then had to request feedback which is poor considering the organisation is about helping people get in to employment. \r\nIn the feedback they said that I had spoken too much about helping people and not enough about meeting targets. I got the impression that they don't care much about their clients at all- I am very happy to not have received an offer of employment with them as I think it would be a horrible environment to work in.", "Interview Questions": "Describe a time where you had to consistently meet targets "}, {"date": "21 Mar 2021", "title": "Employment Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Shaw Trust (London, England) in Jan 2021", "Interview Descriptions": "Interview consisted of a 5 minute presentation based on your CV, a 10 minute role play based around the initial 1st contact between an EA and a client and several competency based questions", "Interview Questions": "What would you do to ensure you meet your end of month targets ?"}, {"date": "7 Dec 2020", "title": "Employment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Shaw Trust in Dec 2020", "Interview Descriptions": "10 minute phone call covering relevant skills and what you know about the company\r\n50 minute video call including an MS Teams 5 minute presentation on your CV and competency questions. \r\nInterview was remote with two people and everyone I spoke to was incredibly helpful and really positive - I was put at ease immediately.", "Interview Questions": "Give an example of team working\r\nExcellent customer service\r\nCase study example \"what would you do in this scenario\"\r\nWorking to targets"}, {"date": "11 Oct 2020", "title": "Employment Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Shaw Trust", "Interview Descriptions": "The interview was a straight forward competency based interview. I was however shocked that the feedback came from an automated HR 'noreply@' email address, with no option to seek further feedback. I have worked in recruitment for years, and it is the most basic rule - if someone has taken the time to interview for your role, you take the time to call them and provide constructive feedback. Time to review your processes I think.", "Interview Questions": "What can you tell us about the IPS process?"}, {"date": "27 Oct 2020", "title": "Employment Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Shaw Trust in Sept 2020", "Interview Descriptions": "Application process was pretty simple. Then called out of the blue for a telephone interview with zero time to prepare. Then panel based interview online that included a presentation on Teams with competency questions.", "Interview Questions": "Example of good customer service?\r\nWhat do you know about Shaw Trust?"}, {"date": "9 Jan 2022", "title": "TRAINING OPERATIONS Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Shaw Trust (London, England) in Feb 2020", "Interview Descriptions": "Long process for level of the job however nice people conducting the process. Included a really detailed test so the length of the main interview increased from about 1 hour to about 3 hours which wasn’t great when expected back at my actual job.", "Interview Questions": "How much experience do you have with Salesforce? "}], [{"date": "30 Oct 2019", "title": "Employment Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Shaw Trust (Hackney, England) in Oct 2019", "Interview Descriptions": "When I arrived, they took me to the interview room and told me I had 5-10 minutes to read a case study and they would then return (2 interviewees) to ask me questions about it.  Below the case study was a few  questions for me to think about and I was given paper and pen to write down any ideas. The case study was pretty straightforward and they wanted to know how I would support the client and what the next steps would be based on the case study I read. This was then followed by some competency based questions and HR questions.", "Interview Questions": "Q How would I work in a team? "}, {"date": "10 Aug 2019", "title": "Shaw Trust Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Shaw Trust (Birmingham, England) in Apr 2019", "Interview Descriptions": "Combination of Q&A/ Assessment and role-play scenario.  Conducted by two senior management and lasted approx 1 hour.  The overall experience was fine and found it less challenging than thought it would and unsure how experienced they are in this type of recruitment experience.", "Interview Questions": "Lots of How, What , Where Q&A's based mainly on working with folk who are not good with finding self-employment or have various emotional/ physical /mental issues.  How would cope with different sets of caseloads and cope with time mgt , etc"}, {"date": "13 Apr 2022", "title": "Digital Coach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Shaw Trust (London, England) in Jan 2019", "Interview Descriptions": "The interview was a two stage process. The first stage was an automated interview with limited time to record responses. The second stage was a presentation on the use of Microsoft teams to a panel of interviewers", "Interview Questions": "How would you go about building trust with a participant digitally?"}, {"date": "11 Apr 2018", "title": "Support Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Shaw Trust (Birmingham, England) in Mar 2018", "Interview Descriptions": "applied via online application with 5 competencies (1000 words each), heard back within 2 weeks and invited to interview. Interview was based in Birmingham and was for a large recruitment drive. Really friendly atmosphere, was running slightly late but had somewhere to sit and offered a drink. Interview was split into 3 parts:\r\n1. written assessment : this was do in the room with other applicants. You where given 30 minutes. Shaw Trust where very accommodating of my reasonable adjustments because of a disability. The assessment consistent of a scenario  regarding a client and their barriers to employments. the applicant had to write a number of personal goals, action points for the clients as well as identify what employability support they need and what additional support/referral you may do.\r\n2. Role play : this lasted 15 minutes and was timed, a interviewer acted the client while the other wrote notes. the interview read a script at the beginning for context. this was very relaxed\r\n3. formal interview: the interview consisted of 7 questions asked by the panel of 2, this again was quite relaxed and informal with added general conversation. All the questions asked where based around (if not the same) as the competencies on the initial application form.", "Interview Questions": "How do you apply commercial focus in the work that you do? "}, {"date": "24 Jan 2021", "title": "Job Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Shaw Trust (London, England) in Mar 2017", "Interview Descriptions": "Application and face to face interview. Once the application was sent, I received a call and invited to attend an interview. The interview was around an hour long with around 8 questions. I received a call within 3 hours of my interview with an acceptance offer", "Interview Questions": "Tell me about yourself? what is your interest in this role? What do you think are the skills needed to do this job? Do you have any retail experience? Are you available at the weekend? How will you travel to work? Do you have any regular commitments? "}, {"date": "10 Oct 2018", "title": "Mental Health Employment Adviser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Shaw Trust (Ashford, Kent, South East England, England) in Mar 2017", "Interview Descriptions": "I was transferred from another company, so I didn't have to interview for this role. However, I am aware of new starters that have gone for similar roles so I know a little bit about the sort of questions that get asked.", "Interview Questions": "New starters are asked about previous experience working with people who have mental health issues.\nManaging your own caseload of clients\nHitting targets\nPrevious employment support experience"}, {"date": "26 Jul 2017", "title": "EA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Shaw Trust (Birmingham, England) in Jan 2016", "Interview Descriptions": "Good interviewer who was skilled at interviewing. Was put at ease straight away so felt more relaxed to answer the questions that were put to me. Questions were not too hard as in the fact that they were not multi layered.", "Interview Questions": "Give an example of when you worked in a team"}, {"date": "4 Jun 2015", "title": "Jobseeker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 days. I interviewed at Shaw Trust (Gosport, England) in Feb 2015", "Interview Descriptions": "through Jobcentre application form, induction four days and into the IT suite to be trained and go into the Springboard course and then had mock interview with David Galloway, and then  Pre screen Business Administration interview training was given after 2 months with the charity Shaw Trust to prepare ourself for a business administration course", "Interview Questions": "What are your greatest strengths"}], [{"date": "4 May 2016", "title": "EEC Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Shaw Trust (London, England) in Apr 2014", "Interview Descriptions": "Interview, STAR based questions, 1 round obtained via agency, no second interview, only real issues was how hot the room was, \r\n\r\n2 people interviewing which I believe is standard for all Shaw Trust interviews, interviewers were very friendly and again it was apparent that they really wanted someone who would come in and do their best for the clients that they support, would empathise with them but also ensure that focus is maintained.\r\n\r\nOn the whole the process was pretty quick and the interview fairly comfortable.", "Interview Questions": "Lots of give me an example of questions,"}]]