[[{"date": "7 Jun 2019", "title": "Academic Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at East Bay Asian Youth Center", "Interview Descriptions": "There was an exercise in doing math and reading. I had to do a multiplication and dividing math worksheet. There was also a reading article that I had to read out loud and summarize.", "Interview Questions": "Why do you want to work here?"}, {"date": "31 Oct 2020", "title": "Academic Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at East Bay Asian Youth Center (Oakland, CA) in Jun 2019", "Interview Descriptions": "Three site directors will interview you at the same time. Questions are based on your reasoning for wanting to work in the field. Afterwards you’re asked to design a lesson plan and demonstration your math skills.", "Interview Questions": "Why do you want to work with kids?"}, {"date": "24 Aug 2015", "title": "Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at East Bay Asian Youth Center (Oakland, CA) in Aug 2015", "Interview Descriptions": "In order to be considered, you will need to apply through their website. The application that needs to be filled online was brief and short. The hiring process was very friendly and straightforward.  Overall, the interview was filled with smiles and laughter. I was very nervous until I met the hiring managers, overall the experience was great and even though I couldn’t answer all the questions at my best, I was still able to leave the room with a positive mind.", "Interview Questions": "What is the top three priorities working with youth?"}], []]