[[{"date": "13 Sept 2021", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DACCO in Sept 2021", "Interview Descriptions": "The recruiters talked about the company, the program and duties of the position. Asked scenario questions as well. Will ask about prior experience as well and are open to follow up questions", "Interview Questions": "Why are you interested in this position?"}, {"date": "3 Aug 2021", "title": "Lpn Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at DACCO", "Interview Descriptions": "They just asked questions about my past work experience really and since I had worked in corrections I believe they thought it a good fit. After that it switched to mainly when could I start.", "Interview Questions": "What jobs had I worked."}, {"date": "4 Feb 2021", "title": "Administrative Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DACCO (Lakeland, FL) in Jan 2021", "Interview Descriptions": "Received phone call for interview. After interview HR called for drug screen and background check. After two weeks background came back and was told what day the orientation would begin.", "Interview Questions": "Tell me about yourself. What are your strengths."}, {"date": "5 Sept 2020", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DACCO in Aug 2020", "Interview Descriptions": "There were two interviews. \r\nThe first call was an audio call, \r\nThe second call was a video call. \r\nI also had a final call with the HR department.\r\nTha total process was very smooth and the responded instantly if I had any questions.", "Interview Questions": "All the questions were related to resume and the basic questions about the position at DACCO"}, {"date": "15 Apr 2019", "title": "Outpatient Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at DACCO (Tampa, FL) in Mar 2019", "Interview Descriptions": "The interview process was good. There were two people interviewing me. They were extremely nice and were not that intimidating.  I felt that during my interview, DACCO would be a great place to work.", "Interview Questions": "Why do I want this job"}, {"date": "19 Nov 2017", "title": "Controller Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DACCO (Tampa, FL) in Nov 2017", "Interview Descriptions": "Well, I would say it is by far the worst experience I have had in interviewing.  I interviewed with the CFO and HR and the interview went well.  A lot of talk around the \"staff\" set in their ways and this role would need to change that in order to progress the position and company.  Fair enough, I felt good about the position in order to continue the conversation.  They knew my salary was higher than the posted position, but seemed to be flexible if the right candidate came through.  I few days later, I WAS OFFERED THE JOB VERBALLY. It was lower than what I am currently making, so we started to negotiate.  Biggest concerns were PTO, health insurance and salary.  They came back with a better salary offer (something that was above what I am currently  making - thanks), health insurance to start in 30 days (asked to get it to start on hire) and 18 PTO days (have twice as much currently).  It was very weird that I was VERBALLY OFFERED THE JOB even though I was told that the next round of interviews would be with the CEO.\r\n\r\nA few days go by without any continued conversation of my offer, and I then got a call by HR asking if I could meet with the CEO of the company?  Kind of thought this was weird because I was already offered the job, but OK be good to meet them as I was going to possibly work there (so I thought).  \r\n\r\nHad my interview with the CEO and it went well, felt we were on the same page. She even showed me my office!  I was surprised that she asked me what my salary expectations were. You would think she would know that especially after it was higher than the range.  We talked about the Glassdoor reviews and she was aware of them and it seemed like they were addressing them (even though the past CFO had issues with management).  It was also communicated that a lot of these reviews were from support staff and not the corporate staff.\r\n\r\nI left thinking that job was pretty much mine.  I did ask for compensation for COBRA should they not be able to start the insurance upon my first day.  She of course said \"we can work on that\".  I did not receive any correspondence for 5 days in which I called and emailed HR to see what was going on since THEY OFFERED ME THE JOB VERBALLY.  Still no response for almost a week.  Then I received an email stating they are working on a few things and would get back to me shortly.  Well, a few days go by and I get the canned response thanking me for my time and they have chosen not to continue our conversation!  Really? You offered the position, negotiated terms, did not follow the protocol of your hiring process, was told by the CEO this is where I will be sitting and you send that?  I am thankful that it did not work out. I would have gotten in there, noticed that the leadership is a complete joke and would be looking for a new job within 6 months!  Look at the reviews here on Glassdoor and take them to heart.", "Interview Questions": "How many years have you been practicing accounting"}, {"date": "25 Mar 2017", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DACCO", "Interview Descriptions": "Interview was fairly straightforward. I would recommend that H.R. become more familiar with the various universities in the nation, especially those not in the state of Florida. Provide details in terms of potential case loads expected to maintain. Inform applications of different professional development opportunities.", "Interview Questions": "General questions regarding education and experience. "}, {"date": "5 Nov 2016", "title": "Peer Support Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at DACCO (Tampa, FL) in Aug 2016", "Interview Descriptions": "(a) Submitted online application with a resume pertinent to the position be sought. (b) Submitted letter of interest to immediate supervisor per agency policy related to inter-agency transfer or promotion. (c) Interviewed by panel of two (2). Interview was performance based in nature", "Interview Questions": "Is Florida Certification Board certificate current?"}, {"date": "21 Sept 2015", "title": "Intake Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at DACCO (Tampa, FL) in Sept 2015", "Interview Descriptions": "I was interviewed  on the phone.   The interviewer identified herself as the director responsible for the particular program which was for juvenile delinquents.  She described the purpose of the program.  She inquired about my work experience and professional qualifications.  She also asked me about my ultimate professional goals in my field.  When I told her my salary expectations, she appeared to stop making inquiries and advised me that she would investigate other departments that had pending openings for  someone with my qualifications.  She advised me to apply for managerial and administrative positions because she believed that I had the qualifications.", "Interview Questions": "What kind of salary was I looking for?"}, {"date": "25 Jan 2014", "title": "Information Technology Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at DACCO (Nashville, TN) in Jun 2013", "Interview Descriptions": "I had 2 interviews with a panel of 3 - 4 people of ranging positions on the IT staff", "Interview Questions": "Where do you see yourself in 10 years."}], [{"date": "29 Sept 2014", "title": "Substance Abuse Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at DACCO (Tampa, FL) in Feb 2010", "Interview Descriptions": "I was interviewed by the program manager who is no longer with the agency.  It was an informative interview with honest and up front conversation.  My questions were answered and he was genuine and friendly.", "Interview Questions": "Honestly I can not recall.  It was over 5 years ago, but I do recall us discussing some possible struggles employees sometimes encounter, and my questions were addressed in a manner which made reassured me of my ability to competently do the job I was applying for."}]]