[[{"date": "10 Sept 2022", "title": "Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Fresno State", "Interview Descriptions": "Zoom interview due to COVID. Questions related to job duties. Interview went smoothly, committee was well spoken and asked questions. Time limit was given for each response.  Call back came from HR.", "Interview Questions": "How do you handle multiple tasks at once. "}, {"date": "14 Jan 2022", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Fresno State", "Interview Descriptions": "Cover letter, CV, performance links, teaching link\r\nZoom call, 20 minutes, 8 standard questions\r\nOn-campus, full day (30-min performance, masterclass, interviews with dean, chair, committee, faculty, and students)\r\n\r\nFees covered by school\r\nSchool seemed warm and friendly\r\nMore difficulty to navigate due to COVID world, but everyone was respectful and mindful", "Interview Questions": "How do you address diversity in chamber music?"}, {"date": "15 Sept 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Fresno State", "Interview Descriptions": "Initial application, phone screen, in person screen. Interviewed for the Foundation Financial Services department. The overall experience was unpleasant. The interviewers were late to bring me in and one seemed completely uninterested in engaging with me. Considering what I knew of the university, diversity seemed virtually nonexistent in that building. The energy wasn't very welcoming at all. I almost wish I would have declined the offer to interview initially.", "Interview Questions": "The usual behavioral questions. Not very conversational."}, {"date": "24 Apr 2021", "title": "Writing Center Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Fresno State", "Interview Descriptions": "Interviewed with direc and assist. Direct and two others. Casual lounge area. Was super nervous but felt a bit better after talking to them more! We discussed writing sample and what we would do to help the student.", "Interview Questions": "Tell me about who you are. Your writing experience."}, {"date": "9 Jun 2021", "title": "International Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fresno State (Fresno, CA) in Dec 2020", "Interview Descriptions": "It was over zoom. The interview process was very easy. All expectations you would have from the job were answered and you also get a distinct idea about what they would expect from you.", "Interview Questions": "What is the one thing that you think sets you apart from other candidates?"}, {"date": "15 Jan 2020", "title": "Tutor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Fresno State", "Interview Descriptions": "There were too many people were in the interview and I wasn't notified ahead of time it would be a group interview,  so I felt uncomfortable. They asked fairly standard questions.", "Interview Questions": "How have you handled a tough conversation."}, {"date": "22 May 2019", "title": "Library Media Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Fresno State (Fresno, CA)", "Interview Descriptions": "Submitted an application online. Took more than a  month to hear back from them and its about an in-person interview. The interview is great in general, read and get review whats in the job description because that's what they're going to ask you.", "Interview Questions": "Expertise on RDA, ALMA, OCLC, MARC, and AACR"}, {"date": "20 Dec 2020", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Fresno State (Fresno, CA) in Apr 2019", "Interview Descriptions": "Level one of interview in front of 5-6 people.\n Question asked very simple questions they just want to know better and what is the reason that you want to join VIP program for \nOnce they know you after two to three weeks you receive and email from the VIP team", "Interview Questions": "Past experience \nProblems encounter at work\nHow did you manage in the given situation"}, {"date": "19 Jun 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Fresno State (Fresno, CA) in Aug 2018", "Interview Descriptions": "I was casually asked to introduce myself and my area of interest in research .which helped them review me and my interest better so that they could analyse if I am the best fit for the position as research assistant .\r\n\r\nThank you", "Interview Questions": "N/A"}, {"date": "3 Dec 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Fresno State (Fresno, CA) in Jan 2018", "Interview Descriptions": "Previous Experience, working projects, about personalities, openness to learning new technologies, algorithmic test, attitude to initiate the ideas, leadership experience, any relavant experince to the requirements, willingness to work more, concerns towards pay and so on..", "Interview Questions": "Basics in programming"}], [{"date": "2 Dec 2017", "title": "Student IT Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Fresno State", "Interview Descriptions": "Applied online, was contacted via email to set up on an interview date. The in-person interview was held in the technology services meeting room, was asked basic IT and customer service questions.", "Interview Questions": "Tell me about a time when you had to deal with an irate customer. How did you handle the situation?"}, {"date": "4 Oct 2017", "title": "Post Award Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Fresno State", "Interview Descriptions": "Apply online or in person, but application is online. 1-2 interviews depending on how quickly they need to fill the position. The interview is in person and usually takes about 30 minutes.", "Interview Questions": "Asked questions in regards to time management, organization's role, and handling difficult situations."}, {"date": "21 Aug 2019", "title": "Finance Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Fresno State (Fresno, CA) in Oct 2017", "Interview Descriptions": "It was great and comfortable. These experiences have provided me with opportunities to utilize and strengthen my versatility within these environments. All the CSUF staff have been great. Through educational training and employment, I have gained valuable experiences in account management, financial systems and human resources duties. I have acquired strong interpersonal skills by working with diverse groups in both asynchronous face-to-face learning environments and the workplace.", "Interview Questions": "What is your past experience in Finance?"}, {"date": "13 Nov 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Fresno State (Fresno, CA) in Jan 2017", "Interview Descriptions": "They gave me a call as i volunteered for them for an event earlier on. They keep the information of volunteers on file for future reference. I volunteered and got a call as soon as the next position was opened up. It is not even important to apply if they know you are interested and if they know you volunteered previously.", "Interview Questions": "Talk about yourself? Why this job?  would you be able to manage work and studies together?"}, {"date": "29 Aug 2016", "title": "Administrative Support Assistant II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Fresno State (Fresno, CA) in Mar 2016", "Interview Descriptions": "Straight forward telephone interview, very slow process.  After you apply you get an automatic response and then you do not hear anything for thirty to sixty days.  Received a panel interview via telephone as one candidate could not do an in person interview.  Did not hear anything for another two months until I saw a name in the position I applied to.  Have never heard back from department that interviewed me or from Human Resources.", "Interview Questions": "Past Work experience"}, {"date": "11 Jul 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Fresno State (Fresno, CA) in Feb 2016", "Interview Descriptions": "three letter of recommendation, experiences in secretarial work or 5 years in an office setting, waited 1 week to hear back from them. They had to call my references in order to get an interview.  the overall experience was great  I learned what to expect from college interview tactics.", "Interview Questions": "What do you see yourself in 5 years"}, {"date": "1 Jul 2015", "title": "TA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Fresno State (Fresno, CA)", "Interview Descriptions": "Interview process was very strait forward.  Started with a phone screening via conference line with a number of professors in the biology department.  From there they had me answer a few questions as if I were in the role.  They followed up shortly there after with a timeline for orientation.", "Interview Questions": "What would you do if an employee tried hard but didn't get the grades to pass?"}, {"date": "3 Jun 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Fresno State (Fresno, CA) in May 2015", "Interview Descriptions": "As a Graduate Assistant I have to work on SAS and Access database. So during the interview process my knowledge of these technologies was tested and the interview process was very friendly.", "Interview Questions": "Apart form technical questions they asked how long will I be able to work for them."}, {"date": "24 Jan 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Fresno State (Fresno, CA) in Aug 2014", "Interview Descriptions": "transparency is their in interview process. It started at exact time and also finished before end time. First they check my education background. Then they ask few questions on my future planning.", "Interview Questions": "In mechanical filed which branch did you loved to work?"}, {"date": "28 Jan 2014", "title": "Administrative Support Coordinator I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at Fresno State (Fresno, CA)", "Interview Descriptions": "I applied online and was contacted by a department member for a face to face interview. It was a panel interview and then I met with two other people in charge of the department. The questions were pretty standard, asked about why you want the job. Then my references were contacted. But I didn't get an offer even though I pass the interviews and my background check, my qualifications match their requirements. It was a waste of time to go through it when the position doesn't seem to be available.", "Interview Questions": "Usual questions, tell me something about yourself? Where do you see yourself in 5 years? How do you stay organized? Scenario questions. "}], [{"date": "17 Jan 2017", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Fresno State (Fresno, CA) in Mar 2013", "Interview Descriptions": "It was good experience. The faculty and the search chair were very supportive and they asked good questions. After the initial phone interview, I was invited to an on campus interview.", "Interview Questions": "Research agenda"}, {"date": "8 Apr 2014", "title": "Administrative Support Coordinator I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Fresno State (Fresno, CA) in Mar 2010", "Interview Descriptions": "- Applied through the website. \r\n- Person that oversees me called me in for an interview\r\n- Went to interview. Was asked for references.\r\n- Was called and offered the position about a week later.\r\n\r\nIt was quick. I don't think my references were ever called upon", "Interview Questions": "None- all basic"}, {"date": "19 Dec 2013", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 6 months. I interviewed at Fresno State (Fresno, CA) in Feb 2009", "Interview Descriptions": "Submit job application, brief interview by Chair of department and another professor regarding areas of interest and basic competency, took a few months to receive job offer as opportunity to teach depends critically on department funding and approval by the next level (deans) and state budget.  Contract is contingent on enrollment and hence never final until after third class meeting as it can be voided due to insufficient enrollment.", "Interview Questions": "None as work of an instructor of beginning college level classes is considered easy, which most people with advanced degrees in a particular specialization should have little problem.  However, teaching philosophy and how a course is approach and organized are critical areas to be prepared ahead of time with thoughtful answers.  Often that may be the determining factor in whether one gets a part-time position."}]]