[[{"date": "12 Jun 2023", "title": "Deputy Chief of Staff Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Global Citizen (New York, NY) in Mar 2023", "Interview Descriptions": "There was an initial screening interview and then a second in-person interview. I didn't hear back from the second for almost 10 days with a informal end of interview process.", "Interview Questions": "What is your experience with building decks?"}, {"date": "30 May 2022", "title": "Content Creator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Global Citizen (London, England) in Apr 2022", "Interview Descriptions": "It is a very long process, it took 2 weeks after sending my application to being offered an initial interview and then another week before I was offered a second interview. Still have not heard back about whether I made it to the next round or not and it has been 2 weeks again.", "Interview Questions": "they asked the typical questions of how I would contribute to the company etc"}, {"date": "11 Mar 2022", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Global Citizen", "Interview Descriptions": "Relaxed and thorough. Interviewers we’re good at making you feel at ease so you could properly answer questions and they took their time to listen attentively. Very friendly culture all the way through", "Interview Questions": "What do see would be a challenge in the role"}, {"date": "11 Feb 2022", "title": "Event Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Global Citizen", "Interview Descriptions": "Following a lengthy application and several phone calls and emails an interview was offered over the phone before then securing an in person interview. Great team that supported the application process", "Interview Questions": "Describe a situation where you have navigated a difficult event experience"}, {"date": "27 Oct 2021", "title": "Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Global Citizen", "Interview Descriptions": "The materials required for the application were easy to gather. I had two phone screenings and one interview with the team members I would work with. The last step was to provide writing samples. Well organized process overall.", "Interview Questions": "How to deal with simultaneous tasks in a structured and efficient way"}, {"date": "25 Jan 2022", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Global Citizen (New York, NY) in Sept 2021", "Interview Descriptions": "Very smooth and very friendly interviewers. I felt welcomed. The questions were not too difficult. I asked plenty of questions at the end of the interview. After I finished the interview, I was excited to work there.", "Interview Questions": "Mostly about my previous experiences and some behavioral questions"}, {"date": "19 Jun 2021", "title": "Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Global Citizen", "Interview Descriptions": "Rigorous but compassionate. 2 to 3 people interviewed me at one time. Several rounds of interviews. Very relaxed style.  Everyone was really nice and all seemed open to follow up questions.", "Interview Questions": "Why do you want to work in the non profit world? What Are the issues important to you?"}], [{"date": "14 May 2021", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Global Citizen (New York, NY)", "Interview Descriptions": "3 interviews over a 3-week period, and then completely ghosted. I followed up 3 times but never heard back. Left a bad taste in my mouth because I put a lot of time and effort into preparing for the interviews.", "Interview Questions": "Why are you interested in Global Citizen?"}, {"date": "11 Apr 2021", "title": "Marketing & Partnerships Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Global Citizen (New York, NY) in Mar 2021", "Interview Descriptions": "Applied online. 1 interview with general HR / 1 zoom with hiring manager/ 1 zoom interview with 4 people / 1 zoom interview with senior team .\n\n6 week process.\n\nAfter my final interview - they ghosted me. Never heard back. \n\nMeaning I did not hear back from anyone even though I followed up 2 times.", "Interview Questions": "What would you do in the first 30 days, 60 days, 90 days? "}, {"date": "5 Jan 2022", "title": "Sr. Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Global Citizen in Mar 2021", "Interview Descriptions": "I found the process in depth, thoughtful, and detailed. They moved quickly but set up multiple rounds of conversation with a wide variety of employees/leaders and broad span of conversation.", "Interview Questions": "How to address work challenges."}, {"date": "29 Dec 2022", "title": "Digital Campaigner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Global Citizen (London, England) in Oct 2020", "Interview Descriptions": "The interview process was smooth. I went through three interviews. The first was very general with HR about general skills on organ action, time management etc. The second interview was with the team which was very nice and a more detailed questioning about experience and etc", "Interview Questions": "How do you manage your time? Please tell us your previous experience? How do you stay organised during stressful periods?"}, {"date": "15 Feb 2020", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Global Citizen in Nov 2019", "Interview Descriptions": "A HR lady reached out 3 days after I applied, scheduled a phone screen and two further Hangouts interviews. Held really good conversations; GC folks did a great job selling their org and 2020 plans. They told me next and final step was to meet the Country Chair (or vice). Things pretty much went downhill from there.\r\n\r\nHeard Country Chair wished to \"widen the pool\" and retained a consultant. Totally GC's prerogative, of course. But that also suggests an outsized reach for a Chair, a non-executive role. Or so I thought. Either way, it no longer was a job for me, and I didn't apply when the consultant, PwC, relaunched the competition. I was therefore surprised to get an email from PwC inviting me for an interview in a different city...in 48hrs. For me, the decision was to ignore or decline.\r\n\r\nThe approach wasn't ideal, perhaps more in tune with mass-recruting entry level staff. In my country, PwC's reputation in these matters appears well deserved. They would need to drag their recruitment processes to the 21st century, it would seem. \r\n\r\nGC's working to bring needed attention to poverty - an urgent goal. They have all my best wishes!", "Interview Questions": "The regulars relating to my past experience, my fit/motivation for the role and a few behavioural ones.\r\nI was uncomfortable about an early question about \"salary expectations\", but maybe that was a missed opportunity to discuss the salary range for the position. No use wasting everyone's time."}, {"date": "21 Jul 2019", "title": "Digital Communications Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Global Citizen", "Interview Descriptions": "Google hangouts for an initial interview (30 mins).\r\nIn-person Interview with colleagues (15 mins).\r\nPhone interview with the CEO (30 mins).\r\n\r\nVery easy going and leaning more towards cultural compatibility as opposed to technical skills and competencies.", "Interview Questions": "Tell me a bit about yourself?"}, {"date": "21 Mar 2022", "title": "Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Global Citizen (New York, NY) in Jul 2018", "Interview Descriptions": "I waited 20 minutes in the waiting room to be interviewed. When I finally met the person interviewing me, she didn't seem interested in me at all and only asked me a few questions. Waste of time.", "Interview Questions": "So, tell me about yourself?"}], [{"date": "6 Nov 2018", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Global Citizen (London, England) in May 2018", "Interview Descriptions": "40 minute interview with the community manager and the campaign manager. Friendly and welcoming atmosphere.  Many of the questions were abstract rather than based on my CV/ experience. Questions were outside the scope of the job description.", "Interview Questions": "what is the most pressing issue facing the world? What project over 2 years could help tackle it?"}, {"date": "21 Apr 2018", "title": "Senior Director, Business Development Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Global Citizen (New York, NY) in Jan 2018", "Interview Descriptions": "The interview process was very disorganized. I was called in for 3 interviews followed by them calling my references. And then left hanging completely. I followed up twice for the results of the process and never heard back.", "Interview Questions": "Consultant type questions. "}, {"date": "27 May 2017", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. I interviewed at Global Citizen (New York, NY)", "Interview Descriptions": "I was contacted by a recruiter who I had recently began to work with. She was almost positive that I'd get this role as I had the experience in a non-profit and running the administrative team. Turns out, that was probably my downfall. I was interviewed by the someone in management outside of the department for which the position was under. They made it obvious that they weren't very aware of the exact tasks and were just filling in for another manager who was away. The person who interviewed me had clearly never interviewed anyone prior or didn't care enough to prepare the right questions. I led the conversation (being that I interviewed candidates in my current role) and made sure to tell them everything that they would (and should) ask. They didn't ask much and seemed uninterested. Then they told me that I've done a lot but might be bored in the role. The recruiter was shocked and unhappy with the outcome and I think I wasn't given  a fair chance.", "Interview Questions": "He asked \"If you're in a good place with your boss, why leave?\""}, {"date": "27 Apr 2017", "title": "Intern Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Global Citizen (New York, NY) in Feb 2017", "Interview Descriptions": "Very unprofessional- The interview was about 10 minutes long. The woman didn't seem to take much interest in me or talking about the company. I had to follow up twice with them to hear the decision. I wish I did not come all the way to the city for nothing.", "Interview Questions": "Past experience, why I want the position, etc."}, {"date": "5 Sept 2016", "title": "Events Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Global Citizen", "Interview Descriptions": "GPP needs to have HR handle all interviewing and not allow managers, who are too young and undeserving to hold such titles, do so. I sent an application for the general internship position and specified that I wanted to be in events. The manager sent me an email a couple days later asking for a Skype interview - little did I know that this was not to be an interview but a game of \"How Long Can I Waste this Perspective Hires' Time.\"\r\n\r\nOur Skype call was rescheduled four times which although super annoying, isn't anything new, I get that people are busy and especially with the GC Festival coming up soon, it's safe to assume GPP's offices are crazy busy right now. What I find to be extremely rude and a bad representation of your organization is to schedule someone for an interview then as the call time approaches and passes you do not take the initiative to contact them ahead to reschedule or after to apologize. I had to send two followups before I received any kind of contact back, we rescheduled twice after but each time history repeated itself. I'm so lucky that I was speaking with other organizations and was made an offer that I immediately sent an email telling them I wasn't interested anymore.", "Interview Questions": "We never got to speak so I don't know what questions would've been asked - I'm assuming the usual \"what do you know about GPP? tell me a bit about your background.\" etc."}, {"date": "17 May 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Global Citizen (New York, NY) in Apr 2015", "Interview Descriptions": "Phone interview then in person interview where I spoke with 4 different individuals who were all from different positions at the company. I first spoke with one individual about my general interest in the position and the non-profit and then she set me up with introductions to others depending on my particular interests.", "Interview Questions": "How do your skills apply to this position?"}]]