[[{"date": "27 Jan 2023", "title": "Business Support Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University Settlement", "Interview Descriptions": "First interview is a phone screener with HR who was nice, but it was exhaustive for a first round. I was then told there would be an assignment and 3 more rounds. For a role that pays as little as 45k, that seemed unfair and cumbersome. But on top of all this, the next day after the first interview, I got an automated email the role was being put on hold. It felt like a waste of time and it feels like they had someone internal lined up and needed to use folks to conduct at least one round of external interviews.", "Interview Questions": "What is your experience writing technical documentation?"}, {"date": "2 May 2023", "title": "Social Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University Settlement in Nov 2022", "Interview Descriptions": "Phone interview with one supervisor. Questions were standard and easy. The position had good benefits package but lower than expected salary. Little space for salary negotiation. The position wasn't a good match. Overall an easy interview. Good for new graduates.", "Interview Questions": "Tell me about yourself. Why are you interested in working for this company? Tell me about your education. Why have you chosen this particular field?"}, {"date": "23 Sept 2022", "title": "Camp Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University Settlement", "Interview Descriptions": "Short and sweet. Enjoyed the time there. Great management and okay training. Could use more support  for the most part. The care for the kids is seen somewhat . I just wish things were different ", "Interview Questions": "Tell me about yourself and the usual?"}, {"date": "18 Jan 2023", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University Settlement in Jun 2021", "Interview Descriptions": "The recruiter was communicative and clear, shared salary and job spec without hesitation and my interview panel had great questions. Overall it was a good experience, I had more timing constraints than they did which tells me they were serious when they said the role was urgently needed.", "Interview Questions": "Asked about my personal values - that’s pretty uncommon in my experience"}, {"date": "16 May 2021", "title": "Lead Teacher Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University Settlement", "Interview Descriptions": "Gossipy and openly opinionated about other staff, unprofessional and very unclear about overall operations. Interviewer did not seem knowledgable about early childhood development.  High turn over and ongoing staffing changes.", "Interview Questions": "How do you handle difficult behaviors in the classroom?"}, {"date": "19 Feb 2021", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University Settlement (New York, NY) in Feb 2021", "Interview Descriptions": "I applied online and received multiple emails from different managers. We set up a phone screen and then an in-person interview. The phone screen was surface level and served to set up the interview. I received multiple emails from different managers again to set up an in-person interview. After emailing back and forth many times no interview ever took place. They simply stopped communicating. this is a highly unprofessional uncoordinated group of women. They really don't seem to know what they're doing. I don't feel like it's much of a loss because I would not want to work with people like them.", "Interview Questions": "do your staff like you"}, {"date": "25 Jan 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University Settlement", "Interview Descriptions": "The interview was 3 rounds along with a written  excercise. Each round you met with a member of the leadership team as well as other staff. All were extremely friendly.", "Interview Questions": "Describe how you management staff? "}, {"date": "13 Mar 2019", "title": "Family Ally Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University Settlement (New York, NY) in Mar 2019", "Interview Descriptions": "Group interview with minimal questions. People talked over each other, very hard to speak since they talked about personal encounters with former children.  Doesn't give a chance to people who want to enter this field.", "Interview Questions": "What activities would you do for a 5 year old with anger management issues. "}, {"date": "12 Feb 2022", "title": "Group Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University Settlement (Brooklyn, NY) in Dec 2018", "Interview Descriptions": "The interview process was great, I spoke one on one with the staff I worked directly under during the after school program. The atmosphere was positive and genuine, and the love and care for the youth was heart-warming.", "Interview Questions": "Why do you want to work with this company."}, {"date": "16 Dec 2018", "title": "Group Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University Settlement (New York, NY) in Sept 2017", "Interview Descriptions": "Ask questions about you. Your experience what you like what and how would you be a great addition to the team. Did two finger printing and bunch of paper work physical", "Interview Questions": "What was my favorite show to watch "}], [{"date": "22 Aug 2017", "title": "Billing Coding Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University Settlement (New York, NY) in Jul 2017", "Interview Descriptions": "i was asked what is my work habits did i do any work for the company in the past. explain it was an intern job without pay and they dont hire the interns", "Interview Questions": "who sent me and why do i want to intern at their company?"}, {"date": "19 Dec 2016", "title": "Human Resources Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University Settlement (New York, NY) in Dec 2016", "Interview Descriptions": "First you receive a phone interview, where they give you background on the company and go over basic questions regarding your experience. If they decide to go with you, you will receive a in person interview. Usually with the talent manager and an intern, and then within the week you will receive an email if they hired you.", "Interview Questions": "Tell me about yourself?"}, {"date": "12 Jun 2017", "title": "Program Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University Settlement (New York, NY) in Sept 2016", "Interview Descriptions": "Interview was quick and simple. Site Director asked if I ever worked with middle school students before and if I have experience planning events. Interviewer was direct and to the point.", "Interview Questions": " What would you do if a student began to act out in an activity?"}, {"date": "20 Jan 2016", "title": "Esol Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at University Settlement (New York, NY) in Jan 2016", "Interview Descriptions": "Casual, friendly, laid-back, but a little too much so. Realized that this was a fake interview in that they already had someone in mind. Interviewer seemed a little cocky, but at the same time unsure of himself because his qualifications differed from the candidate and couldn't really respond to the questions put to him.", "Interview Questions": "How would you use computers in the class?"}, {"date": "18 Jun 2015", "title": "Family/Child Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University Settlement (New York, NY) in May 2015", "Interview Descriptions": "Applied for the job late March, got a call from the recruiter mid-May. Went in for an interview late May. The interview was with two people, lasted about an hour asking about my experiences/qualifications. At the end they told me they were going through the first round of interviews and will definitely let me know the results. It's been almost a month and I have not heard from them.", "Interview Questions": "Asked about my experiences and educational background, my previous work experience and how it relates to this job."}, {"date": "30 Jul 2015", "title": "Group Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University Settlement (New York, NY) in Jul 2014", "Interview Descriptions": "Informa.l One on one. Interviewer was not intimidating - asked about what you expect from the job? what you can bring to the job?  What your past job experiences working with children have been? It was more like finding out if you were a good fit rather than examining what your credentials. The next step; gaining clearance was far more challenging.", "Interview Questions": "What makes you think that you are suited for working in this program?"}, {"date": "7 Jan 2010", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at University Settlement (New York, NY) in Dec 2009", "Interview Descriptions": "Recruiter did phone screen and first FTF interview\r\nBoard members in following interviews\r\nLooking for fit", "Interview Questions": "What about this job would be a challenge for you?"}]]