[[{"date": "13 Aug 2022", "title": "Assistant Test Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seminole State College of Florida", "Interview Descriptions": "Virtual interview with lots of questions, with some of them written on zoom slides to accommodate different learning and processing methods. I was asked to email 3 references after the interview to proceed further with the hiring process.", "Interview Questions": "Tell us about a time when you participated in relationship building between partners/clients/customers"}, {"date": "26 Jul 2022", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Seminole State College of Florida", "Interview Descriptions": "I had to take a math test (had 10 mins to complete test) to demonstrate math knowledge and also was asked typical star questions. Pretty easy interview and laid back.", "Interview Questions": "Tell me about a time when you had to work with a difficult customer. "}, {"date": "16 Aug 2020", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seminole State College of Florida", "Interview Descriptions": "Interesting and gave me a chance to respond to questions. It was not bad at all.\nIt took much preparation but turned out well in the end. I spoke to two individuals that had interview sheets also.", "Interview Questions": "You're interested in the job."}, {"date": "26 Sept 2017", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seminole State College of Florida (Altamonte Springs, FL) in Aug 2017", "Interview Descriptions": "Easy, low stress process.\r\nPhone call to set date and was hired on the spot.  Everyone was very friendly/welcoming and not intimidating. Follow-up with more employee information was immediate.", "Interview Questions": "Nothing really specific. More of a conversation to get to know you and your interest in the position "}, {"date": "19 Feb 2021", "title": "Athletics Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seminole State College of Florida (Sanford, FL) in Jun 2017", "Interview Descriptions": "Interviewed with Two committees over two days. After interviewing with both the hiring committee and the coaches committee I was given a tour. Also requires a writing test on topics related to the Athletics director position.", "Interview Questions": "How my past experiences will help with future challenges?"}, {"date": "9 Aug 2016", "title": "College Success Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seminole State College of Florida (Sanford, FL) in Jun 2016", "Interview Descriptions": "Called after 3 or 4 weeks of submitted application. Interview at which ever campus you applied. Also there was a 30-40 minute writing sample, based on the position. The interview was done by a search committee of 4 people in a classroom. They had a list of questions taped to the desk in front of me, and each person read through a question. They also asked about the possibility of working on a Saturday or after hours during the busy season.", "Interview Questions": "What does diversity mean to you?"}, {"date": "25 Jan 2018", "title": "Criminal Justice Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Seminole State College of Florida (Sanford, FL) in May 2015", "Interview Descriptions": "Panel Interview occurred with 2 males and one female in a closed room away from main office. They sat at a long table in front of me while I sat at a student desk facing them. The process was an  hour long and many questions were asked about my previous work history, skill sets, situational question/answers and interests..", "Interview Questions": "Why did you leave your prior job?"}, {"date": "29 Dec 2017", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Seminole State College of Florida (Sanford, FL) in Aug 2013", "Interview Descriptions": "I went in person and gave them my resume and they interviewed me on the spot. The faculty loved what i told them and were very happy to hire me.", "Interview Questions": "My skills and experience "}, {"date": "18 Oct 2016", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Seminole State College of Florida (Orlando, FL) in Jun 2012", "Interview Descriptions": "Horrible experience. HORRIBLE!!! The job I went to interview for was not the job they were actually interviewing FOR. How stupid is that, right???\r\n\r\nI was told to show up at a certain time for the interview. When I got there, some gal took me into this little room that was absolutely freezing and told me to take a seat. I was given the job description of the position I had applied for and told to read through it and sign the bottom of the third sheet. Fine. No biggie. I read through it and it looked pretty straightforward, and I signed it. The gal took my signed job description and said to \"wait right here and your interview will be in a few minutes\" - HAH!!!  Almost ONE HOUR LATER I was still waiting. I was just about ready to leave (since I had waited so long without seeing another living soul and I was so cold that I couldn't hardly stand it) when the same gal FINALLY appeared and ushered me into a room filled with people. The entire department seemed to be sitting around the long table, and they had snacks and sodas and such and all appeared to be having a great time at the interviewees expense I might add. It's always more fun to be the interviewer than the interviewee, that's for sure. For them it was party time -  for me I could just tell it was going to be a waste of time. Something about that entire group just didn't sit well with me. Anyway, they sat me at the head of a long table and started firing question after question for about an hour. I was even interviewed by the department IT guy (WTH!!!) who was analyzing me on my Excel skills, via 100 million questions. That guy was such a jerk. I had already made up my mind that I wasn't going to take the job even if it was offered to me, because everyone was just so rude. It was like talking to an entire room of people who had already decided they weren't going to like anyone. Anywhoo - the big problem for me was when they handed me the 3 page job description that I had signed. Someone had taken that job description for the job I had originally applied for and had crossed out almost all of the job duties in red ink. I was told the job now had different duties and I was instructed to look down at the bottom of the page to see the \"new job\" - between the time I signed it and the actual interview someone had written all the new job duties at the bottom of the page. WHAT???? Like how does that work????   I would have never applied for the \"new job\" as it was not something I was the least bit interested in. When I questioned why I had been told to read the job description and sign it, the entire group acted like I was completely out of line in asking this question. At that point I literally had utterly and completely made up my mind that there was no way in H.E.L.L. that I was taking the job even if it was handed to me on a silver platter. It was, without a doubt, the worst interview I have ever been on and it was a: Complete.Waste.Of.Time.  My advice to anyone interviewing at Seminole State College - make sure the job you are interviewing for is the one you ACTUALLY applied for. I have been told by other people that they love to do the old \"bait and switch\" tactic. Long story short, I went on to work for the University of Central Florida - and it not only has a much better reputation for worker satisfaction, but they are straight up with the fact that what you apply for is what you get!!!!", "Interview Questions": "What animal do you identify with?"}, {"date": "11 Apr 2015", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seminole State College of Florida (Sanford, FL) in Apr 2011", "Interview Descriptions": "Verbal Interview with search committee of 4, teaching demo with students, impromptu writing demo, and then the long wait for the offer call. It seemed like forever. Finally, HR called one afternoon with the job offer and I of course accepted.", "Interview Questions": "N/A"}]]