[[{"date": "7 Jul 2023", "title": "Strategy Consultant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "An initial screening interview followed by various case study interviews. The interviewers also allowed time to ask questions and describe my background in addition to the case. One case was a take-home case study, and the rest were given during the interview.", "Interview Questions": "Why are you interested in Strategy?"}, {"date": "6 Jul 2023", "title": "Certified Occupational Therapist Assistant (COTA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "The interview was straightforward and easy to schedule. There were four interviewers and all of them asked questions. The questions were standard interview questions. All of the interviewers expressed interest and demonstrated warmth.", "Interview Questions": "The first question I was asked was \"why do you think that you would be a good fit for this position?\""}, {"date": "26 Jun 2023", "title": "Critical Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Intermountain Health (Murray, UT)", "Interview Descriptions": "Super, Super Easy. Submitted an application online, and did a Zoom interview, few days later I got a job offer. Great company, easy process. Just a few immunizations then after a few weeks I was at orentation.", "Interview Questions": "What hours are you looking for a week?"}, {"date": "11 Jun 2023", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Intermountain Health (Provo, UT)", "Interview Descriptions": "Applied on Linkedin, received a call the next day to schedule an interview. The interview was 2-person and typical questions asked. No medical or skill-based questions. Very friendly. Received a call the next day with an offer and discuss salary.", "Interview Questions": "Why do you want to work here?"}, {"date": "5 Jul 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Intermountain Health in Jun 2023", "Interview Descriptions": "I was called within 48 hours of submitting my application and had a starting interview over the phone. The department manager was very nice and professional with good questions about my Nursing experience.", "Interview Questions": "If I am willing to relocate"}, {"date": "5 May 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Intermountain Health", "Interview Descriptions": "The initial phase was a pre-screening phone call with the recruiter, who was very pleasant. Next was the in-person panel interview with the unit’s Director, Manager, and 2 day charge nurses), which lasted approximately 45 minutes and was concluded with a tour. I was offered a position almost immediately. This was then followed by HR clearance.", "Interview Questions": "Describe a situation where you felt there was something wrong happening to a patient but you were meeting resistance in escalating care"}, {"date": "10 May 2023", "title": "Self-Pay Collections Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Broomfield, CO) in May 2023", "Interview Descriptions": "The interviewers were 5 minutes late to my interview that was only scheduled for 30 minutes. There were two people on the interview which was never discussed with me. The person I assumed I was interviewing with only asked me to give a little about myself and then asked a little about my experience. In my response I mentioned some personal details, to which the other person derailed the conversation and started a line of questioning about my personality, which I didn't think was appropriate. He asked me what I'm like. In that line of thought, he proceeded to tell me exactly what the company was about, which was making money (so, NOT healthcare--but then I knew that as soon as I discovered you took the word \"care\" out of your title). He proceeded to tell me to my face that my personality would be a problem because it's not in line with making money. He directly told me that Intermountain Health (not healthCARE), is for-profit company and the bottom line is about making money. It's bothersome that you business is NOT about healthcare. He then listed off several reasons why I was a red flag, in spite of my customer service experience. I assume it's because he believes I won't make money for the company. The interview went no further. Neither asked about the rest of my experience", "Interview Questions": "They asked me more about my personality. They didn't even care about my experience. They wanted to know if I'd make money as a priority or help people."}, {"date": "6 Apr 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health (Murray, UT)", "Interview Descriptions": "They asked relevant questions and gave me clear information about the job I applied for. They also gave me a tour of the unit and showed me around the facility and the staff.", "Interview Questions": "Among the values of IMC, what describes you the best?"}, {"date": "7 Mar 2023", "title": "Staff Occupational Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health", "Interview Descriptions": "First contacted for phone interview where I was able to both answer and ask questions in very friendly atmosphere. Flexible in timing and communicative. Interviewer was willing to answer wide breadth of questions though not always with as much detail as I had hoped, but I felt that was overall fair considering the uncertainties of the position (still needed to discuss position and my potential with rest of team). My timing was unique so interviewer also needed to factor that into decisions and discuss with team. Called to schedule second interview much later.", "Interview Questions": "(To clarify, received soft offer, but I was unable to fill position in timing that company needed.) Q: what is your dream setting within occupational therapy?"}, {"date": "7 Apr 2023", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health in Mar 2023", "Interview Descriptions": "Very unprofessional. A message was left on my phone to contact in regards to resume I submitted. I called and no response so left message. No response in 24 hours and so called back and reached contact. Suddenly it turned into a phone screen interview. I had no idea as that was not stated nor was an email sent stating a scheduled phone interview screen. This is important because I had about a 5 minute window when I called but had I known ahead it was a screen I would have set aside 30 minutes and been in my office. A question was asked about a skill in which I had not recently had to perform at previous positions but that I am capable of. The tone immediately changed and was told I would receive an email or call back within a week to schedule an interview, although she stammered in that. Nobody ever reached back out to schedule anything or say hey we chose another candidate. Poor reflection of this company and speaks to lack of organization and professionalism.", "Interview Questions": "Tell me about the patient experience in your last position."}], [{"date": "22 Jun 2023", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Intermountain Health (Broomfield, CO) in Mar 2023", "Interview Descriptions": "Sit in empty meeting waiting for manager to show, proceed to stare at yourself waiting for them. Proceed to follow up and hear nothing. Recruiter said he would reschedule but is clearly just looking for pipeline fodder.", "Interview Questions": "N/A"}, {"date": "27 Feb 2023", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health", "Interview Descriptions": "Initial meeting with HR, followed by an in person interview by the team I was joining. The interview consisted of fairly standard interview questions. Nothing too out of the ordinary. A good conversation ensued about what they were trying to accomplish and how I could help in that endeavor.", "Interview Questions": "Summarize how you would going about collecting requirements for a healthcare product."}, {"date": "7 Feb 2023", "title": "ICU Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Intermountain Health in Feb 2023", "Interview Descriptions": "Interview was pretty straight forward. Asked 5 commons nursing interview questions. The recruiter was nice and pleasant and told me about the unit and what made them stand out from the rest", "Interview Questions": "Asked basic questions like tell me about yourself, why you wanted to become a nurse, a time you got into conflict with some. Etc. only 5 questions"}, {"date": "13 May 2023", "title": "Investment Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Intermountain Health (Salt Lake City, UT) in Feb 2023", "Interview Descriptions": "I found this position on LinkedIn, and I submitted my application through their official website, and after a few days, I got an invitation for a Hirevue interview. There were 5-6 questions.", "Interview Questions": "Tell me a time when your greatest strength helped your team to be successful."}, {"date": "29 Jan 2023", "title": "Cook Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Orem, UT)", "Interview Descriptions": "Pretty basic interview. The person doing the interview was super nice. The interview also felt like a conversation instead of an interview, Which was pretty nice. It took a lot of the stress off of the interview process.", "Interview Questions": "What skills do you have that will help you excel in this position"}, {"date": "17 Jan 2023", "title": "Orders Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "Questions were provided prior to the interview for review. Had first interview with manager. Then second interview with other team members. Everyone was super welcoming and friendly. Had great discussion and conversation regarding the position.", "Interview Questions": "Why do I want to leave my current position"}, {"date": "14 Dec 2022", "title": "Patient Services Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "The interview was with a supervisor and another PSR. The interview consisted of standard interview questions such as strengths/weaknesses, etc. They asked about availability and comfort level with different software. There were a few scheduling specific questions as well.", "Interview Questions": "How would you respond to a request for an urgent appointment?"}, {"date": "4 Dec 2022", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "Did not even get an interview, after applying just didn't even respond about my application, and just said they were moving with someone else. It was a bit disheartening, because I did not even get the chance to interview.", "Interview Questions": "I did not even get to do an interview."}, {"date": "5 Dec 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "Quick, question/answer process. Video chat first with manager. Basic interview questions. What would you do in certain situations, etc. experience and background questions. Strengths/weaknesses. Challenges and opportunities. 10-12 questions. How long do you plan to be with the company. Life goals", "Interview Questions": "What would you do in a difficult situation"}, {"date": "6 Dec 2022", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "Manager was very thorough and considerate about my understanding of the position and qualifications they were seeking. Kept an ongoing conversation and expressed my abilities in detail and they further asked questions to add on. Were all ears and very mindful of my responses.", "Interview Questions": "What would you bring to the table if you were hired?"}], [{"date": "5 Dec 2022", "title": "Emergency Department RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "Interviewed with recruiter. Straightforward experience and behavioral questions: -Name a time you went above and beyond for your patients? -Why do you want to work in the ED? -What are some skills that is valuable in the ED?", "Interview Questions": "N/A"}, {"date": "17 Nov 2022", "title": "Lead Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Intermountain Health", "Interview Descriptions": "easy, quick hire process, quick onboarding and training for the position. overall great place to start a career for anyone starting a career in healthcare or to work longterm. simple interview with manager, and final approval interview with clinic manager.", "Interview Questions": "if I was going back to school or not?"}, {"date": "6 Jan 2023", "title": "Practice Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Intermountain Health (Provo, UT) in Nov 2022", "Interview Descriptions": "Overall the interview process went well. The first interview was virtual. Got a call within 4 days for the second interview. I wished I met the whole team in my second interview.", "Interview Questions": "Introduce yourself and tell me why you are interested in this position? How do I deal with difficult situations with people?"}, {"date": "23 Oct 2022", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "Zoom interview with the manager. Took just about an hour to complete. Talked about the unit as well as expectations if offered the job. Was able to ask questions about the unit and schedule. Also talked about the team I would be working with.", "Interview Questions": "What made me choose healthcare"}, {"date": "17 Oct 2022", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Intermountain Health in Oct 2022", "Interview Descriptions": "I was interviewed by my direct manager initially. Once the candidates were narrowed down the second round was spent interviewing with the rest of the teams I would have direct contact with on a day-to-day basis.", "Interview Questions": "The initial interview focused on behavioral questions. The second round focused more on hard skills"}, {"date": "2 Sept 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health", "Interview Descriptions": "Applied online. A recruiter was very prompt and professional. I had the first round scheduled very quickly (1 week). The second round took 2 weeks to schedule. Both interviews were very good. The people were very warm and welcoming.\nMy frustration came after the second & final interview. I was told I would be informed of the decision in 1-2 weeks. Over 2 weeks went by and I sent a follow up email. I was then told I would be informed at the beginning of the next week. I followed up again two weeks after that follow up and did not receive a response. I received an automated email a week after my 2nd follow up saying I did not receive the role. I did not hear if I was still being considered for the role for 5 weeks after the final interview. I then reached out for feedback on my interview and no one ever reached back out. The people of Intermountain see very nice, but the interview experience after the interview was not great.", "Interview Questions": "What are some personal metrics you use to measure your success?"}, {"date": "17 Aug 2022", "title": "CI (Continuous Improvement) Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "Interview process was good at first. 'Tell me about a time' type questions. Presented Continuous Improvement tools. It included the whole team and they seemed nice. The process was good until the end. They were not sure who or what they wanted fo r the role.", "Interview Questions": "Tell me about a time' type questions."}, {"date": "3 Aug 2022", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Intermountain Health", "Interview Descriptions": "One video interview submission, two main rounds with up to 6 people, and three reference checks. Took turns asking questions. Very nice people who like their jobs and take time to get to know you.", "Interview Questions": "Why did you choose to apply at this company?"}, {"date": "19 Sept 2022", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Intermountain Health (Salt Lake City, UT) in Aug 2022", "Interview Descriptions": "Group interview. You and 3-5 supervisors/managers asking questions. Average interview questions, some relating to de-escalation, who you are and where you have worked before. Each person takes a question on the paper they read from to ask you. ", "Interview Questions": "Why should we hire you over other applicants?"}, {"date": "25 Sept 2022", "title": "EAP Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Intermountain Health (West Valley City, UT) in Jul 2022", "Interview Descriptions": "It was a zoom meeting and we it was a hassle to deal with. They didn’t send the link until 10 minutes after the scheduled time. And they were in interested in the comments I had", "Interview Questions": "How are you with managing time"}], [{"date": "15 Aug 2022", "title": "Diagnostic Radiologic Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Denver, CO) in Jul 2022", "Interview Descriptions": "two person interview   neither showed personality.   least friendly interview I had ever had.  Not sure what is going on there but with the majority of the tech being within two years of school  there has been some turnover.", "Interview Questions": "Tell us a little bit about yourself"}, {"date": "11 Jun 2022", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health", "Interview Descriptions": "Applied online.  \nGot a prompt to perform an automated hirevue interview.  \nEventually got a phone call scheduling a mid-week phone call.  Two days before, they dropped a programming assignment, saying we want you to complete this in time for your interview, we expect it to take eight hours (the implication being: \"we expect you to drop everything to complete this\").  The task is simple enough, but riddled with intentional typos.  I came to my senses, and realized how ridiculous this was and withdrew my application.\n\nOverall, it felt more like a hazing ritual, i.e. you must jump through hoops to demonstrate you are sufficiently invested.  It did not feel like both parties were feeling each other out.  The few times I did interact with a person, it was to schedule anything.\nAt no point did I have the opportunity to ask questions about the role, nor did anyone actually go to the effort of talking to me apart from assigning work.", "Interview Questions": "Please, complete this task in two (week) days.  We expect it will take 8 hours."}, {"date": "20 Jul 2022", "title": "Senior Accountant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Intermountain Health (Fort Collins, CO) in Jun 2022", "Interview Descriptions": "Contacted by HR, screening interview with HR, remote interview one hour long with two individuals.   I thought it went fairly well .  I sent a thank you note.  Was never contacted again to give me status.", "Interview Questions": "What is an opportunity for you to improve"}, {"date": "1 May 2022", "title": "Scrub Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "Very relaxed feel, management was a pleasure to deal with. Easy to talk with and even easier to understand expectations. They lay out what they want to see and how they expect it to be done.", "Interview Questions": "Where I saw my self in 5 years."}, {"date": "25 May 2022", "title": "Business Analyst Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Intermountain Health (Croton-on-Hudson, NY) in May 2022", "Interview Descriptions": "Pre-recorded video interview 5 minutes. You have 6 days to prepare for it. You will be asked to respond to questions on video. You will be given 2 attempts to record your audio response.", "Interview Questions": "Explain why your background and experience would be a good fit for this job."}, {"date": "16 Apr 2022", "title": "Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "I submitted an application online. I was contacted about a week later to schedule an interview with the hiring team, which lasted an hour. After that, there was another panel interview. The process took 3-4 weeks.", "Interview Questions": "Tell me about your experience working with teams."}, {"date": "10 Mar 2022", "title": "Data Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Intermountain Health", "Interview Descriptions": "The first interview with the analytics team and many of the individuals that were in the same role. Then the second interview was with the management team to get an idea of how I would like to grow.", "Interview Questions": "What sort of projects would you be interested in contributing to?"}, {"date": "8 Mar 2022", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "Easy very very very easy. Friendly and nice. Knew quickly if I got the position. Communication with them was great. Very professional and courteous . Highly recommend interviewing with them", "Interview Questions": "How long I’ve been a nurse"}, {"date": "17 Mar 2022", "title": "Director of Operations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Las Vegas, NV) in Mar 2022", "Interview Descriptions": "Full day of on-site interviews.  Interviews ranged from Chief Operating Officer to Front Line Managers.  Wonderful opportunity to learn the full operations and expectations of the position and amazing culture.", "Interview Questions": "How would you breakdown existing silos?"}, {"date": "17 Jan 2023", "title": "Investments Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Mar 2022", "Interview Descriptions": "Lots of relatively short interviews with different members of the team. Pretty even mix of fit/culture/get-to-know-you questions and more technical questions. They also made sure to leave quite a bit of time for applicant questions - unusual in such a short conversation.", "Interview Questions": "What are some market conditions that work for or against consolidation in the healthcare revenue cycle industry?"}], [{"date": "19 Apr 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health in Mar 2022", "Interview Descriptions": "Applied 3/15\r\nInterviewed 3/29\r\nNever heard back from recruiter & hiring managers. Was told to email them if I didn’t hear back within 1-2 weeks and emailed on the 3rd week and never got a response", "Interview Questions": "Tell me about yourself?\r\nWhat can you bring to this unit?"}, {"date": "1 Apr 2022", "title": "Certified Phlebotomist Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Intermountain Health (Salt Lake City, UT) in Mar 2022", "Interview Descriptions": "The process of the interview was great. The hiring Manager, and Supervisors was very nice and it made it so easier for me to be able to do well in my job interview. Hope to soon get a great offer! Just waiting for the official offer.", "Interview Questions": "Give a previous scenario or experiences in the past from a conflict, stressful, and/or an example of leadership."}, {"date": "4 Apr 2022", "title": "RN Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health in Mar 2022", "Interview Descriptions": "Very thorough. It was a 4 person interview. They asked the typical interview questions, but also do case studies to see what you would do in particular cases. It was friendly.", "Interview Questions": "What makes you a good candidate for the job "}, {"date": "9 Feb 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "Formal interview process with full team. It was a pretty standard interview and standard questions. You need to provide three references at the end of the interview. Organized interview and easy to work with recruiting department.", "Interview Questions": "Tell us about yourself? Why do you want to work here? How will this further your career goals? "}, {"date": "17 Mar 2022", "title": "ICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Intermountain Health (Murray, UT) in Feb 2022", "Interview Descriptions": "Met with the manager on the unit and we had an interview with the classic nursing interview questions. It lasted around 20-30 minutes. At the end of the interview I was able to ask questions", "Interview Questions": "Tell us about a time you prioritized a certain patient and why."}, {"date": "29 Jan 2022", "title": "Healthcare Administrative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Intermountain Health", "Interview Descriptions": "There were 2 sets of interviews. The first one was a recorded interview and the second interview was a panel of 5 executives. They took over a month from 1 to 2 interview", "Interview Questions": "First Question: Tell me about yourself?"}, {"date": "20 Jan 2022", "title": "IT Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Intermountain Health", "Interview Descriptions": "-First had a phone screening where they gaged my interest and briefly went over resume\r\n- met with a panel of managers in my future apartment where they asked a variety of leadership and technical questions.", "Interview Questions": "Describe a time where you went above and beyond at work or in a class project?"}, {"date": "25 Jan 2022", "title": "Senior Data Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Intermountain Health in Jan 2022", "Interview Descriptions": "This was an extremely poorly conducted interview. The interview had a very unprofessional tone from the beginning and it only got worse as things progressed. Questions were repeated and it was apparent that members of the panel were not actually paying attention.  I have always had a deep respect for Intermountain Healthcare, but this interview reflects poorly on the entire organization.  I have not yet heard back, but even if offered a job, I would not accept. This is not the kind of high-performance team that I would want to join.", "Interview Questions": "One extremely poorly worded question was to explain the best practices around using logistic regression."}, {"date": "11 Feb 2022", "title": "Assessment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Intermountain Health (Denver, CO) in Jan 2022", "Interview Descriptions": "The interview was with Program Director, she was very efficient and detailed in what they were looking for, was personable as well. She got to know me as a person, and as a professional s appeared  authentic in her approach with me.", "Interview Questions": "What can You Bring to the Organization?"}, {"date": "28 Oct 2022", "title": "Data Science Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Salt Lake City, UT) in Jan 2022", "Interview Descriptions": "Had a screen phone interview with a Recruiter, then a second phone call with a data scientist, and finished with a project that they gave me 2 days to complete.", "Interview Questions": "Tell me about project X on your resume. They then asked other probing questions about the project to better understand my ownership of it."}], [{"date": "12 Dec 2021", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "Spoke to HR for a phone screen then spoke to a director. Third interview was with a group of directors.\n\nI was told to wait a week to hear back after interviews were done. \n\nI was ghosted by SCL and eventually had to track down HR after my follow up to the search lead was ignored. Once that was done I was promptly sent a templated rejection email.", "Interview Questions": "What are your first steps for taking on a new project?"}, {"date": "5 Nov 2022", "title": "Cybersecurity Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (West Valley City, UT) in Dec 2021", "Interview Descriptions": "The interview process is pretty simple and usually involves 2 stages: 1.) Q/A video interview OR interview with hiring manager 2.) Group interview with 2-3 people The questions that were asked were a mix of the standard behavioral and basic security concepts. Overall, it was a relaxed experience.", "Interview Questions": "Give an example of a time when you had to explain something fairly complex or technical to a frustrated colleague/customer. How did you handle this situation?"}, {"date": "21 Jan 2022", "title": "Executive Project Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Dec 2021", "Interview Descriptions": "HireVue interview followed by a panel interview with team and hiring manager. 30 minute interview: 25 minutes questions from company and 5 minutes to ask questions. This duration is too short to determine fit for hire.", "Interview Questions": "Describe a situation when you had to handle multiple pressing issues at once, or multiple projects' needs at once."}, {"date": "7 Jan 2022", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health in Dec 2021", "Interview Descriptions": "I applied for my resume on the website and I got a phone call from an employer to get an interview.  She decided to do the interview date and time.", "Interview Questions": "Tell me about yourself\nWhy do you want to join our healthcare team?\nHow can you overcome your difficulties?"}, {"date": "18 Jan 2022", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 months. I interviewed at Intermountain Health (Salt Lake City, UT) in Nov 2021", "Interview Descriptions": "Good interview process. Probing follow-up questions and about 4-5 interviewers. The questions were related to the job I was applying for. I was also given the day before the interview and asked to come prepared to discuss. Again, this scenario was directly related to the job. One critique would be the amount of time from applying to being offered the position. I applied in August, didn't have my first interview until November, went through a few rounds of interviews, then was offered the position mid-December. That is a very long process.", "Interview Questions": "How my previous experience related to the role I was applying for."}, {"date": "3 Nov 2021", "title": "Office Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "I had an initial interview with the manager, department director, business analyst, and nursing accreditation manager. The second interview was the same groups with the two medical directors included. Most of the questions were repeated from the first to the second interview.", "Interview Questions": "If you could be any animal what would you choose and why?"}, {"date": "5 Dec 2021", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 days. I interviewed at Intermountain Health in Nov 2021", "Interview Descriptions": "Video interview with 4 managers. They were not sent my resume from my recruiter. I was told I would hear back within the next two days. I never heard back from the recruiter or hiring managers, it’s been over 2 weeks.", "Interview Questions": "“What do you bring to the unit?”\n“What are you looking for in a unit?”"}, {"date": "29 Oct 2021", "title": "Exercise Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "General background, speciality trainings, some unique questions about specific issues that may come up with clients needs, strength training, neuro-muscular control.  Overall, very kind people and thoughtful.  I was met by three people in the interview.", "Interview Questions": "Nothing to share on this topic"}, {"date": "13 Oct 2021", "title": "Customer Service Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Intermountain Health (Salt Lake City, UT) in Oct 2021", "Interview Descriptions": "The interview is average hot seat questions. Think about your previous positions as they will ask for specifics. Average rapid-fire questions that will make you feel kind of nervous. Try to prepare beforehand as much as possible and you will do well.", "Interview Questions": "Tell us about a time you had to work with someone difficult."}, {"date": "12 Oct 2021", "title": "Security Officer PRN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Billings, MT) in Sept 2021", "Interview Descriptions": "Applied online and was contacted by a recruiter who did a very brief conversation regarding my background and qualifications.\n\nScheduled a phone interview with department manager  - Spoke with department manager for approx. 35 min over the phone regarding my back ground and qualifications. Asked a few questions regarding the fact that the position was PRN and asked about Full time options in the future - was informed that I would need to apply if and when a full time position became available.", "Interview Questions": "Why are you interested in working within the security department at SCL Health "}], [{"date": "9 Jun 2022", "title": "RN Emergency Department Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Ogden, UT) in Aug 2021", "Interview Descriptions": "The interview process was conducted virtually, and I was not expecting that. The interviewers were all nice and asked pertinent questions to the job and not random questions to throw you off. The process was smooth, and the staff and recruiters responded in a timely manner.", "Interview Questions": "Explain a situation where you had conflict in your workplace. How did you resolve this?"}, {"date": "5 Aug 2021", "title": "Director of Architecture Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Intermountain Health (New York, NY) in Jul 2021", "Interview Descriptions": "The night before the interview a recruiter emailed me some “interview prep” material. I reviewed it the next morning and found three “cases” which were just vague descriptions of their company processes and products and how I would improve them.\r\nThe interview kicked off and without showing any interest in knowing more about me or telling me more about their company they wanted me to do a presentation based on almost no information provided. My assumption was that my ability to get the details from them would be part of the test but, no, the more questions I asked, the more they seemed to feel I wasn’t understanding the point of what of what I was being tested on. They wanted a show they could critique.\r\nAnd that’s really the problem here - it wasn’t an interview it was a test. It wasn’t respectful, it wasn’t human or even good business. It was just a way to see what kind of show I could give.\r\nI work in machine learning and healthcare with a very large company and have been in many interviews of which I can’t think of a single one where the people and the format was this annoying and disrespectful.\r\nIt’s a good thing though, as we parted ways five minutes in. This must a godawful place to work if that’s how they treat people. Good riddance.", "Interview Questions": "How long can you bu11$shit for us based on vague information? Don’t ask questions, we want to do the scrutinizing."}, {"date": "2 Jul 2021", "title": "Med Tech - Micro Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Intermountain Health", "Interview Descriptions": "Phone call to set up a virtual interview. Some people were on video, others just audio on the phone. They gave an exact date of when to expect a response either way.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "4 Aug 2021", "title": "RN Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Intermountain Health in Jul 2021", "Interview Descriptions": "It was a nice interview, and very professionally conducted. They actually matched me up to a position that I was better suited then what I applied for.  That went well, though I received a rejection letter before I went in that came in error.  They were still learning their new software. It was an understandable mistake but I almost didn’t come in because of it.", "Interview Questions": "Why are you leaving your current position?"}, {"date": "24 Jul 2021", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Intermountain Health (Denver, CO) in Jul 2021", "Interview Descriptions": "3 Interviews, one with my prospective manager, one with my future team, and one with teams I would work with. Ultimately my manager coworkers were the ones to decide whether I could work with them, which I thought was extremely cool. \n\nThe questions were relatively softballs, though I was a little overqualified for the position, so I'm sure some technical questions were skipped since I clearly knew them. However, as a theme, be prepared to talk about how you work collaboratively, and focus on teamwork. \n\nVery friendly people - I can't wait to start working with them!", "Interview Questions": "What steps do you take when you encounter an issue"}, {"date": "18 Jun 2021", "title": "Meh Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "Human resources and recruitment staff were being outsourced at it showed. \r\nPoor overall experience.  Did not seem like their treatment of the staff aligns with their purported vision.  Felt bad for recruiting staff who were trying to recruit me while knowing that they might be laid off.", "Interview Questions": "Clinical questions-which I’ve never been asked before. "}, {"date": "5 Jun 2021", "title": "Continuous Improvement Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "VUE Interview - 5 questions and very structured to filter out applicants and interviewees.\nVirtual Interview - led by the recruitment team and others who may or may not be on the team.", "Interview Questions": "What qualifications related to the job posting do you have?"}, {"date": "16 Jun 2021", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Intermountain Health (Lafayette, CO) in Jun 2021", "Interview Descriptions": "6/7/21 - Applied for position\r\n6/10/21 - Phone call interview with recruiter\r\n6/11/21 - Virtual Interview\r\n6/15/21 - Offer Accepted\r\n7/6/21 - Onboarding\r\n\r\nInterview went very well. Important thing is to be ready for it. It be easy if you be ready for it. Know possible questions that will be asked that can be found on SCL Health website. Brought few professional examples to support answers on the questions. HR been positive and professional, so was I.", "Interview Questions": "Tell about yourself?\r\nWhat makes you want to apply for us?\r\nDescribe challenging situation you dealt with at work and how it turned out?\r\nYou have noticed person you talking with don't listen, describe the way you get their attention?"}, {"date": "28 May 2021", "title": "Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Murray, UT) in May 2021", "Interview Descriptions": "The interview process was very organized and has purpose. It didn't feel like a run-of-the-mill interview. They asked pertinent questions and had thorough answers for my questions. They were very friendly and were involved with the conversation instead of seemingly just asking questions and recording my answers.", "Interview Questions": "They asked me clinical scenario questions with varying patient demographics and level of acuity."}, {"date": "6 Apr 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Intermountain Health (Wheat Ridge, CO) in May 2021", "Interview Descriptions": "Easy, met with the manager over zoom. This position was for an entry level RN so the questions were mostly based on my personality and how I would respond in stressful situations.", "Interview Questions": "How would you handle working with a difficult coworker?"}], [{"date": "8 Apr 2021", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Salt Lake City, UT)", "Interview Descriptions": "Standard interview\r\n3 stage - \r\nPhone Interview, \r\nMeeting #1, \r\nMeeting #2 + 45 minute Excel Test (pivot tables, index match, vlookup) Basic SQL test (select, from, where)\r\nReally want to understand your previous work experience, know how to articulate your stories.\r\n\r\nThe company has started to really want financial analyst to understand the basics of SQL, you will use it on the job.", "Interview Questions": "Time you had to deliver bad news and how you handled it.\r\nWhy Intermountain? What do you know about the company?\r\n\r\n"}, {"date": "6 Apr 2021", "title": "Process Improvement Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Grand Junction, CO)", "Interview Descriptions": "Applied to job online \r\nInterview with HR, about 10-15 minutes\r\nPhone interview with hiring manager, about 10-15 minutes\r\nVideo interview with hiring manager and co-worker, about 25-30 minutes\r\nWait for to hear back from SCL Health", "Interview Questions": "Do you like to work focus on one big project or several smaller projects?"}, {"date": "30 Mar 2021", "title": "Patient Care Technician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "Interview is online (covid) but not live with another person. They ask questions, you record yourself giving the answer and submit the videos. A little weird, I'd much rather interview with a live person.", "Interview Questions": "Tell us a time you worked under pressure"}, {"date": "18 Mar 2021", "title": "Physiatrist, Physician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "Organized, very nice people! Multiple interviews over the course of a couple hours.  Started with the chief, met with HR, then group interview with the practice admin and current providers.", "Interview Questions": "Something in residency that I'm proud of"}, {"date": "16 Mar 2021", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "Was given a technical SQL test. After this was asked to come in and interview with a few team members. Friendly team, overall positive experience. Accepted a position with a different company before a final interview.", "Interview Questions": "What coding experience do you have? What do you know about our team and its role?"}, {"date": "6 Mar 2021", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "The people were very kind and patient! They all shared eye contact with me and remained professional. I feel like they took me seriously while we were all able to share some smiles and laughs!", "Interview Questions": "Why do you think you would be a good fit for this job?"}, {"date": "15 Oct 2022", "title": "Quality Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Broomfield, CO) in Mar 2021", "Interview Descriptions": "One half hour interview with hiring manager and then a hour follow up with team. Very simple and professional process. HR was also very responsive with contacting me shortly after with an offer, and with follow up onboarding steps.", "Interview Questions": "What was challenging about your last job."}, {"date": "29 Mar 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Salt Lake City, UT) in Mar 2021", "Interview Descriptions": "They use hire view and questions are pretty straight forward.  I found it is a lot less pressure than an in person interview.  If you pass the video interview they will do a phone interview with the manager of the unit", "Interview Questions": "what you know about the company"}, {"date": "3 Apr 2021", "title": "Registered Dietitian Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Mar 2021", "Interview Descriptions": "Expedient process less than a month long.  Touchpoints came weekly and   All communication deadlines promised during process met.   Process included brief phone screen, self video interview and a final panel interview via video.  Final interview questions difficult and challenging.  Video format presented audio challenges which inhibited clear understanding  of the interviewer’s speech.    Questions asked were all behavioral, complex and too long and wordy in my opinion.    Not a format that highlighted skill set-.  Questions focused on attitudes.  I have been through behavioral interviews for the past decade and always  come well prepared.  Many questions unique and too obscure where the average candidate would not have example of past experience to craft a competent answer on the  fly.  Final interview did  not promote rapport building and felt more like an interrogation.", "Interview Questions": "Tell me about a time you had to explain something to a nontechnical person using non technical language."}, {"date": "7 May 2021", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Provo, UT) in Mar 2021", "Interview Descriptions": "Online interview was very easy to understand, the time allotted  was appropriate and the questions are the same for everyone so even playing field. You have time before each question to think", "Interview Questions": "What schedule would you prefer?"}], [{"date": "25 Feb 2021", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "Zoom interview.  Started with description of job and then got into Scenario based questions.   Answered all of my questions about the position. Less than 30 mins.  Office manager and staff present on interview.", "Interview Questions": "Pt with low back pain, how would you treat?"}, {"date": "2 Feb 2021", "title": "Business Office Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Intermountain Health", "Interview Descriptions": "Phone interview, then an in-person interview.   There a job offer or decline email.   They have an HR team screen all the applications, so Hiring Managers only see a small fraction of people that actually apply.  If you can get past the HR filter, it is a great sign and you are likely already in the 90 percentile.", "Interview Questions": "All interview questions are historical questions..  \"Tell me about a time when __________\" "}, {"date": "24 Aug 2021", "title": "Procurement Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Feb 2021", "Interview Descriptions": "They have started using a video interview first. Usually looking at 7-10 applicants. Then they move to group interviews (about 5 applicants). Last, they move to one on one interviews (top 2-3).", "Interview Questions": "Tell me about a time that ....there are lots of questions like this."}, {"date": "19 Mar 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Intermountain Health (South Salt Lake, UT) in Feb 2021", "Interview Descriptions": "Very good process, professional and streamlined. Didn’t wait long to be called into the interview. Asked history questions and seemed excited to be speaking with me. Told me what to expect in position.", "Interview Questions": "How many years of relative experience ."}, {"date": "28 Jul 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Denver, CO) in Feb 2021", "Interview Descriptions": "I attended a Zoom Interview.  It was very professional and I felt that it was as close to the real thing!  I felt that the staff asked appropriate and knowledgeable questions regarding my past experience and answered all of my questions in a professional manner.", "Interview Questions": "How many years experience do you have."}, {"date": "26 Jan 2021", "title": "Social Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "HR called me for a telephonic phone screening. no follow up was given after which led me to believe they did not want to move forward with me as a candidate.", "Interview Questions": "questions about previous experience and desire towards position applied for "}, {"date": "8 Mar 2021", "title": "Strategy Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Salt Lake City, UT) in Jan 2021", "Interview Descriptions": "The whole process to 2.5 months from application to the end. Multiple rounds of interviews with various teams & leaders. Everything was virtual. The first interview is a taped video interview. A question pops up on the screen and you have 30 sec to prepare. The the recording begins while you answer the question. You have 2 attempts.", "Interview Questions": "Tell me about what excites you about this position and which parts do you feel unprepared for."}, {"date": "3 Feb 2021", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health in Jan 2021", "Interview Descriptions": "I completed an online Hire Vue interview which consisted of four questions that you completed online. They were prerecorded questions which you had two chances to film and answer with 30 seconds of prep time. I then interviewed  with communications team.", "Interview Questions": "Can you describe your writing style?"}, {"date": "31 Dec 2020", "title": "Clinical Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "The interviewers were around 10-15 minutes late. They do not like to choose applicants with outstanding educational backgrounds. Instead, they would prefer some experienced idiot. It is no wonder they have such terrible customer service and late managers.", "Interview Questions": "When was a time you had a conflict with another employee and how did you resolve it?"}, {"date": "14 Dec 2020", "title": "PCT/CNA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health", "Interview Descriptions": "The interview questions were based on experience and certain problem-solving techniques. The interviewers asked about six questions two of which were hypothetical scenario questions that surround and safety and communication.", "Interview Questions": "How would you deal with a disagreement with a superior?"}], [{"date": "30 Nov 2020", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "The process took around 3-4 weeks minus the background check and orientation. Contacted the next day after applying for the interview. Didn’t hear back till after a week or so.", "Interview Questions": "Tell me about a time you struggled with something, and how did you handle the situation?"}, {"date": "9 Dec 2020", "title": "COVID-19 Test Operative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Intermountain Health in Dec 2020", "Interview Descriptions": "It was an on-the-spot video submission and questionnaire and felt very impersonal and ingenuine. I really would've rather talked with someone, even if over the phone. There's just something about filming yourself on the spot that makes you so awkward.", "Interview Questions": "What was  a stressful situation in a work experience and what did you do to resolve or handle it?"}, {"date": "11 Mar 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Intermountain Health (Provo, UT) in Dec 2020", "Interview Descriptions": "Had a group online interview, similar to zoom. There were multiple ppl in the meeting which I thought was overboard. Like 8 different people watching and asking questions, it made it awkward and only one was really friendly. The questions didn’t apply to me because I was fresh out of school, and it made it hard to relate.", "Interview Questions": "Tell me about a time you built a relationship with a patient."}, {"date": "25 Nov 2020", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Provo, UT)", "Interview Descriptions": "Phone interview was nice. Just goes over simple outline of job, in- person interview  I was asked questions about situations that I've dealt with in the past. Everyone was really friendly and easy to talk to. They made me feel great about my interview. It was nice.", "Interview Questions": "They asked me about a time that I had to multitask and how I handled the situation."}, {"date": "18 Dec 2020", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Intermountain Health (Phoenix, AZ) in Nov 2020", "Interview Descriptions": "I couldn't believe the email I got saying a 195 minute hirevue. I put it off for a few days, because who has that kind of time? But I finally did it late at night thinking it wouldn't take 195 minutes. Oh boy I was wrong. It was a 30 minute interview and then 2.5 hours of coding challenges. I (in my opinion) answered the interview questions decently and nailed the coding challenges and then got a call saying I was not selected.", "Interview Questions": "Define what polymorphism is in the context of programming"}, {"date": "17 Jan 2021", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Provo, UT) in Nov 2020", "Interview Descriptions": "Applied online then got a call. They asked several questions and asked me where I would see myself in 5 years. They told me they would let me know in a week. Didn't get an email until about 3 weeks later that they had moved on with other candidates.", "Interview Questions": "How do you define sucess?"}, {"date": "18 Oct 2020", "title": "RN BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "I applied online on the company's website and they called me in for an interview, I completed the interview. I got a call from HR and was offered the job.", "Interview Questions": "What is my greatest weakness as a nurse "}, {"date": "14 Oct 2020", "title": "Flight RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "Group interview.  Typically for the position.  Complexity would be on the high end of an ACLS scenario.  Question asked by the medical director anybody with a good understanding of ACLS and lab value would have no problem passing the test.  But must think outside of the \"box\"", "Interview Questions": "A patient scenario of high complexity"}, {"date": "3 Oct 2020", "title": "Client Services Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health", "Interview Descriptions": "Was an awkward interview.  Took almost a month to let me know the status.  Called several times asking status and didn’t hear back.  Left several messages hoping for a response", "Interview Questions": "Most difficult situation I have experienced"}, {"date": "9 Sept 2020", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Sept 2020", "Interview Descriptions": "Contacted via text message by the recruiter, HireVue Interview, Excel Test and finally a web-based interview with the team. You'd think with such a tech heavy (one-sided) interview process they would be more willing to give you an opportunity to ask questions about the company and perhaps have them sell you on why you should want to work there. The whole process was a turn-off to working there.", "Interview Questions": "Why do you want to work here?"}], [{"date": "26 Aug 2020", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "I applied online through their website which is just uploading your resume, references and answering simple questions. Emails are sent saying still being considered. Eventually you are asked to create an online interview that you submit and then they'll call you for a phone interview.", "Interview Questions": "How would you provide great customer service?"}, {"date": "20 Aug 2020", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "Recorded interview round through a link.  Received many automatic mail updates throughout the process; Not sure if recordings were looked at afterwards. Video round has basic questions, the software is not very easy to use and makes you nervous.", "Interview Questions": "Basic human resource screening questions "}, {"date": "19 Jul 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health", "Interview Descriptions": "Applied online.  Received email inviting to do HireVue interview.  Received email setting up time to do phone interview(due to COVID).  Phone interview with manager of unit and HR representative", "Interview Questions": "Where do you see yourself Professionally in 5 years"}, {"date": "3 Jul 2020", "title": "RN COORDINATOR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Intermountain Health", "Interview Descriptions": "Several scenario questions on how you deal with difficulty situations and resolve conflicts. They wanted to know what clinical experience I had that could be used to educate and support the outpatient setting.", "Interview Questions": "How would you describe yourself? How would your current/previous employer describe you?"}, {"date": "2 Jul 2020", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Provo, UT)", "Interview Descriptions": "I applied online directly through Intermountain’s website. I was contacted for an in person interview with the Department Manager that was about 20 minutes long. I was instructed to bring something that represented me.", "Interview Questions": "What do you like to do in your free time "}, {"date": "20 Feb 2023", "title": "Bioinformatics Scientist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Intermountain Health in Jul 2020", "Interview Descriptions": "phone call about resume and skill, they contacted references, online video chat call with manager and interested parties, onsite visit and interview asked to giver presentation. I meet and talked to about 15 people about the job and the direct manager and their manager as well.", "Interview Questions": "how do you handle conflict"}, {"date": "23 Jun 2020", "title": "Staff Physical Therapist for Home Health Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Intermountain Health (Denver, CO) in Jun 2020", "Interview Descriptions": "After submitting my application for the role, I was contacted by HR via email asking to set up a date and time to interview within the next 5 business days. We agreed on a time and date. The HR representative called me promptly at that time only to inform me that the full time position I applied for had already been filled the day prior, and that they only have a PRN position left available if I wanted to learn more about that role. I kindly declined the offer but asked why they filled the full time position prior to interviewing all the candidates whom they had scheduled interviews with, she says they were already talking to a candidate before the job even posted. I thought it was extremely unprofessional on the Company’s part to contact me and schedule an interview only to inform me during the interview itself hat they position was no longer available.", "Interview Questions": "I wasn’t asked any questions, I was informed that the position was no longer available "}, {"date": "22 Feb 2021", "title": "Software Engineer(Internship) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Salt Lake City, UT) in Mar 2020", "Interview Descriptions": "Seemed more like a meet and greet honestly. Asked a few technical questions but none were super difficult to answer. Wear a suit and don't stress.  It's not a hard interview", "Interview Questions": "When you don't know how to do something, how do you deal with it?"}, {"date": "12 Mar 2020", "title": "Student Intern II - Web Operations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Intermountain Health (West Valley City, UT) in Feb 2020", "Interview Descriptions": "The took to a conference room to conduct the interview. I met with the lead of the department as well as, I believe to be, my would be immediate supervisor.", "Interview Questions": "Why do you feel that you would be a good fit for the position?"}, {"date": "6 Jan 2020", "title": "Evs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health", "Interview Descriptions": "You first have the phone screening. The process was about 20 min or so each. You answered several questions in the behavioral style format.  Then you have the in person interview .  Some of the questions on the in person were the same as the phone screening.", "Interview Questions": "How was one way you went out of your way to help someone. What was the outcome."}], [{"date": "26 Dec 2019", "title": "Data Science Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "1:1. 2-3 questions all technical related, then a medical data \"case study\" which involved a modeling problem with a dataset exhibiting colinearity.  Case study was in R. Because my background was in Python and not R, the interviewee would type code in as I explained it.", "Interview Questions": "What is your favorite machine learning algorithm and why?"}, {"date": "5 Dec 2019", "title": "Performance Improvement Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health", "Interview Descriptions": "Two one-hour phone screens, then two multi-hour panel interviews with three different groups of people (seven, three, two) over two days.\r\n\r\n1) This company has just rolled out a process with pre-determined (mostly behavioral) questions: of which the interviewers just read off the rubric, popcorn-style, and evaluate.  It doesn't appear as if the questions change between panels, which means you are answering the same ones repeatedly to different groups.  There was one interviewer who deviated slightly and asked questions which built off prior responses, which allowed for more natural and reciprocal dialogue.  After multiple rounds of this, it's apparent that this style was chosen (at least in part) to decrease the candidate's ability to assess individual/group-based culture while increasing the company's own ability to do so to the candidate.  This is the company's perogative to hold their hand close to their chest while asking differently of a potential team member, of course, but given their alleged emphasis on collegiality it's an unusual move.\r\n\r\n2) For the second in-person: while the speed of response was great, requesting less than 24-hour availability the night of the particularly bad snowstorm this year... during the week of Thanksgiving?\r\n\r\n3) Sending thank-you notes through Human Resources to be forwarded instead of directly to the interviewers, long after the recruiter had a hand in the process, was something I have never encountered before.  Unsure if that's corporate policy.", "Interview Questions": "Multiple variants of \"tell me about a challenging ________\"."}, {"date": "20 May 2020", "title": "Data Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Intermountain Health (South Bend, IN) in Dec 2019", "Interview Descriptions": "first a call to get acquainted and submit resume. Then recorded interview for the first round. The recorded interviews only give a few chances and when the questions are shown, you have around 15? 30? seconds to prepare to talk about it.", "Interview Questions": "Why do you want to work at Intermountain Healthcare?"}, {"date": "12 Nov 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health in Nov 2019", "Interview Descriptions": "I Filled out application, then used hireview to do a video interview, then was asked to come in for an in person interview, after that,  my references were  reviewed, then I got a  job offer a few days later.", "Interview Questions": "What are your future goals?"}, {"date": "2 Nov 2019", "title": "Clinical Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health", "Interview Descriptions": "Two interviewers read questions off a prepared paper, interview was easy going, not too many follow up questions. Met with me promptly at scheduled time, took about 30 minutes total.", "Interview Questions": "Do you have any lab experience?"}, {"date": "11 Mar 2020", "title": "IT Support Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Intermountain Health (Salt Lake City, UT) in Nov 2019", "Interview Descriptions": "Long - Took forever to hear back from the hiring manager.  It seemed like they wanted to hire quickly but turned into a nightmare.  offered job else where.  They tried to match pay rate but HR would not let them.", "Interview Questions": "How to reimage a desktop"}, {"date": "15 Sept 2019", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Intermountain Health (Denver, CO) in Sept 2019", "Interview Descriptions": "HR screening call;  very nice.  He rep called from another state. Asked about salary recommendations. I gave her mine which was too high so I said; I would compromise if I could work from home 4 days a week.", "Interview Questions": "What is salary expectations "}, {"date": "27 Nov 2019", "title": "Clinic Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Intermountain Health (Denver, CO) in Aug 2019", "Interview Descriptions": "I was referred to the position by a friend and applied.   The recruiter and the Practice Administrator interviewed my by phone.  I, then, interviewed in person with the Administrator and the Physicians Group.  I was called back to interview with the Team Leads.    I had a great feeling about the interview and thought it went well.  They chose another candidate with more experience in that particular field of medicine.", "Interview Questions": "How would you demonstrate leadership on days when you are short staffed?"}, {"date": "9 Aug 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health in Aug 2019", "Interview Descriptions": "HireVue which is video recorded interview application for smartphones, laptops, or desktops. You are given 30 seconds to read the question before being required/recorded giving your answer. If you do not like the answer you provided, you can retry the same interview question 2 additional times.", "Interview Questions": "How does Intermountain's Mission align with your beliefs and how can you provide care using Intermountain healthcares mission? "}, {"date": "23 Sept 2020", "title": "Inventory Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Salt Lake City, UT) in Aug 2019", "Interview Descriptions": "One in-person, panel interview, with two department managers. Very relaxed, casual, yet professional. References checked were checked but their follow up on an offer was very quick. Overall, pleasant experience, not too stressful.", "Interview Questions": "Why do you want this job?"}], [{"date": "30 Sept 2022", "title": "Covid Screener Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Ogden, UT) in Aug 2019", "Interview Descriptions": "1 virtual HireVue interview with both video and audio. 1 over the phone interview with a hiring manager/recruiter, questions were mostly about relevant experience and why I wanted to work there, also asked about past difficult experiences and how I responded. ", "Interview Questions": "What would you do if you had a disagreement with a coworker? "}, {"date": "16 Sept 2019", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Intermountain Health (Saint George, UT) in Aug 2019", "Interview Descriptions": "Review panel with set questions, even though the questions were scripted, she me of the other things were fishing for certain responses.  Seemed predetermined at point of coming into interview.", "Interview Questions": "How did you handle a difficult coworker in the past? "}, {"date": "19 Aug 2019", "title": "SLP Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Columbus, OH) in Aug 2019", "Interview Descriptions": "Contacted via email to set up phone call. Called by HR recruiter. Asked basic interview questions, why I wanted to work for the company, why I chose the profession, etc.  Then contacted by manager of department for follow up interview.", "Interview Questions": "Why are you interested in working with SCL?"}, {"date": "29 Jul 2019", "title": "Applications Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Intermountain Health", "Interview Descriptions": "Very brief, I  had worked there before and knew  a lot of the employees. So I  had  very good references. Six employees had questions that was made by myself in that case but it wasn't until after I started writing the script that it wasn't my way back in time and then my way of thinking about the fact that it had been a little more complicated than I thought was very good references for me to say that it was just the beginning and it was just like it lo", "Interview Questions": "How work with staff"}, {"date": "25 Jul 2019", "title": "RN Case Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Provo, UT) in Jul 2019", "Interview Descriptions": "Questions were awful. They didn’t ask anything about my experience or qualifications. They didn’t seem to care that I had many years experience or specialized certification in for the position they were hiring for. They expected you to come up with weird scenarios off the top of your head & figure out how you would deal with it. I’m not sure who wrote the interview questions but they did a terrible job. I have no idea how they expect someone to answer their strange questions.", "Interview Questions": "Tell us of a time when you had to deal with a difficult coworker & how you handled it."}, {"date": "3 Jun 2019", "title": "Mental Health Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health", "Interview Descriptions": "They called back after submitting application.  I had an interview 3 days later  2 days they gave me an offer.   They were very friendly and down to earth and just wanted to get know you as a person .", "Interview Questions": "Behavioral "}, {"date": "30 May 2019", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Intermountain Health (Grand Junction, Mesa, CO)", "Interview Descriptions": "Interviewed by a panel of 4 nurses. The interview was compromised of behavioral questions. This is typical for this company. They really didn’t ask about skills, etc. Terrible way to interview.", "Interview Questions": "Tell us about a time you disagreed with a policy or procedure at work? "}, {"date": "7 May 2021", "title": "Bioengineering Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Salt Lake City, UT) in Jun 2019", "Interview Descriptions": "4 people, around table all taking turns asking questions. It was the hiring manager and the 3 others that will be co-workers. Seem intimidating at the time, but we all did it when we would hire someone new and selected the person who was excited about the position and had good qualifications.", "Interview Questions": "General questions from google. Such as an difficult time with co worker. "}, {"date": "9 May 2019", "title": "Clinical Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Salt Lake City, UT)", "Interview Descriptions": "Applied for similar positions several times. Even though I am overqualified for the positions but still didn't get the offer. Got emails about the passed initial screening process and manager review process,  then scheduled an interview.", "Interview Questions": "About why you choose Intermountain, what makes you stand out...."}, {"date": "17 Apr 2019", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Intermountain Health", "Interview Descriptions": "Basic interview questions and conversation with the other staff members. I was given a tour of the facility and was offered a job during the interview process and I declined.", "Interview Questions": "What are my strong qualities. "}], [{"date": "29 Mar 2019", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Intermountain Health", "Interview Descriptions": "Recruiter screening interview, then if passed you are called in for formal interview with management and a tour.  After they completed a few interviews I was called with a job offer.", "Interview Questions": "Name a Time you had to deal with an angry customer, what was the situation and  how did you handle it? "}, {"date": "12 Apr 2019", "title": "Bio-Engineering Research Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Intermountain Health (Murray, UT) in Mar 2019", "Interview Descriptions": "After submitting my resume and cover letter, I was contacted promptly to schedule an interview. The interview process involved meeting with my manager AND fellow bioengineering research techs.  It was a very standard interview. I was sent an email the next week asking that I submit references through their electronic system. The reference checking was convenient for my references, consisting of a 30 question survey for them to fill out (mostly ranking how I perform compared to other employees on a number of scales). I was offered the job within a couple of days of my last reference replying. Negotiations for wage were reasonable, though they were done through a hiring department, which meant that they had to play middle man between me and my manager. Overall, it was a very smooth hiring process.", "Interview Questions": "Tell us about yourself. Specifically, tell us about your research background."}, {"date": "8 Feb 2019", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "Phone interview with the main hiring manager, followed by referral to hiring managers at specific clinics. Standard reference worksheet sent via email. In-person interview at those clinics that expressed interest.", "Interview Questions": "What would past employers say about you?"}, {"date": "7 May 2019", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Intermountain Health (Broomfield, CO) in Feb 2019", "Interview Descriptions": "There were multiple interviews  for a 2 month process. If they did not think I would be appropriate for the position then I could have been told by the 2 interview not 5 interviews and 2 months later.", "Interview Questions": "What systems are you familiar with? "}, {"date": "25 Feb 2019", "title": "Courier/Customer Svc Specialist I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Intermountain Health (Sandy, UT) in Feb 2019", "Interview Descriptions": "You would think that it would be relatively easy for someone with over 20 years of career driving experience to get a PART TIME job working as a courier, wouldn't you?  Not so with Intermountain Healthcare.  From the time I first applied for this position until I finally received notice that they had decided to hire someone else for the job took 3 weeks.  During this time, I received more than one email saying that they were reviewing my background and I was still being considered for the position.  Two weeks after applying, they made me do a video interview for the job (you can use either a webcam or your smartphone to do this).  They give you 5 practice questions to get familiar with the app you have to install to do the interview, but the actual questions you are asked aren't the same as the practice questions!  This was the first time I had to do a video interview for ANY job I've ever applied for (let alone a part-time job), and I guess they weren't satisfied with the answers I gave them.  A lot to go through for just a part-time position, in my opinion.", "Interview Questions": "What do you hope to accomplish in this position if you are hired?"}, {"date": "19 Mar 2022", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Intermountain Health (Provo, UT) in Feb 2019", "Interview Descriptions": "Interview over phone then follow up in person. I met with 3 people: hitting manager, unit miss level provider lead and the colleague I'd be working closest with all together in one meeting.", "Interview Questions": "How do you work well in a team environment?"}, {"date": "12 Apr 2019", "title": "Practice Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Jan 2019", "Interview Descriptions": "Long process but many events. Over two weeks I had three interviews. Interviewers were nice and fun. The questions and vibe suggested they valued a good “fit”.\n\nI was treated with respect the whole time. I asked for questions to be re-asked and expressed that on some questions I couldn’t think of an experience. Despite my shortcomings they were never condescending and seemed to just want to know me really well", "Interview Questions": "What inspires you to work in healthcare?"}, {"date": "13 Feb 2020", "title": "HR Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Jan 2019", "Interview Descriptions": "Interview process was seamless and very organized.  Great experience.  The recruiters were very professional, polite and knowledgeable.  I was informed throughout the process and continually received updates.  A refined and structured process.", "Interview Questions": "Behavioral based."}, {"date": "4 Oct 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health", "Interview Descriptions": "Easy! Online WebEx interview with 6 people. Only lasted 20 minutes. The whole thing was very casual and there was time for me to ask questions at the end. They offered me a job the following day.", "Interview Questions": "Tell me about a time when you went above and beyond for a patient."}, {"date": "11 Nov 2018", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (West Valley City, UT) in Oct 2018", "Interview Descriptions": "I arrived on-time and prepared for a 1-hour interview.  They sprang an Excel test on me, which was okay, but it would really be nice to know if they're going to do that.  They asked me a lot of questions and I answered all of them .\r\nHowever, when I asked a question, the non-manager employee in the room said \"I don't like that question so I'm not going to answer it.\"\r\nI wonder how that would have gone over if I had said something similar?\r\nOverall, quite the unprofessional experience and it's no wonder you hear such mixed things about working for Intermountain Healthcare.  I'll happily take my talent where I'll be treated as a valued prospective employee.", "Interview Questions": "Do you have any questions for us?"}], [{"date": "13 Nov 2018", "title": "Courier Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 5 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Oct 2018", "Interview Descriptions": "Great experience.  They did a great job in helping me know what I was applying to do.  I found the interview helpful and gave me enough information to make a good decision for my career.", "Interview Questions": "Lots of questions focused on customer service experience at former jobs and how it would apply to this job.  They used behavioral interviewing questions.  They wanted specific experiences when asking questions which helped me describe my skills and how I could help them as an employee.   "}, {"date": "29 Nov 2018", "title": "Executive Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Oct 2018", "Interview Descriptions": "I applied to multiple positions similar to this title and only heard back from three people. I continued to receive several emails stating that I was still under consideration but was only contacted by one department to interview. That process was drawn out for several weeks and at the last minute, they canceled the second interview stating that they had already found another individual to fill the position. \r\n\r\nI believe that the prescreening program that they use is limiting their ability to attract talented people to their organization. There were times when \"preferred\" requirements would suddenly be required in the prescreening process, even if they were trivial to the position. There were also times when one would meet all of the qualifications and yet never hear back from the department. The ability to reach out to the appropriate recruiters is nonexistent. It is very difficult to connect with any recruiter unless you know someone on the inside.  With all that said, Intermountain is a wonderful organization that has great values and vision. I would consider myself lucky to be apart of this organization in the future.", "Interview Questions": "Can you tell me about a time when you had to deal with a conflict between coworkers/staff members?"}, {"date": "18 Aug 2020", "title": "Acute Care Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Intermountain Health (Grand Junction, CO) in Sept 2018", "Interview Descriptions": "Was called my the recruiter- on site, was very friendly, scheduled in on my time, very flexible. Flew me out, put me up,  team was excellent greatly enjoyed my time with them.", "Interview Questions": "Why *** hospital, why Grand Junction?"}, {"date": "13 Aug 2018", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "Interview was short and was offer given in the spot. It was less then 15 minutes long and only interviewed with lab a manger.  Started work with in a week.", "Interview Questions": "Why do you want to work for intermountain? "}, {"date": "31 Jul 2018", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Intermountain Health (Denver, CO)", "Interview Descriptions": "Phone screen, phone interview, and in person interview. I was not given an offer for the job, and that's okay. I understand if I am not a fit for the company, but the way they handled it was classless. I spent a total of three and a half hours with phone interviews and in person interviews and they did not bother to let me know that I had not been selected. I emailed them about the position and was sent an automated rejection email. Again I don't mind if I'm not a good fit, but at least carry yourself in a professional way and let your candidates know if they are not selected. Completely unprofessional.", "Interview Questions": "What would your previous boss say was greatest weakness?"}, {"date": "25 Feb 2019", "title": "Sterile Processing Technician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Denver, CO) in Jul 2018", "Interview Descriptions": "I received an email from the hiring manager about two months after applying. The interview came about a week and a half after the email. Which, comprised of a panel interview consisting of the hiring manager, 2 shift supervisors and a lead technician.", "Interview Questions": "Q: Do you have any prior SPD experience? If not, how does your previous work experience apply to this position?\r\n\r\n"}, {"date": "22 May 2018", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health", "Interview Descriptions": "You'll be asked a series of questions in a group interview setting. You'll have a personal recruiter help you through the hiring process. Sometimes the email about the job may come later rather than soon it may say you didn't get the job but you might actually did.", "Interview Questions": "Explaine customer interaction both good and bad."}, {"date": "21 May 2018", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health", "Interview Descriptions": "I met privately one-on-one with a hiring official for an interview. Once offered the position, was required to submit proof of licensure, submit to a background investigation, obtain necessary vaccinations, and engage in a multi-day orientation.", "Interview Questions": "Do you have experience running therapy groups? "}, {"date": "18 May 2018", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "The process was not that long. Starts off with a call from the recruiter and if they approve then they set up and interview with the hiring manager for the position. If hired and you accept, you do like 3 days of new hire orientation.", "Interview Questions": "Tell us about a time you had a difficult patient and how you handled the situation. "}, {"date": "20 Nov 2020", "title": "Health Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Salt Lake City, UT) in May 2018", "Interview Descriptions": "Panel interview, fairly competitive where you present on a subject to demonstrate your style of teaching along with several questions where you need examples of how you have performed in the past.", "Interview Questions": "How do you inspire others through a difficult change process "}], [{"date": "1 May 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Intermountain Health", "Interview Descriptions": "Brief phone interview with a recruiter, then an in person interview with the manager. All pleasant experiences. The recruiter was very helpful and I ended up taking the position and really enjoy the manager as well. The interview was not very high pressure.", "Interview Questions": "What makes you feel you will be a good fit for the position?"}, {"date": "11 Apr 2022", "title": "Surgical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Intermountain Health (Murray, UT) in May 2018", "Interview Descriptions": "Two people interviewed, tech supervisor & surgical director. Question/answer/interview format. Very down to earth and easy to talk to. Offered job immediately after interview. It was like a conversation with friends.", "Interview Questions": "How do you handle difficult coworkers?"}, {"date": "25 Oct 2018", "title": "Physical Therapist Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Intermountain Health (Salt Lake City, UT) in May 2018", "Interview Descriptions": "There was one interviewer and the interview started with a tour of the facility. The interview questions were very straight forward and basic. The interviewer asked about education, past work experience, past work responsibilities, and foreign language skills.", "Interview Questions": "Do you have any foreign language skills?\r\nWhat was your reason for leaving your last job?\r\nWhen did you complete your education? "}, {"date": "6 Jul 2018", "title": "Medical Courier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Intermountain Health (Salt Lake City, UT) in Apr 2018", "Interview Descriptions": "I had a interview in April 2018 and I met with two mangers and i was hired through a staffing agency in March 2018. This is requiring 30 words this is so stupid", "Interview Questions": "Where do you see yourself in five years"}, {"date": "9 Aug 2018", "title": "Bioinformatics Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Intermountain Health (Saint George, UT) in Mar 2018", "Interview Descriptions": "Was referred to this by a recruiter who phone-screened me. First, I was interviewed by the Bioinformatics Manager via telephone. Then I was flown in and interviewed by another manager as well as a panel of peers. They used fill-in forms with ratings for my answers. Quite systematic. Something that irked me a bit was the somewhat callous and procedural way I was handled. There was no discussion of what travel arrangements would work best for me, it was just arranged for the closest airport and the dates I'd be available.", "Interview Questions": "Do you have experience in analyzing SNP's? If so, describe"}, {"date": "28 Apr 2018", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Murray, UT) in Mar 2018", "Interview Descriptions": "Just asked me a few questions about my experience and current availability.   There were two interviewers, and they focused mainly on any and all prior experience I had as a phlebotomist, as well as in other jobs.", "Interview Questions": "When was a time that you had an issue with a fellow employee and how did you handle it?"}, {"date": "12 Jun 2018", "title": "Solutions Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Intermountain Health (Salt Lake City, UT) in Feb 2018", "Interview Descriptions": "I was inteview three times in 6 weeks time.  Every interview there were more people on the panel.  However between every interview the the wait time got longer and longer.", "Interview Questions": "Basic personallity questions and questions pertaining to the postion"}, {"date": "9 Jan 2018", "title": "CQI Education Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Intermountain Health (Salt Lake City, UT)", "Interview Descriptions": "It was very pleasant - I was called by the HR recruiter on Friday, brought in for an interview on the following Monday. The only issue was that the HR recruiter failed to respond to my request for directions on how to get to the place, but she had given me enough info that I found it. GPS took care of finding the building, and once inside I had a very respectful, comfortable interview.", "Interview Questions": "Tell us about a time when you made a mistake - what happened and how did you resolve it? What was the outcome?"}, {"date": "5 Nov 2019", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 9 months. I interviewed at Intermountain Health in Jan 2018", "Interview Descriptions": "the interview process was a joke. their online questions are dumb. they clearly show they don't want to talk to people,  what a stinking mess.  joke joke joke.  this place is unreal.", "Interview Questions": "where do you see yourself in five years"}, {"date": "7 Feb 2019", "title": "Data Analyst-Population Health Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Intermountain Health (Salt Lake City, UT) in Jan 2018", "Interview Descriptions": "I actually interviewed with the Population Health Analytics team three separate times for three separate positions. (Internships and full-time positions). The results were always sort of the same:  \r\n\r\n0. They will come to your state university and feed you pizza and tell you they are interested in applicants. \r\n\r\n1. The manager calls you up for a phone screen.\r\n\r\n2. If you pass the phone screen, they call you in for a small group interview.\r\n\r\n3. You will wait several months to hear if you were hired.\r\n\r\n4. The manager will send out a blanket email saying that they were looking for someone with more experience. \r\n\r\n5. You will look on LinkedIn and realize that they hired someone with less education and experience than you had. \r\n\r\nBe warned, if you are a Utah State University graduate student, they will want to use their alumni connections to pretend like they are interested in hiring you. They are not. Eat their free pizza and chalk it up to a free meal. They will invariably hire a Brigham Young University student. (Which I'm actually fine with; BYU is the much superior program and school). \r\n\r\nIn the actual interviews, they will ask you to describe projects you have worked on. The best projects are ones that you used basic regression and classification techniques to perform an interesting, but routine, task with statistics. They are not research statisticians and do not care about *research* you have performed. They want you to speak about business and customer outcomes.  As long as you are fundamentally sound on basic statistics, they are not going to ask you any questions that you cannot answer. \r\n\r\nYou may be asked to do some simple programming in R. Know how to use glm() in R. Knowing some support vector (e1071) stuff may also be helpful. \r\n\r\nIt overall looked like a nice enough place to work. Pretty clean. Do note that the pay is likely not amazing. (Based on what I could dredge up, they will pay you maybe 80% market value. Maybe less).", "Interview Questions": "What is your greatest failure in life? "}], [{"date": "10 Sept 2020", "title": "GI Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Intermountain Health (Logan, UT) in Jan 2018", "Interview Descriptions": "I interviewed with a panel—nurse manager, nurse and tech. They asked a lot of scenario based questions to see how well you could think on your feet. It included a follow up day in scrubs after passing the panel interview to shadow a tech for 3-4 hours to see what they do during procedures.", "Interview Questions": "Tell me about a time when you had a conflict with a coworker and how you solved it. "}, {"date": "20 Nov 2017", "title": "ICU RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health", "Interview Descriptions": "mostly scenario questions and behavior analysis questions. not hard by any means, definitely drawn out with \"why\" follow up responses from management. \r\nEnsure that there is time in the interview to ask important questions about the unit and style of management they like to use", "Interview Questions": "describe the best and worst day you've had at work and why. "}, {"date": "14 Nov 2017", "title": "Registered Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Intermountain Health", "Interview Descriptions": "Application was done on-line. Basic HR behavior based questions during the interview. They are very uniform. Some situation based questioned asked to see how well you critically think. They were very quick at getting back to me after the interview. Also, after hiring, they were very quick to start training and on boarding.", "Interview Questions": "Tell me about yourself"}, {"date": "7 Nov 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health", "Interview Descriptions": "I applied online, they contacted me for an interview. They were willing to give me a phone interview because I was out-of-state. Otherwise, it would have been an in-person interview. The interview lasted about 30 minutes. Whole process took about 2 weeks.", "Interview Questions": "Why do you want to work here?"}, {"date": "21 May 2021", "title": "Practice Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health in Nov 2017", "Interview Descriptions": "There is a question and answer session with, at least, 4 panel members.  Each member asks, at least, 1 question.  Plenty of time is provided to sufficiently answer each question, and panel members are friendly and patient.  Many questions focus on conflict resolution.", "Interview Questions": "Why are you interested in this position?\nTell us about a problem you had with a co-worker and how you solved it."}, {"date": "17 Nov 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Intermountain Health (Provo, UT) in Oct 2017", "Interview Descriptions": "The interview process took about a month. I had one interview with a group of four employees. Interview was about 30 minutes. Received a call from the recruiters a week later and was offered an opportunity. Intermountain Healthcare was very professional throughout the whole experience.", "Interview Questions": "Tell us a time when you went above and beyond on a project or a deliverable?"}, {"date": "21 Sept 2017", "title": "Laboratory Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "The process took 2 months. I interviewed at Intermountain Health (Hyde Park, UT)", "Interview Descriptions": "I was interviewed 2 times, was finally offered the job and salary and then was told after I needed to interview one more time, even though the job was offered to me.", "Interview Questions": "Situational questions regarding the handling of certain situation."}, {"date": "13 Nov 2017", "title": "Staff Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Saint George, UT) in Sept 2017", "Interview Descriptions": "salary negotiation was very tough. the HR person misinterpreted and miscommunicated information. requiring to write emails. HR also was very inflexible in the salary negotiation even though she did say that I was free to make a counteroffer.", "Interview Questions": "Where do you want to see yourself in 5 years ?"}, {"date": "10 Oct 2017", "title": "Student Intern II Non-Clinical Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Sept 2017", "Interview Descriptions": "The overall process took one and a half month. I interviewed at Intermountain Healthcare Employee Services Center. I was interviewed 2 times. First, was the telephonic and second was the on-site interview. Both the interviews revolved around the behavioral questions, and was finally offered the intern position and salary was negotiated after the job was offered to me.", "Interview Questions": "Have you ever worked with people of different diversity?"}, {"date": "31 May 2019", "title": "Central Processing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Provo, UT) in Sept 2017", "Interview Descriptions": "It was a direct interview to ask why I was applying for the job and how I could help improve the company. There was little discussion about topic not relative to the position.", "Interview Questions": "Why did you decide to apply for this job?"}], [{"date": "17 Aug 2017", "title": "Problem Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Intermountain Health", "Interview Descriptions": "Applied online, contacted for a phone screen. Asked typical questions about my background, told me about the position. Felt extremely rushed and insincere, clearly the recruiter was in a rush to be somewhere else.", "Interview Questions": "Tell me about yourself."}, {"date": "8 Nov 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Intermountain Health (Provo, UT) in Aug 2017", "Interview Descriptions": "I was contacted by a recruiter who set up the interview for a few days later. The entire board in the interview was kind and made me feel comfortable. Asked very relevant questions.", "Interview Questions": "What contributions have you made in previous internships?"}, {"date": "18 Feb 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Denver, CO) in Aug 2017", "Interview Descriptions": "Interview with manager then given a tour to meet charge nurse, see unit, and opportunity to talk to other nurses.  It was not a stressful or intimidating interview but very professional.", "Interview Questions": "Why did you choose nursing as a career"}, {"date": "13 Nov 2017", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Denver, CO) in Jul 2017", "Interview Descriptions": "It was a bit of an informal and unorganized interview. The company did a huge lay off and did not give the clinic enough time to get help and make up for the people that were lost. This is the miscommunication and misunderstandings that happen in this company quite frequently.", "Interview Questions": "N/A"}, {"date": "28 Jul 2017", "title": "PSR Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Saint George, UT) in Jul 2017", "Interview Descriptions": "Very positive experience. Briefly explained the position. Interview was 30 min. I was asked to explain my work experience. What I was looking for. They told me the times of the position and it I thought it would work for me.", "Interview Questions": "They asked like, \"Tell me about a time with previous employer where you handled a uncomfortable situation.\""}, {"date": "12 Aug 2017", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Cedar City, UT) in Jul 2017", "Interview Descriptions": "The hiring process through intermountan is well prepared.  I feel they are professional and fair. The questions asked give a good chance for you to show what you can contribute to the company.", "Interview Questions": "Give an example of how  you handled a conflict with a coworker."}, {"date": "4 Oct 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Denver, CO) in Jul 2017", "Interview Descriptions": "I had a phone interview followed by a video interview and then an in person interview at the facility.  Everyone was very friendly and I appreciated the time they took to talk with me. Each interview was over an hour long and the last one that was in person was almost 4 hours and included a tour of the facility.", "Interview Questions": "Talk about your management style"}, {"date": "30 May 2017", "title": "Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Intermountain Health (Park City, UT)", "Interview Descriptions": "One on one with manager of that department in a board room of the hospital. Lasted about 25 minutes. Pretty relaxed and the manager was easy to talk to. He called me a few days later and offered me the job - he also was able to get me $2 more an hour for the position.", "Interview Questions": "I can't remember all the questions but there were about 10. Almost all were situational questions . . . \"tell me about a time when you dealt with a distraught customer, and how did you fix the problem\" etc."}, {"date": "11 May 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Intermountain Health (Wheat Ridge, CO)", "Interview Descriptions": "The interview was easy and relaxed. They did not ask overly difficult questions. It was in front of a panel of two people. I got a tour of the floor afterwards and was able to meet some of the other people that worked there.", "Interview Questions": "Why do you want to work here?"}, {"date": "21 Nov 2017", "title": "IS Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in May 2017", "Interview Descriptions": "Started with a 30 minute phone interview. Was then called two days later to setup an in person interview with the hiring manager and another co-worker on the project management team. Then received a call about 1-2 weeks later with the job offer.", "Interview Questions": "Let us know an experience you had working with someone that was difficult to work with and how did you handle it?"}], [{"date": "19 Apr 2017", "title": "Benefit and Retirement Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Intermountain Health", "Interview Descriptions": "Multiple people interviewed over two interviews. Standard interview questions, but this can be a slow process. If you have the basic skills, they care more about team fit than your your skills.", "Interview Questions": "Tell me about a time you dealt with an upset customer. "}, {"date": "28 Apr 2017", "title": "Senior Financial Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Salt Lake City, UT) in Apr 2017", "Interview Descriptions": "Phone interview went well, but I chose not to continue with in-person interview. Having years of relevant experience/education should preclude one from having to take a skills assessment related to the job.", "Interview Questions": "Tell me about your background and experience. "}, {"date": "21 Mar 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Intermountain Health", "Interview Descriptions": "Initially things happened quickly and I proceeded from recruiter screening interview to an interview with the hiring manager to an in-person interview.    The in-person interview was an all-day process in which I met with roughly 12 different people at various levels of the organization.    I was then told that I needed to perform an exercise to show that I could do the job they wanted and I would receive follow up contact to schedule that.   I did not hear anything after that.    It was just very unprofessional to go from progressing quickly through all steps to then hearing nothing at all with zero contact.   To me this is a red flag about the organization.  If this is how they treat people that are potential employees, I wonder how well they treat their employees.", "Interview Questions": "Typical questions.  How do you handle conflict?   What are your weaknesses?"}, {"date": "9 Mar 2017", "title": "CP Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Intermountain Health", "Interview Descriptions": "Applied online through company website submitting cover letter and resume.  called by department manager for interview.  Interview conducted by other CP staff.  Pretty straight forward interview questions.", "Interview Questions": "Tell us about yourself"}, {"date": "18 May 2017", "title": "Central Appeals Unit Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Layton, UT) in Mar 2017", "Interview Descriptions": "Application,  survey,  phone interview,  small panel interview with leadership,  big panel interview with team, references online survey,  drug test,  orientation and vaccinations followed by training.", "Interview Questions": " They asked how I dealt with failure and what I do when I make a mistake. "}, {"date": "31 May 2017", "title": "Inventory Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Salt Lake City, UT) in Mar 2017", "Interview Descriptions": "I submitted an online application. Was contacted on the phone a few days later and had a short over phone interview, then was invited in for a full interview. Came in to the office, was greeted and brought into a conference room for the interview.  Had full interview, and then was called and given an offer and instructions how to proceed from there.", "Interview Questions": "Explain a time where a customer had a problem and what you did to help them?"}, {"date": "4 Jan 2021", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Provo, UT) in Mar 2017", "Interview Descriptions": "It was two interviews one with HR department and the second with the Nurse Educator. Both were conducted by one person and they were relatively simple and my interviewers were friendly.", "Interview Questions": "How do you Handle conflict?"}, {"date": "2 Aug 2017", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Salt Lake City, UT) in Mar 2017", "Interview Descriptions": "Applied online. Received a call the next day to interview. I interviewed with the manager and another individual in the same position I was applying for.  \r\n\r\nI was asked to interview the following week with the next most senior individual along with the same manager as before. After this interview they took me around the floor and introduced me to other employees. \r\n\r\nEveryone I dealt with was very pleasant and the process was very welcoming.", "Interview Questions": "Describe a time when you had to manage multiple, competing tasks and how did you handle it?"}, {"date": "15 Apr 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Wheat Ridge, CO) in Mar 2017", "Interview Descriptions": "It was a quick and easy process they quickly responded to the interview with an offer. HR was super quick and responsive. Accepted the job quickly as well. SCL  has a quick and responsive HR", "Interview Questions": "Easy \nQuick \nBased on experiences "}, {"date": "16 Dec 2021", "title": "Assistant Registrar Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Salt Lake City, UT) in Feb 2017", "Interview Descriptions": "Simple and professional basic interview questions like if you can type certain wpm to customer service skills. Are you quick at picking up new things and are you flexible. What are your concerns about the job? Why should they choose you over another applicant ? What would your prior boss say about you as an employee?", "Interview Questions": "What situation have you shown leadership"}], [{"date": "3 Mar 2017", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Intermountain Health (Orem, UT) in Feb 2017", "Interview Descriptions": "Applied online via IHC website. It took about 2 weeks to be contacted for an interview. Interview went well and the staff was very friendly. I hadn't heard back 2 weeks later so I contacted them to follow up and received an email requesting references. 5 days later I was contacted with an offer.", "Interview Questions": "How would you handle an upset patient?"}, {"date": "1 Feb 2017", "title": "HIM Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Intermountain Health (Salt Lake City, UT) in Jan 2017", "Interview Descriptions": "There really was no interview. The HR department called to find out about my supervisory experience. I had none but despite my education, my knowledge, my dedication and my 9 years that I have dedicated to the company, they refused to pass along my resume.", "Interview Questions": "Even though you have been with us for the last nine years, what supervisory experience do you have? "}, {"date": "3 Jan 2018", "title": "Practice Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Intermountain Health (Ogden, UT) in Jan 2017", "Interview Descriptions": "Panel interview with Hr, COO and managers/Physicians.  You sit down and they ask you behavioral interview questions and you answer based off of your personal experience.  Every panel member asks a question and the others who are listening write the pros and cons of your response.", "Interview Questions": "behavioral interview questions"}, {"date": "27 Mar 2017", "title": "Physical Therapy Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Riverton, UT) in Jan 2017", "Interview Descriptions": "Applied on indeed. A hiring rep contacted me and set up an interview with the director. I had a short interview (ten minutes or so). You will also be required to have blood drawn, vaccines administered, backround check, drug screen.", "Interview Questions": "Do you work well under pressure/hectic conditions?\r\n"}, {"date": "8 Feb 2017", "title": "CS Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Intermountain Health (Murray, UT) in Nov 2016", "Interview Descriptions": "They asked me to go to a huge group meeting with over 120 people on November 18, 2016 and I spent from 8:15 am to 1 pm. They provided breakfast and lunch. From 9 am to 10 am they had presentations about the company. From 10 am to 11 am we had networking sections, and from 11 am to 12 pm we had 1:1 interviews for over eight different positions. The interviews were all behavioral questions, very similar to any generic interview question you will see out there. There were no technical questions, so I was not able to show my skills. Lunch took the rest of the time.\r\n\r\nThe process was very long, very tiring. However they showed that they cared about the process, and that they were very serious about it. They even had a whole scheduled planed for what would be the process from that day to the start of the internship. They told us that we would receive an answer by December 9, 2016, but that did not happened. I sent a email to 2 people that work with HR recruitment there to know if the process was still going, but they did not replied back. In January 26, 2017, over two months after the interview, and over a month after the date they told us that they would send the results. I was not even expecting an answer anymore.\r\n\r\nThus, It was very disappointing. I have no problem not getting a offer, but they were a little disrespectful. It was lame to spent about five hours there, having to drive about 2 hours both ways, and miss work and classes for just a behavioral interview that in the end made me think for over a month that they would not answer and be ignored by email. I left there thinking high of the company, and how professional they were, besides the behavioral interview, but now I am not sure. I recently saw them on my University career fair, and did not even go there because I refuse to go through this process again.", "Interview Questions": "N/A"}, {"date": "1 Jul 2017", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Provo, UT) in Oct 2016", "Interview Descriptions": "Hiring involved using their online application.  Its pretty hard to get an interview because the system filters the applicants and yours may not even be seen by the managers.", "Interview Questions": "Have you ever had a confrontation with a fellow employee, and how did you handle it.  "}, {"date": "8 Nov 2017", "title": "Clinical Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Murray, UT) in Sept 2016", "Interview Descriptions": "I️ was asked to prepare a presentation on something related to the job I️ was applying for. There were multiple group interviews which occurred over the course of the day, lunch was included because the interview process took all day. I️ heard about the position within 2 weeks and started shortly thereafter.", "Interview Questions": "Scenario questions about managing a team, what I️ would do in a myriad of situations, where I️ saw myself within the organization in 5 years, how long I️ anticipated working in this position if I️ were hired, etc."}], [{"date": "4 Feb 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Intermountain Health (Murray, UT) in Sept 2016", "Interview Descriptions": "Was called for an interview, went later that day and met with clinic manager, was called later that day with an offer and asked to come in later and fill out additional paperwork. Was given 24 hours to sumbit an official response.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "22 Aug 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "Online Application System that was followed up by in-person interview with the manager of the unit. He was great and liked me from the get-go so I received an offer in the interview. However, this was during a time that the hospital was hiring a large amount of RN's due to a future charting system switch.", "Interview Questions": "Why do I want the job"}, {"date": "18 Aug 2016", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Intermountain Health", "Interview Descriptions": "I applied online and received a request from the recruiter for a phone interview within a few business days. The phone interview went well, and I moved into the second stage. The second phone interview was with the actual hiring manager. This also went well and I was asked to come in for a final in-person interview. \r\nThe final interview consisted of meeting with two groups: managers and prospective team members. I left feeling good about the interview but still unclear on what exactly they were looking for. The hiring manager stated they would follow up in 6 weeks on candidate status post interview and stated that they always let candidates know their status and don't leave candidates wondering. \r\nAfter 6 weeks, I received zero updates. A few days post \"deadline\" I e-mailed the recruiter and was informed that I was not selected. The lack of follow up was disappointing especially since it was insisted that they do not leave candidates hanging. \r\nWhile the interviews were about average the lack of follow-up from the hiring manager and/or recruiter turned this into a negative experience.", "Interview Questions": "What makes you a good fit for this position?\r\nWhere do you see yourself in 5 years?\r\nWhat would you do in xyz situation?"}, {"date": "24 Jan 2017", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Intermountain Health (Broomfield, CO) in Aug 2016", "Interview Descriptions": "Highly disappointing! I was a finalist for a role (after a few rounds of phone and in person interviews), the manager had been very personable with me. When things turned over to the recruiter she did a terrible job. She never provided updates, and when I checked in a couple of times (over a couple of months) she was slow to respond, with little information. If you're going to put someone through the full process, at least have the decency to let them know in a timely manner if they aren't selected. When you drag people on with vague descriptions it creates a very negative candidate experience. If they had eventually come through with an offer I likely wouldn't have taken it. Luckily I found a great role elsewhere.", "Interview Questions": "typical behavioral questions... tell me about a time when you had to deal with conflict, tell someone something they didn't want to hear, lead a group, etc..."}, {"date": "23 Sept 2016", "title": "Quality Consultant I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health in Aug 2016", "Interview Descriptions": "Was contacted by HR. Had a phone interview where they asked all the expected behavioral questions. They asked to meet me in person but didn't offer to pay. Wanted to know if I was coming to the area for a visit. I travel to meet them paying for trip myself.  They called the next week and offered the job. They offered the job at $10/hr less than I'm making now. Tried to negotiate but was told their budget wouldn't allow.", "Interview Questions": "Why should we hire you. Why do you want to relocate. Where do you see yourself in 5 years."}, {"date": "26 Sept 2016", "title": "Data Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Aug 2016", "Interview Descriptions": "They called and set up an Initial phone interview, subsequently I was scheduled for two in-person interviews and a review of SQL code that was provided. I needed to find the errors.  I then was required to submit 5 references, who all received an email survey about me.  Finally, two weeks later, I received an offer.", "Interview Questions": "Many of the questions were technical, related to the job functions or to prior industry experience, but most of the questions were \"what's your biggest weakness/ name a situation in which...\" type questions."}, {"date": "10 Aug 2016", "title": "Physical Therapy Aide Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Intermountain Health (Bountiful, UT) in Aug 2016", "Interview Descriptions": "He asked me to tell him about myself/why I was interested in the position, then asked about 5-6 questions regarding previous responsibilities/exchanges, asking that I tell about specific instances of what I've done in the past rather than what I would do in a given situation. He then told me more details about hours, what the day-to-day would look like, and when he would be able to get back to me. He then asked if I had any questions for him.", "Interview Questions": "Describe a time when you have taken a position through a transition in the company (afterwards he tells me that the office will begin going paperless in a few months)."}, {"date": "7 Aug 2016", "title": "Or RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Intermountain Health (Murray, UT) in May 2016", "Interview Descriptions": "Interviewed with two managers. I dressed in my best looking suit with nice shoes on. I had shaved and presented myself very nicely. They took me back to a conference room where two interviewers took turns asking me a total of four questions. I feel I answered them all adequately, and I had a job offer later that afternoon. Turns out that is not typical, but I was a capstone student there the three months previous so I may have had an unfair advantage. Great experience overall.", "Interview Questions": "Strengths weaknesses"}, {"date": "18 Sept 2016", "title": "Senior Incestment Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Intermountain Health (Salt Lake City, UT) in May 2016", "Interview Descriptions": "The beginning steps including an HR phone screen and a second phone interview with a hiring manager and the invitation and planning, followed by the in-person interview, was fairly smooth, constructive, and (as I believe) mutually pleasant. I was a very good fit for this role, exactly as per description.\r\nThe 'funny stuff' has started happening after the interview.\r\nImmediately after my visit I did follow-up with a nice and short 'thank you' letter to the hiring manager re-affirming my interest and positive experience based on my visit. That was the last week of May 2016. Then there was a long, very long silence. After about three weeks I had decided to follow-up again with another e-mail re-affirming my interest.\r\nAbout 10 days later, a letter with a request for five (5!!! direct and recent!) recommendations came. sure enough, they outsourced this process to another firm that has the references to register (!) and upload their letters (!!) into their system... Leaving aside the fact that one can get direct positive recommendations from five people in organization one is currently employed in, without jeopardizing current employment, is only one's firm wants to get rid of you. Besides, even if it was reasonable to find five references (which I did), who is going to bother with going some place, uploading something? How would I know if they did? Anyway, I have been able to get the references completed.\r\nA month later another HR person finally got back with me saying that the 'original' HR person was on leave, and she could not reach me by phone (granted, I did have my personal phone die on a trip I took)... but she did not even bother to write an e-mail... duh? Okay, with that 'confusion' out of the way... took another good two weeks to receive a call back verbally confirming that I was the best candidate (for what I know they could have interviewed a sizable squad of people over that period of time, it was already the very end of June!)... Well, so far so good? The HR person kind of relegated the responsibility for the delays to the hiring manager, so that they 'work together with a Consultant to work out an offer' for me (???)... Then some random phone calls from HR started, with no apparent goals. They made it seem that the offer of some kind is being put together, but no talk of a starting date, or anything relevant, was done.\r\nI kindly said that the salary figure looked acceptable to me, and that I would like to receive an offer. The HR drone said it would be coming in '15 minutes'... Needless to say, did I get to see it in 15 minutes, or by the end of that day, or the next Monday. This was already ridiculous beyond any reason. \r\nFinally, now that the 'offer' came as an e-mail from the HR, that had only the salary in it, and no (nada!) any vital information about pretty much any other conditions of the employment. No formal letter, no signatures of any kind, not even a copy to a Hiring manager or anyone with any kind of executive latitude.\r\nAt this point, what I think is going on is they have their own 'right' candidate but they need me out of the way voluntarily, as the panel has chosen me in the interview process, so they >> have to << try and hire me, but if they make it ridiculous I would just move on and they invite their brother in faith (or a cousin three times removed, who knows?) with open arms.\r\nWell, I am not giving this kind of satisfaction :) I am waiting for that offer. Still waiting. Needless to say I won't be going to work in that spider can - just want come closure for myself.\r\nUpdate: It's September, I finally turned that thing down. This was ridiculous.", "Interview Questions": "There was a healthy mix of the usual behavioral questions and technical probes of average difficulty. Nothing too challenging if one knows the stuff."}, {"date": "27 Apr 2016", "title": "Communications Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Salt Lake City, UT)", "Interview Descriptions": "Initial submission via web (rejected at first). First round with boss and others. Second round with boss and department head. About two weeks for reference and background check, then offer extended.", "Interview Questions": "Very typical. Background experience. Successful campaigns. Challenges. Why would I want to work for Intermountain."}], [{"date": "22 Apr 2016", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Intermountain Health (Arvada, CO)", "Interview Descriptions": "I interviewed for Colorado Lutheran Home. They give you a tour of facility and then 2 people sat with me and allowed for questions. The process to apply and get hired was drawn out and long. Actually reached out to references and are thorough in background check with even checking with your highschool and other colleges for info on you.", "Interview Questions": "Why do you want to work at CLH?"}, {"date": "16 Nov 2017", "title": "Ehanced Registrar Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Salt Lake, NM) in Apr 2016", "Interview Descriptions": "They aren't very professional with their entire hiring process, you're left in the dark wondering what is going on cause they are contacting you and are not very specific about what to expect.", "Interview Questions": "They like to know how you work with a team. "}, {"date": "8 Oct 2016", "title": "Compliance Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Apr 2016", "Interview Descriptions": "Very easy going. Everyone was super nice and I felt very comfortable. I was asked very specific questions about my skills in my current and all past jobs. You need to come prepared, once you've done that the interview will be easy. I've also had to interview people for jobs at Intermountain Healthcare and I can tell you that the interviewer is just as nervous as the interviewee. We want to make sure that we are hiring someone who will fit in and do a great job.", "Interview Questions": "Why do you want to work for us?"}, {"date": "3 Aug 2017", "title": "Graphic Designer-II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Intermountain Health (Salt Lake City, UT) in Apr 2016", "Interview Descriptions": "Had 2 separate large group interviews. Probably took total of 3 weeks. Pretty mellow overall though questions weren't too tough. More of a situation for the team to meet me and see if I meshed well.", "Interview Questions": "Tell us about your past work."}, {"date": "17 Feb 2018", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Saint George, UT) in Apr 2016", "Interview Descriptions": "Exciting energy, introduced to a panel of three, managers who would be directly involved with the position being hired for. Standard interview questions. Friendly demeanor. They provided a good foundation for what to expect from the job.", "Interview Questions": "Did I think I could balance multiple projects and work with patients experiencing significant pain."}, {"date": "26 Apr 2016", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Murray, UT) in Apr 2016", "Interview Descriptions": "The interview went very well. I enjoyed speaking with the team and found the questions where very fare and adequate to the role.  I liked the fact that it was not a whiteboard session and the technical team saw the value of my unique skill set when finally making the decision to move forward with me.", "Interview Questions": "What do I prefer more the front-end or back-end development"}, {"date": "17 Jun 2016", "title": "Systems and Information Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Murray, UT) in Apr 2016", "Interview Descriptions": "Had the first interview with half the team that was just discussion and a second interview with entire team, where you present on a process. The second interview consisted of an excel test to test excel skills, a presentation on a process (Any process. There were no guild lines). Following those questions from the entire team came.", "Interview Questions": "Give a time when you had conflict with a customer"}, {"date": "14 Mar 2016", "title": "Distribution Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Intermountain Health (Salt Lake City, UT)", "Interview Descriptions": "Met with 3 members of management. Asked me a series of questions which revolved around my strengths and weaknesses. Times I've been in a rough situation and what I've done etc. walked to the front and then called back within 24 hours to proceed with references. The reference check took about 48 hours.", "Interview Questions": "Name a time you had to work with a difficult coworker and what the outcome was."}, {"date": "22 Jun 2016", "title": "CT Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Intermountain Health in Mar 2016", "Interview Descriptions": "In person interview with manager and peer. They ask a technical question. Then ask something like: \"Tell us about a time you had a disagreement with a co-worker\". Had phone offer week following interview.", "Interview Questions": "Tell us about a time you went above and beyond for a patient\""}, {"date": "29 Feb 2016", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Intermountain Health", "Interview Descriptions": "They have a set of questions prepared and record the process. If you are good with basics you can easily clear this interview. They asked me to write a small program on board to check my logical thinking.\r\n\r\nThey first called to schedule interview and I came in person.", "Interview Questions": "Basic java questions"}], [{"date": "27 Aug 2017", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Intermountain Health (Murray, UT) in Mar 2016", "Interview Descriptions": "I reached out to one of the physicians in the research department. He invited me to meet with him and the research services manager. I was told that there was no funding for the position initially, and then later I was told that I would need to submit an application for a posting. I did so and was interviewed twice before receiving the final offer. The compensation was somewhat lower than what I requested.", "Interview Questions": "How would you resolve a conflict with a co-worker?"}, {"date": "18 Feb 2016", "title": "Senior Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Salt Lake City, UT)", "Interview Descriptions": "Very structured. Set list of questions. Pretty standard stuff. They were honest about concerns in meeting my salary requirements. I got to meet the whole team I'd be working with. It was a good experience. Response times were good, and I never got too concerned by not hearing from them.", "Interview Questions": "N/A"}, {"date": "20 Apr 2016", "title": "Customer Patient Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Provo, UT) in Feb 2016", "Interview Descriptions": "I received an email asking me to go to the hospital for an interview. I went to the interview, It seemed completely fine. I thought it went really well. I had two people interview me at the same time. One was very friendly, the other lady seemed all business, which is fine. They asked me several questions explained the job and the requirements. They also said that it was in the ER and an on call position. They asked i think 4-5 questions then told me that they had a few more interviews and someone from HR would call by the beginning of the next week. Well no one called. So I reached out to the lady who sent the original email thinking it was maybe her that was going to call and she gave me another number. I left 3 voice mails for the other lady and she still never called back two weeks later. I had applied for other jobs at the hospital and received an email stating I wasn't going to have an interview and they narrowed the candidates. This email was from someone else. So I emailed them asking if they had filled the position I was interviewed for. For the last two days I have emailed this person back and forth and I have also called and left two messages for them. I am never applying there again. I feel like I have applied there for the past 5 years and I only got one interview. It is highly frustrating and I just am not going to deal with it anymore.", "Interview Questions": "Are you nervous of blood?"}, {"date": "13 Mar 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Intermountain Health (Broomfield, CO) in Feb 2016", "Interview Descriptions": "Multiple in person and one phone interview. Sit in with a panel of leaders asking various questions. Approximately one hour long or so.  Related to the industry questions.", "Interview Questions": "Management scenario questions. Problem/Solution questions. "}, {"date": "29 Mar 2019", "title": "Clinical Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Intermountain Health (Murray, UT) in Feb 2016", "Interview Descriptions": "For a CLA, I was called in for a in person interview, skipping over phone/digital interview platforms. You then meet with the lab managers, they are kind, and normal people to that you can easily connect with.", "Interview Questions": "How does your work experience qualify you for working in a clinical lab setting?"}, {"date": "16 Sept 2016", "title": "Communications Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Jan 2016", "Interview Descriptions": "Weird, large group interview. I really wish they would stop doing this. It's awkward and not very helpful for the candidate or interview committee. The process was long and kind of cumbersome. The recruiter wasn't great, didn't know much about the position and wasn't timely in getting back to me. She also failed to let me know the status of my candidacy.", "Interview Questions": "What do you know about our competition?"}, {"date": "26 Mar 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Jan 2016", "Interview Descriptions": "Heard about the position from a friend who works at a staffing agency and knew I had interest in Intermountain. She alerted me and asked if she could pass along my resume to them. They asked for an in person interview the following week. Had the in person interview, then offer a few days later, then time delay to get all required immunizations.", "Interview Questions": "Why I wanted the job."}, {"date": "17 Mar 2017", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Jan 2016", "Interview Descriptions": "HR receives applications, Manager typically calls for phone interview to perform first screen, then interview with manager and typically a couple other members of the team. They are looking for your knowledge but also how you will fit with the team. Typically say will get back to you by the end of the week, but it is more likely 2-3 weeks.", "Interview Questions": "Share with us an experience when you successfully completed a goal. \r\n\r\n"}, {"date": "7 Mar 2016", "title": "Lab Processor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Intermountain Health (Provo, UT) in Jan 2016", "Interview Descriptions": "I applied online and about a week after, I got a call from HR asking to schedule an interview. They don't give you very much time to prepare, HR asked if I could come in tomorrow. I agreed & the interview process was with one person. She was very friendly & let me know that the interview was going to be different than the ones she does for different positions. She talked a lot about the job, her family, the lab, & most importantly; time commitment. She wanted someone who was willing to go through the training & get certified in the end to continue long term. Overall she asked me ONE interview question, only ONE. Also, The hours weren't negotiable. Once the interview is over, she went around the lab showing me a little tour on how most things run around that department. After about a week I called HR to see how things were going, they mentioned they were still in the process of calling references. A week later, I received an email stating the  position was taken.", "Interview Questions": "What makes you stand out or different from other candidates that you could bring into the job that others can't?"}, {"date": "15 Aug 2018", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Dec 2015", "Interview Descriptions": "The first part of the interview will be in a group. Of course dress professionally, anyone that did not did not get called into the one on one. They will ask group questions- try to answer differently than those around you. There will be a typing test. If you pass then you get a one on one standard interview.", "Interview Questions": "What does customer service mean to you?"}], [{"date": "24 Jan 2016", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health in Dec 2015", "Interview Descriptions": "Fun, easy interview. Manager was very nice. They only asked a couple of interview questions then it was just more about who I am and how I deal with certain situations.", "Interview Questions": "How do you deal with conflict "}, {"date": "19 Jan 2016", "title": "Human Resources Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Murray, UT) in Nov 2015", "Interview Descriptions": "I applied online. I had a brief phone interview by recruiter. The recruiter contacted me later for a face-to-face interview with the hiring manager. I met the hiring manager at his workplace in his office. The interview was low-key and comfortable. There were no surprise questions. All questions were relevant to the work and what I expected. The interview took about an hour. I heard back about two weeks later that they were moving forward with other candidates.", "Interview Questions": "They asked typical interview questions about experience and skill related to the job."}, {"date": "6 May 2016", "title": "Imaging Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Nov 2015", "Interview Descriptions": "I was contacted via phone by HR to set up a phone interview. Following the phone interview, I received a call that they would like to invite me in for an in-person interview. My interview was with two people (they would end up being my immediate boss and her boss). It lasted about one hour, and then I left. I heard", "Interview Questions": "Tell me about a time where you had conflict with a co-worker and how you handled it. "}, {"date": "7 Oct 2016", "title": "Intern Student II - Non Clinical Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Intermountain Health (West Valley City, UT) in Oct 2015", "Interview Descriptions": "Fairly simple, normally the manager does a phone and 1:1 interview. I made it through with just the phone interview. No i am just filling in space because I need to type at least thirty words.", "Interview Questions": "What is your networking background?"}, {"date": "3 Apr 2016", "title": "Clinical Nurse Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 months. I interviewed at Intermountain Health (Denver, CO) in Oct 2015", "Interview Descriptions": "One interview its director, managers and coordinators on strengths weaknesses. Desire and abilities. What could I bring to the position. How would I change things about the department. How I supported senior leadership and inspired employees.", "Interview Questions": "What can I bring to the organization?"}, {"date": "28 Oct 2015", "title": "PRN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Intermountain Health (Ogden, UT) in Oct 2015", "Interview Descriptions": "I was interviewed by three ladies andbthey were very nice but what I didn't like was that they had me wait 30 minutes and had scheduled four interviews at the same time.", "Interview Questions": "What are your weaknesses?"}, {"date": "12 Oct 2015", "title": "Insurance Appeals Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Intermountain Health (Ogden, UT) in Oct 2015", "Interview Descriptions": "IHC is famous for doing the group interview process as the only contact they ever have with candidates.  This is my second time interviewing this way with this company, which always makes me nervous because I never feel like I have the chance to explain/discuss just 'me'.  There were 7 people in the group, which is the largest group I have ever interviewed in and I was afraid they would have a hard time keeping our answers and personalities separate.  The first time I did get the job though, so it will be interesting to see if the same is still the case!", "Interview Questions": "Tell us about an interaction with an employee or manager or a process and how did you handle it?"}, {"date": "23 Oct 2015", "title": "Phlebotomy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Intermountain Health in Oct 2015", "Interview Descriptions": "Applied online in the morning... Visited hr later that morning... Received an email that afternoon... Will have a telephone interview next week. Look forward to an in depth, nuts and bolts interview.", "Interview Questions": "What attracts you to St Francis"}, {"date": "20 Jan 2016", "title": "Patient Advocate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Intermountain Health (Murray, UT) in Sept 2015", "Interview Descriptions": "Applied online. About a month later I got an email to call for a phone interview. After the phone interview I had an interview with the hiring manager. The recruiter took her time getting back to me.", "Interview Questions": "Do you see yourself as a good fit for the company?"}, {"date": "18 Oct 2015", "title": "Practice Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Intermountain Health (North Ogden, UT) in Sept 2015", "Interview Descriptions": "Applied online, I got a call within a few days for an interview, was offered the job a few days after that.  The interview itself was not intimidating, it was low key and easy going.  Four people interviewed me, taking turns asking the questions, i made eye contact with the person who asked the question as i answered it.", "Interview Questions": "What projects have I been in charge of and what was the outcome?"}], [{"date": "15 Mar 2017", "title": "HR Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Intermountain Health (Broomfield, CO) in Aug 2015", "Interview Descriptions": "I had a phone screening with the recruiter and then had a face to face interview with the hiring manager. I also met the team during my face to face interview and for part of it I shadowed the lead to get a feel for the role. After that I waited a couple days and received an offer.", "Interview Questions": "Typically interview questions"}, {"date": "21 Aug 2015", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Intermountain Health (Broomfield, CO) in Aug 2015", "Interview Descriptions": "Met with two people; very nice and professional.  More laid back than expected, but they asked very good questions and answered mine without hesitation.  Most of the interview was a very detailed account of the position for which I was applying though each interviewer had a different spin on the role (one was a manager, the other non-manager).  They interviewed three candidates in one day and made their decision within 24 hours.  Although I was not selected due to lack of calendaring experience, I would be interested in another position within the company.", "Interview Questions": "Why do you want to work here?"}, {"date": "2 Jun 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Intermountain Health (Salt Lake City, UT) in Aug 2015", "Interview Descriptions": "It was very laid back and simple. The interviewers were very personable. I was interviewed by two people who were already employees. I didn't feel intimidated or nervous, especially being a college student and being interviewed by people in prominent positions.", "Interview Questions": "Why do you think you are a good fit for this position\r\nWhat experience do you have"}, {"date": "20 Jul 2015", "title": "Software QA Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Intermountain Health", "Interview Descriptions": "Apply online.\r\n\r\nRecruiter calls within 3-5 days.\r\n\r\nPhone screen conducted.\r\n\r\nCall back to schedule on site interview.\r\n\r\nOne interview with 2 engineers. Technical interview with SQL questions.\r\n\r\nCall back to negotiate and make official offer.", "Interview Questions": "1- Write a SQL query on the board."}, {"date": "23 Jan 2017", "title": "Pt Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health in Jul 2015", "Interview Descriptions": "completing an online application at intermountain's website. Next there is a 1:1 with a manager interview that takes about 30 to 45 minutes. If they like your from your application and first interview there is a second interview with another manager to determine qualifications. After that their is either a job offer or not one.", "Interview Questions": "describe a time when you failed at something."}, {"date": "21 Jun 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Intermountain Health (Murray, UT) in Jun 2015", "Interview Descriptions": "I applied online then walked in a few days later to introduce myself.  Got an interview for a couple days later. HR contacted me by phone that same day (on a Friday) to let me know they wanted to continue with the hiring process and to see if it was ok to contact my references. Got a call that Monday from the HR Recruiter offering me the job and giving me more information on the orientation process. \r\n\r\nFrom online application to job offer was 15 days. From introduction to job offer was 12 days. From introduction to interview was 2 days. From interview to reference check was 3 hours. From interview/reference check to job offer was 3 days. \r\n\r\nInterview was 1:1. Interviewer was my potential manager who was very easy to talk to, light-hearted, and just so approachable (which really helped to calm my nerves).", "Interview Questions": "What are your career goals? -and- What do you look for in a job?"}, {"date": "8 Jun 2015", "title": "Recruitment Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Intermountain Health", "Interview Descriptions": "You apply online.  The recruiter called with some questions.  She was very upbeat and helpful.  She explained the process to me.  The interview was scheduled very quickly.  I knew exactly where to go and who I was meeting with.  During the interview I received information about what the job entailed.  Those interviewing were also friendly and informative.  They helped me feel comfortable and confident.  They asked good questions that helped them get to know me, my skills, and my ways of handling situations.  They got back to me in a timely manner!", "Interview Questions": "It can take time to get all the necessary clearances to hire the candidate.  What would you do to help the process?"}, {"date": "22 Aug 2015", "title": "Applications Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Intermountain Health (Denver, CO) in Jun 2015", "Interview Descriptions": "Had the phone interview, and felt it went well. Was told I would hear back within the week, seemed like a positive fit. Was told my qualifications were a good fit even though I lacked one of the \"nice-to-haves\". Later learned I'd been out of the running because of my qualifications not being an exact fit. The HR department takes the \"screening for exact fit\" a little too seriously, and is probably screening out the best candidates for the job.", "Interview Questions": "Describe a success at work"}, {"date": "22 Apr 2016", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Intermountain Health (Murray, UT) in Jun 2015", "Interview Descriptions": "The interview was over the phone, and asked basic html, css and javascript questions. They also wanted to know if i was familiar with java and jquery. The interview was only done over the phone, i never met anybody until my first day of work.", "Interview Questions": "What is a javascript callback?"}, {"date": "9 Oct 2015", "title": "NICU TECH Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Ogden, UT) in Jun 2015", "Interview Descriptions": "short and sweet. I have never had an interview that lasts for more than fifteen minutes there. Normally you are there with just the manager but on occasion they will have a panel of people", "Interview Questions": "they asked what the intermountain healing commitments were and to describe a time I used customer service"}], [{"date": "22 May 2015", "title": "RN Home Health Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at Intermountain Health (Denver, CO) in May 2015", "Interview Descriptions": "Met the recruiters at a job fair and gave them a resume. They called the next day to set up an interview. I made an appointment for early the next week. Arrived early, but had to wait till past the scheduled time. Interviewed with someone other than the person originally scheduled to do the interview.", "Interview Questions": "They asked about critical thinking skills, and time management."}, {"date": "16 Dec 2015", "title": "Orderly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at Intermountain Health (Murray, UT) in May 2015", "Interview Descriptions": "Was brief but very professional. Took a long time to hear back from company to schedule interview. I applied in April, interviewed in May, and started in June. This is the perfect job for college students.", "Interview Questions": "Why are you best for this job?"}, {"date": "22 Jun 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health in May 2015", "Interview Descriptions": "Two week process after the interview. HR will call with an offer. The interview consistent of 3 supervisors and mangers of the unit. Each asked questions and wrote your response down. You are given points based on your answers. You should have knowledge of nursing skills as I did have questions regarding basic nursing skills and dx's.  Good luck.", "Interview Questions": "Describe a situation where  you provided excellent customer service in your current position?"}, {"date": "19 Jul 2018", "title": "Managerial Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Salt Lake City, UT) in Apr 2015", "Interview Descriptions": "I was a final candidate for a managerial position at Intermountain Medical Center.  The first interview was with three people, the person who would be my direct supervisor, her superior, and an employee.  The second interview was with a group of 6 managers.  The third and final interview was just with the supervisor.  By that time I knew I didn't want the job, and I basically let her know that.", "Interview Questions": "Tell us about a time that yo u had to work with someone you didn't get along with."}, {"date": "11 May 2015", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Apr 2015", "Interview Descriptions": "The process was professional. I received an email informing me of the opportunity to interview by phone. After the phone interview, I was emailed to come in and interview in person. It was 2:1 with the director of finance and a manager. After a week, the skills test was foregone and I was notified that I had not made the cut.", "Interview Questions": "Describe a time when you have had to manage multiple projects that compete for your time."}, {"date": "22 Apr 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Intermountain Health (Salt Lake City, UT) in Apr 2015", "Interview Descriptions": "My internship interview was managed by several people, each one at a time in the room. My final interview included two people- one from a recruiter perspective and one manager of a team.", "Interview Questions": "What kind of position do you envision yourself in?"}, {"date": "6 Oct 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Intermountain Health (Salt Lake City, UT) in Apr 2015", "Interview Descriptions": "I first interviewed on the phone with a senior manager, then I interviewed with two members of senior management twice. It was a technical interview with direct questions about my ability in Database administration, CSS/HTML, Java, Javascript, and general application coding and design, but definitely felt that the interviewers were more interested in me as a person, my soft skill, and if I would make a good contribution to the company culture.", "Interview Questions": "What is your experience with java?"}, {"date": "11 Apr 2015", "title": "Executive- Senior Vice President Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 5 months. I interviewed at Intermountain Health (Denver, CO) in Mar 2015", "Interview Descriptions": "Broken promises, failed commitments. Too many red flags in position and leadership team and I believe that they already had a candidate to offer the position to and I was extraneous baggage. Offered to answer questions, but did not respond. They may have also been fishing for competitive information that I did not provide. I have no idea what the final outcome is as the HR team will not respond or even acknowledge receipt of expenses which were substantial and they had failed to make arrangements for, resulting in my outlay. They are small and will likely be swallowed in a few years so not a place to spend time", "Interview Questions": "They were fishing for competitive information"}, {"date": "8 Jun 2015", "title": "Content Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Intermountain Health (Denver, CO) in Mar 2015", "Interview Descriptions": "I kind of networked my way into the position and they happened to have a position open that fit my skills. I had two informal \"informational interviews\" with members of management, a phone interview with a recruiter, and a formal interview that took a little over four hours with several members of our department.", "Interview Questions": "Why healthcare?"}, {"date": "23 Sept 2016", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Intermountain Health (South Jordan, UT) in Mar 2015", "Interview Descriptions": "The interview process was very positive.  I was asked a total of 6 questions that were all behavioral based.  There were 3 representatives in the room and each took a turn to ask a question.", "Interview Questions": "Describe a time when you were confronted with a difficult situation with a co-worker, and how did you handle it?"}], [{"date": "22 Apr 2015", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Intermountain Health (Lakewood, CO) in Mar 2015", "Interview Descriptions": "Phone screen conducted by HR. Interviewer's questions and response to my answers showed negativity to the point where I had to question why they interviewed me in the first place.", "Interview Questions": "What did your last boss consider to be your weakest characteristic?"}, {"date": "14 May 2017", "title": "I Interviewed to Get Into Their Phlebotomy Training Program Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Murray, UT) in Mar 2015", "Interview Descriptions": "I was interviewed by two women who headed the phlebotomy programs at two different Intermountain hospitals. One of them was cold and jumped all over the fact that I asked about career advancement at her hospital. The interview was a little high pressure because they were only accepting so many into the program and there were two of them throwing questions at you. I feel like they were looking for people in their twenties who were pretty inexperienced and had no ambition whatsoever. Would I say Intermountain is ageist? Yeah, I would.", "Interview Questions": "How did I handle a management dispute?"}, {"date": "1 Mar 2015", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health", "Interview Descriptions": "I went through five meetings over several weeks.  After the phone screening, there was a skills test that consisted of printed sheets describing what they wanted me to do in specific programs, and then I met with different people on four other occasions.  To their benefit they didn't leave me wondering what was happening.  The recruiter kept in touch to let me know I was still under consideration.  I sort of wonder if I only got the offer because I was the only left hanging on after all that time.  Hehe!", "Interview Questions": "If I was on a trip and called you saying I hated my hotel room, how would you handle it?"}, {"date": "8 Jun 2015", "title": "Digital Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 6 weeks. I interviewed at Intermountain Health (Denver, CO) in Feb 2015", "Interview Descriptions": "I applied in the midst of a department restructing, so the \"duration of the process\" was a little longer than usual. However, once the ball got rolling, it was fairly quick and the HR Rep did a fabulous job keeping me in the loop on the next steps and where SCL Health was in their process. \r\nI had 1) an HR Phone Screening call, 2) a 1-on-1 call with the hiring Director, and 3) an in person interview with my future director and the department VP, and finally 4) an in person interview with my future director and the two other department directors. \r\n\r\nBy the time I was done, I felt very comfortable in knowing who I would work with daily, our department's leadership style and personalities, the Mission, Vision and Values of the system and of the specific department in which I would work.", "Interview Questions": "Behavior based questions ... (i.e. Tell me about a time when X-Y-Z or a situation where X-Y-Z)"}, {"date": "21 Jun 2017", "title": "Register Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Intermountain Health (Wheat Ridge, CO) in Feb 2015", "Interview Descriptions": "I went to a job fair and sat down with several people. I was called the next day and it was a quicker process than I expected as I was offered the position and in orientation within 3 weeks.", "Interview Questions": "Where do you expect to see yourself in 5 years?"}, {"date": "14 Apr 2015", "title": "Marketing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Intermountain Health (Denver, CO) in Feb 2015", "Interview Descriptions": "Started with screening from HR representative. That was about a 30 minute call. HR rep was very nice and polite. Fairly straight forward questions about background and provided info on role. That lead to an in person interview which lasted about an hour. Questions focused on skills rather than behavioral type questions.  Followed up with hiring manager but never received an official email or letter that they went with another candidate.", "Interview Questions": "Why do you want to work here?"}, {"date": "11 Jun 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Feb 2015", "Interview Descriptions": "Application accepted and interview scheduled within 2 weeks.  Interview was group type with typical questions. The manager was honest about expectations. HR contacted me by phone with initial offer then with written offer.", "Interview Questions": "Experience, philosophy of patient care."}, {"date": "4 Feb 2015", "title": "Patient Care Tech - Pediatrics Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Intermountain Health in Feb 2015", "Interview Descriptions": "I applied online and got a login . I had applied for a couple other jobs with no success.\r\nFor this job application I had a cover letter and experience as a CNA for 6 months. I also worked at a daycare for 3 years which I think really helped. I called their HR department and three days later got a call from the HR lady about an interview. had a single interviewee who luckily was very friendly and easy to talk to. She asked easy questions. For example \"Tell me about yourself\".", "Interview Questions": "How working in a team helps you succeed? What are three things you can leave me with that will help me choose you over other candidates."}, {"date": "9 Jun 2015", "title": "Specialist, Digital Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Intermountain Health (Denver, CO) in Jan 2015", "Interview Descriptions": "About three weeks after I submitted my application, a representative from HR reached out to organize a phone interview with the hiring manager. The hiring manager called and asked five questions ranging from past work experiences, what I would aim to complete first if I were selected for the position, and even where I saw myself in a few years, I waited another three weeks until I had my in-person interview at the corporate office. Once I completed that, they were very transparent about the number of candidates they had left to interview. I wasn't sure who I'd hear back from next, but I was honored to hear from the Senior Vice President and Chief Communications and Marketing Officer about joining the team!", "Interview Questions": "Where do you see yourself in a couple years?\r\nWhat is one of the first things you'd do in the position?"}, {"date": "20 Sept 2017", "title": "RN COORDINATOR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Saint George, UT) in Jan 2015", "Interview Descriptions": "Lengthy process which included the nurse residency program, simulation trainings, and a highly competitive competition.  I also had to undergo training and orientation to the CVU, ICU, medoncology units, and BHU.", "Interview Questions": "When would you deviate from protocol"}], [{"date": "21 Oct 2015", "title": "Environmental Services Aide Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Intermountain Health (Denver, CO) in Jan 2015", "Interview Descriptions": "I went into the EVS office and interviewed with the then manager of the whole office. It was quick and pain free. He was nice and I just really needed that job.", "Interview Questions": "If you see a patient looking lost or hurt, could you help them?"}, {"date": "13 Jan 2016", "title": "Desktop Support Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Intermountain Health (West Valley City, UT) in Jan 2015", "Interview Descriptions": "I met with the manager, supervisors, and a few team members. We exchanged questions and answers about the position and my abilities and skills. We also talked over the position and what I would be doing.", "Interview Questions": "What do I do for the Army."}, {"date": "23 Dec 2014", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health", "Interview Descriptions": "Phone interview with the recruiter, then hiring manger, then one in-person interview. I had a good experience, recruiters were very responsive and interview team was professional and friendly. I felt they asked fair questions and were very honest answering my questions. Overall, I was very pleased with the experience and decided to take the position and have been very happy here.", "Interview Questions": "Least favorite job you have had and why."}, {"date": "1 Dec 2014", "title": "Psychiatric Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Ogden, UT)", "Interview Descriptions": "I don't remember how long it took after applying online to hear back from them, but when I was called the interview was scheduled for a couple of weeks after. I was surprised and a bit intimidated to find that there would be three staff members interviewing me, but my fears were quickly allayed as they were all very pleasant and brought out the best in me. It felt very casual and was actually kind of fun. The interview lasted maybe 20-25 minutes. They said they would let me know if I got the job by the end of the next week, but later that day called for references, and the day after the interview I was offered the job.", "Interview Questions": "Tell us about a time you went above and beyond for a patient. "}, {"date": "29 Oct 2014", "title": "TAC Analyst I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Intermountain Health", "Interview Descriptions": "I was recommended by a friend, but SCL went through a contract company, who then contacted me. I was a contractor for 6 months and then hired on full time with SCL. From what I can tell they no longer use the contracting company anymore and hire directly through SCL. I had 1 phone interview, and 1 in person interview.", "Interview Questions": "A few technical questions here and there threw me for a loop, mostly because I was not in front of a PC and speaking to them on the phone so it was difficult for me to explain step by step how I would resolve the issue. "}, {"date": "23 Feb 2016", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Nov 2014", "Interview Descriptions": "I applied the job through the company website. It took about 2 and half weeks to get a response. It was one on one and the interviewer was really nice to talk with.", "Interview Questions": "Tell me about yourself."}, {"date": "2 Nov 2015", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 7 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Nov 2014", "Interview Descriptions": "Applied through career fair. Got a call from a recruiter to visit their office in Murray. There were about 30 candidates.They showed us around and talked about the work that was being done their. \r\nThen took us to meet with managers one by one and we had our interviews. After that they gave us lunch. Whole process was about 3-4 hours.", "Interview Questions": "Basic HR type questions. Hypothetical scenarios regarding work place conflicts and how you would handle them. Talk about projects that you have done in school."}, {"date": "22 Oct 2014", "title": "Sourcing Specialist Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "Very Friendly interview and accommodating with date and time of interview. They were very clear that the company was moving about this time next year. Felt like they really wanted to know about my work history.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "7 Apr 2015", "title": "Physical Therapist Assistant (Aquatic) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Intermountain Health (Salt Lake City, UT) in Oct 2014", "Interview Descriptions": "Had a brief phone interview followed by a second phone interview in which 3 therapists (2 PT's and one PTA) asked questions. After the second interview I was invited to fly out to Salt Lake City for an in-person interview...on my own dime, which I did.  A recruiter called me about 1 1/2 months after the in-person interview to tell me that I did not get the job and that they had a hard time deciding between me and the person that they hired. I was glad that they at least called me instead of sending me a generic email like most companies do. The recruiter was also open to answering questions regarding interview feedback which was helpful.  Most companies want nothing to do with you after they send a rejection email. The respect was appreciated.", "Interview Questions": "Mostly scenario questions about how you would interpret a PT's note and how to progress a pt."}, {"date": "25 Oct 2015", "title": "End User Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Billings, MT) in Oct 2014", "Interview Descriptions": "The hiring process takes some time. About a month or so I think is about how long it took to get through interviews and such. Pretty straight forward interview questions.", "Interview Questions": "Where do you see yourself in 5 years"}], [{"date": "9 Jun 2016", "title": "IT Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Intermountain Health (Salt Lake City, UT) in Sept 2014", "Interview Descriptions": "The interview process was quite normal.  I initially was screened by the HR rep who asked me traditional questions about my previous experience and schooling, my interest in the position, etc.  After getting the green light from the HR rep I was then asked the following day to interview with the hiring manager in person.  We had a delightful conversation and talked about how my experience and schooling is a great match.  I was made an offer, at a very low hourly rate that was non-negotiable.  I took the job for the experience; however, I wish i had taken a job with better pay, especially since full-time positions with IHC provide horrible base pay and benefits - unless you are coming into a high leadership position - SVP or higher.", "Interview Questions": "Tell about a time you..."}, {"date": "3 Jul 2014", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Intermountain Health", "Interview Descriptions": "Applications are submitted online.  More than half are rejected based on whether or not you answer the correct questions.  Once selected there are usually 2 interviews followed by an official job offer via phone call and email.  The work environment varies on the clinic.  I worked in 2 clinics.  The first was very positive.  The physicians, MA, rad tech and receptionists all view each other as equals. As such patient care and service was at its best.  At the 2nd clinic the MA viewed the receptionists as lower individuals and it created a very difficult environment.", "Interview Questions": "Difficulty with different insurance companies and their policies regarding care.  It is hard to know what company covers what. "}, {"date": "16 Nov 2015", "title": "Business Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Jul 2014", "Interview Descriptions": "It depends on what area of the company you are applying for. Interviews vary from casual setting to picky. Some departments at Intermountain Healthcare are more interested in \"clicking with you\" to find out if you will be a good fit with the team.  Other areas will pick your resume apart and ask about any or all formal training the candidate has that qualifies he or she to do the job. Some teams will have a scenario that you need to explain how you would work, etc. Often I found the hiring manager already had an internal candidate in mind, and my interview was just so they can fill out paperwork to make HR happy, and to avoid a lawsuit later. If you are lucky to get an in-person interview, watch for the interaction.  If some of the employees on the panel don't care to interact much with you, it is because they are just going through the motions.", "Interview Questions": "Give me an example of a time when you..."}, {"date": "20 Jun 2014", "title": "CNA Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Salt Lake City, UT)", "Interview Descriptions": "After submitting the application, I had a group interview. The interview questions were related to the position, my abilities, and my personality. I interviewed at on off site campus that was easy to find. I received a call within two weeks offering me the position. I then set up orientation to learn the organization's practices and policies.", "Interview Questions": "I did not have previous experience, as the hardest question for me to answer was regarding why I would be good for the job without experience."}, {"date": "10 Oct 2016", "title": "Social Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Cedar City, UT) in Jun 2014", "Interview Descriptions": "After the position closed, I received a letter inviting me to an interview.  The time and place were very specific.  I was interviewed by three individuals, including the current Hospital Social Worker.  It took about 20 minutes.  There were several other candidates who were interviewed as well.  I received a letter to let me know that another candidate had been chosen.", "Interview Questions": "How my past experience has prepared me for a position as a hospital social worker."}, {"date": "29 May 2014", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Intermountain Health", "Interview Descriptions": "Only one interview with a panel. I submitted through website and then the recruiter called. Set up the appointment. Got the job. The people I interviewed with were fantastic! There was a bit of time though on the response as to whether or not I got the job. Overall i feel like it was a great learning experience.", "Interview Questions": "The question about if I had used Pivot tables"}, {"date": "5 May 2014", "title": "End User Analyst II Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Intermountain Health (Denver, CO) in Apr 2014", "Interview Descriptions": "Manager and Supervisor asked me about my various experience. Manager Gavin, seemed like he was high as a kite during the interview. He also did not really seem interested in my answers and stated he had to leave 1/2 way through.", "Interview Questions": "There were not any difficult or unexpected questions during this interview."}, {"date": "30 Mar 2014", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Intermountain Health", "Interview Descriptions": "Informed of the job opening from a friend and passed the HR screening software and the phone interview. That was followed up by an interview with 6-8 people where they asked me technical questions regarding the work I would performing in addition to soft questions like, \"Give me an example of a time when you successfully managed conflict.\"", "Interview Questions": "They asked me specific questions about Oracle SQL syntax ( when does it make sense to use a 'With' statement to optimize query performance)"}, {"date": "26 Jul 2016", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Mar 2014", "Interview Descriptions": "Interview was very easy, the company takes time to verify all claims and references. They had a number of people I would be working with closely in the interview. Later they told me one of the guys didn't show up for work (probably used their offer to get a better one). I was also offered a pay well above the minimum I specified in my application. This company is serious about staying competitive and retaining their employees. They go as far as using third party companies to research the current pay in the market to do both high initial pay offers and to raise current employees pay even without them asking for it. This is a the first time I've ever seen this.", "Interview Questions": "Multiple question geared towards figuring out how well I would work with the team and how willing I am to study new things."}, {"date": "21 Feb 2014", "title": "HIM Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Intermountain Health", "Interview Descriptions": "Intermountain Healthcare is a prestegious healthcare provider. They look for the best candidates possible so the interview process is a little different than a normal interview. Be prepared for personal experience questions along with behavioral questions as well.", "Interview Questions": "Explain a time when you had to work with a difficult co-worker to meet a departmental goal?"}], [{"date": "3 Feb 2016", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Intermountain Health (Logan, UT) in Feb 2014", "Interview Descriptions": "It was mostly to see how well I would work with the team and to give an example of my critical thinking. I was pretty much a new grad with just working in a nursing home for 5 months. I think they mostly wanted to see if I was teachable, willing to work with others, and if I could work with people who were rough around the edges.", "Interview Questions": "Give an example of what you did in an acute situation. What do you do when working with a difficult colleague."}, {"date": "30 Oct 2015", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Jan 2014", "Interview Descriptions": "Sat down in a room with the hiring manager and an employee, I was asked about basic project management skills. I answered the questions. Half way through the interview there was an activity to find out how you would do in particular scenarios.", "Interview Questions": "Tell us about a time you worked with information technology and how it worked out?"}, {"date": "22 Nov 2013", "title": "Associate Software Engineer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Intermountain Health", "Interview Descriptions": "Online process.  Fairly straightforward.", "Interview Questions": "Describe a mistake you have made in the workforce."}, {"date": "14 Nov 2013", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Intermountain Health", "Interview Descriptions": "One interview, 30 mins long with 4 interviewers including regional rep. About 15 questions.", "Interview Questions": "Tell us about a situation where the outcome didn't turn out the way you expected?"}, {"date": "7 Nov 2013", "title": "Registere Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Provo, UT)", "Interview Descriptions": "My initial interview was a \"group interview\" where they brought a bunch of people in together. I'm pretty sure that the point of the interview was just to see how you interact with others in the various activities.  They also told us all to give a short (~3 minute) presentation on \"anything you want\".  They really do mean \"anything\".  It could be making a Peanut Butter sandwich.  It could be your hobby.  It could be an interesting medical technology that is just coming out.  It's less about the content and more about how you carry yourself.", "Interview Questions": "\"If you were a vehicle, what would you be and why?\""}, {"date": "10 Oct 2013", "title": "Communications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Intermountain Health (Provo, UT)", "Interview Descriptions": "A little intimidating. The second interview was with the whole team -- about 7 people. Took about 6 weeks total.", "Interview Questions": "I wish I could remember...."}, {"date": "18 May 2015", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Intermountain Health (Denver, CO) in Oct 2013", "Interview Descriptions": "I applied online  and  they called me for interview.Hiring process took one month.After the interview I called supervisor to get a reply.Finally she called me as I am selected.They offer me  pay less than what I expected..", "Interview Questions": "Are you able to work with different Nationality?"}, {"date": "1 Nov 2014", "title": "Cancer Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Intermountain Health (Denver, CO) in Oct 2013", "Interview Descriptions": "The hiring process included a telephone interview, an interview with manager and a group interview.  The telephone interview was very easy. Asked why I wanted to leave current company.  The one on one interview went well.  It was more of a getting to know you type interview.  The group interview was a lot harder as there were about five people throwing questions at me.  Just was very honest and did the best I could.  Many times the group interviews are to check your skills but also to see if you will fit in with the team.", "Interview Questions": "The basic questions such as what do you like least about current job, how to handle angry physicians."}, {"date": "1 Oct 2013", "title": "Phlebotomist I Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Intermountain Health", "Interview Descriptions": "The interview I was scheduled for was a group interview with the phlebotomy department manager and the phlebotomy shift manager. It was a straight forward review. They asked specific questions about my past experience, what I thought my weaknesses were, and why I thought I was the best candidate for the position.", "Interview Questions": "Be prepared to be tested on your knowledge of the tools."}, {"date": "19 Sept 2013", "title": "Research Support Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Intermountain Health", "Interview Descriptions": "The interview was a panel interview consisting of two staff members from the department and the department manager. The questions were rather easy although a few were very vague and I believe the intent was to see how focused you are when asked a lot of vague questions. Honestly the interview was positive, and although I wasn't offered the position it was an incredibly learning experience for me as a new graduate.", "Interview Questions": "Please tell us about a time you were asked to do something you didn't want to do and how did you respond? \r\n\r\n"}], [{"date": "12 Sept 2013", "title": "End User Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1+ week. I interviewed at Intermountain Health", "Interview Descriptions": "Interview took place with several folks on the team including the management.  They asked a series of questions and scenarios about my experience.  Lasted over an hour.", "Interview Questions": "What is your biggest weakness?"}, {"date": "28 Sept 2013", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Intermountain Health in Sept 2013", "Interview Descriptions": "It took about two weeks from the time I submitted my application until I was scheduled for a phone interview. About two weeks after the phone interview I took an Excel and SQL skills test. And one week after that, I had my final interview. The final interview was one hour long with the manager and three team members. Then another hour with the manager and an additional team member. I was asked to bring in a copy of an analytical report that I had completed in another setting. The team asked questions about why I chose this particular method of analysis and what I could have done to make it better. Then I was shown three charts and asked to interpret them and give suggestions for how to make them more clear.", "Interview Questions": "What is the project that you completed using Access that you are most proud of? "}, {"date": "21 Oct 2015", "title": "ELearning Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Sept 2013", "Interview Descriptions": "Panel style interview following the STAR method of questioning. I first had a screening interview with a company recruiter, then it moved to a one-on-one interview with the department manager, then I was brought in for a panel interview that consisted of the hiring manager, co-workers and director over all of intermountains elearning and education departments.", "Interview Questions": "\"Tell us about a time where you didn't get along with a co-worker and how did you handle the situation..... etc.\""}, {"date": "4 Aug 2013", "title": "Custodian Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Intermountain Health", "Interview Descriptions": "My experience with the Hireing process was very positive. There are always a number of other applicants. But if you are positive and understanding and listen closely.", "Interview Questions": "What do you have to offer this  ? Tell the truth and be up front and honest. Explain how your weaknesses are also great strengths."}, {"date": "2 Dec 2015", "title": "Radiology Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Jul 2013", "Interview Descriptions": "Long process but overall a positive one. A recruiter will initially call you and ask some screening questions and then set up a time to go interview with a manager. Once you've interviewed it can take one to two weeks to hear back. If you get the job they'll call you and present an offer, if you don't get it you'll get an email stating they've gone with someone else.", "Interview Questions": "How do you deal with difficult people?"}, {"date": "12 Sept 2013", "title": "Senior Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Salt Lake City, UT) in Jun 2013", "Interview Descriptions": "after applying for the job online I was contacted by the recruiter who scheduled a face to face interview. The interview went well, they asked about my current position, questions related with the architecture of the project and about the methodology followed. After waiting for 2 weeks , I got another call from the recruiter asking for a face to face with the manager. In the second interview lots of behavioral questions were asked. I was offered the job the next day. Negotiated the salary successfully and joined the company after 1 month.", "Interview Questions": "Tell about a bug caused by your code which caused serious issues in the production system."}, {"date": "31 Jan 2017", "title": "Registered Nurse Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Jun 2013", "Interview Descriptions": "Short, same questions from group to group.  Behavioral, critical thinking questions, group interview, panel.  No breaks, long time for the recruiter to get back to me.  Poor onboarding process.", "Interview Questions": "Tell us if a time when you helped give a patient an extraordinary patient experience."}, {"date": "29 Apr 2013", "title": "Marketing/Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health", "Interview Descriptions": "I applied for this job about a month before I was called in, but once called, the hiring process for this job was extremely quick. The initial contact was very organized and supplied very detailed information about the interview, how to get there, etc. Within one day of my first interview, I was asked back for a second. Within another week I was offered the job. Both interviews were panel interviews; with the same core people in both meetings and then some other, different people in each interview. Questions were very organized and obviously thought through in advance, some typical, some not; however, nothing was too difficult for someone who has prepared well for interviews or had previous interview practice. I was asked some very basic technical questions which I found surprising for anyone with any experience whatsoever, but they were easy to answer, so that was nice. All of the people who talked to me were extremely friendly and very pleasant, and because of this it was easy to come across as upbeat and positive as a prospective employee. I wasn't actually sure I wanted to work for this company before interviewing with them, but both interviews quite changed my mind after seeing who I would be working with and learning more about the position.", "Interview Questions": "None of the questions were difficult for someone confident in their abilities to perform this job. I felt very relaxed and positive about my ability to help them with their work."}, {"date": "26 Oct 2015", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Apr 2013", "Interview Descriptions": "I started with a phone interview with the clinic manager that lasted 10 or 15 minutes and then went into the clinic where I interviewed with him in person.  He had one other Patient Service Rep involved in the interview process.  They were professional and asked very appropriate questions related to the position.", "Interview Questions": "What past experience makes you qualified for this position?"}, {"date": "12 Feb 2013", "title": "Database Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (West Valley City, UT)", "Interview Descriptions": "The interview consisted of 8-12 people in a room asking an assortment of questions.  I think they do this because nobody wants to get the blame is somebody doesn't work out.  This position constantly appears which tells me their interview process is flawed.  Questions included business type questions, personal questions, and technical questions.", "Interview Questions": "The technical questions were the difficult part of the interview."}], [{"date": "6 Feb 2013", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1+ week. I interviewed at Intermountain Health", "Interview Descriptions": "It was great and I really liked the whole process. They were really nice and made everything super easy in the interview. I was offered the job and it was a great experience but the pay was too low.", "Interview Questions": "Tell me about yourself. "}, {"date": "29 Jun 2016", "title": "Ins Ver Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 days. I interviewed at Intermountain Health (Salt Lake City, UT) in Feb 2013", "Interview Descriptions": "super easy and very comfortable, did not feel in a tight situation at all like most places. They are very open and inviting,., They also take everything you have done into consideration, great environment. and amazing benefits", "Interview Questions": "how can you help our company"}, {"date": "7 Jul 2016", "title": "Office Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Intermountain Health (Salt Lake City, UT) in Feb 2013", "Interview Descriptions": "The process was well organized and thorough with no details left uncommunicated by HR or the hiring manager. The panel interview took place with the previous (then current) office coordinator, the unit educator and the department director. They were good about clarifying on various questions as needed, communicated the next steps in the process and had a prompt offer following the interview.", "Interview Questions": "Tell me about a time that you worked with a difficult coworker. What did you do? What was the outcome?"}, {"date": "19 Apr 2017", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Salt Lake City, UT) in Feb 2013", "Interview Descriptions": "I applied online and received a call shortly after. I interviewed with the manager over the team as well as the supervisor. It was a very relaxing and non stress environment.", "Interview Questions": "Customer service oriented"}, {"date": "20 Jun 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Salt Lake City, UT) in Feb 2013", "Interview Descriptions": "Applied and was contacted within approximately one week to interview. \r\nThe interview process was smooth (overall positive experience and average level of difficulty with interview questions). \r\nReceived follow up within about one week after interviewing and was offered the position at a higher rate than the posted starting pay.", "Interview Questions": "Tell us about a time when you interacted with a difficult customer and how did you handle the situation?"}, {"date": "24 Jan 2013", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Intermountain Health", "Interview Descriptions": "I was a student intern in the office and got approached by the floor manager for the open position. After applying I was interviewed by the doctor I would be working with, the other staff I would be working with, and finally, upper management. The interview style was one where the interviewers prepared general interview questions and asked them to me. After the interviews were finished the job was offered.", "Interview Questions": "What is your biggest strength/weakness - I hate this question"}, {"date": "11 Jan 2017", "title": "Scrub Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Intermountain Health (Sandy, UT) in Jan 2013", "Interview Descriptions": "2 months long for them to go through the whole process. it took a long time, and the managers were difficult to read/be personable. they asked simple medical questions about your skills in order to see if you are able to do the job.", "Interview Questions": "what can you bring to this job"}, {"date": "9 Dec 2012", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Ogden, UT) in Nov 2012", "Interview Descriptions": "Apply online, Manager called and gave a quick and confused interview. Received an e-mail rejection notice.", "Interview Questions": "The questions were rushed and scattered.  "}, {"date": "26 Aug 2015", "title": "Behavioral Health Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Intermountain Health (Wheat Ridge, CO) in Nov 2012", "Interview Descriptions": "Interview process entailed sitting with the director of the ED as well as the director of nursing. They both asked a series of questions involving my past experience, education, and why I was interested in position.", "Interview Questions": "How do you feel you would contribute to the health care team here?"}, {"date": "12 Oct 2012", "title": "Senior Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Salt Lake City, UT)", "Interview Descriptions": "My interview consisted of two rounds. First with a manager and then a second with a small panel (3 people). The overall process was very smooth and the questions weren't to challenging. Mainly behavioral and background questions were asked in both rounds. Intermountain puts a great deal of emphasis on team work, honestly and work ethic. If you can demonstrate that you are a hard worker that gets along with your colleges and will go the extra mile, you will fit in nicely at Intermountain Healthcare.", "Interview Questions": "Where do you see yourself in 5 years?"}], [{"date": "24 Sept 2012", "title": "Switchboard Operator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Intermountain Health (Topeka, KS)", "Interview Descriptions": "I honestly do not know what the process is like now, because it has changed quite a bit, since I was hired, but you apply for jobs on-line though the web-site, then I believe go through an interview with Human Resources, then would be referred to department specific people for any further interviews.", "Interview Questions": "I don't know!"}, {"date": "14 Jul 2014", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Intermountain Health (Roy, UT) in Aug 2012", "Interview Descriptions": "Took about a month after I applied online. The interview was a panel of 3 people and was very easy. I was asked to tell about myself, and alot of \"What would you do\" type situations.", "Interview Questions": "Asking me to tell them about group projects."}, {"date": "29 Oct 2015", "title": "Systems Support Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Jul 2012", "Interview Descriptions": "Had an initial interview with the HR rep - asked basic questions about my submitted resume. Very simple stuff - probably just making sure I seemed legit.\r\n\r\n2nd Interview was with my eventual team leader and dept manager. It was relatively casual. My resume has lots of IT support experience, so after they asked a few easy support questions, they were relatively satisfied with my knowledge and credentials.", "Interview Questions": "How do you deal with difficult end users?"}, {"date": "22 Jan 2016", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Intermountain Health (Lafayette, CO) in Jul 2012", "Interview Descriptions": "It was a little intimidating. The first interview is done by phone which takes about 35-40 min. The second interview is done with the department managers. I had to wait for an hour past my interview scheduled time which made the nerves that much worse.", "Interview Questions": "Have you ever had a disagreement with another co-worker?"}, {"date": "8 Sept 2015", "title": "EKG Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in May 2012", "Interview Descriptions": "Very professional.  A long time technician sat in on the interview as well which gave me the opportunity to see how the employee and administration interacted as well as determine if this was someone I would want to work with on a regular basis. The questions were pertinent and on topic to experience, background and how it may be applicable to this job.  Were willing to train based on previous education and medical background.", "Interview Questions": "What kind of car would I be and why? was the most unusual.  All the others were based on my previous experience and future plans."}, {"date": "8 Jun 2014", "title": "End User Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Intermountain Health in Nov 2011", "Interview Descriptions": "I was given a job interview because I had a recommendation from a current employee. When I got to the interview there was 7 people in the room asking me questions one at a time. Some questions tested my technical knowledge. Other questions were just basic interview questions. After showing them that I knew what I was talking about they were very impressed.", "Interview Questions": "The technical questions really tested your knowledge of computers."}, {"date": "17 Feb 2012", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (St. George, UT) in Nov 2011", "Interview Descriptions": "It took a long time. My fist interview was a group interview with ten other people. My second interview was one on one. What distinguished me from the others was my positive personality.", "Interview Questions": "What are some experiences you have had with critical thinking. "}, {"date": "30 May 2013", "title": "Network Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Intermountain Health in Nov 2011", "Interview Descriptions": "Hiring process was poorly executed. The interview went well, and many promises were made but not kept by the employer.", "Interview Questions": "I can honestly say that there were no unexpected questions."}, {"date": "30 Nov 2015", "title": "Facilities Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Intermountain Health (Salt Lake City, UT) in Oct 2011", "Interview Descriptions": "Very long and drawn out. Waited almost 6 months for an answer. However, process was very thorough, and they took their time to weigh answers and credentials carefully. Recruiters were very professional and helpful.", "Interview Questions": "- How many years in the field? What is a tegular tile? Are you available to work on call? Are you willing to travel? What are your professional achievements?"}, {"date": "9 Mar 2013", "title": "Senior Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Intermountain Health in Sept 2011", "Interview Descriptions": "I was initially contacted by their recruiter and informed that I had an interview on xxxx day. He was exceptionally thorough in making sure that I had all the information I needed included individuals interviewing me, the format, the time, advice for parking, etc.  \r\n\r\nOnce I was at the interview it consisted of a panel of 1 peer, my supervisor, and a cross functional member who all took turns asking me questions and grading my responses. The questions were behavioral in nature...I.e. \"tell me about a time when you have not agreed with your boss\" and \"what would you say is your biggest weakness as an employee and how do you work to improve it\". \r\n\r\nAs part of the interview, I was also given a quantitative test element to determine my level of finance ability in an application situation. This was given in Excel and I was given 1 hour to complete it. \r\n\r\nThe job offer was presented by the same individual who set up the interview and was very thorough (again) in going over all the details, the wage and its progression, who I would be working with, start date, etc.  this information was then all presented to me in an official packet through the mail with official congratulations letters, written follow up on the salary and benefits, and scheduling of my orientation and on boarding procedures.", "Interview Questions": " What is your biggest strength and how have you leveraged it to give you success ip with your past employers?"}], [{"date": "18 Jun 2013", "title": "Certified Nurses Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Intermountain Health (Murray, UT) in Sept 2011", "Interview Descriptions": "Received phone call for time to come in for an interview. Came in has interview very easy and felt very welcome interview covered my years of experience and Nurse Manager was happy with the results of the interview felt I was more the able to fill position for full time CNA needed.", "Interview Questions": "What was the one main thing that you remember where you had to calm a patients family/"}, {"date": "2 Dec 2015", "title": "Clinical Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Intermountain Health (Salt Lake City, UT) in Aug 2011", "Interview Descriptions": "Call from HR to schedule interview, interviewed with a panel consisting of the Director, Assistant Director, and team member. I met with them only once and just was asked routine questions that are common in most interviews. Nothing really different or uncommon", "Interview Questions": "Tell us of a time you had to deal with an issue with a co-worker and how did you resolve it."}, {"date": "25 May 2012", "title": "Phlebotomy, Varied Hours Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Tulsa, OK) in Aug 2011", "Interview Descriptions": "You had a short phone interview w/ a recruiter, than a 1:1 w/ the recruiter. You had a wait to be called back like a week or so. Then you were scheduled w/ the supervisor for another 1:1. Then you had to go to Hr do paperwork and such then another couple weeks before starting. It was ridiculous personally. A lot of wasted time!", "Interview Questions": "Why do you want to work here?"}, {"date": "22 Jul 2015", "title": "Distribution Specialist I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Intermountain Health (Logan, UT) in Jun 2011", "Interview Descriptions": "They held two interviews for the position I applied for Intermountain. An initial interview with the Manager and Supervisor, then a panel interview with other co-workers for their input. There may be a screening interview over the phone prior to a face to face interview to establish schedule and experience.", "Interview Questions": "What I would do if I received an urgent call while filling an urgent order?"}, {"date": "19 Jul 2011", "title": "Storage Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Intermountain Health (Salt Lake City, UT) in Jun 2011", "Interview Descriptions": "I spoke with the hiring manager initially on the phone and setup a time for the interview.  I was interviewed by the Team Lead, Manager, Systems Architect, and Senior Storage Engineer of the storage team.  The interview lasted a little over an hour and consisted of some very techinical questions as well as \"getting to know you questions.\"  After this I had to get a blood test, drug test and background check.  Once that passed I was hired.", "Interview Questions": "What is your background with IBM storage?"}, {"date": "20 Aug 2013", "title": "Software Engineer - Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Intermountain Health (Salt Lake City, UT) in May 2011", "Interview Descriptions": "It took a long time to get a call for the first interview. The interview was arranged through a recruiter. I was interviewed by the hiring manager and several of the team leaders of the team I was to be hired into. \r\n\r\nThere was only one interview, and it consisted of personality and project management questions from the manager, and technical questions from the team.  \r\n\r\nOnce the interview was completed, it was over 3 weeks until I heard from them again. When they finally called back it was with a job offer. They wanted me to start as soon as possible. I started working there 3 weeks later.", "Interview Questions": "Give a project timeline and estimate for a project that includes very little detail of what is needed. You are expected to figure out what is going to be required based on just the user interface and give an accurate expected completion date with details about why that timeframe would be accurate."}, {"date": "3 Oct 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Intermountain Health (Provo, UT) in May 2011", "Interview Descriptions": "Hired on initially as a patient care tech.  Found the job posting on the companies web site and was in nursing school at the time.  After finishing school I was hired on by the floor I worked on because I had a good rapport with staff and my manager.  Once working for IHC, it is easy to move around within the organization if so desired and will to be a competent employee", "Interview Questions": "I can't remember, just focus on how you will provide EXCELLENT care to patients and embrace their value of healing connections (aka make patients happy)"}, {"date": "26 May 2015", "title": "Desktop Support Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (West Valley City, UT) in Mar 2011", "Interview Descriptions": "Panel, a decent process with mix of some technical questions and a majority of work ethic, experience, personality.  They believe the tech skills can be trained but the personality and ethic cannot.   If you interview with certain directors in the final interview/approval you may be disappointed with a bit of nepotism and a lack of any respect or interest in other candidates while being reviewed.  Fortunately, there's only a couple/few of these directors and frankly you likely won't want to work under them anyway.", "Interview Questions": "For desktop support asked about printers.   This is a common question because they want to see if desktop folks can deal with printers/printer queues/common networking errors"}, {"date": "3 Feb 2015", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Intermountain Health in Mar 2011", "Interview Descriptions": "I applied online. I was called within a week. I was asked to go to the hospital for a one on one interview. The interview was setup in a small office, the manager and team lead were there. Afterwards, I did a computer task and was sent home. I got a call 2 days later with the job offer.", "Interview Questions": "Weakness/Strengths? If you had a disagreement with a coworker how would you handle it? Give me an example when you dealt with a customer and they... or Give me an example when you dealt with a co-worker and they... and how did you manage?"}, {"date": "14 Jan 2013", "title": "Senior Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Intermountain Health (Salt Lake City, UT) in Mar 2011", "Interview Descriptions": "Dont know much. I started as contractor and got hired.", "Interview Questions": "Depends on team"}], [{"date": "23 Apr 2015", "title": "PSR Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Intermountain Health (Murray, UT) in Jan 2011", "Interview Descriptions": "It was very nerve wracking because they sit you in front of several people who all have their questions, I think are designed to stress you out, maybe to see how you handle stressful situations.  It is impossible to appear relaxed under that type of environmental.", "Interview Questions": "Describe a time when you went above and beyond"}, {"date": "4 May 2015", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Intermountain Health (Salt Lake City, UT) in Jan 2011", "Interview Descriptions": "Easy basic questions, polite, non intimidating, understanding that I was nervous.  I started in a group of people and they explained the job and answered general questions and then they took us one by one to interview individually.  I got a call very shortly after that offering me the job from the HR rep who scheduled all my training very professionally.", "Interview Questions": "Experience and typing test and speed."}, {"date": "24 Oct 2015", "title": "Home Health Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Jan 2011", "Interview Descriptions": "Very kind and understanding. I met with two of the manager for home health. They seemed to have a strong understanding of the industry and have been working there for a long time. They asked a lot of questions that directly relate to the job such as my thoughts on working with medical equipment. My understanding and history in the medical field. They wanted to know my future plans and goals. Pretty straight forward interview process.", "Interview Questions": "how do you deal with pressure"}, {"date": "2 Mar 2014", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Intermountain Health (Saint James, NY) in Oct 2010", "Interview Descriptions": "interview with nursing director.", "Interview Questions": "she reviews your entire life, and makes sure you know she is in charge by putting down your lifestyle"}, {"date": "24 May 2012", "title": "Floor Care Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Intermountain Health (Riverton, UT) in Sept 2010", "Interview Descriptions": "I already worked for the company in a different position.  The process was great however every job interview I have had with the company has taken a very long time between the application and the acceptance.", "Interview Questions": "The classic where do you see yourself in 5 years."}, {"date": "10 Oct 2012", "title": "Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Intermountain Health (Provo, UT) in Aug 2010", "Interview Descriptions": "Group interview with members of the department. Not too lengthy, but grilled on past experiences.", "Interview Questions": "Tell me about a time when there was a disagreement with a doctor. What happened and what did you do?"}, {"date": "11 Aug 2010", "title": "Nursing Job Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Intermountain Health (Scottsbluff, NE) in Aug 2010", "Interview Descriptions": "I realize that we are in a hiring slump, but I am tired of getting the shaft when it comes to interviewing with this company. I have worked with them for several years and can't seem to switch jobs within the company. I feel bad for anyone that has not been a part of the company currently or previously. I call them the 'Evil Empire', because that is what I think they are. They give you small talk at the beginning part of the interview to try and 'calm' you down, I guess. They then, one by one, take you in to a room to do a one on one interview. (mind you there are anywhere from 8-30 candidates) so you don't have much of a chance. I wish that they would pick the top 10 of their candidates and not waste my time. If they don't find one in that 'cream of the crop' then they could ask for more interviews... I hate it when they waste my time... this is not the first interview with them... not sure why I keep bothering with them... oh yeah, I still work for them.", "Interview Questions": "Be Specific. What was your most positive experience with a customer and what was said?"}, {"date": "8 May 2010", "title": "CNA Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Intermountain Health (Provo, UT) in Mar 2010", "Interview Descriptions": "They asked if I had integrity, and how long I wanted to be with the company, and how hard I would work for them by asking if I was usually on time to places and if I would work holidays and things of that nature. They asked what my aspirations were in the health care industry and what more schooling I was planning to take to pursue that", "Interview Questions": "What are your aspirations in the health care industry ?"}, {"date": "6 Apr 2014", "title": "Electrician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Jan 2010", "Interview Descriptions": "Fill out online. Couple different interviews, one panel interview. Answer a few questions, technical stuff, then wait for a job offer", "Interview Questions": "Nothing too difficult. Hardest one was provide an example of when you had to work with someone difficult and how did you handle it."}, {"date": "18 Jul 2013", "title": "Mental Health Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Intermountain Health in Oct 2009", "Interview Descriptions": "Under the former unit manager, the process was based on qualifications re resume and your ability to explain why you wanted the job and how you would perform.", "Interview Questions": "N/A"}], [{"date": "13 Feb 2013", "title": "Orderly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health (Murray, UT) in Aug 2009", "Interview Descriptions": "The initial interview for new hires with Intermountain are usually held at their human resources office.  The first interview is usually a group interview including several candidates.  During the group interview, the HR interviewer will ask each candidate to introduce themselves to the group and give the group a scenario to discuss.  The object is not to be right or to give the best answer.  The object for the HR rep is to determine how well the potential employee will interact in a group.  The trick is to make sure that you are respectful, but make sure to speak up and make your opinion known.  If you perform well, they will give you a one-on-one interview.", "Interview Questions": "I was asked what I thought my coworkers' opinions were about me."}, {"date": "9 Mar 2013", "title": "Operations Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in May 2009", "Interview Descriptions": "Starts with recruiters", "Interview Questions": "Average questions"}, {"date": "28 Oct 2010", "title": "Clinical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Intermountain Health (Salt Lake City, UT) in Apr 2008", "Interview Descriptions": "Interviewed on the phone and another interview in person.  The questions were about my skills and and background employment.  The interview only lasted about one hour.", "Interview Questions": "N/A"}, {"date": "13 Dec 2012", "title": "Finance Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Mar 2008", "Interview Descriptions": "Typically there are two rounds of interviews.  The first round is by the hiring manager.  Often the first round will be with other team members.  The second round of interviews is by the hiring managers boss and possibly by some additional individuals the candidate may interact with.  Intermountain is notoriously slow in the hiring process.  If they make an offer they try and make you feel as though there is no room for negotiations.  Sometimes this is the case but usually there is a little bit of wiggle room in salary negotiations.  Just know that the initial salary is very important because the annual raises are horrible and rarely keep up with inflation.  Salary compression is very prevalent among folks that have been there more than a few years.  The best candidates are often not selected due to politics, favors, etc. of the company higher ups.", "Interview Questions": "You will probably take a computer test to prove your ability to use Microsoft Excel and possibly Microsoft Access.  The Excel test covers calculations for healthcare deductions, asking for definitions for fixed and variable expenditures and basic insert row and column and formulas in Excel.  Also, avoid telling them how much you currently make because they will likely only match that amount in an offer."}, {"date": "8 Apr 2010", "title": "Clinical Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Intermountain Health (Salt Lake City, UT) in Feb 2008", "Interview Descriptions": "The connection was made through an industry trade show where we recognized a mutual interest in each other.  Following multiple conversations over plans for development of the position and expectations for what the position may hold, an agreement was made to follow up in person with a site visit.  Arrangements for the site visit were made very easily and following a thorough interview process that included a 30 minute presentation an offer was made and accepted.", "Interview Questions": "What challenges did you face where your creative problem solving was tested."}, {"date": "13 Mar 2010", "title": "CP Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Intermountain Health (Salt Lake City, UT) in Jan 2008", "Interview Descriptions": "The interview is was your basic interview with the team leader, manager and another employee. Basic questions and a general feel for personality seemed to be the basis of the interview. since it as an entry level position no technical questions or tests were given. Being positive and compassionate seemed to help quite a bit.", "Interview Questions": "What is one major negative work habit that you have?"}, {"date": "1 Sept 2009", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Intermountain Health in Jun 2007", "Interview Descriptions": "The hiring process was not at all difficult. I was made to feel very comfortable, and at ease. There were two rounds of interviews with two individuals in each round. The whole process took about a week and a half to complete. All in all the process was very simple and easy.", "Interview Questions": "Tell me about yourself?"}]]