[[{"date": "7 Jan 2023", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Quality Forum", "Interview Descriptions": "They have a pretty straight forward and standard behavioral interview questions--some specific with regards to research. Long wait time between two interviews, writing brief was done, then ghosted after third interview!", "Interview Questions": "What are your experiences related to working on projects?"}, {"date": "2 Jan 2023", "title": "Managing Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Quality Forum (Washington, DC)", "Interview Descriptions": "Like anywhere else and had six interviews with key stakeholders, hiring manager and direct reports over course of several weeks over zoom . Nothing else worth noting and great onboarding when hired.", "Interview Questions": "Competency and behavioral questions and all different based on interviewer"}, {"date": "5 Apr 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Quality Forum", "Interview Descriptions": "Had two rounds of interviews. Questions were fair but tough. Could tell it was scripted based on repetitive questions. HR screener was difficult to schedule and unfamiliar with the questions and responses.", "Interview Questions": "What is a recent challenge you've overcome? How do you work in a dynamic environment?"}, {"date": "9 Nov 2022", "title": "Vice President Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at National Quality Forum in Mar 2022", "Interview Descriptions": "Very responsive and professional. Diligent and timely in their responses and provided overall good summary of the organization. I appreciated their thoughtfulness and how organized they were. They are a small organization that are trying to do big things and need the help.", "Interview Questions": "How can you apply data to your overall plan"}, {"date": "23 Jul 2021", "title": "Director, Quality Management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Quality Forum in Jul 2021", "Interview Descriptions": "I had originally applied to, and interviewed for, a Manager, QM position. Afterwards, NQF reached out to tell me they were considering me for the Director, QM position instead and to apply in the next 24 hours for an interview that was in 48 hours. I happily agreed and applied. Subsequently, I had 2 separate interviews and a week or so after the last interview I received an email stating the following: \"The hiring team has decided to pursue other candidates who they believe will meet the needs of the department and organization at this time. We wish you all the best in your job search and future professional endeavors.\"\n\nWhile I'm perfectly okay that they decided to move on with another candidate (I had received an offer elsewhere the same week), I am disappointed by the lack of communication about the process and generic copy/paste email I received from the HR team. There was no consideration for the haste with which I was expected to make myself available for another position and no acknowledgement that I had been pulled out of the running for the original position I applied for. \n\nNote to NQF as an org and HR specifically - please be more mindful to the bridges you could be burning with potential talent in the future, especially as a company who is this severely understaffed. This is a small town and everyone in this field tends to know each other.", "Interview Questions": "Describe your quality measurement experience.\nDescribe your managerial/supervisory experience."}, {"date": "22 Feb 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Quality Forum", "Interview Descriptions": "Phone interview with HR, followed by an in-person with hiring manager, and final that included an exercise with hiring team. Typical questions. The entire process took about a month from start to finish.", "Interview Questions": "An area that you feel as though you excel and an area you feel you need additional work to be successful."}, {"date": "17 Jul 2020", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Quality Forum in Jul 2020", "Interview Descriptions": "Kind of awkward, the recruiter asked me to speak slow since she was typing my responses. After about 20 min of general questions, they asked what my range was, and the recruiter explained that what their offering was well below my range.  This was advertised as a mid-senior level, preferred a masters and offered a salary of 50K. Ridiculous.", "Interview Questions": "Why do you want to work at NQF?"}, {"date": "2 Aug 2020", "title": "Quality Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Quality Forum (Washington, DC) in Jun 2020", "Interview Descriptions": "First called for an interview for 30 minutes with the HR representative. They initially called me 30 minutes early and I was not ready so they called back. They then asked me about 10 general interview questions about myself and my resume. It was not difficult and they were very pleasant, but I was a bit thrown off because I was asked to speak extremely slowly and the representative typed out every word of my answer which I had never experienced before. The second round was a video interview and with two different individuals - one for QM and one from QI. They were both kind and asked general interview questions and I enjoyed our conversations.", "Interview Questions": "What is your ideal work environment "}, {"date": "16 Jun 2020", "title": "Analyst Quality Measurement Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National Quality Forum in Apr 2020", "Interview Descriptions": "This was probably the worst and most frustrating interview process I have ever gone through. The recruiter was very unprofessional and left a very bad impression of the company after finishing up the interview. I was contacted by the recruiter via email to schedule a time to have a brief screening call. During the screening call, she proceeded to tell me she was a very slow typist but she had to write my answers down word for word. I had to pause after every single word to give her time to type. I ended up losing track of what I was saying because she would interrupt me saying I was talking too fast even though I was substantially slowing down my speech and ended up pausing for about 7 seconds per word! Even with simple questions like \"why do you want to work here\" - when I answered initially with \"I want to work here because...\", she would pause me right there so that should could write down what I just said. Often times, asking me to repeat things numerous times and pause after each word. Needless to say, during the 30 minute interview, I answered maybe 5 questions because the recruiter needed me to repeat things numerous times and also needed me to pause after every...single....word. \r\n\r\nShe then ended the interview telling me to reach out to her in two weeks. Normally, it is the recruiters job to reach out to you. Instead, she clarified that it was my responsibility to follow up. Really disappointed because I felt I wasted my time preparing and if I had a more competent recruiter, I felt I could answer the questions more comprehensively. However, I felt I had to keep my answers brief and within 5-6 words because the recruiter couldn't type the answers quick enough.", "Interview Questions": "Why do you want to work here? "}], [{"date": "26 Mar 2020", "title": "Project Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at National Quality Forum", "Interview Descriptions": "The HR Recruiter emailed, asking for my availability for a phone interview. I responded with some times, and that was the extent of my experience with NQF. They didn't bother to respond after that, so no there was no interview.", "Interview Questions": "They didn't ask anything because they didn't bother to follow up after requesting my availability for a phone screen."}, {"date": "1 Oct 2019", "title": "Project Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Quality Forum", "Interview Descriptions": "Pleasant Phone Screen with HR/Recruiter. During the interview you are asked to review of your resume. Questions related to time management skills and ability to juggle multiple deadlines was also asked.", "Interview Questions": "Tell me about yourself. "}, {"date": "30 May 2019", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National Quality Forum", "Interview Descriptions": "I received an email from HR for a phone interview. I responded with my availability and did not hear back for a week. I followed up, and finally got a response and we agreed on a time. The HR person never called at the scheduled time and did not send an email until late the same day explaining she was sorry to have missed the call. We then agreed to speak later in the afternoon, and again she never called. I received a random, unscheduled call the next morning and it was HR from NQF. HR proceeded to do the phone interview at that time unscheduled. After the phone interview I was told I would get passed onto the next round. I provided her with my availability and again never received a follow-up. I again had to follow-up and find out what time I should expect a call. I did proceed and have the phone interview with the hiring manager, but did not hear anything following that. I reached out to HR to determine if I was still being considered and they did not even bother to respond. HR for NQF is a chaotic mess, and couldn't seem to fulfill the most basic responsibilities of scheduling interviews. While the position seemed very interesting, I would not want to work for an organization who gives such an impression in the hiring process.", "Interview Questions": "Why are you interested in the job"}, {"date": "5 Jun 2019", "title": "Senior Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at National Quality Forum (Washington, DC) in Feb 2019", "Interview Descriptions": "Great interview process, friendly staff and welcoming front office.  The office was bright, clean and open.  The interview was very professional and not too intense. The first was a phone interview, second a group interview and the third and last interview was with a SVP.", "Interview Questions": "How do you deal with office conflict?"}, {"date": "12 Jul 2016", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Quality Forum", "Interview Descriptions": "Applied online and had an informational interview two weeks later. Was called into the office a week after that for the first interview and then a week later for the second interview. The first time, spoke with the HR point-person, at both second interviews I spoke with a panel of three employees.", "Interview Questions": "Name a time when you had to manage multiple projects at once"}, {"date": "3 Apr 2017", "title": "Project Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Quality Forum (Washington, DC) in Jul 2015", "Interview Descriptions": "My interview was a few years ago and it went well but I had to come in multiple times to meet with different people for different levels of interviews. I was interviewed by a few people who told me they weren't prepared to interview me because they didn't know they were supposed to. Since then, a lot has changed. Apparently now you record videos of yourself answering various questions. I've been told that you can watch yourself back and can re-record so you'll likely spend an entire day doing this.", "Interview Questions": "Tell me why you think you're a good fit for this job"}, {"date": "18 Feb 2015", "title": "Junior Accountant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Quality Forum (Washington, DC)", "Interview Descriptions": "I had a phone interview and was invited to an in-person interview. My circumstances changed and so I couldn't accept the job. I emailed the Director of HR to cancel the interview. He was very courteous and asked multiple times if I was sure that I couldn't work for them.", "Interview Questions": "Let's go through your resume one by one."}, {"date": "23 Mar 2014", "title": "Project Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at National Quality Forum", "Interview Descriptions": "The interview process was very fair, the questions were standard, and you just had to show knowledge and interest in the field. HR was very kind and friendly. They asked a list of questions mostly about teamwork.", "Interview Questions": "Which department do you prefer to be in?"}, {"date": "11 Nov 2013", "title": "Project Analyst Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Quality Forum (Washington, DC) in Sept 2013", "Interview Descriptions": "A very short phone screen about your work and education history. In-person interview was in 30 minute rounds with two interviewers each - about 2.5 hours total. Straightforward questions i.e., reasons for wanting to work there, management style preferences, typical role you take in team work, etc. The interview process happened within two weeks but it took over a month for them to get back to me about the result of the interview. Also applied a couple of months before I was contacted.", "Interview Questions": "If you are working on a project for one manager and another one approaches you and asks you to work on something else for them, what would you do?"}]]