[[{"date": "9 May 2023", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mass General Brigham", "Interview Descriptions": "It was holistic and questions covered all aspects of professional and personal life to where I want to head in the future. I would say no special presentation is required.", "Interview Questions": "How will you do Competitive Landscaping?"}, {"date": "30 Jan 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mass General Brigham", "Interview Descriptions": "The interview process was pretty typical and was asked a basis of some knowledge questions and logical questions and spent a day shadowing, other registered nurses in a specific specialty", "Interview Questions": "What was one instance in which you felt you persevered."}, {"date": "18 Jan 2023", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mass General Brigham", "Interview Descriptions": "The interview process was fair and transparent. They were very good about communicating the process and steps taken along the way. The people were nice and questions were for the most part straight foward.", "Interview Questions": "Talk about your past work experience."}, {"date": "15 Dec 2022", "title": "Clinical Research Regulatory Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mass General Brigham", "Interview Descriptions": "Phone interview with human resources, then a week later notification of zoom interview invite with 2 Program managers. Speak with one manager at a time in separate zoom rooms, about 30 min each", "Interview Questions": "Why should we hire you?"}, {"date": "15 Nov 2022", "title": "Mental Health Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Mass General Brigham (Boston, MA) in Oct 2022", "Interview Descriptions": "Was very straightforward, concise, was an interview about who I am and what I would like to do within the facility. It was also about what my patient population interests are.", "Interview Questions": "Tell me about yourself, what brought you into mental health?"}, {"date": "4 Dec 2022", "title": "Chief Architect Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mass General Brigham (Boston, MA) in Oct 2022", "Interview Descriptions": "Really well-organized and professional. The first round was by two potential colleagues. Second round with CIO. then 3rd round as a panel interview style. Very poignant and challenging questions on all topics related to technology, leadership, diversity, and strategy. Great team over at MGB under a world-class CIO leader. The pride in the organization is palpable and shows throughout the interview process.", "Interview Questions": "What would you bring to MGB and what would you leave behind?"}, {"date": "13 Jul 2022", "title": "HPC Applications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mass General Brigham", "Interview Descriptions": "There were two interviews - an interview with the manager and then a team interview. The first interview had a technical challenge to demonstrate skills. Very quick and simple process.", "Interview Questions": "How would you install this software?"}, {"date": "9 May 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mass General Brigham", "Interview Descriptions": "After I applied for this company, I got a video interview next week. The interviewer asked me about my research experience and future plan. Also, she asked if the research was enjoyable.", "Interview Questions": "What is your research experience?\r\nWhat is your future plan?"}, {"date": "14 Apr 2022", "title": "Trainer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mass General Brigham", "Interview Descriptions": "Three interview process with different people \r\nFirst was with the recruiter over the phone\r\nThe Second and the third interviews were  with the direct team manager and the senior manager\r\nOver skype", "Interview Questions": "Why would you like to work for us?"}, {"date": "14 Apr 2022", "title": "CLINICAL RESEARCH FINANCIAL ANALYST Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mass General Brigham", "Interview Descriptions": "Interview process was easy and straightforward. Met with the team and discussed the role and my experience, after which I met with the Hiring Manager. Everyone was very welcoming and just wanted to get to know me better and understand if I fit within the team and company.", "Interview Questions": "Q. Describe your experience in clinical research finance?\n"}], [{"date": "26 Jul 2022", "title": "Help Desk Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mass General Brigham (Boston, MA) in Apr 2022", "Interview Descriptions": "Microsoft Teams interview.\nTwo people were in a panel. \nOne was the direct manager, and one is the senior manager.\nReceived no questions from the senior manager.\nDirect manager did not care about prior experience.", "Interview Questions": "Can you do the job?"}, {"date": "26 Mar 2022", "title": "Finance Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at Mass General Brigham", "Interview Descriptions": "Process took over 2 months. Initial phone screening a week after submitting application.  Contacted by hiring manager 1 month later for a video interview. Sent a follow up email after no response for 3 week. Received a generic rejection letter from HR that they went with another candidate, only to see job posted again 2 days later.  Ghosting candidates is unprofessional. Don't waste your time applying.", "Interview Questions": "Provide examples of areas you've found most challenging in your career. "}, {"date": "9 May 2022", "title": "Senior Practice Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mass General Brigham (Salem, NH) in Mar 2022", "Interview Descriptions": "Multiple interviews (5) with various members of the current leadership team. These take up precious time away from a busy day while currently working in a different position within the organization. Ultimately got passed over for another great candidate but the interview process was still as expected. They are building a great team there.", "Interview Questions": "What my management style was like. \r\n"}, {"date": "10 Feb 2022", "title": "Investment Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mass General Brigham (Boston, MA) in Jan 2022", "Interview Descriptions": "Mostly qualitative questions about motives behind applying for a job in non-profit institutional investment.  Questions also ask to demonstrate understanding of difference between institutional investing and investment management. Will ask about willingness to work in-person or hybrid, as they seem to be trying to shift from remote working.", "Interview Questions": "Why work for non-profit investor? "}, {"date": "12 Dec 2021", "title": "Business Operations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mass General Brigham", "Interview Descriptions": "initial phone screen, multiple video interviews with employees from various departments.  Standard questions and reasonable duration across all.  But too many interviews and poor candidate experience driven by excessive time lapse in communication.  The process takes months, requests for updates go unanswered, and very little to no feedback is presented when and if you're lucky enough to get in contact.", "Interview Questions": "What do you want out of your career and how does this position fit that?"}, {"date": "11 Dec 2021", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Mass General Brigham (Boston, MA) in Aug 2021", "Interview Descriptions": "The interview process went very smoothly, I interviewed with two people- Jennifer (who was very nice and relaxed) and Isaiah (who is very monotone and showed little expression). It was a zoom interview and they asked really simple standard questions.", "Interview Questions": "What experience do you have?"}, {"date": "7 May 2022", "title": "Senior Application Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Mass General Brigham in Aug 2021", "Interview Descriptions": "Multiple preliminary screening interviews. Once I was able to speak with the divisional manager, they were able to work to find a position that was the best fit for the department as well as myself.", "Interview Questions": "Tell me how you dealt with a difficult situation with a vendor and what did you do to make it a successful solution."}, {"date": "26 May 2021", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mass General Brigham", "Interview Descriptions": "Got an email from a recruiter to set up time to interview. This portion was very general and I found I couldn't really as a lot of questions about the job. The recruiter mentioned the hiring manager will provide more specific details. \n\nI scheduled a time to meet several managers on site. Very nice vibe and got a nice tour of the office. \n\nThe process wasn't so bad, but found it harder during the negotiation as it was a lot of wait, let me check with the hiring manager first. Felt like it was more waiting, back and forth and I would be worried that the managers would lose interest.", "Interview Questions": "-Lots of behavior questions like, can you tell me a time when you took initiative/ handled a challenge?\n-why are you interested in this job?"}, {"date": "11 Feb 2020", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mass General Brigham", "Interview Descriptions": "Well organised. Was called in time. Had to go for 2 rounds. They contacted my references. Multiple locations. Overall Good experience. I dont have anything else to add. Please let me submit this ,", "Interview Questions": "Tell me about yourself and your last job"}, {"date": "17 Jan 2020", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Mass General Brigham (Somerville, MA)", "Interview Descriptions": "Phone screen, phone interview, and in person interview.  A day before in person interview, I was informed that they would like me to do a presentation. Not enough time was given but I spent all day preparing. The interview was with two team members, one of which couldnt stop firing questions and seems arrogant. The whole hour and half was very intense. The presentation piece was unnecessary. The same outcome can be achieved by behavioral questioning but candidate is more relaxed. Too many irrelevant questions, too uptight, and by their own admission they are all about work, work, and work. Interview was a clear indicator that this is not a good fit for me.  I received an email in a timely manner indicating that I will not be proceeding to next round of interviews. Imagine going through another round of interviews after all this!!", "Interview Questions": "what conversation topic will you discuss with CEO?"}], [{"date": "7 Oct 2019", "title": "Licensing Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Mass General Brigham (Cam, MS)", "Interview Descriptions": "3 rounds of interview. Phone screen, Skype and On-site. Behavioral interview questions. Easy interview. Very organized interview process and prompt follow up. Hiring manager, admin staff and HR kept in touch through the interview process. Very realistic timelines for follow up.", "Interview Questions": "How do you evaluate technologies for their commercial potential?"}, {"date": "9 Jul 2020", "title": "Human Resources Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Mass General Brigham (Somerville, MA) in Sept 2019", "Interview Descriptions": "The process took about 2 weeks. I had an initial phone screening then had an in-person interview with the HR team. They asked standard questions and were very friendly. I heard back a week later but did not receive an offer.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "16 Sept 2019", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mass General Brigham (Boston, MA) in Sept 2019", "Interview Descriptions": "Applied Online, HR Contacted me for on-site interview. The interview was technical. The hiring manager was very friendly. Made interview process comfortable. The interview lasted for 20 minutes and got a reference check email from HR within 5 hours of giving an interview.", "Interview Questions": "Why opt for Clinical career. General Resume question. Strength and Weakness.  \r\n"}, {"date": "10 Mar 2022", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Mass General Brigham in Sept 2019", "Interview Descriptions": "2 full days of interviews was intense but also gave important insight into the leaders that I'd be working with.    There was a real-world application exercise wherein the candidates had to respond to a set of data and questions to demonstrate analytic capacity.", "Interview Questions": "What direction do you think healthcare can and should head?"}, {"date": "17 Aug 2019", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mass General Brigham", "Interview Descriptions": "Met with several colleagues at the company. The interviewers were very friendly and asked thoughtful questions. There were several types of positions that interviewed me and it was a good opportunity to learn about the work that they do and the dynamic in the office. We had a great discussion and it was easy to talk to the staff.", "Interview Questions": "How do you manage tough conversations"}, {"date": "28 Jan 2020", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Mass General Brigham (Boston, MA) in Aug 2019", "Interview Descriptions": "The interview process was over Zoom.  The questioning was standard but very specific to the Job description.   The interviewers were the hiring manager and his direct report.", "Interview Questions": "How do you manage the workload?"}, {"date": "19 Jul 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Mass General Brigham", "Interview Descriptions": "Took a few months, started with initial phone interview with recruiter and with manager. Brought in 2x for in person interviews with different team members. Relatively straight forward process, team was very nice and responsive throughout.", "Interview Questions": "Why switch to healthcare?"}, {"date": "13 Jun 2019", "title": "Project Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mass General Brigham", "Interview Descriptions": "Phone interview with HR then two in person interviews with team and leadership. Behavioral questions mostly. Took a month to hear about decision. They asked for three references but they only contacted one reference.", "Interview Questions": "Why are you interested in this role?"}, {"date": "10 Jun 2019", "title": "Marketing Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mass General Brigham", "Interview Descriptions": "The initial interview, I interviewed with the corporate marketing team.  Once that interview was complete, I met with some of the senior leaders of Partners International, and members of functional teams.", "Interview Questions": "They asked about prior global marketing experience."}, {"date": "8 Dec 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Mass General Brigham (Boston, MA) in Apr 2019", "Interview Descriptions": "Online, straightforward. The interviewer greeted me and told me a little about the internship and themselves then moved into questioning me. Relatively fast, easy, nice, professional, and wrapped up with any questions for them.", "Interview Questions": "What makes you stand out from the other candidates?"}], [{"date": "18 Mar 2019", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Mass General Brigham (Las Vegas, NV) in Mar 2019", "Interview Descriptions": "It was easy and everyone was nice.. I hope i get the job bescause im new to town and ready to get back to the medical field...so wish me luck", "Interview Questions": "Why do i want to work for the company"}, {"date": "8 Jun 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mass General Brigham (Somerville, MA) in Mar 2019", "Interview Descriptions": "The interview process was fairly easy, as it was just phone interviews. Everyone was friendly, and no tough questions were asked. I received an offer about a week after my phone interview.", "Interview Questions": "Name one time a group project did not go as expected, and how did your group adapt?"}, {"date": "25 Jan 2023", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mass General Brigham in Mar 2019", "Interview Descriptions": "Applied online and got a call from the recruiter. Got a call from the director who scheduled the interview with me after I passed the screen. Had an in-person interview and got a quick tour of the office space. Heard back within 1-2 weeks about a job offer.", "Interview Questions": "Tell me about a challenge you faced and how you overcame it."}, {"date": "26 Feb 2019", "title": "Applications Analyst II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mass General Brigham (Somerville, MA) in Feb 2019", "Interview Descriptions": "Standard Interview questions, very pleasant. Interview took place in a room and people visited you in that room.  Had phone interview with recruiter, then phone interview with hiring manager 30 mins, then in-house interview", "Interview Questions": "\r\nHow would your coworkers describe you?"}, {"date": "11 Jul 2021", "title": "Licensed Clinical Social Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mass General Brigham (Boston, MA) in Feb 2019", "Interview Descriptions": "Nice and informative when speaking about the job and inviting to questions and concerns during the interview process. Friendly and accommodating and easy to speak to staff during the interview easing interviewees nerves", "Interview Questions": "Strengths and weaknesses of yourself and how to handle situations"}, {"date": "11 Jun 2019", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mass General Brigham (Somerville, MA) in Jan 2019", "Interview Descriptions": "Was nervous at first but everyone was very kind and welcoming. They all seemed very eager to meet me and asked me a lot of easy going questions. I didn't feel like I was interviewing, felt more like a conversation.", "Interview Questions": "Why this job?"}, {"date": "18 Dec 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mass General Brigham", "Interview Descriptions": "Applied and about a month later got an interview with HR on the phone. Then got an in person interview. Was told to prepare a few things (things I found interesting on their website). I got an offer within a few days. Start date was depending on which orientation I was able to attend.", "Interview Questions": "How do you handle stress?"}, {"date": "16 Nov 2018", "title": "A Technical Manager Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Mass General Brigham (Boston, MA)", "Interview Descriptions": "Applied \n- A recruiter reached out to me to schedule an interview \n- I prepared and took my lunch break to do the initial screening\n- The recruiter calls, introduces herself, talks about the role, and I go right in for maybe 15m - 20m about my experience and why I’m a good fit. She does the “mmhm” “yeah that’s great!” “Oh wow interesting”\n\nThen drops me with the they’re not interviewing me for this role and am I interested in another role that pays significantly less than the role I applied for and the role I’m currently doing. \n\nI have never had a more unprofessional interview in my life then come to find this is a common practice as 3 of my friends had the same experience. I would not have been so offended had I known prior to scheduling the interview. They had no intention to actually interview me nor had any intention of letting me until during the interview.\n\nI do not recommend partners to millennial workers who have something to offer. They will bait and switch.", "Interview Questions": "“Would you be open to apply for a role that’s completely not the role you applied for and that we’re currently having an interview for”"}, {"date": "20 Sept 2018", "title": "Third Party Reviewer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mass General Brigham", "Interview Descriptions": "First I had a brief, friendly phone call with HR after I submitted my online application (asked me why I applied for this role and my salary expectations), which lasted about 10 minutes. Then we set an appointment for a panel interview with 3 managers. \r\n\r\nThe panel interview lasted only about 20 minutes. They asked me basic interview questions and gave me some insight on the job and company culture.", "Interview Questions": "What were your duties in your previous job?"}, {"date": "28 Aug 2018", "title": "Leadership Development Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Mass General Brigham (Los Angeles, CA)", "Interview Descriptions": "Two rounds of 1-on-1 interviews back to back, with two people from different departments. Each round lasted about 30 mins. Other candidates were present and waiting in the same area.", "Interview Questions": "Tell me about yourself, and mostly behavioral questions."}], [{"date": "12 Mar 2019", "title": "Applications Analyst II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Mass General Brigham (Boston, MA) in Aug 2018", "Interview Descriptions": "After I applied through LinkedIn, I had one phone call screening with the Lead Analyst and one in person interview that lasted about 2 hours. I first met with a couple of Clinical Systems Analysts from the department, then the  Lead Analyst, then directors of both IT and engineering departments.", "Interview Questions": "What I could bring to the role without having a clinical background"}, {"date": "16 Jan 2019", "title": "Health Policy and Contracting Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Mass General Brigham (Somerville, MA) in Aug 2018", "Interview Descriptions": "Three phone interviews, two in person interviews. Spread out over 2 months. I had to present to the Vice President, two directors, and three managers for my final interview.  After an hour presentation, there was an hour of Q&A.  The questions were intense and a lot of them were to see how I handled pressure and how to answer questions I didn't know the answers to. Wasn't a pleasant experience, but what interview is?", "Interview Questions": "How do you stay organized?"}, {"date": "16 Mar 2021", "title": "IS Programmer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Mass General Brigham (Cambridge, MA) in May 2018", "Interview Descriptions": "1) Phone call with the HR\n\n2) In person interview with the manager regarding experience, coding questions, and then meet with coworkers who will ask some questions \n\n3) Heard back in less than week from HR with salary.", "Interview Questions": "How do you approach an error during coding?"}, {"date": "9 Jul 2022", "title": "Patient Registration Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mass General Brigham (Somerville, MA) in Mar 2018", "Interview Descriptions": "the initial interview is good, you get to meet the hiring manager and they ask you questions about yourself and why you want to work with mgb and they ask about your  goals and past experience.", "Interview Questions": "N/A"}, {"date": "11 Apr 2018", "title": "Collections Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Mass General Brigham (Somerville, MA) in Feb 2018", "Interview Descriptions": "Met w/Management x3. Scenario based questions. Received request for references, and promptly submitted. Two months have passed with no contact or decision regarding my candidacy and no response to my follow-up email.", "Interview Questions": "Describe a time you had to deal with a difficult patient and how you handled the situation?"}, {"date": "10 Feb 2018", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mass General Brigham in Nov 2017", "Interview Descriptions": "I had one or two phone interviews before getting an in-person interview. That entire process took a few weeks. The interview was average in difficulty and everyone was pleasant. Length of the interview was also adequate. I can understand if I wasn’t a good fit for the organization or for that position specifically but I think it unprofessional not to send a notification informing me that the job had been filled and that I was not selected. I liked everything else that I learned about the organization but that one thing is a turn off. They do not pay well but I applied anyway because I thought I’d enjoy the work. I’m sorry to say that I have been deterred from applying to other positions there.", "Interview Questions": "What process improvement tool do you like using the most?"}, {"date": "26 Oct 2017", "title": "Senior Engineer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mass General Brigham", "Interview Descriptions": "Coding test with exploration to scaling.\r\n\r\nThe only company I have ever met with a 0 rating on the Joel Test:\r\n- no development practices at all and little likelihood of implementing any ever\r\n- no possibilities for advancement\r\n- proud of paying 20% below market", "Interview Questions": "How to scale a program"}, {"date": "8 Mar 2018", "title": "RN Case Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Mass General Brigham (Boston, MA) in Sept 2017", "Interview Descriptions": "apply online and get a standard email and never get a call back, unless you know someone in the company. Human resources is now interviewing people for Nursing jobs via telephone", "Interview Questions": "what would you do with a difficult patient"}, {"date": "4 Feb 2019", "title": "Talent Acquisition Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Mass General Brigham (Boston, MA) in Sept 2017", "Interview Descriptions": "They give an initial Phone screen, then they give a 2nd phone screen, then they give an in person interview, afterwards they give offer, and finally if they offer, you negotiate start date and employee on boarding.", "Interview Questions": "why do you want the job"}, {"date": "22 Jul 2017", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Mass General Brigham", "Interview Descriptions": "The experience was pleasant. The interviewer asked standard questions and gravitated towards the overall vision and possible company fit. It was only one round and lasted for about an hour.", "Interview Questions": "What difficulty have you encountered in the workplace and how did you overcome it?  "}], [{"date": "20 Aug 2018", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mass General Brigham (Easley, SC) in Jul 2017", "Interview Descriptions": "Quick interview with the standard questions, people seemed nice and asked a number of questions regarding past experience and qualifications for the job. It went pretty good, and questions were the same as most job interviews.", "Interview Questions": "3 reasons you want this job"}, {"date": "9 Mar 2018", "title": "Client Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mass General Brigham (Somerville, MA) in May 2017", "Interview Descriptions": "Interview process is fairly relaxed. First I had a phone interview with group supervisor and was later invited to have an in person interview about a week later. At the in person interview I interviewed with the group supervisor for about 30 minutes and then the group manager for about 10 minutes.", "Interview Questions": "How do you deal with people who have bad attitudes?"}, {"date": "15 May 2019", "title": "Database Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mass General Brigham (Somerville, MA) in May 2017", "Interview Descriptions": "I had one round of telephonic and one round of in-person interview. After you clear the telephonic interview, you will be asked to come for a in-person interview. In-person interview will be attended by all the team members available and the interview difficulty level depends on how you are responding to the basic questions.", "Interview Questions": "Asked about different topics I have worked on. Some of the team members are very technical. "}, {"date": "5 Jun 2017", "title": "Applications Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mass General Brigham (Somerville, MA) in Mar 2017", "Interview Descriptions": "Hiring Manager scheduled telephonic interview contacting through email.  Interview went well and positive.  Interviewer asked me to get back to me after two weeks. Never heard back from partners healthcare.  I also sent follow up  email for couple weeks but never heard back.  My experience is negative in terms of follow up after interview.  I wonder how hard it is to send an email stating \"we have decided not to pursue further your application.\" ?", "Interview Questions": "What would be your dream job?"}, {"date": "18 May 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Mass General Brigham (Boston, MA) in Mar 2017", "Interview Descriptions": "There were multiple interviews  with many people.  One interview with multiple interviewers, but not a panel. More like a tag team.  It was a very long drawn out process. Very stressful.", "Interview Questions": "Why do you want this job?"}, {"date": "22 Feb 2017", "title": "IT Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mass General Brigham", "Interview Descriptions": "Spoke to a recruiter on the phone. Asked many questions to get an idea of my background, said they would get back to me, but never heard back. Questions were more specific than I expected.", "Interview Questions": "What were some of the projects you worked on?"}, {"date": "17 Mar 2017", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mass General Brigham (Boston, MA) in Feb 2017", "Interview Descriptions": "Brief phone call with HR followed by phone call with hiring manager. After ~3 weeks, the hiring manager followed up with me (email) to inform me that she had decided to move forward with other candidates. I thought this was a really nice touch. Questions where a mix of behavioral and details on past work experience", "Interview Questions": "How do you prefer to be managed?"}, {"date": "26 Apr 2021", "title": "Janitor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mass General Brigham (Boston, MA) in Jan 2017", "Interview Descriptions": "It was a quick and professional. I was interviewed and there were a few other steps to take but they were painless. I would recommend to someone else. The employer is good and nice", "Interview Questions": "Why do you want to work here?"}, {"date": "11 Nov 2018", "title": "Licensing Manager II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mass General Brigham (Cambridge, MA) in Jan 2017", "Interview Descriptions": "it was great. You come in and they ask you a bunch of questions about your resume and past experience. They also ask you why you want to work there. Same as everywhere else.", "Interview Questions": "Why do you want to work here?"}, {"date": "13 Jan 2017", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mass General Brigham (Boston, MA) in Jan 2017", "Interview Descriptions": "Received call from the recruiter and set up a phone interview. Initially digging into the resume. Then asking the question about the each skill and experience and some project related to it. The recruiter was asking the question of machine learning and deep learning and while giving the interview, I felt she does not about technical think but acting smart. Later on, she told you don't have the knowledge of tensorflow, torch which is just the packages of python. She did not forward my resume to the hiring manager and disqualified immediately.", "Interview Questions": "Tell me something about machine learning and deep learning "}], [{"date": "28 Dec 2016", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mass General Brigham (Boulder, CO) in Dec 2016", "Interview Descriptions": "The Guy who was taking the first round of Interview for Data Scientist Role, had no background in Machine Learning. I think he just read the Machine Learning Wikipedia Page. Very Terrible Experience with Medical Companies who are trying to enter into Data Science Field.", "Interview Questions": "Previous Projects"}, {"date": "31 Jan 2017", "title": "Project Manager - Business Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Mass General Brigham (Somerville, MA) in Nov 2016", "Interview Descriptions": "Recruiter followed by in-person with hiring manager and other manager.\r\nThey do extensive on-line reference checks without even a formal offer.\r\nRecommend NOT agreeing to on-line reference checks without an offer; backwards process!", "Interview Questions": "Why did you leave your company?  Describe your greatest achievements.  What tools do you use to complete a project.  Why do you need a Charter?"}, {"date": "5 Jun 2017", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mass General Brigham (Hadley, MA) in Nov 2016", "Interview Descriptions": "I initially applied at one office that was near to my house.  It is a brand new building with two very sharp and capable managers who interviewed me.  The building is a showplace; large, spacious airy and bright.  This is where I really wanted to work.  Their process is to then funnel candidates to other offices where the working conditions are not at all like the showplace.  The manager who interviewed me at the 2nd office seemed more nervous than I was.", "Interview Questions": "What is your greatest strength? (along with the outdated and standard, What is your weakness?)"}, {"date": "26 Oct 2016", "title": "Several Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Mass General Brigham", "Interview Descriptions": "I applied for a number of positions throughout the Partners organization. Never received any human contact or notification that I didn't qualify or that positions were filled. I was even referred by current employees. When they contacted HR to follow up on my behalf they were told that I would be contacted only if the hiring manager were interested.", "Interview Questions": "N/A"}, {"date": "21 Sept 2016", "title": "Human Resources Business Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mass General Brigham", "Interview Descriptions": "Interviewer was very knowledgeable and asked good thought provoking questions.  Has been employed by the company for many years.  Good body language and interested in my responses.  Made the process comfortable.", "Interview Questions": "How would you use behavioral interviewing concepts?"}, {"date": "22 Aug 2016", "title": "Senior Human Resources Assistant At North Shore Medical Center Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mass General Brigham (Somerville, MA) in Aug 2016", "Interview Descriptions": "I briefly spoke with a recruiter who first called me at the wrong time and then was late calling me the second time. Her tone was flat and completely transactional. She seemed like she had no real interest in conversing about my qualifications or the position. She sounded as if she was reading from a script and couldn't wait to get off the phone. All questions were to see if I 'checked the box': why are you looking, what do you do currently, what's your compensation?", "Interview Questions": "Not difficult at all- standard questions, see above "}, {"date": "25 Oct 2016", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mass General Brigham (Somerville, MA) in Jul 2016", "Interview Descriptions": "I had applied online to the position and the recruiter contacted me via phone after a week or so and we had a conversation regarding my interest in the position and my skill set. The recruiter then sent me the details for the in person interview for the following week. I was interviewed by 3 members on the team and the manager and had a very good experience. It felt more like a conversation than an interview where I described my previous experience and the team gave me an insight into the work culture etc. The interview lasted about an hour and I was also given a tour of the office space as well. The recruiter came back with positive feedback and made an offer. After submitting my reviews and clearing the background check I joined Partners.", "Interview Questions": "Briefly mention some of the challenges I faced in my previous role"}, {"date": "9 Jun 2016", "title": "Systems Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Mass General Brigham (Cambridge, MA)", "Interview Descriptions": "Tech test on computer without internet access, basic concepts of object oriented programming. Asked to implement an interface and date time handling, file read write functionality, how to connect to database from java code etc", "Interview Questions": "Difference between inheritance and composition"}, {"date": "27 Jun 2016", "title": "Financial Analyst II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Mass General Brigham (Boston, MA) in Apr 2016", "Interview Descriptions": "I received an email from the hiring manager asking if I was still interested in the position. A first interview was set up where I met with her and another director that also was affiliated with the department. The the first interview went well and I was scheduled for a second interview a little over a week later where I met with the hiring manager and team leader for the department. Three weeks after the second interview I sent an email to the hiring manager to find out where they were in the hiring/interview process (no response). I waited another two weeks before sending a second follow up email(no response). After waiting another two weeks I called and spoke with the administrative assistant who initially scheduled the interview(s). She stated that she was not part of the hiring process but would have somebody get back in contact with me. Later on that day I received an email from human resources stating that the position had been filled.\r\n\r\nMy thoughts after receiving the news was that an organization such as Partner's Healthcare should have notified all prospective candidates of their hiring decision not just the one selected for the role. It took me to call to only to hear back from somebody in human resources that was not part of the hiring process. I would have thought that the hiring manager (who initially contacted me about the position), who I interviewed with twice, and sent the follow up emails would have been the person to let me know of her hiring decision. I was very disappointed in how Partners went through their hiring/interview process is an understatement.", "Interview Questions": "How would you resolve a conflict with a manager or team member?"}, {"date": "24 Oct 2016", "title": "Business Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Mass General Brigham (Boston, MA) in Apr 2016", "Interview Descriptions": "It was three interviews: two of which were behavioral and a third which was a case.  It was an extremely straight forward and friendly interview process basically trying to gauge your interest in healthcare and business development.", "Interview Questions": "Talk me through your resume."}], [{"date": "25 Jan 2016", "title": "Population Health Management - Project Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at Mass General Brigham", "Interview Descriptions": "I applied online and was contacted by an HR recruiter. She did an initial phone screening and then I was contacted by the hiring manager for 2 phone interviews and 1 in-person interview. It was a bit confusing because there were actually a few positions they were looking for, and so they were trying to figure out where I could be a good fit. I spoke with multiple people about several positions, and then had a 1.5 hour in-person interview. Lots of questions about organizational fit and management styles. It felt like a good match, although I never heard back until I reached out to the HR recruiter, who said the positions had been filled.", "Interview Questions": "How would you go about engaging a group of clinicians to implement an initiative encouraged by the corporate office?"}, {"date": "30 Nov 2015", "title": "Investment Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Mass General Brigham", "Interview Descriptions": "Behavioral Interview with four to five current employees including managers and future peers\r\nAsked questions about past experience and allowed time for me to ask questions about expectations and future role at the company\r\nEveryone was very friendly and comforting", "Interview Questions": "What experience have you had working in teams in the past?"}, {"date": "24 Dec 2015", "title": "Applications Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mass General Brigham (Boston, MA) in Nov 2015", "Interview Descriptions": "Phone screen and then onsite interview. First met with two people who conducted the behavioral interview (lasted 1 hr, asked about how you handled certain situations with specific examples), and then met with the department hiring manager. All were super nice and friendly. Heard back within a month for references, and then a few days later got a verbal offer. Overall, HR is really reliable, attentive, and responsive. They always kept me up to date on my candidacy status.", "Interview Questions": "Behavioral questions, and standard HR questions. Nothing too difficult. Just make sure you are able to supply them with specific examples from past work or personal experiences during the behavioral interview. "}, {"date": "12 Jan 2016", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Mass General Brigham (Needham, MA) in Nov 2015", "Interview Descriptions": "Two interviews with same group, one year apart for very similar position.  First interview, never heard from them after jumping through multiple hoops and interviewing with multiple staff.  Second interview - one of the people that interviewed me, reached out to me for a similar position a year later.  Told I was going to meet with a specific person.  Rescheduled my interview to 8 in the morning on a Monday.  I showed up, come to find I am interviewing with the same exact people as the previous year.  Did NOT interview with the main person.  I knew then, that even though they reached out, agreed to the salary, etc.  that I wasn't going to get the job.   A lot of nonsense for nothing.", "Interview Questions": "They asked me:  How do you deal with change?"}, {"date": "21 Aug 2015", "title": "Business Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Mass General Brigham", "Interview Descriptions": "I was interviewed by about 9 members of a group and they took 2 months to present a verbal offer. After that, I never received any communication regarding the next steps. Several attempts to reach out to the hiring manager and the Human Resources counterpart were of no avail. I do not understand how insensitive some people can be. I mean it doesn't take much to communicate the outcome or a changed decision. They just keep people hanging on the leash but don't want to move forward with any commitment. Most unprofessional behavior and totally unexpected of Partners Healthcare or any or its affiliates.", "Interview Questions": "N/A"}, {"date": "8 Sept 2015", "title": "Contract Pharmacist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Mass General Brigham (Jersey City, NJ) in Aug 2015", "Interview Descriptions": "send resume and talk to recruiter regarding how long the contract was for--the contract was to be renewed every Friday--the job was checking cassettes and putting them in proper hourly slot for administration--extremely boring--", "Interview Questions": "contract thru a temp agency--they wanted to know if I could check 400 rx per hour"}, {"date": "4 Dec 2015", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Mass General Brigham (Boston, MA) in Jul 2015", "Interview Descriptions": "I was referred by an employee at Partner's Health care who was working in the same field I was being interviewed for. The first round was a Phone interview with HR. After a couple of days, I had a phone interview with the Manager.", "Interview Questions": "Everything about projects"}, {"date": "13 Jun 2015", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mass General Brigham", "Interview Descriptions": "My individual position was in a matrix organization, I was interviewed by HR, admin. hiring manager, admin. director, then functional manager and  director. I tend to be confident in interviews and found the process to be professional and respectful. I had the opportunity to ask questions about the job, as well as answer questions..", "Interview Questions": "About experience pertinent to the job"}, {"date": "3 Oct 2016", "title": "IT Project Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3+ months. I interviewed at Mass General Brigham (Boston, MA) in May 2015", "Interview Descriptions": "Wasn't well planned or timely. Took more than 3 months. Everyone involved was (in hindsight) overloaded with work and just needed another person to start and help asap. Most of the interviews involved listening to what was expected and being asked if you had specific experience and wanted to do that type of work. New hires with direct/plug and play experience will have the most success. But that also means that it is a lateral position for them.  Candidates who need training will quickly fall off the pace.", "Interview Questions": "Give specific examples of experience utilizing software/management methodology that are required in the job."}, {"date": "12 Apr 2015", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Mass General Brigham (Denver, CO)", "Interview Descriptions": "Recruiter in CA did a phone screen, then I had two in-person interviews.  Between my first interview and second interview, 6 weeks passed.  After the last in person interview, I saw the position had been re-posted.  I inquired whether I still a candidate, with no answer from the company.  Very unprofessional in my book to not let a candidate know whether they've been hired or not after a total of 3 interviews.  I guess that speaks to the company culture.", "Interview Questions": "How do you prioritize your work?"}], [{"date": "6 Mar 2015", "title": "Senior Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mass General Brigham", "Interview Descriptions": "One on one interview with 3 individuals. Everything happened in one day. I met with the direct manager and 2 of her bosses. It went well and everyone was nice. I had a very positive experience. Once I got the job, there was an orientation for half a day to learn about the company.", "Interview Questions": "Why are you a fit to this job?"}, {"date": "8 Jan 2015", "title": "Systems Analyst II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mass General Brigham", "Interview Descriptions": "Interview process consisted of 3 interviews.  First with director, followed by the CIO, lastly with the team itself.  Interviews all lasted about 1 hour and took place over a 1.5 month period.  All participants were respectful.  I had opportunity to ask as many questions as needed and left feeling great about Partners and the opportunity.", "Interview Questions": "I do not recall any question that was unexpected.  They did not try to trick me or catch me off guard.  The interview was a very natural and comfortable conversation about the opportunity."}, {"date": "5 Apr 2017", "title": "Postdoctoral Research Associate Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Mass General Brigham (Boston, MA) in Jan 2015", "Interview Descriptions": "This process was something that was more of an experience to help me understand the nature of researchers within the field of science and medicine. \r\n\r\nUnfortunately, I wasn't thrilled about this experience as a researcher who's looking to expand their career in a clinical setting.", "Interview Questions": "What's your long-term research plan? "}, {"date": "28 Oct 2014", "title": "Risk Management Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Mass General Brigham", "Interview Descriptions": "HR interview, asked me about my strengths and my project. I discuss with the HR about my courses and documentation skills. She was interested in my skills about using forensic tools.", "Interview Questions": "How to prove your wrting skills?"}, {"date": "16 Oct 2014", "title": "Contract Position Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at Mass General Brigham", "Interview Descriptions": "Sat down with a couple of people, went over the resume and answered standard interview questions, strengths and weaknesses, job that was expected, etc. The whole process took maybe an hour.", "Interview Questions": "Nothing really unexpected"}, {"date": "3 Oct 2014", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 5 days. I interviewed at Mass General Brigham", "Interview Descriptions": "The initial interview was via an external staffing agency for a contracting position.  The next and final interview was with the hiring manager, for a specific project.  Excellent and informative interview.  Team fit was critical.  The contracting position led eventually to a permanent position.", "Interview Questions": "No extraordinary / unusual questions.  "}, {"date": "15 Feb 2018", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mass General Brigham (Boston, MA) in Oct 2014", "Interview Descriptions": "Phone interview with HR, in person interviews with 5 people on 2 separate occasions, reference check through skills survey that goes to everyone’s spam folder you’d think a large company would use a better service.", "Interview Questions": "Why do you want this role and what skills will you bring to the role? "}, {"date": "19 Sept 2014", "title": "Applications Analyst II Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Mass General Brigham", "Interview Descriptions": "It's very professional.  You deal with HR, and they give you status updates.  Things take place in an organized and timely manner.  You do a phone screen with HR, then a phone screen with the manager, then go in and interview with the manager and others on the team.  Then HR contacts you for references, and you go online to submit them.  Then HR gets back to you with an offer.  They give you time to think it over.", "Interview Questions": "What was something on a team that you wish you'd handled differently"}, {"date": "7 Aug 2014", "title": "Applications Coordinator ECare Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Mass General Brigham in Jul 2014", "Interview Descriptions": "Hiring process isn't bad but requires several steps. A recruiter will call you and try to place you in a job. Once that happens it will take about 2-3 weeks to be contacted for an interview. The interview is 2 part - first part is a panel interview with behavioral based questions (IE: what would you do if..) and they want specific examples. The second part is with the hiring manager(s). After about 1 week they will call for references. The reference check takes about 1 week, and then they will call for an offer if they so desire.", "Interview Questions": "Give an example of a time when you had to use an unorthodox method to solve a complex problem."}, {"date": "2 Sept 2018", "title": "Software Engineer I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mass General Brigham (Boston, MA) in May 2014", "Interview Descriptions": "The interview was very congenial and thorough.  It was a standard \"tell me about yourself\" interview with no trick questions and no pressure tactics.  There wad a second interview with the big boss just to confirm.", "Interview Questions": "It was a while ago so I don't remember much.  I'm sorry but I don't anything more of substance to add to what I've already written."}], [{"date": "5 Sept 2014", "title": "Contract Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mass General Brigham in May 2014", "Interview Descriptions": "Basic interview question. Not behavior or scientific based. Pretty open discussions on relevant healthcare and medical device makers. \r\n\r\nReview of contracting needs and prior history.\r\n\r\nDiscussion of various entities under MGH and Brigham.", "Interview Questions": "N/A"}, {"date": "12 Mar 2014", "title": "Team Leader II Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Mass General Brigham", "Interview Descriptions": "Initial contact via email. \r\nInterview process was with HR over the phone\r\nOne on site visit. \r\nThe HR rep then handled the salary negotiation stage well.", "Interview Questions": "N/A"}, {"date": "28 Feb 2014", "title": "Applications Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Mass General Brigham", "Interview Descriptions": "Very quick process. I had prior experience in large scale implementations so the timeline from phone to sitting at a desk was about 5 weeks. The most difficult and longest part was getting through HR. Once I got to the actual AM, it was much quicker and more accommodating. I didn't even both negotiating just to escape my hellish old job.", "Interview Questions": "The entire \"panel\" part of the interview is a \"how would you handle\" scenario. Be prepared to cite examples"}, {"date": "16 Mar 2015", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Mass General Brigham in Feb 2014", "Interview Descriptions": "The interview process was fine.  The Recruiter was nice and the interview was on time and generally a good experience. I was screened by the Recruiter and interviewed by the Nurse Manager who was polite and professional.  They neglected to tell me that there would be no vacations allowed for a year due to software issues.  I was excited to start the job but found out the situation was very different after I started working there.", "Interview Questions": "Basic Nursing questions. Wound care questions.   Nothing too difficult."}, {"date": "13 Jan 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Mass General Brigham", "Interview Descriptions": "2 rounds behavioral, standard questions, team player", "Interview Questions": "N/A"}, {"date": "27 Jan 2017", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mass General Brigham (Boston, MA) in Jan 2014", "Interview Descriptions": "I met with several managers of the department I was applying to. Some candidates get a peer interview instead. Some candidates will get a 1on1 interview in addition to the peer interview.", "Interview Questions": "N/A"}, {"date": "17 Oct 2013", "title": "Administration Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mass General Brigham in Oct 2013", "Interview Descriptions": "The interview process has been very well run.  Initial interview was with an HR Staffing Specialist.  It lasted a half hour and he described the job and asked some questions about my background and qualifications.  He told me that next steps would be a phone interview with the hiring manager, then a behavioral interview followed by a face to face interview with the hiring manager and others.  Throughout the process I was told what to expect and who I'd be speaking with.  Overall the elapsed time has been about 3 weeks.", "Interview Questions": "I really wasn't asked any difficult or unexpected questions.  My interviews felt much more like a discussion rather than a question and answer"}, {"date": "19 Jun 2013", "title": "Contract Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Mass General Brigham (Charlestown, MA)", "Interview Descriptions": "contacted by recruiter", "Interview Questions": "why medical devices are so expensive"}, {"date": "10 Jun 2013", "title": "Technical Architect Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at Mass General Brigham", "Interview Descriptions": "1. Phone screen\r\n2. Come in for an in-person interview where you first do a written tech test and then meet with the team members.  The tech test is about average on a difficulty scale for someone who's been doing Java for many years.", "Interview Questions": "Since different team members interview, the questions will vary and some could catch you off guard."}, {"date": "9 Jul 2013", "title": "Patient Registration Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mass General Brigham (Medford, MA) in Jun 2013", "Interview Descriptions": "It was an open house running from 4 to 7 PM.  I was in a line where the to-be interviewee in front writes down basic information provided by MGH (e.i. your name, how you found out about the job, have you applied here before).  After that process, we interviewees--where there was at least 50 of us in the first hour--were placed in the waiting room that consisted mostly of chairs and a video on TV describing the position.  When I was called twenty minutes later,  I went into a room where five other people had private interviews.  The interview was pretty short (4 questions).  The interviewer told me she's going to make calls in 2-3 weeks.", "Interview Questions": "Why do you want to work here?"}], [{"date": "27 May 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 6 weeks. I interviewed at Mass General Brigham (Boston, MA) in May 2013", "Interview Descriptions": "The initial communication seemed clear, informative, however the hiring process takes a long time, more than a month, the interview process was friendly with many open-ended questions and live scenarios.", "Interview Questions": "Compensation, it seems to be a secret to know how much the position will pay, which can be stressful for employees."}, {"date": "6 Apr 2013", "title": "Third Party Reviewers Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mass General Brigham (Charlestown, MA) in Apr 2013", "Interview Descriptions": "I had applied online.   HR contacted me about 1-1.5 weeks later.   My HR rep was great to work with.   Friendly and prepared me to meet with the supervisor of the team.   Met with the manager and supervisor of my team and they were nothing but nice!", "Interview Questions": "What is a negative about yourself?"}, {"date": "29 Oct 2013", "title": "Systems Engineer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mass General Brigham (Wellesley, MA) in Apr 2013", "Interview Descriptions": "phone interview with HR then hiring manager, face to face panel interview with 3-4 people", "Interview Questions": "N/A"}, {"date": "24 Jun 2014", "title": "Graduate Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mass General Brigham (Boston, MA) in Mar 2013", "Interview Descriptions": "Applied online for one role but was contacted by an HR manager who suggested that I apply to another role instead. I applied, had a phone screen with HR, a phone interview with the manager, then an in-person interview with the manager. The very same day I heard from HR that I was going to receive an offer. This happened in March for an early-June start.", "Interview Questions": "Had to define terms in healthcare finance related to financial planning, management, and healthcare payers."}, {"date": "14 Apr 2014", "title": "Referral Service Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Mass General Brigham (Waltham, MA) in Jul 2012", "Interview Descriptions": "I received a phone call from a person in the HR department asking to set up a time to interview. Received a follow up email with the interview time and directions. Met with HR and went over my resume and qualifications. They only asked questions regarding my resume and experience and how I would handle certain situations - there were no crazy out of the box questions asked. I was brought over to meet with the head of the department for which I would be working. The department head asked me more questions about my experience and how I would handle different potential situations. After this meeting I was told that I was hired for the position and received my offer letter a week later.", "Interview Questions": "How I would handle a client who was upset or angry. It was unexpected because the job that I was applying for was described as mostly data entry and I did not know that I would be speaking with patients/clients (over the phone)"}, {"date": "9 May 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mass General Brigham in May 2012", "Interview Descriptions": "Interview/ Hiring process took well over a month. First with a call from HR (I ended up having 3 phone interviews), two in person interviews and then was offered the job after about 2 weeks of not hearing anything.", "Interview Questions": "N/A"}, {"date": "22 May 2012", "title": "Accounts Payable Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mass General Brigham (Charlestown, MA) in Apr 2012", "Interview Descriptions": "I applied on line and about a month later, received a call from the recruiter.  I later traveled to the Corporate office where I met with the same recruiter and the hiring manager.  I thought it went pretty well and I thought I was able to make a connection with the hiring manager.  \r\n\r\nFrom what I heard from the hiring manager, they were looking to fill the role over the next few weeks.  The next step was that qualified candidates would be invited back to meet with others in the same workgroup.  I was told that a decision would be made on 2nd interviews within the next two weeks.\r\n\r\nNever heard back from anyone ever again at the company.  They pride themselves on being one of the great places to work in Massachusetts, but not ever communicating their decision, especially after having a face to face interview, is just plain classless.", "Interview Questions": "How do you handle stress?"}, {"date": "25 Mar 2014", "title": "Applications Analyst II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 6 months. I interviewed at Mass General Brigham (Wellesley, MA) in Mar 2012", "Interview Descriptions": "The hiring process is very slow.  I've seen this with several positions (full-time and contract) that have opened and have been sourced while here.  The shortest time between the identification of a need and the commencement of interviews has been ~6 months.\r\n\r\nSo responding to Partners position inquiries may never result in a call at all only because the lag between posting the position and the actual need for the position has been so long that the need goes away before filling it.\r\n\r\nOtherwise, when called, it's 1-3 phone screens followed by in-person interviews.  For some departments, that in-person interview can be done as a panel of interviewees (with or without some prepared presentation by the candidate).", "Interview Questions": "Typically, the most difficult question to field will be figuring out how to sell yourself if you don't have an extensive clinical background.  The more \"clinical-sounding\" a job may seem, the more this difficulty is.  Some people are just absolutely convinced that if you don't have a clinical background you couldn't possibly perform in role X."}, {"date": "26 Feb 2014", "title": "Instructional Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Mass General Brigham in Feb 2012", "Interview Descriptions": "Several rounds of interviews.  Thorough, based on behavioral assessments.  HR is difficult to reach, and it seemed like a very slow process, but ultimately I received an offer and things moved well after that.", "Interview Questions": "No question was really difficult or unexpected.  They wanted many examples of how you handle different situations and what solutions you were able to come up with as well as the outcomes of the described situations. "}, {"date": "25 Mar 2012", "title": "Associate HIA Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Mass General Brigham (Chicago, IL) in Jan 2012", "Interview Descriptions": "I was selected through school career office and was invited for interview with the senior consultant. The interview was conducted at school. Interview questions were typical behavioral questions. After the interview , I was walked out to meet the recruiter who communicated when will I hear back about next round and asked me about my interview with the Consultant.", "Interview Questions": "Tell me about yourself excluding the details highlighted by  your resume"}], [{"date": "6 Dec 2013", "title": "Network Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Mass General Brigham (Needham, MA) in Jul 2011", "Interview Descriptions": "From a technical review standpoint, pretty standard -- lots of fairly deep-dive technical assessment questions, administrative and managerial questions, etc.  Interestingly, did not meet with any peers, only the group manager -- wouldn't you want to meet with your prospective team to not only assess them, but to have them assess you?  Very poor managerial philosophy, IMHO.  Also unfair to the others on the team.  Also, drastic understatement on what the on-call stints would be like -- \"oh, things are generally very quiet.\"  NOT.  On-call was generally very hectic.  Ask anyone on their network teams -- the stress leading up to, and during, the on-call sessions were really bad.", "Interview Questions": "N/A"}, {"date": "28 Jun 2012", "title": "Applications Development Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mass General Brigham (Wellesley, MA) in May 2011", "Interview Descriptions": "I applied through the online carreer development portal of Partner Healthcare. After one week, I have been contacted by Partners IT HR for a pre-screen interview. After one week, I have been contacted for a formal phone interview with QA Infrastructure Specialist. The last one-on-one interview took place at Partners Healthcare with the QA Infrastructure Specialist and Department Manager.", "Interview Questions": "What was the most difficult situation you delt with your former manager"}, {"date": "13 Oct 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Mass General Brigham (Boston, MA) in Apr 2011", "Interview Descriptions": "Simple process, was referred by an old teacher to the lab. I submitted a resume and was called for a phone interview. All very basic questions- why lab work? what experience do you have? strengths and weaknesses?", "Interview Questions": "why lab work? what experience do you have? strengths and weaknesses?"}, {"date": "16 Oct 2015", "title": "Senior IT Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Mass General Brigham (Boston, MA) in Jan 2011", "Interview Descriptions": "I was first contacted on the phone by an HR person, who asked me about my general qualification.  Then I received an email from the hiring manager and scheduled a phone interview. After the phone interview with the hiring manager, I went in for an in-person interview with the hiring manager.  We went over my past experiences and challenges I had and what action I tool.  I also had a group interview with peers during which I had to answer some specific technical questions.  After that, I had another in-person interview with the hiring manager where he asked me behavior and work style related questions.", "Interview Questions": "Only general questions about past experience, project related issues and actions taken."}, {"date": "8 Sept 2015", "title": "Computer Operator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Mass General Brigham (Boston, MA) in Jan 2011", "Interview Descriptions": "It was very short as the position I was applying for 20 years ago was a simple computer operator role that required few skills or experience. I had some college courses but only minimal computer operations training.", "Interview Questions": "Can you work weekends and nights?"}, {"date": "12 May 2012", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Mass General Brigham (Boston, MA) in Oct 2010", "Interview Descriptions": "discussed with chairperson", "Interview Questions": "who is the president?"}, {"date": "4 Mar 2014", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mass General Brigham (Belmont, MA) in Jul 2010", "Interview Descriptions": "Very fast!  Was contacted, interviewed and hired within a week.  Interviewers put me at ease and were laid back.", "Interview Questions": "Nothing difficult about it"}, {"date": "21 Jun 2011", "title": "Programmer Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Mass General Brigham (Boston, MA) in Jun 2010", "Interview Descriptions": "Initial interview was with the recruiter working for partners. Asked about basic skills and knowledge. Second interview was with potential employer, asked about experience previous projects. Third interview was in person with future boss and coworker. Interview was relaxed and served to judge my personality and previous skills, whether I would be a match for the company. They liked me instantly and said they wanted to hire me and just had to check with their boss. One more interview was done with the boss's boss to ask about my skills and get a feel for the company and I was given an offer less than a few days later.", "Interview Questions": "What previous projects have you worked on?"}, {"date": "3 Aug 2010", "title": "Reporting Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Mass General Brigham (Boston, MA) in Jun 2010", "Interview Descriptions": "Detailed questioning being done on the previous work experience. Most technical interviews were on phone and in person interview was just a friendly conversation", "Interview Questions": "What is a correlated subquery! "}, {"date": "24 Aug 2010", "title": "Financial Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Mass General Brigham (Charlestown, MA) in May 2010", "Interview Descriptions": "I applied one month before actually having a phone interview with the hiring manager.  I applied, 2 weeks later had an HR phone interview, then 2 weeks after that had a phone interview with the hiring manager.  Then, 2 weeks after that I went in for an interview with a peer, a project manager, and the hiring manager.  No one told me that I didn't get the job, I had to call HR a month later to ask about it.", "Interview Questions": "How did you approach a challenge at work, and how did you over come it?"}], [{"date": "9 Feb 2010", "title": "Secretary Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Mass General Brigham (Boston, MA) in Dec 2009", "Interview Descriptions": "Friendly, information gathering phone interview.  Invited to meet in person to discuss specific long term temp opportunity.  Met next day, great discussion and interview - seque into saying that position no longer available, similar position will be much less money, will be in touch if one becomes available... never heard from again.  Not very professional in my view.", "Interview Questions": "N/A"}, {"date": "1 Apr 2013", "title": "Human Resources Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mass General Brigham (Boston, MA) in Oct 2009", "Interview Descriptions": "easy, short", "Interview Questions": "asked if I had ever made a mistake - when I said yes I'm sure I have, saying otherwise would be dishonest, seemed disappointed in that answer."}, {"date": "5 Dec 2009", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mass General Brigham (Boston, MA) in Aug 2009", "Interview Descriptions": "I was first contacted for a phone interview with the senior research assistant and then was asked to come into the facility for an in-person interview with the lead physician on the study.   The doctor who interviewed me seemed to be a very serious guy, and asked mainly general questions.", "Interview Questions": "What have you done over the past few summers to gain experience in the field?"}, {"date": "2 Sept 2013", "title": "Home Health Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Mass General Brigham (Braintree, MA) in May 2009", "Interview Descriptions": "The interview was a nice, easy process.  I took a test and passed.  There was no formal interview.  After, watched a movie that reviewed skills with a nurse who worked there.", "Interview Questions": "Hardest questions on the test are about Hepatitis A,B,and C."}, {"date": "8 Jan 2013", "title": "Staff Nurse (RN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mass General Brigham (Braintree, MA) in Feb 2009", "Interview Descriptions": "I applied online was contacted within a week and scheduled an interview with the manager within 2wks", "Interview Questions": "none they don't try to trick you"}]]