[[{"date": "9 Jul 2023", "title": "RN Interview Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Scripps Health", "Interview Descriptions": "I saw another review that said their interview went as if the manager was intentionally trying to find deficiencies, and that is also how mine went. Felt like I was taking the NCLEX again instead of being asked how I am as an employee. This would have been a new position for me, so I didn't have all the exact answers. Maybe they were looking for someone very experienced, but the job description did not indicate that(asked for one year of experience in an ICU setting, which I have). I've never really had an interview like that, so it was a bit difficult.Also, it took almost a month to get a response back from the recruiter after the interview.", "Interview Questions": "Lab interpretations, many specific clinical scenario questions, how to set up specific equipment(even though my resume and myself  stated that I have not yet worked in this area)\r\nWhy do you want to work for scripps\r\nWhat are you learning right now, personally or professionally\r\nTell me about a time you had conflict\r\nTell me about a time you went above and beyond\r\n"}, {"date": "22 Jun 2023", "title": "New Grad RN Residency Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Scripps Health (San Diego, CA)", "Interview Descriptions": "Asked behavioral questions such as name a time when you had a conflict with a coworker and how you resolved it? and describe a time that you stepped on a \"land mine\" and things went bad ? how did you handle this situation?", "Interview Questions": "Why nursing? Why scripps? What do you do if you had a difficult day at work?"}, {"date": "24 May 2023", "title": "Department Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "I submitted a resume with keywords related to the job post. I received on demand pre record interview invitation within the hour. I submitted the videos and the passed initial review. I emailed the recruiter twice. I am still waiting on a response.", "Interview Questions": "Why do you want to work with us?"}, {"date": "17 May 2023", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Scripps Health (San Diego, CA)", "Interview Descriptions": "Video recorded interview, once moved along to in person. Scheduled a meeting with the manager and two other employees from the department. It was a very relaxed environment, they were very welcoming.", "Interview Questions": "Why do you want to work for this organization?"}, {"date": "15 May 2023", "title": "Patient Service Representative I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Scripps Health (San Diego, CA)", "Interview Descriptions": "The interview process is pretty easy. Just wanted to do the office and had basic interview questions. Nothing too difficult to answer. It went smoothly and there were negatives about it.", "Interview Questions": "How would you handle emergency situations?"}, {"date": "12 May 2023", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health (La Jolla, CA)", "Interview Descriptions": "Phone interview for basic background questions, then in-person interview with more detailed questions specific to the role. Took about 4 weeks total from application to interview to hire. Positive experience.", "Interview Questions": "Describe the work environment and/or culture in which you are most productive and happy"}, {"date": "8 May 2023", "title": "Registered Nurse, BSN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Scripps Health (San Diego, CA)", "Interview Descriptions": "The interview process was very difficult but I was able to answer all of them. They asked very tough questions and needed a response. Was very quick with questions and did not really care about the answers", "Interview Questions": "N/A"}, {"date": "31 May 2023", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Scripps Health (La Jolla, CA) in May 2023", "Interview Descriptions": "The interview itself was extremely brief and done online with no prior meeting in-person. Teams interview was over in less than 20 minutes very few behavioral questions regarding the candidate far more questions regarding loyalty to company", "Interview Questions": "If you are hired, can you commit 3-5 years with the company? Where do you see yourself working in 1 year? How do you deal with criticism?"}, {"date": "22 Apr 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health (Encinitas, CA) in Apr 2023", "Interview Descriptions": "After you fill out the application it will send you an automated message to take the online interview within 72 hours. I’m assuming that everyone gets an online interview and then after that they will determine to bring you in for a second interview.", "Interview Questions": "Why do you want to work at Scripps?"}, {"date": "2 Apr 2023", "title": "Epic Application Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "The interview is done in a panel with management and other analysts, not necessarily from your application. They will all do a marry go round of questions, most of the questions are the golden standard of the script and each one in the panel asks a question.", "Interview Questions": "Tell us of a time you had a conflict with another employee and how you resolved it."}], [{"date": "19 Apr 2023", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Scripps Health (San Diego, CA) in Apr 2023", "Interview Descriptions": "I filled out application then got a notification that they wanted me to do a multimedia video interview. It asked me about 4 questions and I talked to camera for each question. Have not heard back since then.", "Interview Questions": "Tell us about a time you got into a misunderstanding with someone and how it worked out."}, {"date": "4 Mar 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health", "Interview Descriptions": "There is a standard /Stock list of questions that are outdated, and potentially don't identify the candidate well. \"What makes a good day for you?\" the answer they want is BUSY because that's typical for a nurse, working super hard all day,. \"how would your previous manager describe you?\" Maybe just ask for a previous evaluation. \"Do you like to treat others like you like to be treated?\" The \"answer\" is \"no I treat others how they want to be treated\". I guess it is all to standardize the process with dumb questions. I've sat in on interviews and most of these questions throw the candidate off and make they feel nervous and I just feel SOOO bad for the candidate! It's embarrassing. But interviews typically cause some nervousness anyway,.", "Interview Questions": "See above questions. They have a list of standard questions for nursing. \"What makes a good day for you?\" \"How do you feel about unfinished work?\" Obviously, one would say \"I hate unfinished work\"! whether or not you do or don't. Right?"}, {"date": "2 Mar 2023", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "part one is a round of video submissions about how you would fit into the role. very easy set up. easier than coming up with a 30 word minimum for this section of the questions.", "Interview Questions": "how do you fit into the culture"}, {"date": "1 Mar 2023", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Scripps Health (Encinitas, CA)", "Interview Descriptions": "I was scheduled a virtual interview with Scripps Health at the Encinitas location, three days after I applied. On the day of the interview, the hiring supervisor was completely absent. I had to email Scripps myself, and I received a response two hours after the interview, to find out why the hiring supervisor did not show up. She explained, “sometimes the day can get away from us”. I agreed to reschedule the interview for another day. On this second try, I was interviewed by the team’s clerical operations supervisor, who was 30 minutes late to the scheduled interview. The hiring supervisor from the previous day was supposed to be present as well, but again, she was completely absent. The interview was fairly easy. General questions were asked, such as, ‘where do you see yourself in the next five years?’, ‘what would your previous employers say about you?’, ‘why Scripps?’ etc. Exactly 2 weeks after the interview, I received an email stating that the position has been cancelled. I’m incredibly shocked at how the hiring process was conducted by Scripps Health. Word of advice: Please respect your potential candidate’s time and efforts to be a part of your team. I have never experienced this amount of disrespect and unprofessionalism within an interview process. I will not be applying to this company in the future.", "Interview Questions": "What do you see yourself in five years?"}, {"date": "23 Feb 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health in Feb 2023", "Interview Descriptions": "Submitted application, proceeded to primary on demand interview (72 hrs to record), then waited 1-2 weeks to hear response for secondary interview. Tell me about a time where you received constructive criticism. What happened? How did you handle it and what would you have done differently?", "Interview Questions": "-Why would you like to join our connected and patient-focused culture? -In what ways do you promote positive staff experience? -Tell me about a time where you received constructive criticism. What happened? How did you handle it and what would you have done differently?"}, {"date": "18 May 2023", "title": "Senior Financial Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Scripps Health (San Diego, CA) in Jan 2023", "Interview Descriptions": "The folks I interviewed with were polite. However, I didn't really felt they were there for job security. Nothing wrong with that. I like to innovate internally and figure out solutions for the future not just the now. Nothing wrong with job security but it leads me to believe we have different priorities in our lives.", "Interview Questions": "Tell me about a time you disagreed with a colleague and how did you overcome their objection?"}, {"date": "12 Dec 2022", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "They Sent a Self recorded interview link after my application and then was sent a link with times to set up a live interview. Live interview was online around 15 min", "Interview Questions": "Why should we choose you"}, {"date": "20 Jan 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health (San Diego, CA) in Dec 2022", "Interview Descriptions": "Interview with the unit manager over Microsoft Teams for a new grad RN position, was mix of regular questions, behavioral questions, and a clinical scenario question. Fairly standard new grad RN interview.", "Interview Questions": "When was a time you taught something to a colleague?"}, {"date": "27 Nov 2022", "title": "Licensed Vocational Nurse (LVN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Scripps Health", "Interview Descriptions": "Video prompts with a couple questions. Then a phone call with director, meet with providers- overall an extremely easy process with an offer made within a day of meet and greet", "Interview Questions": "Why do you want to join? Describe an instance where you disagreed with a coworker?"}, {"date": "4 Dec 2022", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Scripps Health in Nov 2022", "Interview Descriptions": "Teams meeting online, was a pleasant and fair experience. Questions that were generalized and job specifics as well. I was very impressed with the response time of the company and would recommend applying here.", "Interview Questions": "Tell us about yourself and your qualifications"}], [{"date": "18 Nov 2022", "title": "Radiology Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Scripps Health (San Diego, CA) in Nov 2022", "Interview Descriptions": "Pretty easy interview process. The interview will be via online with the staff and supervisors. All the staff were very friendly and attentive to my answers. Definitely I felt comfortable during the interview process.", "Interview Questions": "How did you resolve a difficult situation at work and what was the end result."}, {"date": "4 Oct 2022", "title": "Clinical Pharmacist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Scripps Health", "Interview Descriptions": "Submitted application and after 2 months received email from recruiter with invitation to upload pre-recorded video interview (4 questions). No updates until about 2 weeks later, at which point began receiving weekly email messages with status updates. Each update was copied verbatim as a general message describing I was still \"in consideration\". Contacted recruiter for clarification regarding timeline. Recruiter graciously replied they would follow up. Never heard back. Sent follow-up emails to no avail. In the meantime, Scripps portal showed two new applications to the same job posting submitted on my behalf. I was never informed why or asked to verify the submissions for accuracy. Job description was rewritten and reposted. Email received with the title stating I was invited to interview, however the link provided only asked one question regarding licensure. Sent email to recruiter asking for clarification. Out of office reply provided contact information for two other recruiters. Emailed them to no avail. Ultimately received email from Scripps informing me I had not been selected. Attempted contact with recruiter. No answer.", "Interview Questions": "Why do you want to work at Scripps? How did you improve an process? Describe a time of conflict at work. Describe a time you went above and beyond to help a patient."}, {"date": "30 Sept 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "1:1 interview with manager questions were scenario based with a few behavioral star questions. The process of scheduling was relatively easy because first there was an online questioner and then a selection for online or in person interview.", "Interview Questions": "How do you handle conflict?\nHow do you handle a difference of opinion in direct patient care?"}, {"date": "10 Oct 2022", "title": "Administrative Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Scripps Health in Oct 2022", "Interview Descriptions": "It was short and only a few questions. I had to record my responses. I had the ability to re-record my responses as many times as I needed or wanted to.", "Interview Questions": "Please describe a disagreement you recently had with another person at work. How did you handle the situation?"}, {"date": "23 Sept 2022", "title": "Clinical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "Average interview. Took about a month. From initial phone screen. Typical interview questions. Did two interviews one on the phone and the next on video call. The process was a pleasant experience overall!", "Interview Questions": "What was the most difficult situation you experienced and how did you overcome?"}, {"date": "7 Sept 2022", "title": "Administrative Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "Afrer sending in application, got an email to send in a video interview. 3 questions were asked and you can re-record if needed. About a couple weeks later got a phone call reviewing some positions they had. Did interview for one position at first. Didn't get chosen for that position so interviewed for the second position. Interview were both over video. Then haven't heard back from them since.", "Interview Questions": "Tell us about a time you received constructive criticism?\n"}, {"date": "10 Aug 2022", "title": "Surgery Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Scripps Health (La Jolla, CA)", "Interview Descriptions": "Hiring manager called to set up an interview time. Interview details were emailed along with the managers that were going to be present in the interview. The interview took place in a manager's office.", "Interview Questions": "How would I handle someone I worked with being difficult to work with on a particular day?"}, {"date": "3 Aug 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "Shockingly difficult. they ask you to do a video interview first (self recorded) before you’re even considered . It’s a bit ridiculous. the actual interview for the neuro icu was also unreal. It was like the managers were purposely trying to point out my deficiencies", "Interview Questions": "reasons why a carotid endarterectomy would go into metabolic acidosis"}, {"date": "2 Aug 2022", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Scripps Health", "Interview Descriptions": "interview was done virtually, very easy. Supervisors are very nice. A lot of opportunity of growth. Most of my coworkers have been with Scripps more than 20 years and plan on retiring here as well", "Interview Questions": "How will you handle a difficult situation with a patient?"}, {"date": "24 Sept 2022", "title": "Patient Service Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health (San Diego, CA) in Aug 2022", "Interview Descriptions": "I had a positive interview experience and was offered the job the following week. I was very disappointed when the recruiter stated that my hourly rate was non-negotiable. I worked for Scripps for 10+ years and the compensation they offered was lower than my previous rate of pay. I withdrew my acceptance. ", "Interview Questions": "Scenario based interview questions, followed a script  "}], [{"date": "19 Sept 2022", "title": "PSR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Scripps Health in Aug 2022", "Interview Descriptions": "Great interview process. Met online with 3 managers at the same time. They made me feel comfortable and the conversation was easy going. They explained the position and what they expected once hired. ", "Interview Questions": "How would you deal if you have a disagreement with a coworker?"}, {"date": "25 Jul 2022", "title": "Licensed Acupuncturist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "all online, recorded interviewer, then you recorded your answers and submitted them. It was nice to be able to re-record your answer if you didn't like your first response. \nIt was difficult because you couldn't ask questions of the interviewer,", "Interview Questions": "Why do you want to work for Scripps?"}, {"date": "9 Jul 2022", "title": "Patient Care Associate (PCA) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Scripps Health (San Diego, CA) in Jul 2022", "Interview Descriptions": "Smooth and straight forward interview process. No tricky questions. Very friendly interaction overall. It was also fairly quick. About 30-45 minutes at most. The interviewer was interested in background information as well.", "Interview Questions": "What would you consider is your weakness?"}, {"date": "20 Jun 2022", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health in Jun 2022", "Interview Descriptions": "I First applied then received an email to do video interview questions. Then two weeks later I received a follow-up email for telephone interview. General questions. A time you were in a stressful situation and how you handled it.", "Interview Questions": "A time you were in a stressful situation and how you handled it."}, {"date": "10 Mar 2022", "title": "Medical Receptionist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "All staff I met with were prepared and on time for the interview. Seems like this would be a good place to work, but I was not offered a position.", "Interview Questions": "Asked about previous work experience"}, {"date": "3 Mar 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Scripps Health", "Interview Descriptions": "It was a panel interview with the supervisor and manager of the Med Surg unit. They made you feel real comfortable even though interviews can be a little intimidating. Asked basic interview questions as well as some scenarios.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "16 Feb 2022", "title": "Office Administrative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "Quick response from Scripps. Video interview with pre-recorded questions done on my own schedule. Easy process that I was able to complete in a day. I was allowed time to practice answers and interview was recorded.", "Interview Questions": "How do you handle office conflict?"}, {"date": "1 Feb 2022", "title": "Talent Acquisition Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "I applied really easy and once i was finish submitting my application received a txt letting me know i was selected to do 1 video interview. I had 72 hrs in order to complete it.", "Interview Questions": "Why do you want to work at Scripps.\r\n "}, {"date": "27 Jan 2022", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Scripps Health (San Diego, CA) in Jan 2022", "Interview Descriptions": "Automatic digital pre-recorded interview given after submitting online application, but only 72 hours to do it. 3 minutes of recording allowed per question but unlimited retakes given and the ability to stop in the middle and finish later. If you submit additional applications for multiple roles, Scripps will automatically use your original video responses for all proceeding applications. It varied for each role, but within a few days to a two weeks I was updated by email if my application was forwarded to the recruiter. If the recruiter likes you, they will then ask you to set up a live video interview with the hiring manager. Some had me facetime while others had me use their formal ModernHire platform. I was expecting technical questions on the second interview but mine were all behavioral and some basic yes/no answers on if I know how to do vitals and the extent of my experience. The recruiter then let me know if I got the job in no later than a few days. My fastest turn around on an offer was two hours after my interview with the hiring manager. My experience is limited to my 100-hr clinical externship but I used my other customer service and public health experiences to convey how patient-centered I am and eager to learn! The hiring managers both said they clearly saw that in my resume and responses so I highly recommend reminding them of your patient-centeredness in nearly every question answer (where appropriate). I finished my interviews by asking each of them if they had any doubts about my ability to succeed in the role; I really think this helps not only give opportunities to further explain why you're fit for the role if they have doubts, but also helps them reflect on their impression of you and say it out loud--its also shows confidence and a huge effort to showcase your eagnerness. Good luck!", "Interview Questions": "Why Scripps?\r\n\r\nTime you went above and beyond for a patient/customer?\r\n\r\nTime you had a conflict with a coworker and how did you resolve it?\r\n\r\nTime you increased efficiency in the workplace in a past role?\r\n\r\nDescribe a project or decision that you're most proud of from the past year."}, {"date": "5 Jan 2022", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Scripps Health", "Interview Descriptions": "I was sent a self paced interview then a week later told my video had been sent to the hiring leader it’s been a week and i have yet to revive anything", "Interview Questions": "Why do you want to work for us"}], [{"date": "11 Jan 2022", "title": "RN New Grad Residency Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Scripps Health in Jan 2022", "Interview Descriptions": "30 min, rapid fire questions, little feedback during the interview, zoom format,  with nurse manager, offers were sent two weeks later which was stated by the staff member, I had to think quickly", "Interview Questions": "Tell me a little about yourself?\r\n"}, {"date": "22 Dec 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "Easy, it was like having a conversation. The manager is very sweet and caring. She gave you time to gather your thoughts. It was a video call and everything went smoothly.", "Interview Questions": "N/A"}, {"date": "15 Dec 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "The on demand video interview process was simple and easy to follow. Scripps has an extremely welcoming environment and an amazing recruitment team. The process prepares you for a live interview.", "Interview Questions": "Why do you want to work at Scripps?"}, {"date": "17 Dec 2021", "title": "Medical Records Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Scripps Health (San Diego, CA) in Dec 2021", "Interview Descriptions": "Had on-demand interview which consisted of recording answers to 4 questions (why do you want to work here? Etc.). Received an email my application was forwarded to HR 2 and a week later received an email saying I was not selected.", "Interview Questions": "Why do you want to work here?\n"}, {"date": "22 Dec 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Scripps Health (San Diego, CA) in Dec 2021", "Interview Descriptions": "Applied online. 3 weeks later I received a request to interview with the recruiter. Interview was simple with basic questions. I was immediately scheduled to interview with the floor manager. The next day I interviewed with the floor manager via video chat. It was a tough interview. Many patient-scenario questions which were very specific with detailed information. Questions regarding my background and training, etc. 2 days following this interview I received a call from the recruiter offering me the position.", "Interview Questions": "Which of these two patients would you see first? (Patient information included for the scenario)"}, {"date": "31 Dec 2021", "title": "Patient Care Assistant (PCA) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Scripps Health in Dec 2021", "Interview Descriptions": "Quick and to the point. The interview process has been easy and allows me to do it at my own pace. The company communicates quickly as well. Overall a good experience so far", "Interview Questions": "What is one way you went above and beyond for a patient?"}, {"date": "11 Nov 2021", "title": "Supply Chain Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health", "Interview Descriptions": "A hiring manager will ask you six basic an average questions. They are mostly concerning for Situational questions. At the beginning of the process they will do a video online questionnaire.  As part of their screening process", "Interview Questions": "If you disagreed with one of your coworkers how did you handle the situation?"}, {"date": "8 Nov 2021", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "Online format where I talked to someone from HR. Went over my previous work experience and education as a nursing student. Interviewer also went over my resume and certifications that I had.", "Interview Questions": "Name a time you had a disagreement with a coworker and how did I resolve it."}, {"date": "15 Nov 2021", "title": "Patient Care Assistant (PCA) Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Scripps Health (San Diego, CA) in Nov 2021", "Interview Descriptions": "Online application. 72 hours to complete pre-recorded video interview questions, if you pass the pre-recorded video step then you go on to schedule a live video interview. At this point if you are chosen they will call or email with an offer.", "Interview Questions": "Why do you want to work at Scripps?"}, {"date": "16 Nov 2021", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Scripps Health (San Diego, CA) in Nov 2021", "Interview Descriptions": "The interview process was about 30 minutes. They asked behavioral and situational types questions. There interview consisted of 3 manager panel. The interview was through their company software over video.", "Interview Questions": "Tell us about yourself and why you chose nursing? "}], [{"date": "17 Oct 2021", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Scripps Health", "Interview Descriptions": "The interview was a long process but worth it at the end. I had 4 interviews within the same week. It took 2 weeks from doing the application for them to give me a call.", "Interview Questions": "Why should we hire you?"}, {"date": "3 Nov 2021", "title": "Human Resources Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health (San Diego, CA) in Oct 2021", "Interview Descriptions": "The process of this interview was online by creating small clips of the answers you're responding to the questions. The questions are similar to questions you are looking for to get hired and why you desire to work for the agency. Wasn't so bad, it was my first time doing this type of interview. I would do it again for practice.", "Interview Questions": " Why do you wanna work for our team? "}, {"date": "4 Oct 2021", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health in Oct 2021", "Interview Descriptions": "The interview was fairly simple. It was only 4 video questions. You can re-record as many times. It is self paced. I have not heard anything back after recording my video interview.", "Interview Questions": "Tell us about a time you had a conflict with a coworker and what was the outcome"}, {"date": "2 Sept 2021", "title": "Department Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health", "Interview Descriptions": "Due to COVID, the first interview was an on-demand video interview, which was very helpful and easy to navigate. There were 4 questions total, and I was able to re-record myself as much as I needed. There was also a notepad window that I was able to type key points on to help me answer.", "Interview Questions": "Tell us about an improvement you made in your current role. What was the outcome?"}, {"date": "12 Aug 2021", "title": "RN Plastic Surgery Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "Easy and laid back interview, very friendly. They asked about my experience and how I could add to their team. When that specific role wasnt available they offered me a different position", "Interview Questions": "how is your experience applicable to this role"}, {"date": "23 Aug 2021", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Scripps Health in Aug 2021", "Interview Descriptions": "Never encountered interview questions like the ones management asked. First you do an online interview and If you are chosen to move forward another interview is scheduled. This time with a live person", "Interview Questions": "Conflict with a co worker and how you resolved "}, {"date": "27 Jul 2021", "title": "New Grad RN Residency Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "I only went through On Demand Video Interview that was offered after you sent in your application. You have about two days to turn it in. They had less than 15 questions and it was very basic interview questions.  I suggest you turn it in ASAP, because I felt like I turned it in later than the others and they did not look at it.", "Interview Questions": "What do you expect your new role to be? "}, {"date": "11 Sept 2021", "title": "Director of Pharmacy Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Scripps Health (San Diego, CA) in Jul 2021", "Interview Descriptions": "I had 3 panel interviews which were mostly behavioral interviews, focusing on medication safety initiatives, and metrics for quality improvement projects.  Several panel interviews with different audiences. Some work based knowledge questions.", "Interview Questions": "tell about a time you had to escalate something to administration?"}, {"date": "25 Jun 2021", "title": "New Graduate RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health (San Diego, CA) in Jun 2021", "Interview Descriptions": "The interview process is good.  After submitting the initial application I received an email thirty minutes afterwards with a link to complete the video interview. The link to the video interview expires 72 hours after it is sent, so make sure you are prepared to take the video interview.", "Interview Questions": "Tell us about yourself. (there are eight questions asked in the video interview)"}, {"date": "14 Sept 2021", "title": "PCT Patient Care Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Scripps Health (San Diego, CA) in Jun 2021", "Interview Descriptions": "Video interview, respond to prompts. Did not take a long time, super easy and very thoughtful prompts. Hope to work there one day soon maybe once I graduate school, which is in the spring", "Interview Questions": "Why do you want to work here"}], [{"date": "2 Apr 2021", "title": "Associate Analyst, Program Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health (San Diego, CA) in Mar 2021", "Interview Descriptions": "The first interview was a video interview where you record yourself answering taped questions. You do have time to practice and submit your best answer. There is a information video that explains how it will work. There is also a skills test and a panel interview.", "Interview Questions": "Why is career development important to you?"}, {"date": "7 Feb 2021", "title": "Ophthalmic Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health", "Interview Descriptions": "Interviews were pretty straight forward.  I am a current employee and have enjoyed my time at Scripps but I almost turned down this job due to lack of communication with my recruiter. My recruiter and recruitment coordinator were TERRIBLE. They almost had to push out my start date due to a screw up on their end. They ignored countless emails regarding questions my onboarding agreement. They sent me to the wrong site twice for my physical. I was supposed to have a welcome call and my recruitment coordinator called an hour before 'to get things started early' after I had been emailing and trying to call her for 2 WEEKS. She didn't even acknowledge the fact that she had ignored my emails and calls. The lack of communication was so terrible and I am not the first one that has had to deal with this.", "Interview Questions": "How would you do a work up for x, y , and z? "}, {"date": "10 Feb 2021", "title": "Patient Care Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health (San Diego, CA) in Feb 2021", "Interview Descriptions": "Quick and professional. Takes a couple of weeks to hear back, but finding out wether you got the job or not happens pretty fast after the interview. Submit application, and depending on wether they like what they see, they will decide to go forward with an interview or not.", "Interview Questions": "Why do you want to work here? "}, {"date": "1 Feb 2021", "title": "Medical Representative PSR Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "EASY so kind. FOr the COVID clinics if only it weeren't for the pandmeic but alas here we are upport staff within Clinical Effectiveness and partnering with the Quality and Patient Safety teams at the Sharp hospitals.", "Interview Questions": "Tell me your strengths and weaknesses"}, {"date": "4 Feb 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Scripps Health (San Diego, CA) in Feb 2021", "Interview Descriptions": "First I submitted my application. Then I was invited to complete a self-paced recorded interview. After submitting that a couple days later i was invited for a live virtual interview. The day after I was called and offered the position.", "Interview Questions": "Tell me about  a time you went above and beyond for a patient "}, {"date": "25 Jan 2021", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "Easy questions to maneuver if you provide detailed examples to back up every answer. Healthcare needs all of these examples related to patients. You will meet with 2-3 supervisors and they will ask you questions in rotation.", "Interview Questions": "Q. A time you made it out of a difficult situation. "}, {"date": "20 Feb 2023", "title": "Surgical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Scripps Health in Jan 2021", "Interview Descriptions": "The interview process was pretty straightforward. I came in as a student and to them that was fairly rare since I had no experience, but they brought me on a taught me so much. During the interview I was asked about my clinical experience, what cases I am familiar with and where I see myself with them. I was asked about how I have been there for the patient and in why did I choose Scripps. Towards the end I was given two very hard questions and answered them as best as I could. I was interviewed by 2 people at the same time via facetime.", "Interview Questions": "What is one way you have gone above and beyond for a patient ?"}, {"date": "15 Dec 2020", "title": "Licensed Vocational Nurse (LVN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health (Rancho Bernardo, CA) in Dec 2020", "Interview Descriptions": "I had two interviews for different departments: one was an On-Demand video interview and the second was a video call with the manager. Very positive experience and fair process overall.", "Interview Questions": "Why do you want to work for Scripps?"}, {"date": "16 Feb 2021", "title": "Materials Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health (San Diego, CA) in Dec 2020", "Interview Descriptions": "over the phone, via zoom.  2 people were on zoom.  Did hear one of the people make noises, as in okay, I'm not really sure if I believe you.  Other then that, thought it went well and thought I would get a call back.  Now they are looking to hire for the same position, seems as if they person they chose did not work out.", "Interview Questions": "reviewed qualifications, experience, and past issues. "}, {"date": "7 Dec 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Scripps Health (San Diego, CA) in Dec 2020", "Interview Descriptions": "Pre-screening questions with recorded video answers, then when passes pre-screening you may have interview with Supervisor or panel interview. Panel interview may be with colleagues and supervisors. Describing person experience and hypothetical questions", "Interview Questions": "What have you contributed to your department What was something you taught to another colleague"}], [{"date": "22 Oct 2020", "title": "Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "Easy and direct questions based on practical experience. One phone interview, followed by an in-person interview.  Necessary Certification was a must.  All relevant questions were asked based on your resume.", "Interview Questions": "Describe a situation where you had to multi-task?"}, {"date": "29 Sept 2020", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Scripps Health", "Interview Descriptions": "1. Initial 15 phone screen with HR. More of a touch base about your background and if you fit the position\n2. 60 min phone interview with hiring manager. The interview was through their dial in number. Interview wasn’t too difficult but they were specific to what they were looking for and the role that they would have in the organization.", "Interview Questions": "Why do you want to work here?"}, {"date": "9 Sept 2020", "title": "Applications Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health (San Diego, CA)", "Interview Descriptions": "Phone screen. Large panel interview (8-10) people. Questions based on previous work related to role. Questions on your process and how you accomplish goals and measure success. Specific examples requested - no generalizations.", "Interview Questions": "Talk about a time you worked with a difficult physician."}, {"date": "28 Sept 2020", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Scripps Health (San Diego, CA) in Sept 2020", "Interview Descriptions": "Was contacted about completing a online interview that consisted of 4 questions that could be down on my own time (within 3 days), and re-recorded.  From there I was contacted within a week that I had moved on to the next interview, which was with the hiring manager and 2 supervisors on the floor. Super nice and welcoming!", "Interview Questions": "Why do you want to work at Scripps?"}, {"date": "13 Jul 2021", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Scripps Health (La Jolla, CA) in Sept 2020", "Interview Descriptions": "Interview process was relatively easy. Self-paced, video on-demand interview that must be completed within 72 hours of when the interview invitation was sent.  I then had a phone interview with the department manager a couple days later.  Was offered the job after my interview.", "Interview Questions": "1.\tWhy would you like to join our connected and patient-focused culture?\r\n2.\tTell us about a time you went the extra mile to meet the needs of a patient or customer?\r\n3.\tTell us about an improvement you made in your current role.  What was the outcome?\r\n4.\tPlease describe a disagreement you recently had with another person at work.  How did you handle the situation?"}, {"date": "25 Feb 2021", "title": "RN- Float Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health (Oceanside, CA) in Sept 2020", "Interview Descriptions": "The interview was over the phone due to COVID restrictions, I know some interviews were done through video call, as well. Interview process was fairly simple, easy going and friendly. He allowed me to ask questions about the organization and about floating.", "Interview Questions": "Tell me about a time you had a disagreement with a coworker.\r\nWhat made you want to be a float nurse?"}, {"date": "13 Aug 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Scripps Health (San Diego, CA) in Aug 2020", "Interview Descriptions": "Applied online and got an invite to complete an online prerecorded interview. The pre-recorded interview was also used for more than one job I applied for at Scripps. Then a week later I got an invite to complete a live interview online.", "Interview Questions": "Describe a conflict you had at work."}, {"date": "13 Aug 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "Personable and comfortable. Pleasant and easy to arrange. I enjoyed it. There wasn’t an issue I met with two managers and ended up taking a position I didn’t even apply to.", "Interview Questions": "Describe a difficult situation and how you handled it. "}, {"date": "11 Aug 2020", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "I had to 3 days to record myself for 5 questions on Hiring Manager. A day late,  I got an opportunity to schedule an appointment to a 2nd interview which is going to be through Hiring Manager as well.", "Interview Questions": "What interests you about Scripps?"}, {"date": "11 Jul 2020", "title": "Patient Registration Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health in Jul 2020", "Interview Descriptions": "The self paced interview consisted of a 4 videos of pre-recorded questions, I answered via video and I was able to rerecord as needed. I haven't heard back yet, but I will update this if I do. I put be low that \"I didn't get the job\" but there wasn't an option to put \"waiting for a call back.\"", "Interview Questions": "Why do you want to work here? \r\n\r\n"}], [{"date": "24 Aug 2020", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Scripps Health in Jul 2020", "Interview Descriptions": "I have completed the self-paced interview process that included 4 questions. You are able to redo them before you actually submit them. Questions were not too challenging, mostly basic soft skills interview type questions. I am in the next phase and was invited for a live interview after I sent in the self-paced video. So that is why my answer for the offer says no for now because the application process is still going.", "Interview Questions": "Describe a time you had a conflict at work?"}, {"date": "18 Aug 2020", "title": "Food Service Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health in Jul 2020", "Interview Descriptions": "After submitting the application, I received an email to perform a self-pace interview. You have 3 days to complete the interview. The self-pace interview is simple. You answer about 4 questions.", "Interview Questions": "Why would you like to work here?"}, {"date": "16 Jun 2020", "title": "Patient Care Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Scripps Health in Jun 2020", "Interview Descriptions": "The process took about 2-3 weeks first you apply online, you get your application forwarded to manager of the department, and get called for an interview. I was excited for this interview. Until the hiring manager did  not even say hello! She did not seem like she did not want to hire me or any interest of speaking to me. She kept looking to her left from the beginning to the end. I knew I would not get hired from the second I said hello.  The individual did not look happy and treated the interview as non existant", "Interview Questions": "Tell me a time a patient was upset and how did you handle it?"}, {"date": "7 Jul 2020", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Scripps Health (San Diego, CA) in Jun 2020", "Interview Descriptions": "I thought the hiring process was great, albeit a little slow. I applied and then heard back within a week or two when I was asked to schedule an asynchronous interview. I completed this and then was invited to a real interview with a supervisor. They also sent a skills test to complete for PCA/CNA competencies. The hiring manager was super nice during my virtual interview, (they use ModernHire) and multiple people reaching out were all kind and very accommodating along the way. For the interview, questions were asked about everything from the job itself to my skill set.", "Interview Questions": "Have you ever received disciplinary action on a job or license?"}, {"date": "29 May 2020", "title": "Kitchen Staff Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Scripps Health (La Jolla, CA)", "Interview Descriptions": "Interviewed by two ladies who wrote down word for word everything I said in response to third questions.  The interview took place in the dining room of the Scripps Green hospital.", "Interview Questions": "Situational questions. What would you do here? Describe a time you dealt with this?"}, {"date": "27 Apr 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "Applied online and got an invitation that same day to do a self paced taped interview. The self paced interview was very convenient and easy to do and took a lot of the pressure out of a real in person interview. You can redo your answers as many times as you want.", "Interview Questions": "Why do you want to work for Scripps?"}, {"date": "2 May 2020", "title": "New Graduate RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Scripps Health", "Interview Descriptions": "The whole process took around a month. Applied online and received an interview invite. Standard behavioral questions, the process was overall very easy and everyone I interacted with was very kind and professional.", "Interview Questions": "How do you deal with interruptions at work?"}, {"date": "2 Jul 2020", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Scripps Health in May 2020", "Interview Descriptions": "I was informed via email that I was selected to do  a virtual interview and was given a window in which I had to complete it. The software was easy to use, the questions were typical behavioral type, and you were given unlimited re-recordings to answer your questions.", "Interview Questions": "Tell us about an improvement you made in your current role. What was the outcome?"}, {"date": "9 Apr 2020", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Scripps Health", "Interview Descriptions": "I was interviewed by 2 people and the whole interview was about 10 minutes long. They give you a time and date and you have to be there at that time in order to get an interview. They were organized and had people getting in and out quickly.", "Interview Questions": "what was your most frustrating clinical experience? "}, {"date": "4 Mar 2020", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Scripps Health (Carlsbad, CA) in Mar 2020", "Interview Descriptions": "Applied for the position and received an email asking to complete a four question self paced interview. I’m glad I was given time to really think about my answers and the ability to re-record my answers if I didn’t like them.", "Interview Questions": "Why do you want to work for Scripps Health?"}], [{"date": "29 Jun 2021", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Scripps Health (San Diego, CA) in Mar 2020", "Interview Descriptions": "3 step process. Apply online, get an interview with a recruiter, then interview with manager of the unit. Interview with recruiter will determine the likelihood of getting the position. But vetting is harsh for the initial application. Overachingly the entire system is easy to manage but difficult to get past the I goal vetting process.", "Interview Questions": "Describe a time where you went above and beyond for a patient? "}, {"date": "19 Mar 2020", "title": "Diet Clerk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health in Mar 2020", "Interview Descriptions": "I had a positive experience all around, from start to finish. The recruiter who contacted me as well as the Dietician who interviewed me were both very nice. The person who interviewed me made me feel very comfortable throughout the interview. She was very thorough and informative of the position.", "Interview Questions": "Why do you want to work for Scripps?"}, {"date": "4 Oct 2020", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health (San Diego, CA) in Feb 2020", "Interview Descriptions": "First you record yourself answering about five interview questions. Then if selected you will have a phone interview.  Some questions might be the same for both interviews but questions will increase in quantity as the interview process continues.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "11 Feb 2020", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Scripps Health (San Diego, CA) in Jan 2020", "Interview Descriptions": "The interview was a series of questions from a panel of employees including the clinical manager, nurses, patient service representatives, and other medical assistants. I was also given a tour of the full clinic.", "Interview Questions": "What are 3 great qualities that coworkers would attribute to you?"}, {"date": "2 Jan 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Scripps Health (San Diego, CA) in Jan 2020", "Interview Descriptions": "Easily applied online and did a video interview with an automated person asking questions. It was self-paced so I enjoyed that aspect and I felt that I could thoroughly think about the questions and answer it to the best of my ability.", "Interview Questions": "Why do you want to work at Scripps?"}, {"date": "24 Feb 2020", "title": "Monitor Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Scripps Health (San Diego, CA) in Jan 2020", "Interview Descriptions": "applied online, got several emails then I got a call from the main supervisor to go in for an interview. Went the next day, got a job offer on spot. The guy from the parking structure was very nice and did not charge me for the day. Overall, very nice and positive atmosphere.", "Interview Questions": "about telemetry and an Test"}, {"date": "11 Dec 2019", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Scripps Health (San Diego, CA) in Nov 2019", "Interview Descriptions": "Took about a month to hear back after I applied to the position. I was sent an email with a scheduled time and wasn’t given another option so I had to be free at that time. However they did let us know when applying to block out two days to make sure we could attend the interview. When I arrived there were 4 people on the panel that interviewed me.", "Interview Questions": "What is one word your friends would use to describe you? "}, {"date": "6 Nov 2019", "title": "Spd Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Scripps Health (San Diego, CA) in Nov 2019", "Interview Descriptions": "Interviewers were very pleasant and calm. The whole interview lasted about 25 minutes and interviewers were forthcoming with their opinions of how I did. I was told what to expect next and an approximate time frame for the next steps of the process.", "Interview Questions": "Describe yourself in one word."}, {"date": "1 Nov 2019", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Scripps Health (San Diego, CA) in Oct 2019", "Interview Descriptions": "I went through three interviews. The first was a video interview, then interview with HR, and finally an in-person panel interview. I felt like I did great. If I am honest with myself, the position was not necessarily below me, but I would have been going backward. I only applied to try and get my foot into the door at Scripps, but I definitely would have stayed in the position for a few years. In all honesty, I think the VP already had made up her mind about who she wanted before I arrived. The interview was supposed to be a 3-panel interview. However, it ended up being just the VP and her Exec Asst. The interview panel, in addition to several comments made by the VP during the meeting, signaled to me that they did not take the interview seriously. I was told on Halloween via email (out of all days) that I was not selected. It was a bummer, but I suppose it's onwards and upwards. Your loss Scripps! *Pretty Woman voice*", "Interview Questions": "Tell me about a time when your day did not go as planned?"}, {"date": "17 Oct 2019", "title": "Patient Access Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Scripps Health (San Diego, CA) in Oct 2019", "Interview Descriptions": "Panel interview with 3 people. Interview went well.  Each person asked about 3-4 questions. They made me feel comfortable which made the interview process a little less overwhelming. They  offered me the position within a weeks time.", "Interview Questions": ".Tell us about your healthcare experience ?"}], [{"date": "16 Oct 2019", "title": "LVN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Scripps Health (San Diego, CA) in Oct 2019", "Interview Descriptions": "Call and a brief overview of the position followed by an invited to be interviewed in person. \r\nThe in person interview consisted of a group of people taking turns to ask general questions and an overview of the job and daily tasks.", "Interview Questions": "explain a difficult situation you have faced?\r\nWhy Scripps?\r\n"}, {"date": "18 Jan 2021", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health (San Diego, CA) in Sept 2019", "Interview Descriptions": "I applied on the website and one of the physicians in charge of hiring for this particular position reached out to me. After emailing back and forth, we set up time for the interview. The interview was very professional and formal.", "Interview Questions": "Tell me about your job/experience at \"XYZ Company\"?"}, {"date": "20 Aug 2019", "title": "Food Service Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "It was a group interview conducted by hiring managers representing multiple Scripps locations, and consisted of several scenario and experience questions related to the position. After the panel interview we were then interviewed one-on-one with an HR supervisor that wanted to get a better understanding of our plans and why we'd potentially be a good fit for the job.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "29 Jun 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Scripps Health", "Interview Descriptions": "Lengthy I had a panel and from the time I applied to the interview it was several weeks. The panel is usually at their CFLI location in Clairemont. I applied for the new graduate position.", "Interview Questions": "What are your strengths"}, {"date": "14 Jun 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Scripps Health", "Interview Descriptions": "Applied online, got a call from HR, had a phone screen with manager, then a phone interview with manager and other professional. References were checked and then offer was given via telephone and email.", "Interview Questions": "How would you resolve a conflict with a coworker?"}, {"date": "12 Jul 2019", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Scripps Health (Encinitas, CA) in Jun 2019", "Interview Descriptions": "The interview was fairly quick, beginning with a short introduction about yourself and followed by some \"rapid-fire\" questions relating to your work style. There were two interviewers and one spectator.", "Interview Questions": "How would you describe a good day for you?"}, {"date": "15 Apr 2019", "title": "Family Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Scripps Health", "Interview Descriptions": "Pleasant the physician was very professional answered all my questions. The interview was 1:1 and about 1 hour. Before the 1:1 interview there will first be a 30-minute telephone interview. This is basicallly describing the department.", "Interview Questions": "What do you want to work this departs and at Scripps?"}, {"date": "27 Mar 2019", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "There were multiple panels that day for each Scripps location. I was interviewing for  Scripps La Jolla. It was a panel interview with 3-4 hiring managers. Each asked a question. They were friendly. It lasted about 30 minutes", "Interview Questions": "What would you do if someone said don’t ask questions, just do it?"}, {"date": "30 Jan 2019", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "Long interview process, it took me over a month to start working once I found out I got the job. They should try and speed up the hiring process. The interview was me an a panel of 5 employees and the manager.", "Interview Questions": "How will you be an asset to the company?"}, {"date": "13 Nov 2018", "title": "Patient Account Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Scripps Health (San Diego, CA)", "Interview Descriptions": "The initial phone call to interview was not very productive. There was no feel run down of the position just a \"do you want to interview and what time?\" The interview was not very interactive, was very rushed and the interviewers quite frankly did not seem too interested in interview process.", "Interview Questions": "Not much as how your experience qualifies you for the position."}], [{"date": "3 Nov 2018", "title": "Pharmacy Technician Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Scripps Health (New York, NY)", "Interview Descriptions": "Applied online, received a call from a recruiter about a month later to describe the position and ask a few screener questions (tell me about yourself, how do you handle stress, do you work well in a team environment, etc.) On the same call she then set up an in-person interview scheduled a week later with the Pharmacy Manager, and sent me an email a few minutes later to confirm. The interview was supposed to be a panel interview with several people in the pharmacy, but due to scheduling concerns the interview was conducted by the Pharmacy Manager and another Pharmacy Technician Specialist who had already had the position for quite some time. They asked questions very unique to the position (can you work with blood or bad smells, are you independent, what are you looking for in a job, are you a fast or slow worker, etc.), scenario questions to test your reasoning and logic (prioritizing certain patients over others), and questions to assure I was familiar with commonly prescribed drugs. They were very kind, but also very direct and determined to find the right person for the job. I received a call about a week later from the recruiter who offered me the position.", "Interview Questions": "Are you a fast or slow talker?"}, {"date": "9 Feb 2019", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Scripps Health (San Diego, CA) in Oct 2018", "Interview Descriptions": "Panel interview with hiring managers and charge nurses from several units. They prefer quick and concise answers. I think mine was about 15 minutes long. Mostly behavioral and situational questions. No clinical questions.", "Interview Questions": "Name three strengths "}, {"date": "2 Apr 2019", "title": "Ultrasound Technologist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Scripps Health (San Diego, CA) in Sept 2018", "Interview Descriptions": "STAR interview style that was a little intimidating at first because it was unexpected but overall was a positive experience. Turned off by the fact that the job details/schedule/benefits were very different than what was originally described in the job posting. I applied for a full time benefits position Monday - Friday, only to be told at the end of the interview it was a Per Diem, no benefits position.", "Interview Questions": "I was asked to describe a problem I had within my current workplace and how I resolved it."}, {"date": "15 Aug 2018", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "short with 2 people. Asked simple questions regarding the position and had opportunity to ask them questions. Was offered the position a few days later. Was a very easy and fast process.", "Interview Questions": "What is something your former employer would say about you?"}, {"date": "9 Jul 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Scripps Health", "Interview Descriptions": "Greeted by nurse recruiter, panel interview with 3-4 nurse leaders in specific department. Mostly behavioral based questions with additional “rapid fire” questions (do you prefer this or that...). Heard from HR within a week with conditional job offer and directions to complete health screening, background check, drug screen, etc.", "Interview Questions": "Tell us about a time you had conflict with a coworker."}, {"date": "18 Jul 2018", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Scripps Health (La Jolla, CA) in Jul 2018", "Interview Descriptions": "Terrible.  Here is how the recruiting process goes:\r\n-Apply\r\n-Apply\r\n-Apply\r\n-Apply\r\n-Apply\r\nKeep paying\r\n-Recieve multiple \"thanks but no thanks\" emails\r\n-Recieve a few \"Please provide further information because your application is under manager review\"\r\n-Fill out all the requested information\r\n-Recieve a phone call from HR\r\n-Return HE's phone call\r\n-No answer? Leave vm\r\n-HR never returns your call\r\n-You call again\r\n-HR hangs up on you in mid sentence\r\n-HR never returns your phone call after they hang up on you\r\n-No response from all that information that they requested.\r\n\r\nEnd of recruitment process.", "Interview Questions": "Please provide further information to which goes nowhere"}, {"date": "18 Sept 2018", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health (La Jolla, CA) in Jul 2018", "Interview Descriptions": "30 minute interview with a panel of 3 managers from the program. Since we were informed that it was going to be short, I prepared short and concise answers for basic questions (so short,  I was there for only 25 minutes including questions I asked).", "Interview Questions": "Give 3 words that describe you?"}, {"date": "26 Apr 2018", "title": "Patient Service Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Scripps Health (Chula Vista, CA) in Apr 2018", "Interview Descriptions": "Applied 2 weeks ago and received a call from the hiring manager to come in for a face to face interview. It was a 30-min with the hiring manager and team lead. They asked standard situational and behavioral questions. Received a call same day with an offer.", "Interview Questions": "Do you like scores to measure your performance"}, {"date": "18 May 2019", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Scripps Health (San Diego, CA) in Mar 2018", "Interview Descriptions": "Applications are available online, a talent questionnaire is required at the end of your application, HR recruiter will contact you and either recommend you to the department manager, or not. If recommended, you will interview with the department manager, they will decided to extend a former offer for your review, or not. If you get the offer, you must respond promptly by accepting or negotiating. Once accepted, you’ll have blood work, physical, and company orientation before starting at your hospital.", "Interview Questions": "The most frustrating questions were phrased “what would you PREFER” when discussing shifts, days of the week, and location.. "}, {"date": "6 Feb 2018", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Scripps Health (San Diego, CA) in Jan 2018", "Interview Descriptions": "I applied multiple times and I finally got a call back for an interview. The following Thursday I attended the interview and took about 30 min. She basically wanted to get to know me a little more and asked about my past jobs followed by 8-12 questions.", "Interview Questions": "What is a good day for you?"}], [{"date": "27 Jan 2018", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Scripps Health (San Diego, CA) in Dec 2017", "Interview Descriptions": "You meet with a panel of four to interview.  a serious of different questions are asked, so be on your toes to answer with a quick , and professional answer.", "Interview Questions": "Don't want to ruin it for the next candidate, \" Be prepared \" is all  i want to  give as a readiness suggestion."}, {"date": "27 Oct 2017", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Scripps Health (San Diego, CA)", "Interview Descriptions": "applied online. First status showed application received, then it changed to under review, then it changed to hiring manager review, and finally got an email invitation for interview.  THe interview day and time was set and you had to either accept or decline the invitation.", "Interview Questions": "Tell us about yourseld"}, {"date": "13 Nov 2017", "title": "Service Desk Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at Scripps Health (Wildomar, CA)", "Interview Descriptions": "First I filled out the online application, next I took an online personality test, then I did a phone interview, last was an on site in person interview with 2 managers.", "Interview Questions": "Tell me about yourself"}, {"date": "9 Nov 2017", "title": "Director of Clinical Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Scripps Health (San Diego, CA) in Nov 2017", "Interview Descriptions": "Telephone screening initially with hiring manager followed by three on-site panel interviews in two separate days.  First on-site was one-hour with hiring manager's colleagues.  Second on-site interviews were comprised of lead physicians in the first hour and the leadership team in the second hour.", "Interview Questions": "How to approach group of long-time employees in cliques to change their behavior."}, {"date": "7 Jan 2020", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Scripps Health (San Diego, CA) in Nov 2017", "Interview Descriptions": "It was simple and direct. I first received a screen call to verify what I was interested in, and then moved onto a in person interview, where I was offered the job.", "Interview Questions": "Describe a situation where  you deescalated an issue. What steps did you take to ensure the satisfaction of the patient's request, within the scope of practice."}, {"date": "29 Sept 2017", "title": "Lab Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Scripps Health (San Marcos, CA)", "Interview Descriptions": "I had a brief phone interview with HR and was offered an in-person interview for the following week. Both interviewers were friendly and I thought the interview went really well. They most had standard questions like, how do you handle working with a coworker you don't get along with or with a difficult patient. After 2 weeks of not hearing back, I tried contacting HR multiple times for an update but never heard back. They just left me hanging. Very unprofessional.", "Interview Questions": "lots of situational questions: describe I time when..., describe how you would..."}, {"date": "16 Sept 2020", "title": "Kitchen Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Scripps Health (San Diego, CA) in Oct 2017", "Interview Descriptions": "3 interviews.  1 phone, 2 in person. The final interview they had me meet the team and go over technicals of what I'd be responsible for and how I would approach those situations/issues.", "Interview Questions": "Name one word that describes you."}, {"date": "26 Feb 2018", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Scripps Health (San Diego, CA) in Oct 2017", "Interview Descriptions": "Panel interview of four including the person I would be replacing. Introductions and explanation of job. There was a lot of light jokes. It was a non serious environment. I left feeling very confident.", "Interview Questions": "What makes you think you're the best fit for this job?"}, {"date": "20 Oct 2017", "title": "Patient Service Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Scripps Health (San Diego, CA) in Sept 2017", "Interview Descriptions": "There was a lengthy online application with long personality quiz/survey,  then a phone interview, then an in-person interview.  I was told there would be 3 interviewers, but one was unavailable and the other two were about 30 minutes late. The Operations Manager was very friendly. I received a call back the same day as the in-person interview regarding extending an offer. They didn't require a references check.", "Interview Questions": "Do you like games that challenge you or make you think? Give examples."}, {"date": "1 Sept 2017", "title": "Recruiting Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Scripps Health (San Diego, CA)", "Interview Descriptions": "Applied on their website\r\nReceived and email with date and time of interview\r\nGroup interview with a panel \r\n\r\nExtremely easy panel interview. Very friendly staff.  They're located in Kearny Mesa not inside of a hospital.", "Interview Questions": "How do you provide customer service "}], [{"date": "15 Sept 2017", "title": "Pharmacy Technician Specialist-patient Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at Scripps Health (San Diego, CA) in Sept 2017", "Interview Descriptions": "Phone Interview, then invited for a panel interview (ended up just being with the 2 pharmacists I would have been working with).  Was pretty straightforward, there was one role play situation where I was the technician calling a patient regarding an approved prior authorization for a NF medication and was asked to calm the patient after revealing their copay was still pretty high!\n\n**as far as any follow up; I tried to contact them on multiple occasions, but was given the runaround! I wish they would have told me outright that I was not going to be chosen to move forward in the process! **", "Interview Questions": "Describe a situation where you had to work as a team"}, {"date": "4 Apr 2018", "title": "Cardiovascular Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Scripps Health (San Diego, CA) in Sept 2017", "Interview Descriptions": "Applied online through the company’s website, and then submitted a resume, and references. Interview was with a panel and included a few brief get know you questions, a few technical background questions, and some referencing my resume.  Questions did not go into depth about my technical experience, but were more about how I heard about the job and why at this Hospital.", "Interview Questions": "Why do you want to work here?"}, {"date": "12 Sept 2017", "title": "Tele Tech Days FT Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Scripps Health (Encinitas, CA) in Sept 2017", "Interview Descriptions": "Applied on-line. Got a call from the Director. She asked me a few interview questions over the phone. She then set up an interview to come in and meet in person. I met with her, took a test and then sat with 2 tele techs for a while to get the feel of things. Very positive experience. Although, I do not agree on the testing part. I do not feel a test determines how good of an employee you are. I'd say 8 out of 10 questions on the test in my 10 years of being a seasoned Cardiac Monitor Technician have I ever been asked such questions that were the fort 10 or 12 questions on the test. Had the test been solely on rhythm strips it would have been a better out come. I truly believe you cannot base a persons ability to do a very good and outstanding job based on a test. In reality there are some people that just do not test well but, are the best workers ever!", "Interview Questions": "What would your co-workers say about you?"}, {"date": "9 Aug 2017", "title": "MA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 8 weeks. I interviewed at Scripps Health", "Interview Descriptions": "Applied and got a call about 4 weeks later.  Interviewed with a supervisor and 2 other MA's. Got a call about a week later with offer.  Whole process was good.", "Interview Questions": "What makes a good day for you?"}, {"date": "25 Sept 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at Scripps Health (San Diego, CA) in Aug 2017", "Interview Descriptions": "Short scripted interview without opportunity to interact with interviewers. Panel interview with introduction that interview would last 45 minutes, to answer completely but quickly to allow for all questions. Interview began 10 minutes late so interview panel appeared to be in great rush to get through interview.", "Interview Questions": "Tell us about yourself"}, {"date": "3 Sept 2017", "title": "Biomedical Equipment Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Scripps Health in Jul 2017", "Interview Descriptions": "The interview definitely focused on work ability Independent working conditions, flexibility with working hours and possible stay late condition  and customer service along with the ability to perform job specifics.", "Interview Questions": "what drives you?"}, {"date": "1 Jun 2017", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Scripps Health (San Diego, CA)", "Interview Descriptions": "1:1 and peer interview. Involve the whole team in the success of the potential employee; they become invested in success of the new hire. Excellent hiring process for both parties involved. Scripps is a great company to work for.", "Interview Questions": "A project/campaign most proud of"}, {"date": "18 May 2017", "title": "New Grad RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health in May 2017", "Interview Descriptions": "There were several panels going on at the same time. In one room, it was my panel interview with someone else's on the other side of the room. I'm not sure about the rest. My panel was with current RNs from different units and no managers or executives.", "Interview Questions": "Describe your perfect day. "}, {"date": "15 Jun 2018", "title": "Radiologic Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Scripps Health (San Diego, CA) in Feb 2017", "Interview Descriptions": "Multiple interviewers with in-depth interview to see if it will be a good fit for all parties. Interview usually takes approximately one hour to complete. Get there early parking can be difficult", "Interview Questions": "What is your priority in your job"}], [{"date": "13 Jun 2018", "title": "Unit Secretary Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Scripps Health (La Jolla, CA) in Jan 2017", "Interview Descriptions": "Office was under construction, so there was no clear way to find someone for help. After calling the manager she came out and got me, she was clearly unprepared and all over the place. Trying to make the best of it, I stayed professional and we started the interview. Simple questions about my previous job, such as duties and situations. We discussed the position further and she said I would be expecting a call by the end of the week. Never received a phone call back even after calling to follow up. Weirdest interview experience.", "Interview Questions": "Previous job duties and situations"}, {"date": "7 Jul 2019", "title": "Service Desk Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Scripps Health (San Diego, CA) in Jan 2017", "Interview Descriptions": "Had to go through temp agency to get in door.  To get directly in the company I don't see anyone doing.  Everyone goes through a temp agency- and they only use one.  And then they hire from who makes it through based on performance over a few months. The rest seem to get fired and they start all over.", "Interview Questions": "How do you deal with unhappy callers?"}, {"date": "6 Feb 2021", "title": "Test Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health in Jan 2017", "Interview Descriptions": "The interview was not what I have expected. It took longer than necessary. Some people were late and were also in a hurry to finish. I would not recommend based on my experience.", "Interview Questions": "What is your best experience"}, {"date": "22 Nov 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Scripps Health (Encinitas, CA)", "Interview Descriptions": "referred by an employee at Scripps I called the nursing supervisor to come in and  Apply in person had brief  phone interview then a panel interview waited on what they were waiting to pay me got the call and accepted position", "Interview Questions": "why would you like to work at scripps"}, {"date": "27 Nov 2018", "title": "Patient Account Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Scripps Health (San Diego, CA) in Nov 2016", "Interview Descriptions": "I was interviewed by managers 2 managers and 2 supervisors of 3 different departments at my first and only interview. Prior to the meeting portion of the interview they requested that I take a test to assess my understanding of billing in healthcare. Then they took turns asking questions about my life, my dreams, my experience, and my view of the health care industry and of the position I was applying for. They were all very approachable and kind, and it didn't feel like an interrogation in the least, even though there were 4 of them.", "Interview Questions": "What did I like most about working in Healthcare?"}, {"date": "16 Dec 2016", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Scripps Health (San Diego, CA) in Nov 2016", "Interview Descriptions": "I received a phone call and did a cold interview on the phone....then I got the call that the doctors wanted to interview me in person at the hospital.  It seemed like a pretty seamless process.", "Interview Questions": "What about your experience would make you a good fit for this position?"}, {"date": "26 Oct 2017", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Scripps Health (San Diego, CA) in Sept 2016", "Interview Descriptions": "I received a phone call a few days after applying and had and scheduled an interview the following week. There were three interviewers asking questions and it lasted 30 minutes.", "Interview Questions": "Tell us about yourself "}, {"date": "21 Aug 2016", "title": "Patient Service Representative II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Scripps Health", "Interview Descriptions": "Applied online, received email for phone screen 2 days later. Was asked for 1:1 on a Friday with hiring manager. Interview was fairly easy & I was offered the position the following Monday", "Interview Questions": "How do you handle angry patients or employees"}, {"date": "23 Aug 2016", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health (La Jolla, CA) in Aug 2016", "Interview Descriptions": "Three interviews in the process over two week period. I was impressed with the commitment the manager and team members showed in regards to finding the right person for this position.", "Interview Questions": "Q: What is your belief regarding friendships with colleagues outside of the workplace?"}, {"date": "15 Aug 2019", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Scripps Health (San Diego, CA) in Sept 2016", "Interview Descriptions": "I applied online 09/15/2016. About 1 week later I received a call from the manager offering me an interview a few days later. I was interviewed by the site manager and director.  Quick 10-15 min interview.  I received a call few days later asking me if I was interested in a 2nd interview with some of the staff (dr's and MA's). Of course, I agreed.\n\nA few days after that I received a call from HR (John) offering me the position with start dat 10/31/2016.", "Interview Questions": "What are your strengths "}], [{"date": "3 Aug 2016", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health", "Interview Descriptions": "The interview very short and structured. I felt like interviewers were rushed having to see many people throughout the day. There were two interviewers. Each  specialty had their own panel consisting of two people.  There were five or six stations total.", "Interview Questions": "Name three qualities that you look in your manager?"}, {"date": "12 Sept 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Scripps Health (San Diego, CA) in Aug 2016", "Interview Descriptions": "It was very well structured and very organized. The hiring manager was very nice and we'll knowledgable. Very pleasant experience and I felt really good and feel that this company is very good.", "Interview Questions": "Have you ever been in a situation where you were right and everyone is wrong."}, {"date": "12 Jul 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Scripps Health", "Interview Descriptions": "First you get a screening phone interview.  Then an in-person interview.  Mine were one-on-one.  Occasionally offices like to do another interview with more staff.  Like everywhere it is slow, and once they decided to hire me it took over a month to start.  Before the 1:1 interview they give you a super simple test mostly about medication dosages (e.g. if a medication comes as 10mg/mL, and the Dr orders 5mg how many mL do you draw up?).  Then you talk for about 30 minutes with a manager.", "Interview Questions": "How do you prioritize your time?"}, {"date": "4 Oct 2016", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Scripps Health (San Diego, CA) in Jul 2016", "Interview Descriptions": "Over the phone conversations; email and offer sent by HR - very unpersonable.I was sent an offer sheet and all I had to do was sign. The very next day, the manager apologized and retracted the position  The kicker was giving the position to a newly \"trained\" RN", "Interview Questions": "How would I diffuse a bad interaction"}, {"date": "6 Jun 2016", "title": "Food Service Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health", "Interview Descriptions": "1. Submitted application\r\n2. phone interview\r\n3. interview with supervisors\r\n4. got hired\r\n5. background check in process, waiting for call o start training\r\n\r\nThe supervisors were really nice and I felt in a comfortable environment in the interview.  They asked some scenario questions.  They really care about teamwork, flexibility, and ability to work in a fast paced environment in an efficient way.", "Interview Questions": "What makes a good healthcare provider?"}, {"date": "22 Mar 2019", "title": "EVS - Housekeeping Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Scripps Health (San Diego, CA) in Jun 2016", "Interview Descriptions": "the whole process was short and sweet, not too many questions and my interviewer was very helpful, kine, and honest. i think that anyone who goes thru this interview process will be very happy", "Interview Questions": "Do You Know What Your Doing"}, {"date": "25 Sept 2018", "title": "Lift Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Scripps Health (Santa Ana, CA) in Mar 2016", "Interview Descriptions": "Was great to do that interview please help the way you go there never the problem glass door reverence tge honor of my people will never fualter, you have no hope for those that defy us the chosen people, you demons shall fail with out a doubt, perish now!!", "Interview Questions": "How do you do in a destruction environment"}, {"date": "20 Feb 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Scripps Health (San Diego, CA) in Feb 2016", "Interview Descriptions": "The process for me was very fast. After applying the recruiter contacted me the same day that I applied letting me know I had been chosen to move forward in the process and to submit for background. I interviewed  once a week later. Two days later I was contacted back and offered the position.", "Interview Questions": "Do you know how to make a spreadsheet using Excel?"}, {"date": "23 May 2017", "title": "Receiver/Supplies Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Scripps Health (San Diego, CA) in Feb 2016", "Interview Descriptions": "Phone interview- which included questions about the company, your knowledge of the position, followed by a interview at the hospital, which asked questions based more around yourself and your work ethic and experience", "Interview Questions": "What do you take pride in?"}, {"date": "25 Oct 2017", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Scripps Health (Encinitas, CA) in Jan 2016", "Interview Descriptions": "basic questions that anyone could answer off the top of their heads, very easy and quick. You don't have any need to prepare and will do well! They really need volunteers.", "Interview Questions": "why do you want to volunteer?"}], [{"date": "22 Nov 2017", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Scripps Health (San Diego, CA) in Jan 2016", "Interview Descriptions": "It was an individual  in person interview with the departmet  manager and supervisor. They asked questions specific to OT and questions from Scripps. Both interviewers were accommodating and kind", "Interview Questions": "What are good traits to have as an OT?"}, {"date": "31 Oct 2015", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Scripps Health (New York, NY)", "Interview Descriptions": "I had interviewed with two different departments. I applied online and was called within a week. Only one interview for each position. There wasn't a need for a second interview. Both were panel interviews. I was offered the position and then started my background check.  It took 2 full weeks for the background check through Hire Right. Once when that cleared I started in two weeks.", "Interview Questions": "Tell us of a time that you set a goal and succeeded in achieving. Explain what it was and what you did to achieve it."}, {"date": "7 Oct 2015", "title": "LVN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Scripps Health", "Interview Descriptions": "The hiring manager called and asked a couple questions about if I was interested in working for them. Asked about my experience and why I wanted to work for the company over the phone. I was then prompted for a small background check through email. After that a group panel interview was set up, I interviewed with 7 people total, mostly the nursing staff and Medical assistants i would be working with. They each asked about 2-3 questions. Overall very nerve racking experience but they were very nice and made it easier. I was offered the position about 2 days later as the manager said she had 1 more candidate to interview. The interview questions were more character based and a couple scenario questions with the staff more than with patients.", "Interview Questions": "How would you feel and how would you handle this if you told (nurses name) that you would help her complete a task and ended up not being able to?"}, {"date": "21 Sept 2015", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Scripps Health", "Interview Descriptions": "I was given time to answer the quiz questions, then I got called in to the room for my interview, my interview was rushed and distracted after the first 10mins, this was a float pool position,", "Interview Questions": "Do other nurses come to you for help?"}, {"date": "29 May 2018", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Scripps Health (San Diego, CA) in Sept 2015", "Interview Descriptions": "phone screening and interview, after 2 weeks face to face interview. then a phone call offer and explanation of benefits. the process took 2 months including background check and drug tests", "Interview Questions": "how can you handle stress"}, {"date": "8 Oct 2015", "title": "Training Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Scripps Health (San Diego, CA) in Sept 2015", "Interview Descriptions": "Panel of department members asking old school, scenario-based questions to probe your personality. No questions on skill level or experience for position. Received notice that I advanced to the next level. I never heard from them again. I saw on linked in they hired someone but they left me hanging. Very unprofessional and cliquish. Falsified job description since advertised as training specialist but wanted training admin also.", "Interview Questions": "What would your coworkers say about you? Really?"}, {"date": "26 Aug 2015", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 4 weeks. I interviewed at Scripps Health", "Interview Descriptions": "My interview was conducted with an panel interview of the top 5 people in all of scripps pharmacy department and was asked several questions about my past experience..\nWas very nerve racking and the one of the interviews that pretty much was going to decide to hire me told me either:  \"you'll be receiving a job offer or a guaranteed second interview\". \nI never heard back whatsoever and my online status went to: \"no longer review\" \nThat was a suprise with no explanation whatsoever.\nVery unprofessional, at least be courteous enough to let a prospective employee know what's going to happen instead of stringing along and then lying to their face in the interview.\nFor so called medical professionals, you sure have a funny way showing your professionalism and staying true to your words.", "Interview Questions": "what were your duties at your past wmployers?"}, {"date": "17 Aug 2015", "title": "Lab Assistant Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Scripps Health (San Diego, CA)", "Interview Descriptions": "Group panel interview. Questions were a little difficult so had to really think about them before I gave a good answer. Questions consisted of scenario questions and skill questions. What would you do if so-so happened or when doing so-so what are the next steps after it.", "Interview Questions": "Gave scenario questions. What would you do?"}, {"date": "12 Sept 2015", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Scripps Health (Encinitas, CA) in Jun 2015", "Interview Descriptions": "Applied and was called for an interview quickly and scheduled interview for that week. Interview with a week. Interview went very well, hiring manager was nice and laid back, basically told me I got the job on the spot and that my official offer would come in a few days, and it did. When the hiring department called me they told me the offer rate, which is $6 lower per hour than what I am making for the same position at another local hospital and that there was no negotiation, as it goes by experience on a sliding scale. Surprised that they weren't able willing to negotiate at all especially since I am employed by their competing hospital system. Would have loved to work there.", "Interview Questions": "Given a situation (call light going off, patient trying to get out of bed, and nurse calling your phone) in what order would you address the tasks and why?"}, {"date": "27 Apr 2015", "title": "Patient Service Representative II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Scripps Health", "Interview Descriptions": "brief telephone interview and was invited in for a panel interview (1 manager and 2 employees who have been working at Scripps for over 5 years), was then told I would get a call back within a week or so for the status, 3 weeks passed, did not hear back so I decided to call and follow up, was then told they are still interviewing and they would let me know. A few days later I log in to my job profile where I applied online and the status changed to \"No longer under review\".", "Interview Questions": "Tell me about yourself"}], [{"date": "26 Aug 2015", "title": "Access Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Scripps Health (San Diego, CA) in May 2015", "Interview Descriptions": "long, lots of questions. a lot of people were involved. they want you to have insurance background. the people that interviewed me were fun and made it interesting. were asking upfront and wanted honest answers. they know what they are looking for but were nice about making sure it was a good fit for everyone.", "Interview Questions": "what would your coworkers say about you"}, {"date": "11 Jun 2015", "title": "Rad Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Scripps Health (San Diego, CA) in May 2015", "Interview Descriptions": "They have streamlined the process and cut down the response time considerably. It used to take months - now it seems they have changed the process so that the site hiring managers have more input and get to see qualified candidates sooner.", "Interview Questions": "Prior experience"}, {"date": "10 Apr 2015", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Scripps Health", "Interview Descriptions": "Telephone interview, took 3 weeks to get a call, was told I would get a call for a in person interview and the hiring manager never called back. I took the initiative and called, was then told again I would get a call back, 2 weeks pass and the status online with the job changed to \"no longer under review\".", "Interview Questions": "Why do you want to work here?"}, {"date": "10 Sept 2017", "title": "RN Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health (San Diego, CA) in Apr 2015", "Interview Descriptions": "Met with manager,  supervisor and social worker supervisor.  Answered typical questions.   Interview includedate information on role.     Call back with offer was quick .  Background and physical scheduled an completed quickly", "Interview Questions": "Specificso on handling tough patients "}, {"date": "11 Aug 2015", "title": "Professional Develop Spec CFLI Instructional Design Full Time Day Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 5 months. I interviewed at Scripps Health (San Diego, CA) in Mar 2015", "Interview Descriptions": "The interview process here was the most grueling, dry, and impersonal experience I've ever had in my 30 years of job hunting. I had a phone interview followed by two face-to face interviews with different groups of people. I would not have accepted a job there if they offered me a million dollar salary as I would never want to work with these people.", "Interview Questions": "N/A"}, {"date": "16 May 2018", "title": "Volunteer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Scripps Health (San Diego, CA) in Jan 2015", "Interview Descriptions": "I attended a seminar with bunch of people at the main hospital. There were student interns among other volunteers. It was a great experience to so many volunteers at the seminar.", "Interview Questions": "They asked you to introduce yourself in a group setting among other volunteers "}, {"date": "7 Aug 2015", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Scripps Health (San Diego, CA) in Jan 2015", "Interview Descriptions": "Basic interview process.. asked \"What are my long term goals\", \"Tell me about yourself\".. and so forth. Had the interview with the current manager as well as the supervisors. I kind of felt intimidated due to the fact that I wasn't prepared to have multiple people give me the interview. Other than that, it was like I mentioned, a basic interview.", "Interview Questions": "Was there any moments where you had to deal with an irate customer and how did you handle the situation?"}, {"date": "16 Feb 2018", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Scripps Health (La Jolla, CA) in Nov 2014", "Interview Descriptions": "You fill out a standard personality test while submitting resume.  Then Phone Screen then face to face with Hiring manager.  Then negotiation with HR for Salary typical of anyplace else.  Drug test comes a week before you start after you are already hired.", "Interview Questions": "About past experience"}, {"date": "19 Oct 2014", "title": "Pharmacy Technician - Part Time Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Scripps Health", "Interview Descriptions": "Went during Interview event. Applied online and waited until it was my turn. Bring your certification and license. They can get it later but it looks better if you have it. Hand them your resume right when you see the interviewer. They will ask questions about yourself. I didn't have any experience but she liked my personality and that I was a people person. Then they told me only the graveyard shifts were available. I guess I couldn't hold my expression so they basically told me I wasn't the right fit and they were right. Late hours just were not do-able for me. They were really nice. Didn't get an offer but my confidence entering the working force wasn't effected.", "Interview Questions": "Tell me about yours (asked 3 times)"}, {"date": "4 Mar 2018", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Scripps Health (La Jolla, CA) in Sept 2014", "Interview Descriptions": "After submitting an application to them online, within 2 weeks I was contacted for an interview. I met with the volunteer program director and she interviewed me. It wasn't too intimidating and they were very informative.", "Interview Questions": "Why do you want to pursue a career in the healthcare field?"}], [{"date": "1 Jul 2017", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health (La Jolla, CA) in Sept 2014", "Interview Descriptions": "The application process is long, but system will save your info for additional submissions for different positions. When rejected for a position, the system notifies you, so if you DON'T hear, you are still in consideration.", "Interview Questions": "What is your biggest weakness and how have you worked to overcome this? \r\nWhat was the best thing a manager has done to help you in your role?\r\nTell me about a time things didn't go as planned, and how your responded."}, {"date": "16 Mar 2014", "title": "Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Scripps Health", "Interview Descriptions": "This was an internal position.  I went through an interview with the hiring manager and a couple different panel interviews.  One with other IS staff and one with customers.", "Interview Questions": "No really challenging questions, I thought of them as pretty standard."}, {"date": "14 Feb 2014", "title": "Software Developer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Scripps Health", "Interview Descriptions": "Easy overall - multiple group interviews, phone interviews but nothing spectacular. This isn't Google", "Interview Questions": "Some technical questions that anybody with a CS degree should be comfortable to answer."}, {"date": "6 Dec 2013", "title": "Postdoctoral Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Scripps Health", "Interview Descriptions": "Applied online. Got contacted by e-mail in about a month by the prospective supervisor to schedule a phone interview. Phone interview lasted for about 15 minutes, he didn't ask much questions, just told that I seemed to be a good fit for this position and asked some questions about my availability and visa situations. The same day got a e-mail from him inviting for the on-site interview. I was asked to prepare a talk about my previous research. The on-site interview lasted for about 2-3 hours, including the talk + questions/discussions, then individual communication with different people in a group, and a lunch.", "Interview Questions": "N/A"}, {"date": "31 Dec 2013", "title": "Psr Hiring Pool Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Scripps Health (Del Mar, CA) in Nov 2013", "Interview Descriptions": "Applied online for over two years even though i met all of the qualifications i wasn't selected. Finally, i called human resources and spoke to someone asking what i have done wrong. They gave me recommendations and next thing i knew, i got an interview. they emailed  me for an interview for the hiring pool. i followed up and recurved an  appointment. The Interviewer was professional and friendly. She showed pride in Scripps and her job. She asked about questions and answered them appropriately and professionally.", "Interview Questions": "What would you do if your done with your work and it's time to go home but your coworker is not done?"}, {"date": "27 Oct 2013", "title": "Medical Receptionist/Front Desk Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at Scripps Health (La Jolla, CA) in Oct 2013", "Interview Descriptions": "The interview process was really easy. Easy questions were asked, and the staff was really polite and personable.", "Interview Questions": "\"Where do you find yourself in 5 years?\""}, {"date": "17 May 2015", "title": "Food Service Partner Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Scripps Health (La Jolla, CA) in Oct 2013", "Interview Descriptions": "They first do a phone screening with the supervisor calling you.  The panel interview is intimidating!  It's a panel of 5 people.  They are all supervisors and leads and the manager of the department.", "Interview Questions": "What is something that you are proud of?"}, {"date": "7 Mar 2017", "title": "Clinical Laboratory Techniction Assistant, Senior Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Scripps Health (San Diego, CA) in Sept 2013", "Interview Descriptions": "I was referred by a friend who recommended me and lucky for me that's how they more or less prefer to acquire out side candidates. My interview was with my supervisor and 2 other department leads. Very straight forward.", "Interview Questions": "What are your strengths?"}, {"date": "30 Jul 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health", "Interview Descriptions": "They have a hiring fair at Scripps Mercy where you get the chance to interview for two hospitals.  You go in the morning dressed and ready with copies of your resume and they choose what unit you will be interviewing with. You then interview with the little manager of that particular unit.  A bad manager will just read off the piece of paper and not be spontaneous in asking questions which is the manager I got.  Very bad!  The second manager was awesome, from Mercy Hospital, very experienced and comfortable interviewing and asking questions of first person accounts of what I've done and how I handled situations. Totally aced it! Wish to God I had gone with Mercy instead of La Jolla Green!", "Interview Questions": "I got a total BS question. what do you think is the biggest issue facing nursing today? "}, {"date": "15 Jul 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Scripps Health", "Interview Descriptions": "Very basic, they attempt to tell you how awesome their company is and how they are top ranked.   They will feed you good the first day to attempt to impress you.  Anyone that knows hospitals knows they are no where near the top of the competition .", "Interview Questions": "Very simple and basic. "}], [{"date": "29 Jul 2013", "title": "Rad Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Scripps Health in Jul 2013", "Interview Descriptions": "I was prepared to answer the standard questions, like \"tell me about yourself\", \"Why did you choose this profession?\" But he didn't ask very many questions, and they were mostly open-ended behavioral/situational. \"Tell me about a recent success. Why were you successful?\" \"What would be your ideal job/work environment?\" \"Tell me about a time, professionally, when you had to be flexible to complete a task/goal...\"", "Interview Questions": "Would others (such as your faculty and classmates from school) consider you a leader?"}, {"date": "6 Aug 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health (San Diego, CA) in Jun 2013", "Interview Descriptions": "One on one meeting with the Nursing Supervisor in her office that lasted about 30 minutes. She then took me on a tour of the facility and introduced me to the different department employees that she was in charge of.", "Interview Questions": "Where do you see yourself in five years"}, {"date": "12 Oct 2017", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Scripps Health (San Diego, CA) in Feb 2013", "Interview Descriptions": "The process was efficient and each person on panel asked multiple questions. In my opinion you answered to your experience. I did not think there were any wrong answers. You were graded by panel on different situations they could occur and how would you handle it.", "Interview Questions": "Why should we hire you. "}, {"date": "23 Aug 2017", "title": "Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Scripps Health (San Diego, CA) in Feb 2013", "Interview Descriptions": "If went fairly fast because I was working for UCSD so nurse manager was please that I knew the staffer that worked there as well I had drug screen orientation to floor and unit and various ceu classes before starting", "Interview Questions": "temp what would you report"}, {"date": "1 Mar 2017", "title": "Over Night CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Scripps Health (San Diego, CA) in Jan 2013", "Interview Descriptions": "Just have all your ducks in a row all your papers,school degrees medals honors certifications BLS card everything, even before your interview..... the manager took a look at my stack of papers and hired me immediately...... no one else cared about my papers", "Interview Questions": "Got experience? Always say of course, you have no idea...what I've been through... then briefly describe your job Try to be a happy person no matter the outcome."}, {"date": "15 Jun 2015", "title": "Critical Care RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Scripps Health (San Diego, CA) in Nov 2012", "Interview Descriptions": "The talent manager coordinated interview and hiring process with the department manager performing the formal 1:1 interview. Unfortunately, the left doesn't always know what the right is doing and it evokes a level of uncertainty from the future employee. At least, it did for me.", "Interview Questions": "What steps are you taking to advance your personal clinical practice?"}, {"date": "7 Oct 2012", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Scripps Health (San Diego, CA)", "Interview Descriptions": "Two panel interviews with team. The first interview was standard questions. The second focused  with more job specific situations and how I would handle those situations.", "Interview Questions": "Standard questions with a focus on how I dealt with change. "}, {"date": "27 May 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Scripps Health (San Diego, CA) in Oct 2012", "Interview Descriptions": "After online application process, phone interview with director. 1:1 meeting with same director and then a large panel interview of about 6-8 other managers and directors. Process took about 3-4 weeks.", "Interview Questions": "All behavioral and situational management questions."}, {"date": "22 Aug 2016", "title": "Operations Systems & Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Scripps Health (San Diego, CA) in Jun 2012", "Interview Descriptions": "I interviewed as an internal transfer.  The process began with an informal telephone interview with the (outgoing) manager, then progressed to an in-person interview with the manager, project manager, and a senior team member.  The in-person interview relied on pre-selected interview questions divided into several categories related to various topics, such as \"interpersonal skills\" (as one example).", "Interview Questions": "How has your education prepared you for this sort of position?"}, {"date": "6 Jan 2016", "title": "Lift Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Scripps Health (Encinitas, CA) in May 2012", "Interview Descriptions": "Casual talk with the previous manager. Not sure how it is with the new management as I didn't have to interview with them. I'm guessing it is 2-3 of them and maybe one lift tech interviewing you.", "Interview Questions": "Don't remember. The new management will probably ask you for related experience or customer service positions."}], [{"date": "3 May 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Scripps Health (La Jolla, CA) in May 2012", "Interview Descriptions": "Panel Interview. Director of the department and 3 or 4 of the people who you will be working with. They take turns reading off of a printed sheet of questions and write down everything you say. This was kind of awkward as there was a lot of silence as they were writing.", "Interview Questions": "Tell us about a time when you could not agree with a co-worker. "}, {"date": "9 Nov 2015", "title": "CT Technologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Scripps Health (San Diego, CA) in Apr 2012", "Interview Descriptions": "Short only asked a few questions about my work experience and how i found out about this position. They were focused on professionalism and be strict about following protocol during medical procedures. They described many situational question that I would face upon being hired. From dealing with difficult doctors and telling patients to comply with certain procedures. They temperature check you by exposing some of the difficult scenario you will face in this role", "Interview Questions": "How do you deal with a patient who did not wish to comply with our procedures"}, {"date": "20 Apr 2016", "title": "Clinical Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Scripps Health (San Diego, CA) in Mar 2012", "Interview Descriptions": "Pretty straight forward with strength and weakness, why u want to apply for position, what do you bring to Scripps, describe your last job, what project did you do to foster teamwork, behavior situation", "Interview Questions": "N/A"}, {"date": "29 Nov 2015", "title": "Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Scripps Health (San Diego, CA) in Feb 2012", "Interview Descriptions": "Interview was fairly easy.  You should know how to answer strength and weakness questions.  You should be able to answer situational questions.  They want to know how you work in a team environment.  The hiring manager and staff members who interview are very friendly and helpful to make the environment relaxing.  Just be yourself and things should work out well.", "Interview Questions": "What are some of your weaknesses"}, {"date": "17 Mar 2015", "title": "EMT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Scripps Health (Encinitas, CA) in Nov 2011", "Interview Descriptions": "Entered into a room with many of the other interviewees, started in a line and sat down with the manager of the specific department we were interviewing for, and did a 10 minute interview each with the department manager. Basic questions were asked, mainly pertaining to what we have done and where we plan on going in the future.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "10 Dec 2015", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Scripps Health (San Diego, CA) in Oct 2011", "Interview Descriptions": "Very quick and very thorough. Some technical questions but mostly it is about you. They a telent mine survey during the application and most of the questions are based on the answers on that survey.", "Interview Questions": "How do you handle difficult situations, like patients complaining?"}, {"date": "7 Jul 2015", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scripps Health (La Jolla, CA) in Sept 2011", "Interview Descriptions": "it was a panal interview where there were 4 employers interviewing you and you answered various questions.  They asked very difficult questions but I prepared for the interview before I met with them", "Interview Questions": "why should we hire you"}, {"date": "25 Sept 2013", "title": "Claims Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 months. I interviewed at Scripps Health (San Diego, CA) in Jul 2011", "Interview Descriptions": "When meeting with Jenny, I was pleasantly surprised at how friendly she was. Her office was warm and inviting filled with pictures of her handsome son. She shook my hand immediately and made note of my interview notebook. When she began the interview process, her tone immediately calmed my nervous energy. The interview felt like I was talking with an old friend that I was catching up with. Although this was a temporary job, she treated the interview as though I was going to be a permanent employee and an integral asset to her team.", "Interview Questions": "Honestly, I do not remember specific questions, only that most of the questions were standard. "}, {"date": "12 May 2015", "title": "Senior Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Scripps Health (San Diego, CA) in Jun 2011", "Interview Descriptions": "It was not difficult at all. Since I already work in the system, I know the job requirements very well and was able to answer all the questions with no problem.", "Interview Questions": "What is your long term goal?"}, {"date": "1 Aug 2014", "title": "Administrative Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at Scripps Health in Mar 2010", "Interview Descriptions": "You must apply online, and complete a Talent questionnaire.  Scripps post jobs daily, and receives thousands of application for each job.  It's important to keep your eye on the job posting (check the website every afternoon around 4 PM), and submit your resume promptly.  You want to be one of the first applicants for the posting, or your resume will be lost in the sea of other applicants.", "Interview Questions": "What is the key to providing extraordinary patient or customer service?"}], [{"date": "5 Aug 2012", "title": "Supervisor, Information Services Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Scripps Health (San Diego, CA) in Mar 2010", "Interview Descriptions": "It was a closed loop.  No way someone from the outside had a real opportunity.  I was not really qualified, I just knew someone.  My feeling is that the end result was successful but when I look back and consider it the process was probably not thorough enough.", "Interview Questions": "None, the interview was cake."}, {"date": "19 Aug 2010", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Scripps Health (San Diego, CA) in Jan 2010", "Interview Descriptions": "I applied online through the Scripps Health Care website. I was called for a phone interview 2 weeks after my application was submitted. I briefly spoke with the lead Medical Assistant for Pediatrics. She offered me a time to come in to meet the hiring manager for an interview. At that time, I did not know it was going to be a panel interview. I met with the hiring manager and panel of medical assistants working in the pediatric group. They each had a set of questions they asked me, and I answered each question to the best of my ability.  I was called back 1 week after the  interview and was offered the position. Two days later the talent manager called and sent me via email my hiring packet with instructions for my pre-employemnt paper work including date for physical and training. I also received a offer of acceptance which I faxed straight away.", "Interview Questions": "Do you think it's fair to treat every patient the same?"}, {"date": "12 Jul 2010", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 days. I interviewed at Scripps Health (La Jolla, CA) in Jan 2010", "Interview Descriptions": "Met with Managers and then with Doctors", "Interview Questions": "Why do you deserve this job"}, {"date": "9 Nov 2013", "title": "PSR III Surgery Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 6 weeks. I interviewed at Scripps Health (La Jolla, CA) in Sept 2009", "Interview Descriptions": "Lengthy process once application is approved by HR and then sent to the hiring manager. I waited over 1 month until I heard from someone about an actual interview, then waited another 2 weeks until they presented me with an offer. If you are seeking employment immediately, please keep this in mind.", "Interview Questions": "How do you handle stress"}, {"date": "7 Jun 2012", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Scripps Health (San Diego, CA) in May 2009", "Interview Descriptions": "Just interviewed with one person on phone and another in person. Was pretty casual.", "Interview Questions": "What fruit describes you the best?"}, {"date": "20 May 2011", "title": "Human Resources Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Scripps Health (San Diego, CA) in Feb 2009", "Interview Descriptions": "Panel interview was a surprise to me.  Walking in the room to see all those people ready to question me was very intimidating.  I would hope I had known in advance.  They seem to be very organized through the interview process however; they fail to send a thank you but no thank you note.", "Interview Questions": "How would you handle if an employee complains that the privous shift employee is not leaving everything in order (organized, cleaned, task completed) for the next shift."}, {"date": "2 Jun 2010", "title": "Human Resources Within Scripps Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Scripps Health (San Diego, CA) in Dec 2008", "Interview Descriptions": "I don't have much details to give except it was a fairly lengthy process.  But that was years ago; since then, there have been improvements.  There was an initial screening over the phone and later I was invited to come in for my panel interview.  The questions were fairly general from you would get asked from other companies.  Overall, it was not too painful of a process.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "9 Sept 2012", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Scripps Health (San Diego, CA) in Aug 2008", "Interview Descriptions": "First interview with Rehab supervisor and one staff therapist, second with director of rehab.\r\nVery nice, encouraging, not intimidating.", "Interview Questions": "What are your weaknesses?"}, {"date": "12 Jul 2009", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Scripps Health in May 2008", "Interview Descriptions": "Process is regulated by HR recruiter who is sometime difficult to make contact with.  While it was easy to leave messages, it was much harder to get return call.  Early discussions with HR prior to job offer were challenging to get much substantive information.  Actual interview process on the other hand was much more efficient and informative.\r\n\r\nCompany devotes substantive time and effort into arranging continuing and escalating  effort to new employee orientation, mentoring and feedback.", "Interview Questions": "What and how are you prepared to do to ensure patient safety and confidentiality"}]]