[[{"date": "13 Jul 2022", "title": "Lead HVAC Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Regis University", "Interview Descriptions": "short and straight to the point. they asked if there where and questions for me. just 2 in the interview.  the liked that i looked and answered with me eyes focused on them.", "Interview Questions": "Just asked about my previous experiences with Customer service ."}, {"date": "27 Jan 2022", "title": "Department Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Regis University", "Interview Descriptions": "Long but in a group with 2 faculty and 3 students so it was a nice conversation and actually went by pretty fast. make sure you speak up, but give time to the other students to also talk (respect).", "Interview Questions": "What area are you passionate about?"}, {"date": "18 Nov 2021", "title": "Ranger Tech Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Regis University", "Interview Descriptions": "It's a very simple interview process and will either be done by an ITS person or an RTS student. It took about 10-15 minutes. Questions are mainly technical and situational.", "Interview Questions": "What separates you from all the other candidates?"}, {"date": "12 Mar 2019", "title": "Events Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Regis University", "Interview Descriptions": "A phone interview (30 minutes in length) with two resident directors followed by a Skype interview (30 minutes in length) with 3 more resident directors. An offer came a week later.", "Interview Questions": "What are some current challenges students are facing today?\r\nHow do you define social justice?"}, {"date": "12 Mar 2017", "title": "Education Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Regis University", "Interview Descriptions": "The interview process is that they will ask your years of experience and ask for your CV and cover letter, while looking at your writing ability. The other process is looking at publications and presentations that have been completed by the interviewee.", "Interview Questions": "What will you bring to Regis University?"}, {"date": "24 Jul 2017", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Regis University (Denver, CO) in Mar 2017", "Interview Descriptions": "I saw this position posted on HigherEdJobs.com and decided to submit an application. I received an email with follow up questions (more of a screening process). The next week I received a call for a phone interview. After the phone interview I was selected to attend an on-campus interview. Lastly, I was asked back for a second campus interview. Both campus interviews involved various directors within the admissions  department.", "Interview Questions": "How would you evaluate students to see if they are good fit for our school?"}, {"date": "25 Feb 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Regis University (Denver, CO) in Feb 2017", "Interview Descriptions": "About 3 weeks after applying, I received a phone call to set up a phone interview. The phone interview lasted about 40 minutes and was more conversational than a set of questions. Looking for someone that can meet deadlines, has clear communication, a level of professionalism, multitasking, staying focused on a wide variety of tasks, and keeps in touch regularly. \r\n\r\nAbout a week later, I had an in-person interview and met with 3 people (panel). Everyone was very positive and pleasant. It seemed like a very wonderful work environment. There were some employees who had worked there for years (15 years) and then more new-comers. Again, more conversational, rather than asking specific questions. They mentioned after 6 months, you are eligible to take classes.", "Interview Questions": "What is your experience using social media? Do you feel comfortable working in an open work environment? Can you talk about your specific degree? Questions regarding things very early in career (5+ years ago). What is your biggest fear about this position? How do you feel about keeping us up-to-date?"}, {"date": "23 Mar 2016", "title": "Learning And Development Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Regis University (Boulder, CO) in Jan 2016", "Interview Descriptions": "The first stage of the screening was a video interview. This was a one way interview where a moderator asked you a series of questions and you had 2 minutes to reply to the screen. Found this very unhelpful, even a phone screen would have allowed for some questions on my part.", "Interview Questions": "What can you bring to this position"}, {"date": "7 Oct 2015", "title": "Report Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Regis University (Denver, CO) in Jul 2015", "Interview Descriptions": "not very hard technical questions, both senior and director are very nice and open to talk. I dont have much experiences with technology they implemented but they are ok with learning.", "Interview Questions": "How good is your mind reading skills?"}, {"date": "17 Sept 2017", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Regis University (Denver, CO) in Jan 2014", "Interview Descriptions": "First, a phone screen. Then, an in person interview on campus. Department heads and potential co-workers around a table in what felt like a workroom. Table, chairs, people, window. That's it.", "Interview Questions": "What AP Style change do you like least? (That was something I had never been asked in any writing-related interview, but I know AP, so no problem.)\r\nWas also asked about what I knew about Regis' Jesuit foundation. That one threw me.\r\nHad to write something on the spot. Usually no problem, except someone stayed in the room, sitting across the table watching me write. Awkward."}], [{"date": "5 Aug 2016", "title": "Academic Technology Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Regis University (Denver, CO) in Sept 2013", "Interview Descriptions": "I applied for Academic Technology Specialist and Academic Technician. I interviewed twice with the hiring manager and the coordinator. The interview was relatively casual, asking about my background and why I wanted the position. I was asked about experience with deployment and experience with audio visual troubleshooting. I was also asked about my schedule availability.", "Interview Questions": "What sets you apart from the team?"}, {"date": "25 Aug 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Regis University", "Interview Descriptions": "I was interviewed by my boss and by the two women I would be working with.  All three women asked the same questions: why I wanted to work for the university, why I was interested in the particular position, an experience in a previous position where I faced a challenging situation dealing with peer/boss/customer and how I handled it.", "Interview Questions": "Nothing really. Very standard interview questions."}, {"date": "6 Aug 2013", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Regis University (Denver, CO)", "Interview Descriptions": "I applied to the position posted on their website and was contacted within two weeks by the hiring manager.  First, we scheduled a phone interview, which lasted about 45 minutes to an hour and then one week later an in-person interview.  I wore a nice professional looking sweater, slacks and flats which seemed appropriate.  At the in-person interview, parking was free and I had to walk less than 10 minutes from my car to the building.  It was easy to find my way around the campus.  I met first individually with the hiring manager and then in a small group of four people. They were all professional, but also quite friendly with me and with each other, which felt very nice. They took turns asking questions, which were fairly standard, mostly about my previous experiences in various academic settings.  Nothing was odd, tricky or unexpected. The interview lasted a bit over an hour and I left with a good impression that they were really doing their best to hire someone who was a good match for the job.  Less than a week later, the hiring manager called me and offered me the position, which I accepted.", "Interview Questions": "They asked a bit about my very early career foundations.  I had to think back."}, {"date": "17 Nov 2014", "title": "Faculty Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Regis University (Denver, CO) in Aug 2013", "Interview Descriptions": "Highly unusual process where you interact with other candidates through an assessment. Included a topical presentation, assessment of peer dynamics, creative exercises, team problem-solving activities, a lengthy exercise on Jesuit values, essays, and multiple interviews. Interviews skewed to religious foundation more than academic qualifications.", "Interview Questions": "How will you promote Jesuit values in your classroom?"}, {"date": "6 Jan 2013", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Regis University (Denver, CO)", "Interview Descriptions": "Quite typical - fill out application form, potential phone interview, in-person interview tends to occur with a panel, provide references. Can take a while before you hear back.", "Interview Questions": "What is the Regis mission? Note, this is not your typical company mission statement - read up on the website."}, {"date": "6 Oct 2016", "title": "IT Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Regis University (Denver, CO) in May 2012", "Interview Descriptions": "The interview process was very easy. I got a speak with the IT Manager at the time, it was great interview. Talked about the experience on IT and how to integrate different technologies. none none none none none none none none none none none none none none none", "Interview Questions": "how would you integrate a software system into a Fitness Center? Draw out plan"}, {"date": "9 Apr 2013", "title": "Work Study Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Regis University in Mar 2012", "Interview Descriptions": "I completed multiple Interviews at Regis for different departments. They were pretty simple, behavioral questions. They wanted to see how I would fit in the different departments.\r\nThe pharmacy school wanted to see if I could remain confidential.\r\nCSIS wanted to know my web developing skills.\r\nRelations wanted to know my skills in using cameras.\r\nKRCX, my personality.\r\nResident Assistant, my compassionate, yet leadership experience.\r\nCA, my ability to work with others.\r\n\r\nAll had a fundamental goal to see how I work with the other people.", "Interview Questions": "How can you contribute to our office?"}]]