[[{"date": "26 Jan 2023", "title": "Software Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chicanos Por La Causa in Jan 2023", "Interview Descriptions": "The process was prompt, well communicated, and the environment was welcoming. I had an hour long behavioral interview with classic questions. Technical interview consisted of High Level design scenario questions, and additional questions relating to comprehension of database commands, etc.", "Interview Questions": "How would you explain object oriented programming to an adult who didn't work as a software engineer."}, {"date": "26 Aug 2022", "title": "Promoter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Chicanos Por La Causa (Tucson, AZ)", "Interview Descriptions": "Interview - straight to the point about position&related questions. BUT I didn’t like that they never emailed me about not getting the position. Waited wks for response. Unprofessional. There were two interviewers, they were non-supervisors, supervisors double booked their schedules and instead of rescheduling the interview. The whole hiring process made me really uninterested in the company.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "10 Aug 2021", "title": "Education Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Chicanos Por La Causa (San Antonio, TX) in Jul 2021", "Interview Descriptions": "The interview process took about one hour. They asked a variety of questions relating to mentoring and instances where I had to teach students and adults new curriculum.  They also asked if I have ever been in a position working with difficult people.", "Interview Questions": "Name an instance where you taught a colleague a new system?"}, {"date": "25 Jun 2019", "title": "Parent Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Chicanos Por La Causa (Tempe, AZ) in Feb 2019", "Interview Descriptions": "Got call for interview, set date and time, had interview at their center. Interview was done with both supervisor of center and manager. They tag team the interview and gave a paper with questions to be to look over before they asked the interview questions.", "Interview Questions": "How would I retain a resistant family?"}, {"date": "28 Jan 2017", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Chicanos Por La Causa (Phoenix, AZ) in Dec 2013", "Interview Descriptions": "Easy. They were in need of a project coordinator I vsited the office and the manager and another project coordinator interviewed me. We realized I was a fit for their needs.", "Interview Questions": "How much experience I had in a similar position?"}], []]