[[{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Amazing", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Feb 2023", "job_title": "Student Worker in Aliso, CA", "duration": "N/A", "pros": "Pretty chill. Most of the jobs are pretty chill.", "cons": "Could be a lot of work at times."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A really good place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Jan 2023", "job_title": "Working Student in Aliso, CA", "duration": "N/A", "pros": "Creativity is enhanced. You can approach supervisors easily", "cons": "A really small environment, so you don't expose to so many people"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "4 Oct 2022", "job_title": "Research Assistant in Aliso Viejo, CA", "duration": "N/A", "pros": "Soka is beautiful to work at, and people care about each other. The community is tight-knit and you will feel like you have an impact.", "cons": "Sometimes too many positions are combined, resulting in overwork for some jobs. Some people do very little while others carry the institution on their backs."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great job", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Oct 2022", "job_title": "Undergraduate Research Assistant in Aliso Viejo, CA", "duration": "N/A", "pros": "Flexible, self-guided, interesting project/work, great experience", "cons": "Depends on the professor you work for"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Strange environment", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Nov 2021", "job_title": "Lecturer in Aliso Viejo, CA", "duration": "N/A", "pros": "Pay and benefits are competitive. \n\nThe director of my department acts strict, but it's all a show. After a while, nobody really checks up on you.", "cons": "It takes the worst elements of a Japanese hierarchical organization, and combines them with a cult of personality. Upper admin are all conservative Japanese men who require you to make curricula that adhere to the Japanese definition of a \"good education.\" This means that all the needs analysis data and research based arguments for my curriculum went out the window, in favor of having the students engage in rote memorization and busy work, to take arbitrarily-made paper exams.\n\nTributes to the school's founder, a Japanese billionaire and cult leader, are everywhere. The students all claim they admire him deeply, and your coworkers will agree. Faculty/staff events (such as reading circles) revolve around reading the founder's books.\n\nThe school officially pushes its image of a \"secular institution\", except the organization they are distancing themselves from is the school's major financier, and leaders of that same organization are the decision-makers on campus. \n\nThe students are almost all from the organization's feeder schools, starting from kindergarten, all the way up from university. It's really sad to see."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great job to work during school", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "20 May 2022", "job_title": "Mail Clerk in Aliso Viejo, CA", "duration": "N/A", "pros": "Very flexible with schedule (as a student worker). Very fun. They are so nice, caring, and genuine people.", "cons": "More physically taxing than other on-campus jobs."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Soka University of America", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "7 Apr 2022", "job_title": "Admission Assistant in Aliso Viejo, CA", "duration": "N/A", "pros": "Great place to work\r\nProfessional development\r\nUniversity has great values", "cons": "Nothing to complain about the working experience."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Soka RAship", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Apr 2022", "job_title": "Research Assistant in Aliso Viejo, CA", "duration": "N/A", "pros": "Flexible, great pay, oppoturnity for grwoth", "cons": "Limited hours, limited slots, laid back"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Good experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Feb 2022", "job_title": "Student Research Assistant in Aliso Viejo, CA", "duration": "N/A", "pros": "- gain experience with data cleaning and organization", "cons": "- sometimes overwhelming when balancing with school work"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Excellent but no room for career growth.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "11 Jan 2022", "job_title": "Student Affairs in Aliso Viejo, CA", "duration": "N/A", "pros": "Great benefits-no cost health insurance", "cons": "Too small for any development or career growth"}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "great place", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Dec 2021", "job_title": "Student Library Assistant in Aliso Viejo, CA", "duration": "N/A", "pros": "nice people easy job. understanding.", "cons": "not too much. very nice."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great Education", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Sept 2021", "job_title": "Assistant Director Graduate Admissions in Aliso Viejo, CA", "duration": "N/A", "pros": "This is a beautiful campus that is International and inclusive", "cons": "Very new campus with employees that do not have diverse experience"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Amazing Place to Work!", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "22 Dec 2020", "job_title": "Manager in Aliso Viejo, CA", "duration": "N/A", "pros": "Mission driven organization where employees really care about one another and the students", "cons": "Too small for career growth opportunities"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great Liberal Arts University", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Dec 2020", "job_title": "Research Assistant in Aliso Viejo, CA", "duration": "N/A", "pros": "- form close relationships with students and professors\r\n-naturally beautiful setting", "cons": "-located in a small, suburban city with little to do"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Oct 2010", "job_title": " in Aliso Viejo, CA", "duration": "N/A", "pros": "Soka University has a stunningly beautiful campus and has a wonderful culture of caring for the individual.  It's really a joy to work here because of the people who work here and the students who attend this campus from 23 states and over 40 countries.  The benefits are very good and the university has not laid off any employees during the difficult economy we've experienced the last few years.  The Soka Bistro is a great place to have  lunch and the cost for all you can eat is just $5.25 for employees.  We also have free parking, free access to most events on campus -- and free tuition for our children if they are admitted.", "cons": "Because Soka University is a private, non-profit liberal arts college, salaries are comparable to similar colleges -- but cannot compete with corporate salaries. It's also hard to get to know all of the students because our office is not in the academic core."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "High faculty turnover due to a subculture of a Soka Gakkai religious elite; a sectarian college", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Jun 2012", "job_title": "Professor/Faculty in Aliso Viejo, CA", "duration": "N/A", "pros": "Students are quite focused on learning and not distracted by either intercollegiate sports or binge drinking. Facilities are quite new. Soka Bistro's food is excellent.", "cons": "Non-Soka Gakkai (SGI) believers are shut out of believers' meetings where the most important decisions are made behind closed doors; it's sort of like a small theocracy or communist party ruled regime. University President more likely to eulogize SGI Great Leader Ikeda than to discuss issues of academic significance. Curriculum is very rigid with fewer electives for students to choose from. Students are required to live in on-campus dorms all 4 years: infantilization. A large proportion of students come from feeder SGI high schools, many in Japan; certain ideas such as doubts about the SGI doctrine are verboten."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Fair Job/Nice Staff", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Feb 2020", "job_title": "Tour Guide in Aliso Viejo, CA", "duration": "N/A", "pros": "My bosses have always been friendly, and the people I work with are easy to get along with. So far, I have enjoyed giving tours to people, as there is a wide range of people to see. I also work reception, so that's a job that's fairly easy, and it helps me learn more about the campus I work on. The people that trained me explained things easily so I could understand what they expect from me, rather than me having to guess at what I'm supposed to do. It seems like the atmosphere here is not too strict since people like to converse while in the office, which is nice because then it ensures that things don't feel too formal or stuffy. It's easy to ask for help and go up to others to say hi. For what I do, the pay is fair.", "cons": "Sometimes days can be a little slow when it comes to tours, but I'm always around people that have tasks and are willing to help!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A school that practices what it preaches", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Feb 2020", "job_title": "Tour Guide in Aliso Viejo, CA", "duration": "N/A", "pros": "I am currently a student in Soka University of America's MA program in Educational Leadership and Societal Change; students in this program work to develop the skills they will need to overcome the challenges facing society in the 21st century.  At the same time, I work for the school's Community Relations office as a student tour guide.  My experience working for the school has shown me that the professional work environment at this school is as exceptional as the quality of its academics.\r\n\r\nThe word 'Soka' means value-creation in Japanese, and every aspect of this schools design and day-to-day operations are meant to create value in the lives of its students, staff, and faculty.  At Soka, students can work at almost all campus departments except security and facilities.  This provides plenty of opportunity for students to gain experience and supplement their already generous financial aid.  Soka goes to great lengths to ensure that every student is able to obtain a world-class education, and in fact, students whose families earn less than $60,000 per year have their tuition waived.  Because the school is very small—with just over 450 undergraduates—the campus community is tight-knit.  Students get to know their professors very well over the four years they spend here, which is great when it comes time to apply for internships, jobs, or graduate school.  Classes are small as well, with usually just 12 students in any given class section, and are typically arranged so that instruction occurs along the lines of a Socratic seminar, in which students and teacher all participate together in classroom discussion.\r\n\r\nStudents at Soka are always encouraged to be active participants in the process of learning, and to take charge of their scholarly and personal lives.  In terms of residential life, the residence halls are well-equipped (free laundry!) and students never have to share their room with more than one other person—incoming first-year students live in double rooms with a private bathroom, while returning students live in suites with two private bedrooms and a bathroom per suite.  Meals are included in room and board, which helps put all students on an equal footing.  There's also a shuttle service that takes students to the Aliso Viejo town center and nearby locations on the half hour.\r\n\r\nOverall, I can wholeheartedly recommend Soka University of America as a school that has devoted all its resources toward realizing its mission statement, which is \"to foster a steady stream of global citizens omitted to living a contributive life.\"  At many other schools, the mission might just be an abstract ideal not palpable in the daily routine, but at Soka, every member of the campus community works to make this mission a reality.", "cons": "The city in which Soka University of America is located, Aliso Viejo, California, is a rather quiet and suburban area, which means that there is relatively little to do off-campus within a close distance to the school.  Although there is a shuttle service, going to places such as Los Angeles requires a car or the use of public transportation, the latter of which is a bit inconvenient in Southern California.  Luckily there's a lot of fun activities to do on-campus, such as student clubs and organizations, as well as service projects.  Still, because Soka is such a small school, it can sometimes feel a bit boring or isolated, especially during break periods and holidays, when some students travel or visit home.\r\n\r\nAlthough the school's small size makes it easy for student voices to be heard, sometimes, there simply aren't enough students facing a certain challenge or situation for there to be a 'critical mass' which means that sometimes, specific and unusual circumstances may take a little while to be addressed.  Moreover, depending on the concentration a student is trying to pursue at Soka, they may find some of the class offerings a bit restrictive.  This is being addressed in part by the new Life Sciences concentration that opens Fall 2020.\r\n\r\nStill, despite a few drawbacks, it's clear that Soka makes every effort to address the needs of its students as promptly as possible.  Again, at least for me, working for Soka as a student employee has been an invaluable experience that would not have been possible anywhere else."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A great new university and a great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "12 Sept 2012", "job_title": "Anonymous Employee in Aliso Viejo, CA", "duration": "N/A", "pros": "Soka University staff and faculty receive great benefits (full medical,dental and vision coverage for yourself and dependents), contributions to a retirement plan and free use of recreation and fitness facilities...along with free parking and a 50% discount at the dining hall.  The college is in a beautiful location about one mile from the Pacific Ocean (if you're a bird. 7 miles by car.)", "cons": "It's a small college (450 students) so there aren't a lot of career pathways.  Some offices have no where to \"grow\"."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Soka Performing Arts Center - Student Employment", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "2 Jun 2018", "job_title": "Performing Arts Center, Student Employee in Aliso Viejo, CA", "duration": "N/A", "pros": "The culture of care is prominent amongst employees and departments at the Soka Performing Arts Center. It is absolutely the best on-campus employer in terms of practical work experiences and opportunities to grow and build your resume. It has definitely been an unbeatable experience.", "cons": "I suppose it is more demanding in terms of commitment than other on-campus jobs, however, management is very flexible and understanding of students' other responsibilities."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "IT Student Administrative Assistant", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Jul 2015", "job_title": "IT Student Administrative Assistant in Aliso Viejo, CA", "duration": "N/A", "pros": "Friendly, dynamic, and diverse working environment with great opportunities to work both individually and as a member of a team in an administrative office setting.", "cons": "Relatively new office environment with a constantly changing administrative system. Great for people who look to be part of establishing a workflow system, not for those wanting something concrete."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good way to earn as a student", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Jun 2020", "job_title": "Box Office Associate in Aliso Viejo, CA", "duration": "N/A", "pros": "There's a variety of different jobs you can apply to as a student so you can find a job that matches your interest.", "cons": "Lots of students have jobs so unless you apply early on in the year/semester, you might not have lots of options."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A supporting environment", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Oct 2016", "job_title": "Student Affairs in Aliso Viejo, CA", "duration": "N/A", "pros": "Caring, supportive colleagues. Multi-task job so it won't be easily boring.The School's mission on peach and human rights is especially meaningful", "cons": "Some training is not necessary and long"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Assistant Director of Student Programs", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Oct 2015", "job_title": "Assistant Director of Student Programs in Aliso Viejo, CA", "duration": "N/A", "pros": "Small and less bureaucracy to navigate when needing to execute department initiatives.", "cons": "Very little room to advance."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Director, Special Projects", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "2 Feb 2018", "job_title": "Director in Aliso Viejo, CA", "duration": "N/A", "pros": "Great mission, community, and support.", "cons": "Because it is small, sometimes certain positions are limited in long term advancement and the place is so wonderful, it's hard to leave."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": "N/A", "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Residential Assistant and Writing Center Assistant", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Mar 2017", "job_title": "Anonymous Employee in Aliso Viejo, CA", "duration": "N/A", "pros": "Improve in program management.\r\nEnhance my leadership skills.\r\nExpand my communication skills.", "cons": "Time spent on organizing programs can be used for other extracurricular activities or academics."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great Place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "6 Dec 2019", "job_title": "Marketing Assistant in Aliso, CA", "duration": "N/A", "pros": "The location is nice and weather is good for most part", "cons": "Limited growth and really repetitive"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Student Worker", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Sept 2018", "job_title": "Research Assistant in Aliso Viejo, CA", "duration": "N/A", "pros": "Respectful of student schedule\r\nFocused on helping the student grow", "cons": "Sometimes conflicts with class schedule"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Graduate Research Assistant", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "31 Aug 2017", "job_title": "Graduate Research Assistant in Aliso Viejo, CA", "duration": "N/A", "pros": "Easy to communicate with superiors.", "cons": "Nothing major to complain about."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "x", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Jul 2020", "job_title": "Research Assistant in Aliso Viejo, CA", "duration": "N/A", "pros": "Great working environment at the workplace", "cons": "Nothing that is significant to me"}]]