[[{"date": "7 Dec 2022", "title": "Chaplain Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Saint Joseph Health System (Mishawaka, IN) in Aug 2021", "Interview Descriptions": "Pre-interview by phone. The In-person interview with the director and staff was warm and respectful. The director walked me to the parking lot. I felt support from the other chaplains and never felt bad vibes from anyone.", "Interview Questions": "They asked about my call to chaplaincy."}, {"date": "16 Dec 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Saint Joseph Health System (Bloomington, IL) in Nov 2020", "Interview Descriptions": "During my job interview , I was very confident in my self as well as the process to becoming an employee for saint joseph hospital. It was awsome to have been recognized and hired to a wonderful team.", "Interview Questions": "How would I handle certain situatiuons."}, {"date": "20 Aug 2020", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Saint Joseph Health System (Santa Rosa, CA) in Aug 2020", "Interview Descriptions": "Began with an on-demand interview with 4 attempts to answer, 3 minutes per question with 6 questions total. The  hiring processed moved quickly as i was contacted for a second interview 3 days later as well as a reference check", "Interview Questions": "Why did you become an RN?"}, {"date": "7 Sept 2019", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Saint Joseph Health System", "Interview Descriptions": "Tough. Very confusing- went from HR over to the hospital for a second interview after the first. Then it was an hour long interview on the floor- people kept walking in and out of the directors office in the middle of the interview. Pretty unprofessional.", "Interview Questions": "Why saint joes?"}, {"date": "31 Jul 2020", "title": "Nuclear Medicine Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Saint Joseph Health System in Apr 2018", "Interview Descriptions": "The process was fairly straight forward. Called for an interview, interview took about an hour. Met with department manager who asked standard interview questions - nothing too tricky. Met with lead tech of the department who was able to get a feel for who I was and ask whatever questions they wanted.", "Interview Questions": "Discuss a time that you had to deal with a difficult patient?"}, {"date": "9 May 2019", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Saint Joseph Health System (Mishawaka, IN) in Apr 2018", "Interview Descriptions": "They usually start you off on line.  They want you to apply on line.  Once that’s done, someone in HR reviews your qualifications.  If you get past that, then you go to local manager and there they might do a team interview or one-on-one.", "Interview Questions": "Why did you apply for this position?\r\nTell me /us about yourself.\r\nTell us about a situation where you ......."}, {"date": "4 Aug 2019", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Saint Joseph Health System (Mishawaka, IN) in Mar 2018", "Interview Descriptions": "There is an online application, and if your application fits all requirements, they will ask to do an in person interview at Saint Joseph's Regional Medical Center in front of an interview panel.", "Interview Questions": "When is a time you went above and beyond for a patient?"}, {"date": "19 Aug 2017", "title": "Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Saint Joseph Health System in Jun 2017", "Interview Descriptions": "The interview questions are the basic interview questions and your qualifications.  If you do a simple google search for sample questions, those are the ones they will be asking.", "Interview Questions": "Give me an example of how you handled a stressful situation."}, {"date": "23 Jul 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Saint Joseph Health System (Mishawaka, IN)", "Interview Descriptions": "Started with phone interview x2\r\nThen I was brought in to talk with potential leaders\r\nIt was a low pressure interview as they are having problems finding nurses in the community\r\nI met with various porential supervisors and managers\r\nThey had a pretty thorough process - similar to most.\r\nDrug screening and phtysical was necessary", "Interview Questions": "1. Why here?\r\n2. Tell us strengths\r\n3. Tell us weaknesses\r\n4. Describe yourself\r\n5. Are you easy to get along with?"}, {"date": "15 Aug 2016", "title": "Staff RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Saint Joseph Health System (South Bend, IN) in Apr 2016", "Interview Descriptions": "I interviewed during my internship of my senior year of nursing school.  I spent over 136 hours in the department and spoke with the manager and other staff RN's on numerous occasions. I had one multiperson interview with the manager and one single interview with the hiring manager of the department.", "Interview Questions": "Was given different scenarios regarding patients and how would I handle them?\r\nDescribe myself.\r\nHow would others describe me?"}], [{"date": "1 Sept 2015", "title": "Staff RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Saint Joseph Health System (Norville, MO) in Jul 2015", "Interview Descriptions": "I came in 3 hs earlier, they anted to interview me.\r\nI reminded them that my interview was scheduled at 5pm\r\nI would like to allow you to prepare for the interview.\r\nAt the time of interview, They came up with written questions for the interview.", "Interview Questions": "what was your experience as a manager?\r\nGive an example why did you not like you job?\r\nWhat did you do when employees are in conflicts?"}, {"date": "5 Oct 2015", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Saint Joseph Health System (Mishawaka, IN) in Oct 2013", "Interview Descriptions": "Quick - 1 interview with hiring supervisor.  It was quick to get the interview but took 3 weeks to make job offer.  Not unusually  bad, I suppose.  I didn't get any updates - just a call with the job offer.  It was quicker than I expected.", "Interview Questions": "Typical:  Why here?  Tell us strengths, weaknesses.  What do you bring to the table.\r\nThey were standard questions by the hiring supervisor."}, {"date": "8 Jun 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Saint Joseph Health System (Mishawaka, IN) in May 2012", "Interview Descriptions": "First phone, then one-on-one. They started with someone from HR.  Then I was invited onto the campus.  There I interviewed with small teams - mostly HR people but some nurses.  They showed me around the building - nice, new facility.  I was impressed by the building - but a building does not make a good hospital.  You can have an average, old facility but it can be a place of great healthcare.\r\nI can tell you now, that place is not great.\r\nThey made me an offer and stated that it's a take it or leave it ..... so I took it.", "Interview Questions": "1. Why do you want to work here?\r\n2. Tell us your strengths\r\n3. Your weaknesses\r\n4. Tell us about a time when you had a run in with a patient?\r\n5. Why should we hire you?"}, {"date": "17 Apr 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Saint Joseph Health System (Mishawaka, IN) in May 2009", "Interview Descriptions": "More than 10 years ago - face-to-face", "Interview Questions": "Tell me about yourself"}]]