[[{"date": "12 Mar 2023", "title": "Medical Scribe Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Erlanger", "Interview Descriptions": "it was a great place and they were kind and friendly. good work environment to start off. lots of great providers to work with and want you to succeed. the managers were nice and helpful", "Interview Questions": "Why do you want to work here?"}, {"date": "18 Jun 2022", "title": "Supply Chain Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Erlanger (Chattanooga, TN)", "Interview Descriptions": "At that time they were looking for a good organizational fit. How you would work with the existing team.  Process knowledge as it relates to the position. Clear understanding that you are there for the patients and how your job affects patient outcomes.", "Interview Questions": "Why should they hire you?"}, {"date": "11 Mar 2022", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Erlanger", "Interview Descriptions": "Long but we’ll worth it. Takes almost a month to start working. There are a lot of steps to get hired on as well as a physical and drug screen.", "Interview Questions": "Do you know how to use epic? "}, {"date": "19 Apr 2022", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Erlanger (Albany, GA) in Feb 2022", "Interview Descriptions": "Concise and straight forward. Inviting and down to earth manga requiring managers. The interviewer where  Knowledgeable about Erlanger history and pointed out great benefits concerning the hospital, the programs and development they offer, the extension and progress of the smaller surrounding Erlanger  facilities, as well as some great aspects about living and working in Chattanooga.", "Interview Questions": "Why do you want to become a part of Erlanger "}, {"date": "28 Mar 2023", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Erlanger in Jan 2022", "Interview Descriptions": "In-person interview, hiring process took about a month. The hiring manager asked about my medical knowledge, how i handle difficult situations etc, The online portion is fairly easy and they have no problem answering questions.", "Interview Questions": "Erlanger is know for quick stroke response team and procedures, are you familiar with STEMI and NSTEMI?"}, {"date": "15 Jun 2022", "title": "New Grad Nurse Residency Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Erlanger (Chattanooga, TN) in Nov 2021", "Interview Descriptions": "Zoom call, with multiple department heads, walking through the whole process, job offer, expectations. They asked about my personal experiences during clinical, what I liked and didn’t like. My expectations going into it. They made it a very safe, comfortable environment.", "Interview Questions": "What did you when you encountered a difficult patient? "}, {"date": "4 Nov 2022", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Erlanger (Chattanooga, TN) in Sept 2021", "Interview Descriptions": "The process is somewhat slow in hearing back, but the interview was thorough and relaxed and I felt like they were invested in their staff. It's a big hospital system so expect the process to take longer", "Interview Questions": "How soon do you think charts should be completed?"}, {"date": "15 Jul 2021", "title": "Auditor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Erlanger", "Interview Descriptions": "Brought in for group interview with Manager and lead nurse.  Others were present during the interview within hearing distance.  Overall though good interview experience.  Good communication prior to hire,  as well.", "Interview Questions": "Why did I think I would be a good fit?"}, {"date": "10 May 2021", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Erlanger (Chattanooga, TN) in May 2021", "Interview Descriptions": "Basic interview question about past work experience. Questions about how you would react in certain situations. How have you resolved a stressful situation in the past. Why you would be a good fit for the job.", "Interview Questions": "Basic interview questions about pat work "}, {"date": "31 Dec 2021", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Erlanger (Murphy, NC) in Jul 2020", "Interview Descriptions": "Initial Phone screening was completed, then a face to face. Job descriptions and responsibilities are adjusted as needed. No structure or procedures in place, every day is a surprise as to what you are told or needed to do.", "Interview Questions": "Are you willing to work additional hours as needed? "}], [{"date": "22 Jan 2020", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Erlanger", "Interview Descriptions": "Interview process was quick (about thirty minutes) and easy (with about five to six questions). Interviewed with both day and night managers. Only had to complete one interview before they sent over an offer.", "Interview Questions": "Describe a time you were challenged in the workplace and how did you overcome this challenge "}, {"date": "3 Jul 2019", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Erlanger (Chattanooga, TN)", "Interview Descriptions": "I got a call back within a few days and the interview lasted maybe 10 minutes. I wasn’t asked any typical interview questions. She basically asked when I could start and that was it. I think they were pretty desperate to get people in and they have very high turn over here.", "Interview Questions": "When can you start?"}, {"date": "6 Nov 2018", "title": "Trauma Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Erlanger (Chattanooga, TN)", "Interview Descriptions": "A group panel which included the Trauma Program Manager and two Trauma Registrars. They all took turns asking questions. It was a laid-back interview. Pretty straightforward questions. It was a smooth process.", "Interview Questions": "My background; experience with coding; why should we hire you? Self-motivator?"}, {"date": "4 Jul 2018", "title": "Med Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Erlanger (Harrison, TN)", "Interview Descriptions": "Interviewed with floor manager.  She showed me around the floor and introduced me to one of the techs.  I spent some time with the tech before coming back to the manager.", "Interview Questions": "Do you know what you’ll be doing as a tech?"}, {"date": "28 Aug 2018", "title": "Patient Care Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Erlanger (Chattanooga, TN) in Jul 2018", "Interview Descriptions": "This was a very comfortable interview process. It consisted of a group of people from different units of the hospital conducting the interview at one time, which provided for a quick and efficient interview process.", "Interview Questions": "What contributions can you bring to our unit?"}, {"date": "26 Jun 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Erlanger (Chattanooga, TN)", "Interview Descriptions": "3 person interview. Relaxed and not stressful. Easy efficient process. Had offer in about 1 week from date of interview. Interviewed in 2 units. Had pick of both offers. Cross training provided in 2nd unit.", "Interview Questions": "How did you handle a difficult situation?"}, {"date": "25 Oct 2017", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 8 weeks. I interviewed at Erlanger in Oct 2017", "Interview Descriptions": "Very negative experience. It was not a proper interview. I was very positive and professional and the manager acted as if they did not want to be there. Every positive thing I said was turned around on me as a negative. I could not even fully explain who I was. I was cut off several times and did not get a chance to talk. The manager spoke and did not want to hear what I had to say. The manager would not even shake my hand or accept my portfolio.  I felt as if I where being discriminated against. I was not given a fair chance even though it is a learning hospital. It was very unprofessional. I felt as if i where being called to the meeting just to be treated poorly. The person was extremely rude and unprofessional it was improper. The person also made comments on my age and marital status I can not believe this person is representing erlanger. WORST INTERVIEW EVER!", "Interview Questions": "there where no proper questions however i was asked about my expierience"}, {"date": "31 Oct 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Erlanger (Chattanooga, TN) in Mar 2017", "Interview Descriptions": "A panel interview lasting 30 min with several managers from different floors, they are questions and I answered.  Everyone was pretty laid back, the interview went quickly.   I brought my references and resume, and my grades because I was a new grad.", "Interview Questions": "When was a time you were challenged?"}, {"date": "21 Jul 2017", "title": "ER Tech Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Erlanger (Chattanooga, TN) in Nov 2016", "Interview Descriptions": "Applied in November got email to come in for interview. After one month with background check and reference check i started in jan 2017 the interview procesa is easy the hiring process is way slow", "Interview Questions": "Why do you want to work at erlanger"}, {"date": "16 Feb 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Erlanger (Chattanooga, TN) in Apr 2016", "Interview Descriptions": "easy, great nurse recruiter who worked with me from start to finish.  human resources provided answer to my questions and helped with the process to move from another state to take this job.", "Interview Questions": "experience"}], [{"date": "20 Sept 2015", "title": "Recruiting Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Erlanger (Chattanooga, TN) in Aug 2015", "Interview Descriptions": "Interview was scheduled and held same day.  It went so well I thought I had job which I desperately wanted and needed.   No follow up until six weeks later when I was told they hired internally.  When I asked for feedback, I was told to work up the ranks at Walmart and I have a graduate degree.  Job I applied for didn't require a bachelors.", "Interview Questions": "Why did I leave my last job?  What happened at my last job?  It was more of a polite conversation, like chit chat."}, {"date": "27 May 2015", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Erlanger (Chattanooga, TN)", "Interview Descriptions": "Pretty easy and straight forward, Typical hospital questions. Basic questions on how you would handle things that arise in the hospital. Also questions about your skills and experiences. Asked if I were comfortable doing certain tasks.", "Interview Questions": "How would you handle a situation where a patient or family was angry about the care given"}, {"date": "20 Sept 2015", "title": "Social Media Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Erlanger (Chattanooga, TN) in Apr 2015", "Interview Descriptions": "Everyone was delightful.  I received phone calls to set up a phone interview.  From there it was in person with people in marketing, the recruiter, and the big boss.  Lunch was included and gas and daycare fees were reimbursed.  They come across as a great group of people.", "Interview Questions": "The last question was along the lines of....as I walk to my car, what&#039;s the one thing you can tell me to stay in my mind that will convince me you are the one for this job."}, {"date": "6 Aug 2016", "title": "FMLA Coordinator/Human Resources Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Erlanger (Chattanooga, TN) in Dec 2014", "Interview Descriptions": "Interviewed with HR Director concerning new position within Erlanger Health System. My former position as Administrative Assistant at outlying facility of Erlanger was eliminated. I was selected to fill the position of FMLA Coordinator which was an open position in HR.", "Interview Questions": "What I considered my strengths and weaknesses to be."}, {"date": "26 Aug 2015", "title": "Secretary Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Erlanger (Chattanooga, TN) in Dec 2011", "Interview Descriptions": "There is no consistency across departments. Each one chooses how to handle hiring and most do not follow up with applicants. It may be months or even a year or more before you hear back from anyone if you do at all.", "Interview Questions": "Whether I wanted to replace the furniture in the office because that department was the &#034;moneymaker&#034; and if I was hired I could order anything I wanted."}]]