[[{"date": "26 Apr 2023", "title": "Lead Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's National Hospital", "Interview Descriptions": "3 round interview process that culminates with a long negotiation with HR. Make sure to challenge HR with their initial offer as they will inevitably low-ball you to begin. HR team seems to be very resistant to changing.", "Interview Questions": "Where do you want to see yourself at the organization in 5 years?"}, {"date": "21 Apr 2023", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Children's National Hospital (Washington, DC)", "Interview Descriptions": "The interview was very quick and easy going. I was hired on the spot. It lasted 30 minutes in total and the questions were asking about my background as far as what I have done in previous positions.", "Interview Questions": "Tell me about yourself? What courses have you taken to give you knowledge on credentialing?"}, {"date": "19 Mar 2023", "title": "Call Center Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Children's National Hospital", "Interview Descriptions": "Easy, will ask pretty standard interview questions. Typical questions such as why should we choose you? What is your idea of great customer service? Situational questions what if you saw a coworker doing something that is not ideal what would you do?", "Interview Questions": "Describe your personality and what makes you a great fit for the role?"}, {"date": "10 Mar 2023", "title": "Clinical Operations Team Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's National Hospital", "Interview Descriptions": "Two total interviews over zoom in which the hiring manager was very transparent and helpful. She kept me in the loop every step of the way and answered every one of my questions.", "Interview Questions": "What experience do you have with organizing faxes?"}, {"date": "5 Apr 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's National Hospital (Rockville, MD) in Mar 2023", "Interview Descriptions": "The interview was a brief structured interview administered by two lab coordinators (approximately 30 minutes). The interviewers were very nice and welcoming. Moreover, I heard back fairly soon from them. When applying, I believe I received a Zoom interview with them two weeks later, and upon finishing the interview with them, I heard back from them within a week.", "Interview Questions": "Why Children's National? What are you expecting to get out of the position? How will your prior experiences help you?"}, {"date": "4 Mar 2023", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's National Hospital in Feb 2023", "Interview Descriptions": "got a email from recruitment that i have zoom interview with the hiring manager cause i passed the test that they give in order to proceed to the next step", "Interview Questions": "how long were you a cna?"}, {"date": "1 Nov 2022", "title": "Patient Experience Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's National Hospital", "Interview Descriptions": "There were multiple panel interviews over several months. Unfortunately, there was very little follow up and communication from hiring manager and recruiter and a few miscommunications from the scheduler on timing. All the folks interviewed were extremely giving of their time and asked in depth questions. They took a genuine interest in my background.", "Interview Questions": "How would you work with other departments? how would you improve performance?"}, {"date": "20 Sept 2022", "title": "Medical Scribe Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's National Hospital", "Interview Descriptions": "On site hospital interview. Was also given a tour of the hospital and different units at the hospital. \nInterview questions were the basic questions…past experiences, behavior questions and so forth ", "Interview Questions": "Why do you want to work here? "}, {"date": "1 Sept 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's National Hospital", "Interview Descriptions": "Múltiple Interviews and shadowed, grateful to have seen the floor prior however a lot of staff left from my interview to start date.  Not sure why so many staff have left", "Interview Questions": "A time that you had a disagreement and how you addressed it "}, {"date": "31 Aug 2022", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's National Hospital", "Interview Descriptions": "I had a 2 round interview - one with the Principal Investigator and one with the business manager who was then acting as the interim research manager. It was largely standard with questions on my experience and interest in the topics of study. Both interviewers were incredibly warm and wanted to make sure there was a culture fit for the team as well.", "Interview Questions": "What is one word that your coworkers would use to describe you?"}], [{"date": "25 Jul 2022", "title": "Practice Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Children's National Hospital", "Interview Descriptions": "This has honestly been one of the most unorganized interview processes I've ever dealt with. The recruiter (who has been amazing) reached out to me on May 9th for the initial interview, then my next interview was with the person that is currently in the role, which was about 2 weeks later. Then  I was supposed to receive a follow up a week later and I didn't until June 7th saying that the recruiter had PTO then some health issues. Then I had a panel interview on June 14th, where  I then found out the hiring manager was not available for the panel interview. So I then had to do a separate interview on June 22 to accommodate the hiring manager.  And still to this day I haven't received an update and its July 25th. Again the recruiter has been very responsive but she doesn't have any additional information because the hiring manager and team didn't have anything.  I was told that the next round of interviews would be starting the second week of July. I asked was I still in the running and I was told yes, but still nothing at all. Just ghosted for no reason at all. This is beyond unprofessional and it makes me not even want to work for a company that treats candidates like this. Communication is key and there was and still currently is none. I am moving on to another company that values it's candidates.", "Interview Questions": "Where do you see yourself in 5 years? \nWhat type of leader are you?\nHow do you deal with conflict in the workplace? "}, {"date": "23 Jun 2022", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Children's National Hospital", "Interview Descriptions": "It went well, the usual questions were asked.\nBe prepared to share examples of your work and thought process. \nLots of opportunities to ask questions. \nUnclear on a lot of processes. \nThere is nothing else to share.", "Interview Questions": "When was a time you had to multi-task?"}, {"date": "13 May 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's National Hospital", "Interview Descriptions": "The interview process wasn't long. After application submission, I scheduled multiple interviews. The interviews were spread out over a few days depending on availability. After multiple interviews with people in the lab a decision was emailed.", "Interview Questions": "Mainly asked about research interests and experience and how it could apply to the lab."}, {"date": "11 May 2022", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's National Hospital", "Interview Descriptions": "The meetings were organized and thorough. I met with several people including HR and the manager of the department.  They asked good questions and made me feel comfortable throughout.   It seemed like they cared about me.", "Interview Questions": "They asked about my nursing experience in the department and what I did well."}, {"date": "12 Jun 2023", "title": "Senior Grants and Finance Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's National Hospital (Washington, DC) in Apr 2022", "Interview Descriptions": "Pretty easy and relaxed interview experience. Not too many stages. Just a couple of panel interview rounds. The questions were very fair as well. After the interview, it took them a day or two to extend an offer.", "Interview Questions": "Related to your job duties and general questions."}, {"date": "11 Apr 2022", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's National Hospital (Washington, DC) in Apr 2022", "Interview Descriptions": "Received a phone call and email for an interview shortly after applying (maybe a week or so). Was interviewed by two RAs and a coordinator. A week later was contacted for a second interview with the program manager (which I had the next day) and right after the second interview, was sent a survey via email that included a few more questions that I had to complete by the end of the day. Exactly one week later received my offer. Both interviews were very conversational and behavior-based. Interviewers mainly asked me follow-up questions based on things I said rather than having very specific pre-planned questions. Everyone was incredibly friendly. The survey was a mix of behavior-based questions, research-related,  and a few \"what would you do in this situation?\"", "Interview Questions": "Tell me about yourself\r\nHow do you stay organized\r\nWhat is your three-year plan\r\nHow would people in your life describe you\r\nIRB related questions (in the survey)\r\n"}, {"date": "21 Mar 2022", "title": "Sr. Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's National Hospital", "Interview Descriptions": "Answered a few preliminary questions in the screening process. Then had a group interview.  It was standard questions based on the work.  It didn’t feel intimidating at all. I’ve never had a group interview before", "Interview Questions": "How do you describe contract modeling. "}, {"date": "5 Apr 2022", "title": "Emergency Medical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 3 months. I interviewed at Children's National Hospital (Washington, DC) in Mar 2022", "Interview Descriptions": "I was screened over the phone before my in person interview with the nurse manager. I was asked standard questions and was allowed to shadow in the emergency department. Everyone was very friendly and nice!", "Interview Questions": "What are your strengths and weaknesses"}, {"date": "17 Feb 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Children's National Hospital (North Kensington, MD)", "Interview Descriptions": "The process of the interview was good, they explained what their company do, what they offer and at the end they asked me if I was ready for the second interview.", "Interview Questions": "They asked me about myself "}, {"date": "13 Jan 2022", "title": "Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's National Hospital", "Interview Descriptions": "1) Phone screen from hiring manager - interviewer was not very personable, standard questions, describe experience, some behavioral questions\n2) Virtual video interview with multiple interviewers- about 3 interviewers, standard questions, not very structured", "Interview Questions": "standard questions, describe experience, some behavioral questions, etc"}], [{"date": "10 Feb 2022", "title": "NICU RN II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Children's National Hospital (Washington, DC) in Jan 2022", "Interview Descriptions": "Zoom interview. Took about 75 minutes. Normal interview questions asked. Orientation was explained to me. Overall good experience. Did not like how everyone is considered a rotating nurse, this is a big thing to consider", "Interview Questions": "Tell me about yourself and your experience? "}, {"date": "8 Dec 2021", "title": "LAUNCH Nurse Trainee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Children's National Hospital", "Interview Descriptions": "Only one recorded video interview with a nurse recruiter.  The recording was shared with the rest of the team.  A week later I was contacted by the same person and was offered the position.", "Interview Questions": "Why do you want to work for Children's National Hospital?\nDescribe a time you encountered conflict in the workplace and how did you resolve it?"}, {"date": "12 Dec 2021", "title": "Clinical Risk Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Children's National Hospital (Washington, DC) in Nov 2021", "Interview Descriptions": "I received a direct call from the department manager, who set up my interview. Interviewed via zoom with the whole department (8-10 people) for one hour and then had a one on one with the department chief. Good interview experience, but got completely ghosted after despite sending follow up emails.", "Interview Questions": "Why should we hire you for this job? "}, {"date": "4 Oct 2021", "title": "Research Tech II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's National Hospital", "Interview Descriptions": "Warm, inviting staff. The lab team was very thorough and clear about expectations. Lots of structure and communication as well. Admin and HR were pleasant too. would definitely recommend working there. Great experience overall.", "Interview Questions": "What is you biggest weakness?"}, {"date": "24 Oct 2021", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's National Hospital (Washington, DC) in Oct 2021", "Interview Descriptions": "The employees were very welcoming and personable. They asked various questions, didn't pressure me, and I enjoyed it. I came for an in-person interview, and had a cell phone screening call beforehand to set up the meeting.", "Interview Questions": "Three traits about you in your work space."}, {"date": "13 Sept 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Children's National Hospital (Washington, DC)", "Interview Descriptions": "Informative, kind, and fun interview process. Was able to meet the staff, get a tour, able to shadow all while having a great conversation like interview. I left feeling very understood and listened to.", "Interview Questions": "Describe yourself in 3 words as a nurse."}, {"date": "20 Jul 2021", "title": "Linen Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Children's National Hospital", "Interview Descriptions": "Easy, straight to the point interview.\nInterviewer explained general job description and day to day tasks of position.\nAsked to describe my positive and negative qualities \nAlso asked about availability towards the end of the interview.", "Interview Questions": "\nWhy do you want to work as a Linen Technician?\nHow would you resolve an issue with a coworker?"}, {"date": "10 Jul 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Children's National Hospital", "Interview Descriptions": "The interview was a bit tough but actually the best interview I've ever had. My interviewers were very patient and really listened to what I had to say. It was more of a conversation with some difficult questions but overall a great experience!", "Interview Questions": "Tell me about a time when you made a mistake"}, {"date": "7 Jul 2021", "title": "Sr. Patient Access Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's National Hospital", "Interview Descriptions": "Panel interview. It was via zoom, some questions were demeaning and it seemed as if they had better things to do than be in the interview. I was cut off when asking questions at the end of the interview. Bad vibe all around. I was grateful when the interview was over", "Interview Questions": "Describe a time you went over and beyond for a customer "}, {"date": "24 Jun 2021", "title": "Registered Nurse NICU Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Children's National Hospital (Washington, DC) in Apr 2021", "Interview Descriptions": "Fill out application, add letters of recommendations and transcript, apply early because they get too many applications. Interview is very straight forward. Team is very nice. Show your passion and focus on patient safety.", "Interview Questions": "Tell me about yourself & why NICU"}], [{"date": "24 Mar 2021", "title": "Talent Acquisition Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Children's National Hospital (Washington, DC)", "Interview Descriptions": "I was approached by a recruiter but LinkedIn, had a phone screen, then it took them over 2 weeks to get back to me for another phone screen, then another week or so where they planned panelists interviews for me. The panels were fine, but just long and exhausting as they asked the same questions over and over. I had a final interview with another panelist two Mondays ago and I didn’t hear back for over a week, so I contacted them yesterday to ask for a status update and they said I didn’t get chosen. I was really annoyed because they also didn’t give any feedback and I put a lot of effort in each interview so I thought I had it in the bag.", "Interview Questions": "Behavioral Questions- What would you do in this scenario?"}, {"date": "15 Mar 2021", "title": "Senior Data Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's National Hospital in Mar 2021", "Interview Descriptions": "Pretty standard, had a  30 minute chat about my background, reason for leaving, etc. Then had an hour long talk with other members of team about same thing.  Offer came quickly after that and they were very professional but it wasn't really what I had in mind.", "Interview Questions": "Can you talk about a time you dealt with a reluctant stakeholder?"}, {"date": "21 Jan 2022", "title": "PICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's National Hospital (Washington, DC) in Oct 2020", "Interview Descriptions": "It was a 20 minute zoom interview with 2 PICU managers and 1 experienced RN. It was a good mixture of asking questions and describing the unit. I heard back from HR within the week", "Interview Questions": "Have you ever been exposed to death before?\r\nDescribe one of the sickest patient you’ve taken care of?\r\nHave you ever made a mistake and how did you handle it?"}, {"date": "22 Sept 2020", "title": "Payroll Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's National Hospital", "Interview Descriptions": "Short phone call with supervisor  on roles and what is expected with your position there as well as past roles and what the expectations were on those positions", "Interview Questions": "How would your past role help you with this position?"}, {"date": "10 Sept 2020", "title": "Medical Technologist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Children's National Hospital", "Interview Descriptions": "Good very straightforward will give you tour and very accommodating . Hr explains well the process and very helpful.  Explains the benefits and perks well and the process of hiring", "Interview Questions": "Any expectations for working here"}, {"date": "15 Apr 2020", "title": "Physician/Pediatrician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Children's National Hospital", "Interview Descriptions": "Long, very nice people. Met several people, good tour of facilities. Lots of time to ask questions. Felt like I was interviewing them as much as they were interviewing me. Some things they said they would follow up on never got followed up.", "Interview Questions": "Why do you want this job"}, {"date": "24 Apr 2021", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's National Hospital in Mar 2020", "Interview Descriptions": "First Apply online, then a zoom interview. The interview consisted of a job description detail of benefits, then a few clinical questions. They asked my hesitations and why I wanted this position and unit in particular. Was not a hard interview, with unit manager and the educators", "Interview Questions": "- Describe one meaningful patient interaction you've had.\n- Describe a time you took part in \"team nursing\" "}, {"date": "30 Jan 2020", "title": "Government Affairs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's National Hospital", "Interview Descriptions": "The staff is friendly, but extremely hard to get in contact with. Once the four hour interview process was complete, I did not hear from them again. There was no denial of the position and no one was ever hired.", "Interview Questions": "Why are you interested in the position?"}, {"date": "22 Sept 2019", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's National Hospital", "Interview Descriptions": "Basic question, nothing too hard. Make sure to show your interest. The interviewers were very professional and seem like a great place to work. They asked about my past experience and how it relates to position currently seeking.", "Interview Questions": "Where do you see yourself in 5 years"}], [{"date": "27 Aug 2019", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's National Hospital", "Interview Descriptions": "Phone call interview, in-person interview, reference check. The in-person interview went well, and the interviewers were polite and friendly. The facility was great, and I got to emet the other people I would potentially be working with. Everything was very formal", "Interview Questions": "Why do you want this position? "}, {"date": "24 May 2019", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's National Hospital (Washington, DC) in May 2019", "Interview Descriptions": "Got a phone interview, scheduled the in person interview, got a call the following week from HR confirming my expected pay and got a offer letter the same day", "Interview Questions": "They have you take 2 assessments \r\nTyping and customer service "}, {"date": "8 Apr 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Children's National Hospital", "Interview Descriptions": "It lasted about 30 minutes. The person in the position called me and asked me questions about my resume and my interest in the position. About a week later they emailed me to offer me an in person interview.", "Interview Questions": "Q: Why are you interested in working on clinical trials?"}, {"date": "29 Jul 2021", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Children's National Hospital (Silver Spring, MD) in Mar 2019", "Interview Descriptions": "Interview process was timely and fairly easy. Arrived early and the manager was not yet in the office to interview me. Interviewed with three to four people on the team. Received an offer about ten days later, as the manager needed a replacement immediately.", "Interview Questions": "What about Children's values align with your goals?"}, {"date": "3 Feb 2019", "title": "Student Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's National Hospital", "Interview Descriptions": "Consisted of an online application, phone screening, and invitation-only on-site \"open house\".  Phone screening is done on all applicants.  Involves three questions-- why CN, what do you want to achieve this summer, describe a difficult patient interaction/what you did/what you learned from it", "Interview Questions": "What do you want to achieve this summer?"}, {"date": "15 Jan 2019", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's National Hospital in Jan 2019", "Interview Descriptions": "Filled out application online. Scheduled an interview over the phone. Completed an in person interview in the PICU with 2 nurse educators. I was asked several questions, and they also told me about the residency itself. It was conversational.", "Interview Questions": "How do you handle stress?\r\nWhat are your strengths and weaknesses?"}, {"date": "17 Dec 2018", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Children's National Hospital", "Interview Descriptions": "Group was professional and interested in my career advancement. The interviews felt more like a conversation rather than a list of questions to answer. Hiring department was quick to respond and was willing to find the best job fit for me.", "Interview Questions": "The group asked what my interests were, and how they played into the different projects at the hospital."}, {"date": "3 Aug 2022", "title": "Transplant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Children's National Hospital (Washington, DC) in Nov 2018", "Interview Descriptions": "Initially I received a phone interview with the hiring manager then we scheduled  a phone panel interview with select team members. Once that was completed I was invited onsite for an in-person panel interview with the teams.", "Interview Questions": "What about the job appeals to you?"}, {"date": "24 Apr 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's National Hospital (Washington, DC) in Apr 2018", "Interview Descriptions": "It was a 3 part interview of about half an hour each.  The interviewers all made me feel relaxed and they asked questions based on my resume.  It was an informative interview for me.", "Interview Questions": "Describe a moment you had a difficult situation and how you handled it?"}, {"date": "18 Dec 2018", "title": "Grants and Finance Administrator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Children's National Hospital (Silver Spring, MD) in Feb 2018", "Interview Descriptions": "I was referred by a former colleague to a recruiting agency. I was contacted by the recruiting agency and interviewed over the phone for roughly 30 minutes. After that, the recruiter did not reach back to me. I persisted by contacting the recruiter through email multiple times. I was then contacted again by recruiter and was set up with an in-person interview. Was offered the job.", "Interview Questions": "What is your experience with grants management?"}], [{"date": "10 Jun 2021", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's National Hospital in Dec 2017", "Interview Descriptions": "I was contacted for a phone interview,  follow by an in person interview, and then a shadow day. I was interviewed by a manager, and director. I met the whole team on my shadow day.", "Interview Questions": "Q: How do you work under pressure? "}, {"date": "2 Jan 2018", "title": "Family Support Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's National Hospital (Washington, DC) in Nov 2017", "Interview Descriptions": "I arrived early because I was not sure where my interview would be held. When I finally found the location, I waited outside for 20 minutes, knocking on the door with no response. I sent a email and called with no answer. I was about to leave when finally the supervisor called me back. \r\n\r\nWhen I finally sat down for my interview, I noticed there was something off putting about the supervisor. She was not warm and did not smile. She asked me about a previous place of employment, which was not listed on my resume. This made me extremely uncomfortable. \r\n\r\nFrom the interview process, I could tell that the supervisor had her mind made up about me before she began interviewing me.", "Interview Questions": "Where are you currently employed?"}, {"date": "26 Nov 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's National Hospital (Washington, DC) in Oct 2017", "Interview Descriptions": "Shadowed a register nurse for 3 hours before sitting down and speaking with the clinical educator regarding the position. She explained the format of the orientation process as well as expectations of a new hire nurse.", "Interview Questions": "What makes you interested in working on this unit at this hospital?"}, {"date": "2 Aug 2017", "title": "Payer Clearance Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Children's National Hospital", "Interview Descriptions": "I initially applied for the Payer Clearence Specialist position. I was called by the hiring manager and completed a 20 minute interview/screening. I was invited into the office to complete a face to face. Along with the interview, three assesments had to be completed. The interview went fairly well and I was told that I would hear back from someone in few weeks. I received a call three weeks later from another manager located in at the main hospital for completely different position. Apparently, my resume was forwarded to the DC location for review. I was invited to interview for the Patient Access Coordinator role because the previous manager thought that would be a better fit. I drove to DC ( about 50 minutes) and met with two managers in the Patient Access Dept. These women were very nice and informed me of all the perks of the position and basically told me I would be great for the job. The next day, I was asked to take three more assessments and that after the assessments were completed mangement would find \"the best fit\" position for me. Received an email ten days later requesting that I come back to the Silver Spring office for another face to face.  I went back to the office and was asked to take another assessment! Total of seven assessments in 29 days! I then had a sit down with another manager who was not as nice and didnt have the time to talk with me. Not sure what happened but the entire process was a complete waste of time. Didnt get an offer or so much as a rejection email.", "Interview Questions": "Where do I see myself in five years?"}, {"date": "5 Sept 2017", "title": "Leiter Einkauf / Stellvertretender Betriebsleiter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's National Hospital (Washington, DC) in Aug 2017", "Interview Descriptions": "I applied online and the next day received a phone call to set up an interview. I did so the following Monday. I interviewed with the manager and clinical leader and it was very casual. I then had to remove all jewelry and shadowed three nurses in the unit throughout the different stages (pre-op, during the test and post-procedure). Everyone was friendly and I learned a lot about radiology nursing.", "Interview Questions": "How long do you plan to stay here?"}, {"date": "26 Jul 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 2 weeks. I interviewed at Children's National Hospital", "Interview Descriptions": "This was the most unprofessional interview I ever had. The woman ripped me up, said I had no experience, and couldn't understand different that different job titles mean different things at different places. Horrible.", "Interview Questions": "So you don't really have any experience in this do you?"}, {"date": "18 May 2017", "title": "Communications Operator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's National Hospital (Washington, DC) in May 2017", "Interview Descriptions": "The interview process was very professional as well as the supervisor that interviewed me. She was pleasant and the human resource department was helpful as well. This company has a great reputation for excellent service and I was very satisfied even being a interviewee.", "Interview Questions": "How do you deal with difficult customers or situations?"}, {"date": "24 Aug 2017", "title": "RN II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's National Hospital (Washington, DC) in May 2017", "Interview Descriptions": "I was contacted by the supervisor really quick after submitting my application approximately 3 days later.  Ever since the interview I have not heard any response back from the manager. I assumed they selected another candidate.", "Interview Questions": "Why do you want to work for Children's? what are your strengths ? weaknesses?"}, {"date": "4 Apr 2017", "title": "Web Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Children's National Hospital", "Interview Descriptions": "I was contacted by a recruiter and had a phone interview with them.  They then passed me on for a phone interview with the person who would be the supervisor of this position.  We had what I thought was a friendly yet professional conversation, and this person told me that I would be hearing more from them.  I sent a thank you note the next day.  A long time has passed (i dont want to say exactly how much time, to be as anon as possible) and I have heard nothing.  So unprofessional.\r\n\r\nOnce you move past the recruiter/headhunter stage, I believe the interviewee at least deserves a polite \"we have decided to move on to other people\" stock letter from the HR department, at the very least.  I am a little hesitant to bash the particular employee that I interviewed with though, as this person told me they were pretty short handed on help.  So perhaps a general red flag about the institution as a whole should have gone up for me (and you reading this) at that point.", "Interview Questions": "How I thought my experience would fit the role. Typical things like that, no real surprise questions."}, {"date": "19 Jan 2017", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's National Hospital (Washington, DC)", "Interview Descriptions": "The interview was long & drawn out.  I interviewed with about 6 managers.  The interview started about 2 hrs late.  I did connect with one of the managers and was happy to know I would be working with her.", "Interview Questions": "They asked a lot about attendance and working with others."}], [{"date": "4 Dec 2017", "title": "Leadership Role Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's National Hospital (Washington, DC) in Jan 2017", "Interview Descriptions": "Hardest interview of my life! Good experience though. There is no way anyone could have prepared me for that interview. After all I was seeking employment by a top hospital in the nation for a supervisory role. The experience overall was worth it. Took a month from the time i applied, received a call, went in for an interview, got an offer call and so forth. I am thrilled! They hammered me in that interview, literally sat in my car shaking for a hour (seriously). I am honored to have been the final choice.", "Interview Questions": "Why do you want to work at Childrens?"}, {"date": "13 Feb 2018", "title": "Clinic Operations Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's National Hospital (Washington, DC) in Jan 2017", "Interview Descriptions": "They used a behavioral based interview. The questions were read out to me by the supervisor and hiring manager. The line of questioning was mechanical. They mostly asked the questions because they were required to ask , not because they wanted a response. After the interview I started having doubts about the type of manager I was going to work for. True to my guts feeling my manager was not too pleasant", "Interview Questions": "What do you do if you disagree with your boss?"}, {"date": "2 Oct 2016", "title": "Clinical Research Coordinator II Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Children's National Hospital (New York, NY)", "Interview Descriptions": "The interview process is still on-going and I believe it depends on the particular lab.  I applied end of June 2016 and first heard back mid July 2016.  We did a phone interview, Web-X, then a face-to-face interview at CNMC with two weeks in between each.  I was told I would find out early September 2016.  I didn't hear back then so I reached out.  At that point I was told they were busy with projects, were conducting other interviews, and would let me know \"soon.\"  I randomly got a call end of September 2016 asking to come in for a 2nd face-to-face interview scheduled a little over two weeks out.  I wasn't even told what it would be for until I asked.  No mention of salary or benefits yet.", "Interview Questions": "What would your previous employer say are your strengths?  Weaknesses? "}, {"date": "15 Jun 2016", "title": "Business Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2+ months. I interviewed at Children's National Hospital (Washingto Township, OH)", "Interview Descriptions": "Applied Nov 2015. Got call Feb 2016 and then an offer May 2016. The process was long and drawn out. I applied while in another state and they didn't want to fly me out. Conducted 3 phone interviews. 2 assessments and one FaceTime chat.", "Interview Questions": "What data programs have you used?"}, {"date": "3 Jun 2016", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Children's National Hospital (Washington, DC)", "Interview Descriptions": "Had a phone interview with Hiring Manager first, then meet with HR hiring manager, Panel in front of 4 doctors then other staff. The whole process was done in two days, phone interview first day then asked to come in.", "Interview Questions": "What would I do in certain situation, what type of software are you willing to learn.  Office organizational skills."}, {"date": "5 Sept 2017", "title": "Development Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's National Hospital in May 2016", "Interview Descriptions": "I received an email regarding the position and how they felt I could possibly be a good fit.  Went through the phone interview process where they never gave me any update until I called and emailed asking how the process was going along.", "Interview Questions": "Situational questions"}, {"date": "22 Apr 2016", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Children's National Hospital", "Interview Descriptions": "I interviewed with the entire department (about 10 people) at one time for about 3 hours. The interview was more like a long conversation, it was good but a little intense. They really wanted to get to know me and make sure I would be the right fit. It was also clear they wanted to fill the position as soon as possible.", "Interview Questions": "Give me an example of a time when you and your boss had opposing views? How did you handle the situation? What did you say? (I was asked several questions like this)"}, {"date": "31 Mar 2016", "title": "Conference Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Children's National Hospital", "Interview Descriptions": "I was recommended by a friend.  The interview was very easy.  It was clear that they were anxious to fill the position.  My qualifications were solid and they had to fill the position quickly.  It was clear that the interviewer didn't know too much about event management.  I spent much of the time giving direction on how I would manage the event.   They seemed very relieved that my responses were in keeping with what they were looking for.", "Interview Questions": "What was the single most important element in managing an event"}, {"date": "9 Jun 2016", "title": "Director of Construction Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Children's National Hospital (Washington, DC) in Apr 2016", "Interview Descriptions": "Met with leadership staff to review my competency for the job.  I had several rounds of interviews.  Met with both Engineering and Construction staff to discuss my plans for the department and my competency for the job.  Many of the questions were centered around what I felt is wrong with the department and what could be improved.", "Interview Questions": "How would you improve the Construction Department?"}, {"date": "2 Mar 2016", "title": "7 East RN I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Children's National Hospital", "Interview Descriptions": "Very laid back and super easy. I interviewed directly with the unit manager and she was extremely nice. It was my first interview ever and it was a very nice experience.  Asked very basic questions that didn't require much thought. Got to shadow after and everyone on the unit seemed very positive. I have not heard back yet about the position, I assume many people applied. However, I think the interview went very well.", "Interview Questions": "how would you describe yourself in your friend group?"}], [{"date": "31 May 2016", "title": "Development Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 months. I interviewed at Children's National Hospital in Mar 2016", "Interview Descriptions": "Phone interview with the team's Assistant Director, followed by in-person meeting with broader team members including other team's assistant directors, a few writers, and the Program Director. The phone interview took 3 months to schedule from the time I applied online, and then the in-person interview was 2 more months after that. I never heard anything back after my in-person interview, even after checking in 3 separate times and being told \"they would get back to me after no more than 2 weeks\" each time.", "Interview Questions": "Normal questions: \"What makes you a good fit for this position\""}, {"date": "19 Feb 2016", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Children's National Hospital", "Interview Descriptions": "I submitted my application to a posting on my university website. I was contacted within a week by a research assistant by phone (no email), asking me to call back at my soonest convenience. I called back, and it seemed that the position required an immediate hire, so I did not go through with process.", "Interview Questions": "Q: When is your desired starting date?"}, {"date": "2 Feb 2016", "title": "RN I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Children's National Hospital (Washington, DC)", "Interview Descriptions": "Unit manager called to schedule an interview.unit manager and clinical nurse educator were present. Both asked a lot of questions about my pediatric practicum.  Halfway through interview unit manager left to go to another interview and stepped out to take a call before that. there was a short shadowing experience afterwards.", "Interview Questions": "What would you do if you walked into a room with a patient who was asthmatic?"}, {"date": "18 Jan 2016", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Children's National Hospital (Silver Spring, MD)", "Interview Descriptions": "The interview was very extensive.  It was a panel interview, and in some cases the persons conducting the interview were not very friendly.  It was coupled with additional interviews with a combined total of five people for approximately 5 grueling hours.", "Interview Questions": "Describe one of the most difficult situations you were confronted with as a manager."}, {"date": "5 Oct 2016", "title": "Summer Innovator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Children's National Hospital (New York, NY) in Jan 2016", "Interview Descriptions": "I applied through a school program and heard back for an interview in a month. I interviewed in January and received an answer soon after. It was very relaxed and friendly, mostly behavioural questions.", "Interview Questions": "What projects have you worked on and what would you like to work on at Children's?"}, {"date": "17 Jan 2016", "title": "Senior Compensation and Benefits Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Children's National Hospital (Silver Spring, MD) in Jan 2016", "Interview Descriptions": "The interview process was relatively quick.  I met with 3 individuals in the span of 2 hours.   The questions where very detailed, and job specific.  The decision not to hire me was made within an hour.  I appreciated the quickness of their response, as it did not leave me wondering whether or not I would get the position.", "Interview Questions": "They asked me to describe my time working for a wicked manager."}, {"date": "2 Oct 2016", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's National Hospital in Dec 2015", "Interview Descriptions": "I was an internal job candidate, which is much easier to have than an external job candidate; therefore, the position was promotional. Not sure if this is true, but if you are internal to the company, you are automatically granted an interview on application. I had two separate interviews - comprised of a phone interview and in-person interview with an executive and two department directors. My job application was reviewed within one week of submission, and I was hired 1 month afterwards. This is not typical- I have heard many stories of HR taking up to 4-6 months to bring in an external candidate.", "Interview Questions": "What strategies do you employ when you're dealing with a difficult topic during presentation?"}, {"date": "6 Nov 2015", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at Children's National Hospital", "Interview Descriptions": "HR is no nonsense.  After I applied they called me two days later.  They picked the date and if I couldn't attend, they said \"Thank you for your consideration\" and ended the call.  Eventually I was able to go to the initial interview.  It consisted of a very basic written test with questions on basic calculations like pounds to kg, basic math and medical terminology.  Then you interview with the nurse recruiter.  If they liked you and you passed your test, your application is forwarded to the units in need and they contact you.  The interview on the units depend on where you go.  It can be very serious to a casual conversation with your bar buddy.  If they like you, you get an offer then pre employment physical.", "Interview Questions": "the usual questions"}, {"date": "18 Sept 2015", "title": "Research Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Children's National Hospital", "Interview Descriptions": "Asked about previous experience. HR is not very good. Overall good experience but be patient. The interview process was good, very knowledgable staff. Went very well. Not the hardest interview ive ever had. Also not the easiest.", "Interview Questions": "Asked intense science questions"}, {"date": "23 Aug 2015", "title": "Recruiter, Blood Donor Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's National Hospital (Washington, DC)", "Interview Descriptions": "Not long, a few phone calls and a half day in person.  The original phone calls were with the HR recruiter, who also extended the offer and was in charge of the salary negotiations and start date.  She was not helpful at all and I actually had to reach out to the hiring manager directly because she would not respond once I had accepted the offer.", "Interview Questions": "Tell us how you would handle X"}], [{"date": "11 Jul 2015", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Children's National Hospital", "Interview Descriptions": "Was flown in to do an interview several times over the course of a month. Interviews went very well. To a point where I felt confident enough I was to be given an offer. But I was never provided with one or even a formal decline. The decision was just left open and in the air. Even when I called the individuals responsible to inquire about the decision many months later to gain a sense of closure, I never got a clear answer. As if they both wanted and did not want to hire me at the same time? I was also not reimbursed for the many rides to the hospital and back to the airport. Altogether, it was an inconvenience to have flown out there so many times and not get the courtesy of a formal decision in return - my expectations of what I thought was a great hospital, were let down.", "Interview Questions": "N/A"}, {"date": "6 Apr 2017", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Children's National Hospital (Washington, DC) in Jul 2015", "Interview Descriptions": "Met with lab PI and answered questions about my experience in research and writing of research articles, reports, grant proposals, etc.. Expressed willingness to join laboratory as research tech with primary roles in writing rather than in benchwork.  agreed to start work right away as there was so much to do.", "Interview Questions": "Can you write papers and grants?"}, {"date": "9 Sept 2019", "title": "Operations Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Children's National Hospital (Washington, DC) in Jul 2015", "Interview Descriptions": "My interview wasn’t conventional I received a phone call to come in for a Interview and got the job the next day. I know it usually is easier to have an employee referral.", "Interview Questions": "Why do you want to work at CNHS"}, {"date": "23 Jul 2015", "title": "CCT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Children's National Hospital (Washington, DC) in May 2015", "Interview Descriptions": "Interviewed with two clinical instructors and then got a tour around the unit. Asked various questions regarding hypothetical situations - mainly focused around patient care (i.e. what would you do if a patient's mom is yelling at you). Offered feedback at the end and said they would be in touch within the next couple of weeks.", "Interview Questions": "If you could be any position in a company what would you be? (i.e. the CEO, regular staff nurse, etc)."}, {"date": "27 Jul 2016", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Children's National Hospital (Silver Spring, MD) in Apr 2015", "Interview Descriptions": "The process was rather brief, not too intimidating. I came in for one interview in person at the silver spring office. The parking was adjacent to the building so it was easy to find. Didn't take more than 30 minutes. Met the main director and three other women in the department. I had to do quite a bit of email correspondence, but it worked out in the end and I got the position.", "Interview Questions": "What experience do you have (college course work, internships etc) that would use here?"}, {"date": "22 Sept 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Children's National Hospital (Washington, DC) in Apr 2015", "Interview Descriptions": "I first applied online, and after several days, received a follow-up email from a potential supervisor, with whom I then scheduled a phone call. The phone interview was fairly straightforward in the end, and was roughly equal parts skills assessment and fit assessment. At the end of the interview, I was offered a position on the spot by my potential supervisor, and given some time to get back to them.", "Interview Questions": "Describe your experience in software engineering, including the programming languages you are familiar with."}, {"date": "9 Apr 2015", "title": "Clinical Operations Supervisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's National Hospital in Mar 2015", "Interview Descriptions": "Honestly the interview process was quick and painless and they communicated every step of the way.  What upset me was that when I applied and answered what my minimum salary requirements were I expected to be met with at least ALMOST that number when offered the job (and to be managing numerous departments and almost 20 employees, I didn't think $65K was unreasonable especially in comparison to what other companies offer for similar responsibility).  Instead the HR guy called me to tell me they wanted me but offered me almost $10K less than what I asked for.  I REALLY wanted the job but couldn't do it for that little and asked about other benefits like metro stipend etc and 1.) he told me he didn't know if they offered that (you're the HR guy, isn't it your JOB to know all the benefits??), 2.) when I seemed discouraged at the number they offered he told me how they really couldn't offer more b/c the last person to even make $60K had 28 years of experience (that's all well and good, but I don't care about other people, I care about me) and 3.) when I emailed him the next day to say I really couldn't take the position for such a smaller salary and to please let me know if anything was negotiable I never even heard back... a bit unprofessional if you ask me.\r\n\r\nBottom line, don't waste candidate's time if you aren't going tp offer them anything close to what they state as their minimum salary requirements... or at least be transparent about that right out of the gate so they know not to continue the process if it's a deal breaker.", "Interview Questions": "Customer service is a big deal at Children's, tell me about a time when you had to deal with an irate customer and how you dealt with it?... If you were working on a group project and your coworker wasn't pulling their weight and it was the night before it was due, what would you do?  What would you do if it happened a second time?... How have you felt when you've had to terminate employees before?... How do you handle multiple demands of you at the same time?"}, {"date": "16 Jan 2015", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's National Hospital", "Interview Descriptions": "The interview was conducted by an executive director and manager and referral was made to the supervisor who did less interviewing than sharing her work style. Offer was made within days.", "Interview Questions": "What are you most proud of"}, {"date": "4 Jan 2015", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Children's National Hospital", "Interview Descriptions": "First interview was via Skype. It was not difficult, the person who interviewed me was my further supervisor. I already have passed a first selection based in my skills and acknowledges, so, the interview itself was a simple step.  Two persons were interviewing me, my supervisor and another principal investigator, since she would be a future collaborator in other projects.", "Interview Questions": "They did not asked a really difficult question."}, {"date": "2 May 2015", "title": "Clinical Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's National Hospital in Jan 2015", "Interview Descriptions": "I was sent an email requesting an interview. We established a date for a phone interview one week from the date of the email. On the day of the phone interview, I was immediately told that the screening process had not noticed that I would not be graduating college for another five months. I was then told that they were looking to fill the position sooner, so the phone interview would therefore not be necessary. I was not happy with the fact that they could not have resolved this issue with an email, but instead led me in to the actual phone interview only to tell me over the phone that it would not be happening after all.", "Interview Questions": "N/A"}], [{"date": "16 Feb 2015", "title": "Global Patient Services Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's National Hospital (Washington, DC) in Jan 2015", "Interview Descriptions": "I was called in for a first interview in January. I met with the Department director.\r\nTwo weeks after the first interview I was called in for a second interview. The second interview was not with anybody working with the Department but rather with a consultant.\r\nI felt in the second interview that the decision had already been made.", "Interview Questions": "- Why do you think you are a good fit for this position?\r\n- Why did you chose to apply to Children's National?\r\n- How does your experience relate to this position?"}, {"date": "19 Dec 2014", "title": "RN I Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Children's National Hospital (Washington, DC) in Dec 2014", "Interview Descriptions": "Panel interview with questions about experience, qualities, and time for you to ask questions. More focused on personal characteristics and offered an opportunity to shadow at a later date.", "Interview Questions": "What makes you unique that you didn't learn in nursing school?"}, {"date": "2 Dec 2014", "title": "Staff Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Children's National Hospital in Nov 2014", "Interview Descriptions": "Contacted by phone first the I was invited for a 1 to 1 interview. The Interview was easy, asked to talk about my self and a couple of other simple questions. Nothing unexpected or difficult.", "Interview Questions": "N/A"}, {"date": "1 Jul 2015", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Children's National Hospital (Washington, DC) in Oct 2014", "Interview Descriptions": "apply online hr interview departmental interview callback ask the same questions as any interview just be open and honest and smile after all it is a kid hospital. be prepared on time and dress nicely", "Interview Questions": "why did you choose here to work"}, {"date": "1 Oct 2014", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Children's National Hospital", "Interview Descriptions": "General interview. There isn't a formal process and varies by hiring staff. No unexpected or curve ball questions. The post interview process was slow, but eventually I was offered the position.", "Interview Questions": "I was only asked general interview questions. I also discussed my background, then had an opportunity to ask the group questions. I interviewed with three people."}, {"date": "30 Jul 2014", "title": "Clinical Research Coordinator I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's National Hospital", "Interview Descriptions": "Applied for the Clinical Research Coordinator I position early June and Heard back via email about a month later. They asked for additional information which I provided. 2 weeks later they emailed back asking for a phone interview and a week after I had a phone interview that was brief. I still haven't heard back; I did follow up and they said they are still making the decision.", "Interview Questions": "Most the questions were about my related experience. No behavioral questions during the phone interview. "}, {"date": "14 Jul 2014", "title": "Research Faculty Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Children's National Hospital", "Interview Descriptions": "I submitted my initial application online, and didn't hear anything for several weeks. I was then asked to submit a CV. I had a telephone interview, and was invited to visit twice. The first was a full-day visit with half a dozen one-hour interviews and a 60 minute job talk/research seminar. The second visit was a half day visit, where I was introduced to most of the VIPs. I appreciated very much the fact that so many important people made themselves available to meet with we.", "Interview Questions": "Interview questions were not difficult. Most of the questions revolved around my past experiences and technical skills."}, {"date": "7 Jul 2014", "title": "COR II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's National Hospital", "Interview Descriptions": "I applied for the job online and was contacted by the hiring manager to set up an interview. I interviewed for the position and was then contacted by the HR recruiter with the job offer and possible start dates.", "Interview Questions": "All questions were pretty standard"}, {"date": "8 Jan 2017", "title": "Graduate Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2+ months. I interviewed at Children's National Hospital (Washington, DC) in May 2014", "Interview Descriptions": "Easy, supportive, and seamless process to apply. You begin by applying online, get the interview, which is a panel style, and then shadow the unit you applied too. The panel is usually management, leadership, and educational staff. They are insightful and passionate about the job you are applying too and share personal stories giving an idea of what working there might be like. My experience was very enjoyable.", "Interview Questions": "Strengths and weaknesses. "}, {"date": "3 Apr 2014", "title": "RN I Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's National Hospital", "Interview Descriptions": "New Grad position, interview was fair and they were quick with their decision. Overall, a great experience compared to others.", "Interview Questions": "What sets you apart from other candidates"}], [{"date": "11 Feb 2014", "title": "Clinical Research Coordinator I Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's National Hospital", "Interview Descriptions": "I submitted my application online and received an email a week later asking to come in for an interview. I had the in person interview the following week and was offered the job two weeks later.", "Interview Questions": "Every question was run of the mill. "}, {"date": "16 Mar 2015", "title": "New Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Children's National Hospital (Washington, DC) in Feb 2014", "Interview Descriptions": "Easy and quick, with great and responsive people. Once I received the email, the recruiter was very responsive and quickly got the ball rolling for the next steps. The team also was very nice about work with my  schedule and being flexible with my current job demands.", "Interview Questions": "What do you like least about your current job?"}, {"date": "25 Jan 2014", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Children's National Hospital", "Interview Descriptions": "I applied online.  I didn't hear anything for months.  I finally got a screening call from a recruiter. Then the following week was invited to meet the recruiter in person. Two weeks after that I had a full day of interviews followed by a couple more rounds of phone interviews and finally a test.", "Interview Questions": "Basic questions, but you do things in rounds so you recreate your self all day long. "}, {"date": "15 Dec 2013", "title": "Clinical Research Coordinator I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's National Hospital in Nov 2013", "Interview Descriptions": "I was contacted by e-mail asking for availability for an interview. I interviewed and in three weeks received a response stating that I was selected.", "Interview Questions": "You are asked to do a mock consent I was e-mailed a consent form before the interview and that would be the form I had to present to a hypothetical patient's parent. The questions were pretty standard: tell me about yourself, what made you choose this field, etc."}, {"date": "2 Nov 2013", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Children's National Hospital", "Interview Descriptions": "Very organized and structural. Your resume and experience are carefully screened.", "Interview Questions": "What have you been doing to maintain your continuing education? What professional organizations do you belong to?"}, {"date": "22 Oct 2013", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's National Hospital (Washington, DC)", "Interview Descriptions": "Preliminary interviews are held a few times a year for PCTs as there are not rolling offers. Preliminary interview consists of a short quiz on child development and pediatric vital signs. Study material is sent to the interviewee a short time before the interview. After successful completion of the quiz a short 1 on 1 interview with a recruiter is held.\r\n\r\nSecondary interviews are held in departments that are interested in hiring you.", "Interview Questions": "No difficult questions, mostly the standard pre hospital screening questions dealing with patient safety and workplace cohesiveness. "}, {"date": "30 Aug 2013", "title": "Postdoctoral Research Fellow Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Children's National Hospital", "Interview Descriptions": "30-presentation+individual interviews", "Interview Questions": "N/A"}, {"date": "26 Aug 2013", "title": "Associate Director Foundation Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Children's National Hospital", "Interview Descriptions": "Had several interviews with a recruiting firm they use to fill positions.Then was brought in for a three hour interview with 9 people.", "Interview Questions": "No odd questions and there is no consistency between hiring managers of what types of questions they'll ask. All depends on who you end up being in a room with. What's more important is that you ask questions to make sure its a good fit for you. Organization is very disfunctional."}, {"date": "21 Aug 2013", "title": "CRC I Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Children's National Hospital", "Interview Descriptions": "It was very simple and stress free! I was very excited about working at this site while visiting for an interview.", "Interview Questions": "Why I wanted to leave my current job. I did not want to be negative, so I felt like I had to add fluff as to why I wanted to leave when I really did not like the work environment of my previous employer."}, {"date": "10 Jun 2013", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's National Hospital", "Interview Descriptions": "Apply online, if chosen will will be scheduled for an interview at which time you will take a short quiz which includes basic math, conversion and word problems, etc. If you have a passing score your application will be referred to hiring manager for a second interview. Note: take a calculator with you.", "Interview Questions": "quiz questions/calculations"}], [{"date": "16 Jul 2015", "title": "Summer Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Children's National Hospital (Washington, DC) in Jun 2013", "Interview Descriptions": "A basic conversation with the PI and my mentor about what I want to get out of the summer, and what would be expected. It was very casual. I got into contact with the lab director through emailing a bunch of PIs at the hospital. I think once I came into the lab I already pretty much had the job. It was more to make sure I was a normal person and nice to work with.", "Interview Questions": "What do you want to get out of research?"}, {"date": "20 Jul 2013", "title": "Clinical Research Coordinator I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's National Hospital (Washington, DC) in Apr 2013", "Interview Descriptions": "Applied online through website - heard fairly promptly (~2 weeks after putting resume in). \r\nInterviewed with the Clinical Research Manager and a CRC already working in the department, as well as some of the doctors in the department. Interview questions were fairly typical - general HR questions (strengths/weaknesses, a couple scenario-based questions/what would you do, demonstrate teamwork experience, etc.).", "Interview Questions": "They brought in 3 doctors from the department and had each one talk about their research."}, {"date": "14 Jan 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Children's National Hospital in Feb 2013", "Interview Descriptions": "Applied through university listing. Interviewed on campus with alumni working at CNMC. Then completed phone interview with future boss. HR was difficult and slow to work with. They require trip to DC after accepting position in order to do occupational health screening.\r\n\r\nOverall, seemed unorganized and hiring process was very specific to whatever internship you were applying for and how that boss went about it.", "Interview Questions": "Why CNMC?"}, {"date": "13 Aug 2012", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Children's National Hospital (Washington, DC) in Aug 2012", "Interview Descriptions": "Received a phone call from the nurse manager wanting to see if I was interested in the position.  She spent time telling me the negatives as if she wanted me to decline.  Then told me she had to check interview schedule. Called me back to state problems with directors schedule and asked for days of availability.  Then she didn't call for over 2 weeks claiming vacation schedule. Had me come in the same week and interviewed with everyone a to z.  Only to get a email stating they decided to go with someone else.", "Interview Questions": "How do you establish relationship with your patients"}, {"date": "10 Mar 2014", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's National Hospital (Washington, DC) in Mar 2012", "Interview Descriptions": "Skype interview, presentation", "Interview Questions": "What's the significance of your work?"}, {"date": "12 Mar 2012", "title": "Anonymous Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's National Hospital (Silver Spring, MD) in Jan 2012", "Interview Descriptions": "In the particular interview experience I had, there wasn't an HR/recruiting involvement, so the hiring manager had to schedule the interviews and such.  I realize this can be overwhelming, however, the time it took to provide me with a decision after the final interview I had was nearly a month.  I found this to be unprofessional and less than courteous.  After the phone interview, I was notified within a few business days of an invitation to come in for a first round interview.  After that, another few business days passed and I was notified of a final interview.  I was surprised and frustrated that it took so long to get back to me.  After about 2 weeks, I assumed they were in the process of offering to the other candidate, so I moved forward with my job search.  About 2 weeks later, I got the call.  Hopefully this is a once in a blue moon instance and future candidates will not have to endure the long wait as I did.", "Interview Questions": "What makes you the best candidate for this position? "}, {"date": "10 Jul 2012", "title": "Transport Paramedic Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Children's National Hospital (Washington, DC) in Feb 2010", "Interview Descriptions": "Initial communications consisted of setting up date and time for interview.  Had to drive to campus, parking was validated.  Met with clinical manager, staff members, and education coordinator of team.  There were basic interview questions asked.  These consisted of questions about myself, work history, experience with pediatric patients, and hobbies.", "Interview Questions": "Give an example of a time when you dealt with a conflict between you and a partner and how did you resolve it?"}, {"date": "15 Jan 2010", "title": "Junior Financial Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Children's National Hospital (Silver Spring, MD) in Jan 2010", "Interview Descriptions": "Give me a time you implemented something new.\r\n\r\nDid excel stuff\r\nasked to write down what you know", "Interview Questions": "tell me about yourself"}, {"date": "11 Jan 2010", "title": "Nursing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Children's National Hospital (Washington, DC) in Nov 2009", "Interview Descriptions": "The interview consisted of a two hour shadowing session during which I followed a nurse on the floor and was exposed to the unit and what work would be like day to day on the unit. The nurses on the unit were very welcoming and friendly, and I found the shadowing session to be very helpful in getting an understanding of the unit. The individual interview was conducted by the nurse manager.", "Interview Questions": "What is a challenge or struggle you have dealt with in the past? How did you deal with it?"}, {"date": "27 Feb 2013", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Children's National Hospital (Washington, DC) in Oct 2009", "Interview Descriptions": "I had a unique situation due to external funding for the position.  I had two rounds of interviews before an offer was made.", "Interview Questions": "Do you think you are too qualified for the position?"}], [{"date": "12 Feb 2013", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Children's National Hospital (Washington, DC) in Jul 2009", "Interview Descriptions": "Very disorganized process. hr did not realize I was an applicant", "Interview Questions": "I did not receive any difficult questions"}]]