[[{"date": "14 Feb 2023", "title": "National Graduate Leadership Programmer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Police Now (London, England) in Feb 2023", "Interview Descriptions": "The assessment centre is intense but a good overall experience. You receive a really detailed (8 page) feedback report regardless of the outcome, which is useful for understanding you strengths/weaknesses not only for this job, but more generally too.", "Interview Questions": "What is your understanding of the programme?"}, {"date": "2 Feb 2023", "title": "Head of Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Police Now (London, England) in Jan 2023", "Interview Descriptions": "The interview process was a three-stage process. A telephone interview, presentation and a final stage with competency-based interview with the directors of the business. The interview was remote, the presentation and final stage was in person.", "Interview Questions": "They asked us to present what our priorities would be if we were to join the business."}, {"date": "7 Jun 2023", "title": "Head of Impact Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Police Now (London, England) in Jan 2023", "Interview Descriptions": "Three stage interview process: telephone interview with HR, in person second stage, including a presentation and interview and third stage interview with directors and the CEO. Great communication from HR, no delays, very quick and efficient process. very mission focused.", "Interview Questions": "Questions about mission alignment, stakeholder management, diversity and inclusion etc"}, {"date": "20 May 2023", "title": "National Graduate Leadership Programmer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Police Now in Dec 2022", "Interview Descriptions": "Very friendly people; one of the best interview processes I've ever encountered. However, I declined the offer because the salary is very low. At first I thought: Oh, not bad, £29k a year, then I realised it was £26k a year (at least in the area I chose) plus a £3k joining bonus. If you want to be a neighbourhood police (not office police) then go for it; otherwise, I'd say go find a well-paid job instead. The assessment day introduction session is really important, I'd recommend you to join. The interview questions I listed below are for assessment day.", "Interview Questions": "Apart from the common interview questions such as self introduction and motivation, how much do you know about Police now, what can you bring, they will also have questions around their values such as diversity, for example why it is important or how can you bring diversity"}, {"date": "7 Oct 2022", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Police Now (Bowness-on-Solway, England)", "Interview Descriptions": "Multi stage interview process including video recording and 6 hour multi form final interview.  The people conducting the interviews were all friendly and helpful however the feedback provided was very vague, seemed computer generated and was totally impersonal. Tbf they are interviewing many people, upwards of 500.", "Interview Questions": "Many different questions related to the role aswell as personal values"}, {"date": "4 Aug 2022", "title": "National Graduate Leadership Programmer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Police Now", "Interview Descriptions": "Challenging but rewarding interview which had an initial web assessment to get an understanding of personal skills before a longer assessment centre day which occured online as a result of covid. Nevertheless, everything ran smoothly and support staff were on hand to help with any issues.", "Interview Questions": "What do you understand as the mission of Police Now?"}, {"date": "30 Aug 2022", "title": "National Detective Programmer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Police Now in Jul 2022", "Interview Descriptions": "There was a mixture of questions and written tasks. The video questions are mainly based around understanding of the role and values rather than candidate competency.  The other tasks focus on competency.", "Interview Questions": "How would you describe the programme to someone who has not applied through it?"}, {"date": "17 Aug 2022", "title": "Head of People Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Police Now in Jul 2022", "Interview Descriptions": "The process from application to interview was managed at a really good pace with great communication throughout.    There were 3 interview stages, so quite in-depth however this was explained from the start of the process .  I enjoyed every stage! \r\n Everyone was friendly and professional and it enabled me to meet various people from the wider teams and ask questions that were important for me.", "Interview Questions": "There is a real commitment to making a difference. \r\n Throughout the interview stages, I was asked about my understanding of the company mission and purpose.  "}, {"date": "15 Jul 2022", "title": "Force Partnerships Area Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Police Now (London, England) in May 2022", "Interview Descriptions": "The interview process with Police Now was clearly communicated and the entire process took place in a good timeframe. The Recruitment Officer was knowledgeable, prompt and polite in their communication. The interviews were well structured and the interviewers were open to questions and discussion about the role and organisation. Lastly, the interview outcome and feedback was shared very quickly.", "Interview Questions": "Police Now is very keen to understand whether candidates are mission-aligned. This is a very important factor for all roles at the organisation."}, {"date": "16 May 2022", "title": "Graduate Leadership Programmer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Police Now in May 2022", "Interview Descriptions": "Long process, with simulation exercises, group work and writing an incident report based on an interview with a member of the public. A personal interview, reflective session and videos to watch too.", "Interview Questions": "Name a time you have dealt with a conflict in the workplace"}], [{"date": "8 Mar 2022", "title": "Graduate Leadership Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Police Now", "Interview Descriptions": "Online pre recorded - had to write and record your answers and then fill out some questionnaires. It wasn't too hard and took me 1.30hrs to complete. Had to complete scenario based questions.", "Interview Questions": "Why do you think you would be appropriate  for the roll?"}, {"date": "17 Jan 2022", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Police Now", "Interview Descriptions": "Good. Polite and well organized. Had to cancel due to other commitments. But a positive experience of the company overall and interview process was easy to understand and complete. Phone screening first and then a take home task and final interview after.", "Interview Questions": "Take home task was a presentation on database management"}, {"date": "22 Feb 2022", "title": "National Partnerships and Events Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Police Now in Dec 2021", "Interview Descriptions": "The interview process was well organised and informative. The interviewers made me feel at ease and were incredibly receptive of any questions I asked. The questions challenged me and allowed me to really think about the role and how I would fit into it and the company. It was clear straight away how mission passionate everyone involved is. After the first telephone interview there was a take home task.", "Interview Questions": "Why is diversity and inclusion important?\r\nWhy would you like to work for PN?\r\nWhat skills do you think you need to be successful in the role? "}, {"date": "16 Nov 2021", "title": "National Detective Programmer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Police Now in Oct 2021", "Interview Descriptions": "Assessment centre focuses on motivational alignment and specific skills in collaboration, problem solving, cultural awareness, emotional awareness.\n\nAssessment centre consists of investigate report, 2 role play scenarios, an interview and a reflective exercise at the end, all of which are assessed and based on situations you would be likely to face as a detective.", "Interview Questions": "Some strength questions\nSome competency questions\nAnd some scenario questions in the interview e.gs what would you do if in a certain situation "}, {"date": "29 Sept 2022", "title": "Graduate Detective Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Police Now in Oct 2021", "Interview Descriptions": "Online application followed by an online assessment (this was timed but you did not have to complete it in one sitting). If you passed this you were invited to a virtual assessment (online due to Covid) that was approximately 6 hours", "Interview Questions": "Tell me about something recent and relevant in the news that you think may affect the job of a police officer/detective"}, {"date": "24 Nov 2021", "title": "Research Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Police Now in Oct 2021", "Interview Descriptions": "The process was very thorough and in-depth, being a three stage process. The first stage was a telephone interview, after which around a week later there was a more practical skills based interview with the line manger of the successful candidate and  department head, with the final stage involving an interview with two of the organisations directors. Whiles it was a relatively drawn out process, the recruitment team at PoliceNow were incredibly supportive and would give regular detailed updates on where you were in the interview process, constructive feedback, and what the next step would be.", "Interview Questions": "Questions varied by each stage of the process. The first stage were general questions about why you applied for the role. At the second stage they were more focused on the role itself and its associated demands. The final stage focused on your alinement with the organisation values."}, {"date": "13 Sept 2021", "title": "Policing and Home Affairs Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Police Now in Sept 2021", "Interview Descriptions": "A really positive experience from start to finish. I felt that the PN team really got to know me and understand my experiences as part of the interview process. Some questions were challenging, but encouraged you to really think about your answers. \n\nIt was a two stage interview; the first stage was longer and included a short written task. The interviewers fully answered all of my questions, and made PN seem like a great place to work.", "Interview Questions": "Could you describe two areas that you would need to develop to be successful in this role?\nWhy do you want to work for PN?\nWhy do you think diversity and inclusion is important to PN?\nHow can diversity and inclusion be included in your work with PN?"}, {"date": "7 Feb 2022", "title": "Police Detective Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Police Now (London, England) in Aug 2021", "Interview Descriptions": "Online Assessment was straight forward, gives you plenty of time to prepare and gives you hints and tips.\r\n\r\nQuite a lengthy process. I applied for both Police Now and WMP and found that going through an proper constabulary was more beneficial but this is just preference", "Interview Questions": "Video question: What makes a good Neighbourhood Police Now"}, {"date": "24 Sept 2021", "title": "Progression Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Police Now (Preston, North West England, England) in Jul 2021", "Interview Descriptions": "Telephone interview, followed by face to face with first line management, followed by 2nd face to face and presentation to senior leaders of the company. The last interview and presentation lasted about an hour.", "Interview Questions": "N/A"}, {"date": "3 Mar 2021", "title": "Investigative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Police Now", "Interview Descriptions": "Applied online. Skype interview carried out by 2 members of staff, with a text the night before from the organisation to check I was prepared for the interview. Interview lasted about 1 hour. Email a few weeks later with the outcome", "Interview Questions": "What is an example of you showing bravery"}], [{"date": "15 Mar 2021", "title": "Neighborhood Police Officer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Police Now (London, England) in Mar 2021", "Interview Descriptions": "Very poor experience. My application was delayed for months with no communication, eventually costing me a potential job which I worked hard for. I would recommend applying directly to the police as this company are very incompetent and don't put in much effort. I was deceived about the roles available and classed as a late applicant due to their lack of action and communication. Extremely annoyed, was also told a manager would call me and that lasted about 20 seconds today. She didn't even ask what had happened and it was her colleague who offered the call last week. \r\n\r\nI was on a standby list for the very same job that apparently wasn't available originally and caused a long delay. Massively disappointing, don't put your hopes on this company as they cannot deliver. Even sent me emails with the wrong name and made a few errors in processing my information. What a waste of 5 months!", "Interview Questions": "Why do you think this is the role for you?"}, {"date": "11 Feb 2021", "title": "National Graduate Leadership Programmer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Police Now", "Interview Descriptions": "Particularly engaging and surprisingly fun for an interview. There were three parts of the interview: an augmented reality interview, a role playing interview and a standard face to face interview.", "Interview Questions": "Name a time/situation where you used leadership skills?"}, {"date": "16 Feb 2022", "title": "Salesforce Implementation Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Police Now (London, England) in Feb 2021", "Interview Descriptions": "I was approached on LinkedIn and after a conversation with the internal recruitment manager went through a process of interview, including a presentation and a next stage interview with the Chief Operating Officer.", "Interview Questions": "I was asked to give a presentation about the system implementation  process and about my experience."}, {"date": "27 Jun 2022", "title": "Graduate Scheme Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Police Now in Dec 2020", "Interview Descriptions": "There were various interviews and tests online, and you pass various stages as you go through. The stages involve written interview questions where you record your response to them. You are given time to prepare for these questions during. It was easy to follow and advice is available throughout.", "Interview Questions": "Situation questions where you are expected to record your reaction and response to various situations."}, {"date": "26 Feb 2021", "title": "Grad Scheme Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Police Now (Liverpool, England) in Nov 2020", "Interview Descriptions": "Consisted of role play, group and individual exercise. Role play was difficult, had a person from ethnic minority aggressively asking questions. Difficult to know how far to go and answer questions. In my feedback it said I wasn't culturally aware enough.", "Interview Questions": "What legacy do I want to leave"}, {"date": "14 Oct 2020", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Police Now (London, England) in Sept 2020", "Interview Descriptions": "Applied online, the entire process took 4 weeks. HR team is very friendly and kept me updated about my progress. Interviewed by 2, questions were mainly focused on previous work experiences and my understanding of Police Now's mission.", "Interview Questions": "Why I wanted to work for Police Now."}, {"date": "28 Sept 2020", "title": "Officer Level Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Police Now in Aug 2020", "Interview Descriptions": "The process started with an initial phone interview, I was asked about previous roles, my views on diversity and inclusion and walked through next steps should I be successful at this stage. This was followed up a few weeks later by a panel interview and a Q&A with current staff members. I found the second interview enjoyable. It was nice to get a feel for the company by meeting the 4 people that interviewed me. Communication at each stage was clear and timely. The commitment to Diversity and Inclusion at Police Now really stood out in each interview.", "Interview Questions": "What does equality and diversity mean to you?"}, {"date": "3 Jul 2020", "title": "National Detective Programmer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Police Now", "Interview Descriptions": "I successfully completed the online assessments which included written questions, video responses and situational judgment questions. The police now recruitment team told me to wait for further information about the interview. They did not reply to any of my emails. I then messaged them on Instagram and they reassured me that they are still giving out interview dates, it was just a matter of time. In the meantime I invested my time and money to prepare for the interview. After waiting over a month I got an email saying that due to a large number of applicants “it is regrettable that we will not be able to progress your application further “. Unfortunately, I am not the only person who has experienced this, feel free to look on the studentroom forums. \r\n\r\nA clear lack of organisation and transparency with their applicants. I have never experienced being given an interview offer and then have this opportunity retracted. I think it’s common sense to close the application process once you have enough applicants rather than offering interviews above capacity. \r\n\r\nAbsolutely unprofessional.", "Interview Questions": "N/A"}, {"date": "8 Jul 2020", "title": "National Detective Programmer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Police Now", "Interview Descriptions": "One of the worst companies I have ever applied to! A massive warning to all future applicants that Police Now are one of the most incompetent companies, and ways to enter this industry by far.  I passed all interviews up till the video, and upon this, they only give three pieces of feedback back. This feedback was rather vague and does not specify certain components you failed like all Graduate schemes do. I emailed in regarding this, and requested for better feedback because without a proper reason as to why my application was progressed, I took it was my background that affected this. Now one senior recruitment member stated to me they \"blind'mark\" the work, and this is a blatant lie, because she could not justify why my application was rejected. A note to all candidates that THEY DO NOT BLIND MARK WORK, they see what you look like on video, they have access to your name, address, education and intuitions obviously to progress certain applicants on their background.\r\n\r\nIn all, said person was clueless and incompetent like her staff, shes does not know what she's talking about, and their whole application process is a mess and a waste of time. Every Graduate Scheme gives proper feedback after video/timed assessments, Police Now are just biased and a bunch of time wasters. They like to argue that they are fair and equal, but they do not play by these rules, they do not impose blind-marking, and by not giving you actual feedback, they hide the discrepancies in their application process and obviously do not have to answer to a higher power.", "Interview Questions": "Video Interview depended on the context, and questions were catered to that."}], [{"date": "17 Jul 2020", "title": "Trainee Detective Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Police Now in Jun 2020", "Interview Descriptions": "I took part in the assessment day following a successful online application which consisted of a combination of multiple-choice answers, written questions and video questions. The assessment day was virtual (COVID) with 4 exercises; an interview, a role-play exercise, a scenario-based task and a written exercise. \r\n\r\nAll the exercises are straightfoward. Things like role-play and scenario-based task can sound scary if it's something you've not encountered before but the best advice I can give is be yourself and trust your instincts. \r\n\r\nOh and the interview is not super competency-based like most, it's more getting a feel of who you are/where your values lie.", "Interview Questions": "How would you remain open-minded? "}, {"date": "8 Apr 2020", "title": "Police Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Police Now", "Interview Descriptions": "It was a two year graduate police officer training programme. \r\nOnline Application Form - You get to choose which police force you would like to join. \r\nOnline Assessment - timed, included multiple choice questions, short video responses and written answers \r\nAssessment Centre (Virtual Reality Simulation, Strengths based Interview and Scenario Role-play)", "Interview Questions": "What does it mean to be openminded?"}, {"date": "5 Sept 2021", "title": "Police Detective Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Police Now (Bristol, England) in Mar 2020", "Interview Descriptions": "An online interview with role play, decision making, and one-on-one questions. The interviewer didn't seem particularly interested in really learning more about the interviewee as a person, it was simply a box ticking exercise.", "Interview Questions": "What makes you want to be a Police Detective? "}, {"date": "25 Mar 2021", "title": "Graduate Police Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Police Now (London, England) in Feb 2020", "Interview Descriptions": "Feedback really didn't match the interview day itself, strengths were very generic / on my CV but weaknesses felt plucked out of a hat given my background. VR was also unfair given motion sickness it induced.", "Interview Questions": "Can't be disclosed on here."}, {"date": "3 Dec 2019", "title": "Graduate Police Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Police Now", "Interview Descriptions": "Really interesting experience. I’m not allowed to go into too much detail, but the interview day was a fun if challenging experience. There were also aspects of the process which I had never encountered before at any other assessment centre. However, I do wonder whether they lose a lot of very good candidates simply due to the unique nature of their interview process.", "Interview Questions": "Why do you want become a neighbourhood police officer?"}, {"date": "21 Oct 2019", "title": "Marketing Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Police Now (London, England)", "Interview Descriptions": "The HR team needs to communicate properly with candidates when arranging a time and date for initial first stage interviews and should allow the candidate to have enough preparation time for the role and not put them on the spot to conduct the interview when they call. This gives a bad impression on the organisation in how they deal with things.", "Interview Questions": "Why do you know about the graduate scheme Police Now offers? "}, {"date": "22 Jun 2019", "title": "Detective Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Police Now (London, England) in Apr 2019", "Interview Descriptions": "Application form, written and mathematical tests, Skype interview and assessment centre. At the assessment centre you had to compete 2 written assessments, an interview, 2 role play exercises and 2 virtual reality exercises.", "Interview Questions": "About your motivation "}, {"date": "17 Apr 2020", "title": "Graduate Detective Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Police Now (Cambridge, England) in Apr 2019", "Interview Descriptions": "terrible , was falsely informed application was successful then received a telephone invite to an assessment centre with one days notice for an area I had not applied for and had not chosen to work in", "Interview Questions": "Police suitability "}, {"date": "25 Mar 2019", "title": "Quantitative Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Police Now", "Interview Descriptions": "Incompetent HR unable to read emails mentioning when candidates are available. \r\n\r\nany day AFTER a specific date means that a candidate cannot take the call that day \r\n\r\nwhen somebody with strong qualifications and technical skills approaches you, show RESPECT to that person and his time and reply to the god damn emails, or if you dont apologize  \r\n\r\nno diversity whatsoever - I suspect a posh, toxic passive aggressive culture, if you are not white and Brit avoid    \r\n\r\nIts important to spot the cultural problems before joining, though I am disappointed because I truly wanted to help tackle rising crime levels using technology, i didnt care about the penny salary I would do it for free \r\n\r\nPlease Stop modelling with SPSS and Excel we live in 2019 - Quantitative Analysis means coding \r\n\r\nLess PR more ACTION \r\n\r\nInstead of doing Propaganda videos on social media and employing one million marketing/recruitment personel wasting public funds hire a team of developers (there are volunteers) to automate your analytics function to understand causality of crime which is a public health issue and address poverty and discrimination which are under the carpet in the UK \r\n\r\nif you dont do that people will keep stabbing each other in the streets", "Interview Questions": "Can you reschedule because the hiring manager called sick? "}, {"date": "7 Mar 2019", "title": "Graduate Recruitment Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Police Now (London, England) in Feb 2019", "Interview Descriptions": "At first, I applied with my CV and Cover Letter. After about a week, I was asked to do a video interview which had 6 pre-recorded interview questions and I had to record my answers in 1 minute time slots. I was told the result within a week and invited for a live video interview. The live video interview was around 45 minutes with a member of staff. I was told the result within 3-4 days and invited for a face to face interview in Moorgate (Head office). There I met with the recruitment managers and some staff members and it lasted around an hour and a half. It was a traditional face to face interview.", "Interview Questions": "What do you know about the graduate scheme?"}]]