[[{"date": "22 Feb 2023", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at OhioGuidestone", "Interview Descriptions": "Great interview process! The entire process was done virtually. The second interview lasted an entire hour. Didn't feel like an interview it felt more like a great conversation. Can't wait to start!!", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "30 Jul 2021", "title": "Clinical Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at OhioGuidestone", "Interview Descriptions": "The interview process was a 45-minute phone call where the interviewer asked questions about my previous experience, reliability, and commitment to social services.  During this interview, I also learned about Ohio Guidestone and all of the services we offer.", "Interview Questions": "How do you plan to balance a caseload of clients with your other obligations. "}, {"date": "20 May 2021", "title": "Community Health Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at OhioGuidestone", "Interview Descriptions": "Had a virtual interview with the recruiter as well a second virtual interview.  Interviewers were friendly and provided informative information about the agency. Was asked  open ended questions as well as what would you do scenarios.", "Interview Questions": "Why age group am I comfortable working with? "}, {"date": "5 May 2021", "title": "Outreach Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at OhioGuidestone", "Interview Descriptions": "Casual. They asked a lot of questions relating to specific situations. Such as a “tell me situation where you had to handle a unique trauma and how you handled it”", "Interview Questions": "Why did you go into the social work field "}, {"date": "17 May 2022", "title": "Clinical(Non-paid) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at OhioGuidestone in Mar 2021", "Interview Descriptions": "*phone call screen 20 minutes to go over briefly my desire for internship, hear about the organization and their intern program \r\n*one hour video meeting with supervisor to review resume \r\n*email offer letter", "Interview Questions": "Q: what are my internship site requirements "}, {"date": "17 Feb 2021", "title": "Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at OhioGuidestone (Cleveland, OH)", "Interview Descriptions": "The process involved a two step interview. One with HR and another followed with the hiring manager. The interview was generally what was to be expected for community mental health agencies.", "Interview Questions": "Describe safety and what it means to you."}, {"date": "3 Feb 2021", "title": "Community Counseling Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at OhioGuidestone", "Interview Descriptions": "Stress free and personalized. Asked a lot about self and what I was looking for in an internship site. Also the online portal was very easy to naviagate. I would highly recommend. Also you need 3 referencess.", "Interview Questions": "What are you looking for in an internship"}, {"date": "14 Oct 2020", "title": "Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at OhioGuidestone", "Interview Descriptions": "The process was very quick and streamlined. I submitted an application and was contacted shortly after to schedule a phone interview with an HR representative. Easy to talk to them, very comfortable setting.", "Interview Questions": "What made you decide to go into the mental health profession?"}, {"date": "24 Jun 2020", "title": "Mental Health Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at OhioGuidestone in Jun 2020", "Interview Descriptions": "I applied on company's website, received an email for a phone interview with HR, and arranged a time with HR. The interview was brief and standard.  The whole process was easy to follow and to go through.", "Interview Questions": "Questions include why do I want to join OhioGuidestone, an example of when I set a goal for myself, and past experiences. "}, {"date": "9 Nov 2020", "title": "Licensed Social Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OhioGuidestone in Jun 2020", "Interview Descriptions": "The process was relatively quick, two interviews scheduled on different dates with different people. The outreach employee who reached out to me about the position was very helpful and responsive.", "Interview Questions": "Q: Describe your personal preferences for treatment style or interventions that you are familiar with using. "}], [{"date": "10 Mar 2020", "title": "Community Mental Health Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OhioGuidestone (Cleveland, OH) in Mar 2020", "Interview Descriptions": "I had a pre-screening by phone (very polite) and then an onsite interview. The onsite interview was brief (30 minutes), but went well. The interviewer was to the point, but friendly. It was a pleasant experience.", "Interview Questions": "Describe a time you were confronted with an ethical issue at your last job. Did resolving the issue involve consulting your coworkers? How was the issue resolved?"}, {"date": "30 Sept 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at OhioGuidestone", "Interview Descriptions": "Only consisted of an in-person interview. The supervisor discussed the position and we talked about what I was looking for in an internship. The I was asked some typical interview questions. Based off of my responses they agreed to take me on as an intern and I scheduled an appointment to meet with HR.", "Interview Questions": "Talk about a time you experienced conflict at work. "}, {"date": "27 Jan 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OhioGuidestone (Berea, OH) in Oct 2019", "Interview Descriptions": "I actually really liked ohioguidestones interview/hiring process. It started with me being contacted by email only a couple of days after I replied and we scheduled a phone interview. The person who interviewed me over the phone was very nice and asked about my basic qualifications and basic questions. After she said she would pass my information on and if they chose to interview me then she would contact me via email to set up the interview. I was emailed and scheduled an interview. The interview questions were situational and I was asked how I would handle various hypothetical scenarios.", "Interview Questions": "What was a question that you were prepared to answer that we didn’t ask? "}, {"date": "18 Nov 2019", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at OhioGuidestone (Dallas, TX) in Jan 2019", "Interview Descriptions": "Very smooth set of questions and answers did not require that much elaboration. Would do it all again and appreciated the professionalism throughout the whole process. Excellent dialog between all parties that participated in the interview. Seems like a really good company", "Interview Questions": "What would you consider your strengths?"}, {"date": "30 Apr 2019", "title": "VICTIM Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at OhioGuidestone (New Philadelphia, OH) in Jun 2017", "Interview Descriptions": "They require six references( they will  call everyone). The first interview is a phone interview with HR. If you get a second interview it is will the Supervisor you will most likely be working with. Once offered a position you must have a background check and fingerprints done/drug test and physical exam.\r\nYou will have a picture taken and sign all on-boarding paperwork.", "Interview Questions": "Tell me about a time when you had to deal with a difficult person."}, {"date": "3 Aug 2017", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at OhioGuidestone (Cleveland, OH) in Apr 2017", "Interview Descriptions": "Phone interview was short and neutral.  I was immediately scheduled an  in person interview followed by an offer letter. Very laid back. I was confident I would get the position.", "Interview Questions": "What are your strengths?"}, {"date": "7 Jun 2017", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OhioGuidestone (Lorain, OH) in Feb 2017", "Interview Descriptions": "Interview process was quick. There was a phone screen and then a face to face interview. The interviews were relaxed and comfortable.  Talking about internships or past jobs related to this position is key. Identifying the population you are comfortable working with is something that will be asked.", "Interview Questions": "What do you foresee as a challenge of this job? "}, {"date": "27 Mar 2017", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at OhioGuidestone (Berea, OH) in Jan 2017", "Interview Descriptions": "Very long. The company contacted me via phone, took two weeks to schedule a face to face. Completed round one of face to face interviews with three different interviewers. It was a rather simple bunch of questions, really just your average interview. I then waited a month without hearing a word about the position, and then the organization desired a second round of face to face interviews. I complied, and told them they really needed some senior leadership, and that the position they were looking for needed to be upgraded. The interviewers did not disagree. I then spent two weeks trying to negotiate a reasonable salary, and really, this organization is penny wise and pound foolish. The organization doesn't look at efficiency to be gained, only looks at what the price is. All and all, it was easy to spot that the organization is running on an outdated model. Instead of looking at what would be invested, and what would be gained (ROI), it's only about minimizing spend, and that simply doesn't work in the 21st century. Organizations that buy on price only disappeared long ago, and so will this one. The CEO makes $300,000 a year, and is running a 1980's style management model, where you pay employees as little as possible, beat them into the ground, and live with high turnover. The organization lacks zero modern infrastructure, systems and processes. A sharp individual with a Lean or Six Sigma background could take ten percent off of the costs of this organization in 90 days. If you are fresh out of college, this is a good starting point, but expect to be burnt out and out the door in 24 months or less. The benefits are subpar across the board, from time off to medical, all below industry average. The retirement plan takes six years to fully vest, and the average employee life is way less than that, so you can see from the word go that this is a factory mentality, and the thought of managing quality simple isn't there.", "Interview Questions": "What is your next career step? "}, {"date": "27 Oct 2018", "title": "CPST Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at OhioGuidestone (Lorain, OH) in Jan 2016", "Interview Descriptions": "Phone Interview, Face to face with HR, and then director of the site you will be working.  The process is lead by someone from HR and they give you phone calls and emails to keep you in the loop.", "Interview Questions": "How do you feel about going into people's homes?"}, {"date": "31 Mar 2015", "title": "Community Mental Health Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at OhioGuidestone (Cleveland, OH)", "Interview Descriptions": "Was contacted for a phone interview a week after submitting my résumé and cover letter. The person conducting the phone interview started the converation by telling me that she felt that I was more qualified for their Community Mental Health Worker position rather than the original position I applied for, which was okay with me. She then went on to say that even though she felt I was more qualified for the Community Mental Health Worker position, they really wanted someone with a LSW, which is something she knew I didn't have (I just have a Bachelor's Degree). That comment really bothered me and made me feel like she already knew that she wasn't going to move forward with me after the phone interview was over. During the whole phone conversation, the she seemed really disinterested and aloof. Even though I felt that I handled her questions well, I didn't get a good vibe about it. Her demeanor over the phone made me feel as though the things I have to offer weren't good enough for OhioGuidestone. Bottom line, the interview was a waste of my time.", "Interview Questions": "Why do you want to work for OhioGuidestone?"}], [{"date": "25 May 2014", "title": "Adult Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at OhioGuidestone in May 2014", "Interview Descriptions": "I submitted my resume online and received an email a few days later about setting up a phone interview with someone from HR.  The phone interview did not take very long, only about 30 minutes.  She said she would let me know the next day about an in person follow up interview.", "Interview Questions": "What are your salary requirements?"}, {"date": "7 Sept 2015", "title": "Teacher Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at OhioGuidestone (Maple Heights, OH) in Mar 2014", "Interview Descriptions": "I saw an ad on Craigslist. Sent my resume to HR, they invited my to open interviews, interviewed with two hr people who have me an offer spot on, then interview with head supervisor and she approved. The next process was an onboaring packet, vpr, first aid and a paid class.", "Interview Questions": "Why do you like childcare?"}, {"date": "5 Nov 2012", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at OhioGuidestone (Cleveland, OH)", "Interview Descriptions": "First, I submitted my application, resume, cover letter, and letters of reference. I was quickly called in for an interviewer, which consisted mostly of the interviewer asking about previous work history, education, and professional aspirations. It was relaxed, quick, and painless. Initially, I was very nervous but was quickly put at ease.", "Interview Questions": "What can you offer this administrative team that nobody else would be able to?"}]]