[[{"date": "17 Apr 2023", "title": "Network Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Wisconsin (Milwaukee, WI)", "Interview Descriptions": "They just want to know you have a good background and they will train you to do the job in an effective way. The interview were basic questions about networking which I learned from some classes.", "Interview Questions": "What is your background about networking? Have you done any physical work? Tell us about yourself."}, {"date": "10 Dec 2022", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Wisconsin (Milwaukee, WI) in Jul 2022", "Interview Descriptions": "Initial interview with recruiter. Interview was scheduled quickly but was rescheduled on the morning of the interview due to some conflict which was annoying. Otherwise genrally professional and prompt communication.", "Interview Questions": "Q: Describe your strengths. Q: Why do you think you’re a good fit for this role? Q: Are you pursuing other opportunities?"}, {"date": "5 Apr 2022", "title": "Health Council Lead Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Wisconsin (Madison, WI) in Mar 2022", "Interview Descriptions": "Interview was well structure and thought provoking. Questions perplex but well formulated. Must come prepared to give insight and well thought out responses. I did come prepared with a powerpoint for the interviewers to follow along with and make references. Interview took nearly 45 min and was structure with the two interviewers going back and forth to answer questions. Took time and made conversation relatable.", "Interview Questions": "What do you plan to contribute to the team."}, {"date": "14 Nov 2021", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Wisconsin", "Interview Descriptions": "No direct interview. I turned in my credentials and I was awarded the TA ship position by the university. Decisions are made by the department (hiring dept). I did an interview with some select professors based on research interest", "Interview Questions": "No direct interview. I turned in my credentials and I was awarded the TA ship position by the university. Decisions are made by the department (hiring dept). "}, {"date": "19 Oct 2021", "title": "HR Assitant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at University of Wisconsin (Madison, WI) in Jun 2021", "Interview Descriptions": "Set of interview questions with two assistant managers and then came back for a second interview with head manager a couple of days later; was hired a few days later and then was given an orientation", "Interview Questions": "What are my strengths and weaknesses?"}, {"date": "6 Aug 2021", "title": "Donor Experience Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Wisconsin (Madison, WI) in Apr 2021", "Interview Descriptions": "Well  planned and safety precautions were followed. Enjoyed learning more about the Foundation but it was not a good fit for either of us. The description made it seem like it was an established role not a brand new idea.", "Interview Questions": "What is your management style"}, {"date": "13 Jan 2021", "title": "Campus Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Wisconsin", "Interview Descriptions": "I saw the job posting in my school email. After the application, I received the email scheduled an in-person interview. Got the job soon after. The whole process took a month or two.", "Interview Questions": "Mock scenario, how to say the opening statement."}, {"date": "25 Jun 2021", "title": "Telephone Interviewer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Wisconsin (Madison, WI) in Apr 2020", "Interview Descriptions": "The interview process was very easy and not super formal. First I had a phone interview that went over basic topics such as my availability, interest in the position, and logistics of training/work hours. After that I was asked back for an in person practice call and typing test. The practice call involved me reading a script and the typing test was not rigorous. After that I was offered a position and then entered training. The UWSC hires a lot of students and from what I've heard, most people that interview get offered a job! Nice people and easy interview process.", "Interview Questions": "\"Our shifts are 4 hours long, do you think you could spend that much time on the phone/computer?\" "}, {"date": "2 Jun 2019", "title": "Sr Financial Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Wisconsin", "Interview Descriptions": "Interview process overall was relatively easy.  However, a panel interviews a candidate first that has nothing to do with the job, position or department in general.", "Interview Questions": "The interview questions almost had nothing to do with the position itself."}, {"date": "16 Nov 2018", "title": "Center Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Wisconsin (Milwaukee, WI) in Oct 2018", "Interview Descriptions": "First, you get an email inviting you to select from a list of available times to interview on the phone. Then you have a phone interview with about five people asking you questions. A few weeks later you may get invited to interview in person.", "Interview Questions": "How have you contributed to developing diversity?"}], [{"date": "2 Mar 2018", "title": "Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at University of Wisconsin (Madison, WI)", "Interview Descriptions": "The interview process two-tiered.  The first interview is at state level and is conducted in Madison.  The second interview is at county level, includes county board supervisors, county HR and is conducted in county.  Interview candidate will need to prepare presentation on pre-selected topic.", "Interview Questions": "what is your educational background and experience"}, {"date": "12 Nov 2022", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Wisconsin (Madison, WI) in Jan 2018", "Interview Descriptions": "Standard grad school process which is used for evaluating candidates for research positions for masters and phd level education all over the united states of america. Grad record exam is required and then you look for faculty who are working in your area of interest.", "Interview Questions": "What are you passionate about"}, {"date": "1 Dec 2017", "title": "Library Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at University of Wisconsin", "Interview Descriptions": "Casual setting that was open to questions.  The interview did not take long and covered most of the basic and classic interview questions that most employers tend to ask new hires.", "Interview Questions": "What is one of your greatest strengths?"}, {"date": "27 Apr 2017", "title": "Biostatistican I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Wisconsin in Apr 2017", "Interview Descriptions": "The job I interviewed for was with the Medical College, specifically research with the CIBMTR. This was the first round of interviews - just a quick 15 minute chat on the phone. The woman interviewing me was nice and asked me around 10 questions - all very standard interview questions, nothing really technical or specific to the job.", "Interview Questions": "Strengths, weaknesses, what is your management style, where do you see yourself in 5 years, etc."}, {"date": "3 May 2021", "title": "IT Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Wisconsin in Jan 2017", "Interview Descriptions": "Formal panel interview with other department heads after an initial phone screening.  Largely structured questions as part of a formal interviewing process.   Less about technology and more about managing a diverse workforce.", "Interview Questions": "Strong focus on diversity in hiring, team development, and communication style."}, {"date": "29 Nov 2016", "title": "Academic Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Wisconsin", "Interview Descriptions": "Phone Screen with 3 people; only 1 asked questions. Many questions were about my ability to do the job; they were definitely asking questions from a pre-written list. The hiring process seemed like they were handicapped by human resources and the position has been empty for quite some time due to that.", "Interview Questions": "Why are you interested in this position and how can you contribute to this department?"}, {"date": "9 Nov 2016", "title": "Help Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Wisconsin", "Interview Descriptions": "Behavioral interview; three questions to see if you're customer service oriented. They were looking for you to talk about customer service, communication, and critical thinking. Interview was with two employees.", "Interview Questions": "Tell me about a time when you worked a with a group."}, {"date": "18 Dec 2015", "title": "Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at University of Wisconsin", "Interview Descriptions": "They emailed first and then I called back. Had skype interview with basic questions at first, then after, they called my references. then an in-person with a presentation on a topic that they gave me. they called back the same day.", "Interview Questions": "Name a time you worked with underserved populations"}, {"date": "14 Oct 2016", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Wisconsin (La Crosse, WI) in Dec 2015", "Interview Descriptions": "It was a sit down in chair's office, he asked me 5 questions about teaching philosophy, then gave me a sheet describing the class I would teach and the times that it met.  He gave me a syllabus from the last instructor and told me I could use it or change it.", "Interview Questions": "N/A"}, {"date": "17 Dec 2015", "title": "Assistant Researcher Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Wisconsin in Dec 2015", "Interview Descriptions": "I was interviewed by a panel of three of the departments researchers. They asked about my past experience/projects. They also asked what I thought I could contribute to the department. The interview lasted a little more than an hour", "Interview Questions": "What attracted you to the role/position"}], [{"date": "22 Sept 2015", "title": "Human Resources Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Wisconsin", "Interview Descriptions": "Quick, it was a two week process. Right after I applied they emailed me wanting to set up a phone interview. After the phone interview they schedules an in person interview with all of the human resources staff. About a week after the in person interview I was given an offer and had accepted", "Interview Questions": "What are important aspects of human resources? What experience have you had that makes you a good candidate?"}, {"date": "27 Jul 2015", "title": "Web Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Wisconsin in Jul 2015", "Interview Descriptions": "I applied online and they scheduled for skype interview. 3 people interviewing me and they said that they gonna ask me 13 questions. The interview went for 40 mins.", "Interview Questions": "How do you update yourself with current technology"}, {"date": "14 Jan 2015", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Wisconsin", "Interview Descriptions": "You submit an application online to the program. The program will respond to you and schedule you for an interview. The interview was behavioral questions conducted by the supervisor of the program. The interview lasted to about 20-30 minutes.", "Interview Questions": "Name a conflict you had and how did you solve it."}, {"date": "8 Jul 2015", "title": "Research Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Wisconsin (Madison, WI) in Dec 2014", "Interview Descriptions": "I applied online and was contacted for a Skype interview a few days later.  It was a panel interview and they rotated around the table who was asking questions.  About 5 minutes before the interview, they sent me a list of the questions they were going to ask so I could look it over.", "Interview Questions": "typical behavioral questions"}, {"date": "3 Aug 2016", "title": "Research Associate-employee In Training Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at University of Wisconsin (Madison, WI) in Nov 2014", "Interview Descriptions": "Telephonic, Technical and HR. Asked about my background, work experience and future directions. I was interviewed with 8 persons on different timings. I was also taken to lunch and dinner. Overall the process i was good and manageable.", "Interview Questions": "General HR questions Asked about my background, work experience and future directions"}, {"date": "2 Jun 2014", "title": "Fond Du Lac County Bilingual 4-H Youth Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Wisconsin", "Interview Descriptions": "I was required to prepare a two-page maximum cover letter in response as to how my experiences met each minimum qualification and submitted my resume in addition to a standard online job seeking account. I was contacted a month later that I was selected for an interview and was asked for my availability on a given day. The interview was with 4 members, one the direct boss I would have been working under, a lady from the offices in Madison, an AmeriCorps Vista member, and the co-department head. The interview was over Skype where I was projected on a screen in front of them.", "Interview Questions": "There were multiple questions regarding my experience educating youth, of which my experience is limited, making those questions difficult to answer."}, {"date": "8 May 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Wisconsin (Madison, WI)", "Interview Descriptions": "Standard graduate school application and interview. Online application with essays, test scores, recommendations. Interview and visit weekend with day-long series of interviews, weekend-long assessment by interaction with current students.", "Interview Questions": "Why do you want to pursue a PhD?"}, {"date": "7 Feb 2016", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Wisconsin in Apr 2014", "Interview Descriptions": "Phone interview. Very straightforward. Nice guy (boss) interviewing, 30 minutes or so. He asked all the basic questions about research and teaching. Easy to talk to, relaxed. Though this was overall an easy interview - they certainly can be harder. Not sure what else to say, just be prepared to address all the core questions about your experience and expertise.", "Interview Questions": "All the standard questions about research and teaching."}, {"date": "30 Jun 2016", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 7 months. I interviewed at University of Wisconsin (New York, NY) in Apr 2014", "Interview Descriptions": "1) I sent my vita, college transcripts, letter of intent, and cover letter to the department.  2) After several months, we scheduled an interview and two demonstrations of my skills.  3) After a few weeks, I was hired.", "Interview Questions": "How do I work with members of the community?"}, {"date": "18 Mar 2014", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Wisconsin", "Interview Descriptions": "Fast and efficient interview process. A lot of university resources for clinical research, clinical and family support and options to go through and choose from; ask details so you can fit your specific profile. Senior administrators are useful, but pay attention to the fine print. Overall a comfortable setup and a friendly interview environment.", "Interview Questions": "Nothing out of the ordinary"}], [{"date": "27 Jan 2014", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Wisconsin", "Interview Descriptions": "Referred to the Career Services Office. A very speedy process.", "Interview Questions": "How do you deal with ambiguity?"}, {"date": "5 Jan 2016", "title": "Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3+ months. I interviewed at University of Wisconsin (Madison, WI) in Oct 2013", "Interview Descriptions": "Long and tedious...many different steps without communication in between steps leaves you guessing if you are in the running or not.  I think that because the positions are so flexible in nature it is difficult to have a real grasp of the work and expectations often do not meet reality once the job begins.  Hiring authority is centralized with the regional office and includes county based individuals who have a vested interest in the hire.", "Interview Questions": "presenting your teaching/communication style to the interview team"}, {"date": "22 May 2017", "title": "Senior Online Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Wisconsin in Sept 2013", "Interview Descriptions": "Pretty straightforward...phone interview with HR and then Skype interview with a few people from the hiring commitee.  Overall it was a professional and welcoming experience.  I had no complaints on the process.", "Interview Questions": "What did Google's Algorithm changes (Panda and Penguin) affect in SEO?"}, {"date": "18 Sept 2016", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Wisconsin (Madison, WI) in Jun 2013", "Interview Descriptions": "Hiring time was slow after submission of application but the process after was timely. The HR staff coordinating communications and accommodations was very helpful. \r\n\r\nPhone interview, on-campus interview (search committee, presentation, 1-on-1)", "Interview Questions": "Why are you interested in this position and why do you think you're the best candidate?"}, {"date": "9 May 2013", "title": "Housing Tutor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Wisconsin", "Interview Descriptions": "Easy online application. Received an email for the interview. Three people interviewing- 2 current tutors and 1 other housing employee. Asked general question on why you'd be good for the job, etc. Then there was a portion where they gave you three questions in your field and had you explain how to do each problem.", "Interview Questions": "N/A"}, {"date": "17 May 2016", "title": "Community Resource Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Wisconsin in May 2013", "Interview Descriptions": "First skype interview, then there were questionnaire to prepare for presentation. I conducted a research and collected the information necessary for the presentation. It took me a while to prepare as some of  people I was calling where out of the office, or not able to answer my questions. Took a while to get the presentation done the way I wanted.", "Interview Questions": "Three top priorities in Economic Development in the X Community."}, {"date": "25 Mar 2013", "title": "Research Specialist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Wisconsin", "Interview Descriptions": "Found job on UW-Madison's website, contacted lab via email. We set up an interview time that worked and it was very comfortable. Questions related to the job and previous education. Hiring process was quick.", "Interview Questions": "Not applicable. The interview questions were expected."}, {"date": "1 Oct 2012", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Wisconsin (Madison, WI)", "Interview Descriptions": "Very easy interview process, it was more personal questions to see if I was a good fit as opposed to business related questions.", "Interview Questions": "What are 5 of your biggest flaws"}, {"date": "15 Jul 2013", "title": "Veterinary Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at University of Wisconsin (Madison, WI) in Jun 2012", "Interview Descriptions": "I was given many details over email prior to the interview such as wage and expected hours.  The interview itself was very informal, but that's may be just how my department was.  Since I interviewed, they had started having candidates stay for a few hours and follow other techs around.", "Interview Questions": "Why I was leaving my current job"}, {"date": "23 Feb 2012", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at University of Wisconsin (Madison, WI) in Feb 2012", "Interview Descriptions": "go through resume, why you apply for chemistry library, what you want to get from this position", "Interview Questions": "what are you proud of?"}], [{"date": "10 Jan 2012", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at University of Wisconsin (Madison, WI) in Nov 2011", "Interview Descriptions": "The panel interview was as expected for University of Wisconsin - a \"round up\" of employees available to serve, some of which have no concept of what would (or wouldn't) make an applicant successful in the position.  I was surprised however,  with such a large institution, of some of the comments made during the process. Although I am no HR expert, they seem to have bordered on the illegal.  \r\nI earned one of two finalist spots and when I finally met with the ultimate hiring manager, he couldn't be bothered talking to me.  Mostly spoke about himself and then cut us off at the half hour mark.  It was apparent that the hiring decision was made prior to my interview and he was just going through the motions.  It was disappointing that I took time off of work (two separate days, over two hours) to go through the interview process when, prepared my references, completed a background check, come to find out, the job went to an internal candidate that was earmarked from the beginning (based on a reliable internal source). The processes and procedures of University of Wisconsin require the protocol of a search and screen committee and panel interview. Although I feel I was the more qualified applicant, I regret I was simply used as a requirement fulfillment for this department to hire the person they had in mind from the beginning. My advice to future applicants is to verify if there is an internal applicant applying for the same position you are considering.  If there is, I would suggest withdrawing your application as I have seen this very thing happen again and again at UW.  It is a flaw in the system that unfortunately I fell victim to.", "Interview Questions": "How good of writer are you?"}, {"date": "22 Jul 2015", "title": "Computer Lab Assistance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at University of Wisconsin (Stevens Point, WI) in Nov 2011", "Interview Descriptions": "The interview focus on customer services rather than tech knowledge. You will be interviewed by the manager or student coordinators. Interview questions are scenario based. After you answered the questions, they will actually tell you the polity and rule for handling the situations. If you have a good attitude to learn and service, you will get hired.", "Interview Questions": "What will you do if a student is talking on phone in the lab?"}, {"date": "19 Mar 2013", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Wisconsin (Madison, WI) in Oct 2011", "Interview Descriptions": "usual interview for postdoctoral position, day on campus plus presentation about previous work, i had an impression that guy expected me to turn down the offer", "Interview Questions": "you never know what they expect from you"}, {"date": "21 Dec 2012", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at University of Wisconsin (Madison, WI) in Sept 2011", "Interview Descriptions": "I knew a UW athlete, who recommended I tutor part time when I needed a job.  The process was pretty simple, and I started a few weeks later.  Other than a single compliance meeting, there were no steps between the interview and working.", "Interview Questions": "There were no particularly hard questions; they just wanted to know how you would go about tutoring an athlete.  The interview didn't last more than a half hour."}, {"date": "18 May 2014", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at University of Wisconsin (Madison, WI) in Jun 2011", "Interview Descriptions": "Stepped in and asked if they were hiring, she gave me an interview that week. The questions were basic - what are my strengths, what are my weaknesses. How do I deal with difficult situations.", "Interview Questions": "N/A"}, {"date": "17 Jul 2015", "title": "Senior Research Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Wisconsin (Madison, WI) in May 2011", "Interview Descriptions": "I had a phone interview which was fairly general in nature.  This was followed by an in person interview which lasted the better part of 4 hours.  The University is large and each hiring entity will have there own style as it pertains to interviewing.  I have found that interviews for laboratory positions are rather laid back and less formal.", "Interview Questions": "I was asked how I could leverage my skills to meet the needs of the lab."}, {"date": "10 Nov 2015", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at University of Wisconsin (Atlanta, GA) in Feb 2011", "Interview Descriptions": "I found the job description on the internet and applied for the job. I had an interview and on campus visit. I had to present my job market paper during the campus visit. It went all well. I liked the campus and the faculty. They showed me around the campus and I heard about the benefits from the Human Resources. We went out for lunches and dinners. It was great and I had a good time. They called me a week after the campus visit.", "Interview Questions": "Describe your research paper"}, {"date": "14 May 2012", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Wisconsin (Milwaukee, WI) in Feb 2011", "Interview Descriptions": "Interview process was very quick.", "Interview Questions": "Give an example of how you helped a customer."}, {"date": "20 Oct 2010", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Wisconsin (Madison, WI) in Oct 2010", "Interview Descriptions": "It first started with tough examination. The exam has fore sections and most of the people only managed to finished 2 sections. After that is a nice, inform section, going through the history of the company, the future they have. Most important, the hiring positions they have.", "Interview Questions": "how do you know XXX"}, {"date": "12 Jan 2011", "title": "Student Services Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Wisconsin (Kenosha, WI) in Oct 2010", "Interview Descriptions": "Confirmation letter acknowledging application received. Phone call offering to schedule initial phone screening. Phone screening interview with three people lasting about 1 hour. Letter offering second in person interview. Second interview consisted of 1) Panel of students, faculty, staff 2) Independent interview with program director 3) 15 minute presentation open to all members of campus community followed by Q&A. Offer by email. Negotiation by phone and email.", "Interview Questions": "N/A"}], [{"date": "27 Apr 2012", "title": "Assistant Scientist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at University of Wisconsin (Madison, WI) in Apr 2010", "Interview Descriptions": "I first give a 45 min presentation and then meet with about 8 peoples individually, I had lunch with the group. \r\nit is very extensive interview, you better have a really good sleep at the night before the interview. The peoples are very cold and you get be used to no smile situation.", "Interview Questions": "why you want to work here, what is your goal in the next five years."}, {"date": "9 Feb 2014", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Wisconsin (Madison, WI) in Jan 2010", "Interview Descriptions": "On site", "Interview Questions": "Would you accept an offer if it was made today?"}, {"date": "25 Jan 2012", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Wisconsin (Madison, WI) in Jan 2010", "Interview Descriptions": "Nothing much to tell", "Interview Questions": "Why do you want to join our research lab"}, {"date": "6 Feb 2011", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 5 days. I interviewed at University of Wisconsin (Madison, WI) in May 2009", "Interview Descriptions": "Short and to the point, offered lots of insight into what the position would entail. Interviewer proctored a skills test prior to beginning a 1:1 interview. After the interview, we toured the facility.", "Interview Questions": "Which is more important in a leader: listening to others or accepting responsibility -- and maybe blame?"}, {"date": "2 Jun 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Wisconsin (Milwaukee, WI) in Feb 2009", "Interview Descriptions": "There was a submission of CV and cover letter and based on that they shortlisted. Did not conduct a formal interview  and evaluated based on resume and references .", "Interview Questions": "there wasn't any specific question asked"}, {"date": "14 Feb 2011", "title": "Dining Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Wisconsin (Oshkosh, WI) in Jan 2009", "Interview Descriptions": "Phone interview", "Interview Questions": "What was your biggest failure?"}, {"date": "11 May 2010", "title": "Postdoctoral Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Wisconsin (Milwaukee, WI) in Jan 2009", "Interview Descriptions": "phone interview, then onsite, then offer", "Interview Questions": "why do you think we would give you an offer?"}, {"date": "12 Jan 2010", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Wisconsin (Madison, WI) in Jan 2008", "Interview Descriptions": "Questions about future research plan, interested area, interested professors.", "Interview Questions": "What other offiers?"}, {"date": "25 Sept 2009", "title": "Web Content Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at University of Wisconsin (Milwaukee, WI) in Nov 2007", "Interview Descriptions": "First interviewed with Bookstore manger, then IMT manger. \r\nVery quick, and simple interviews since the job was designed for a student working park time hours with no Benfits. Had to call many times to get the first interview, the Bookstore director is always busy. Was asked why I want this job, what do I hope to get out of it, past experience etc.. I did not bring a portfolio. I did mention my classes in webdesign. The IMT manger was more silent, and ackward.. I felt like I had to carry the interview, and do the talking. The bookstore was very busy, while the IMT department want slow and quiet. The bookstore depends on the IMT department to keep their site up and running.", "Interview Questions": "why did you quit your last job?"}]]