[[{"date": "15 Apr 2021", "title": "Information Security Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Southeastern Louisiana University in Apr 2021", "Interview Descriptions": "I applied online via their website and it took over a month to get an invitation to an interview. \n\nThe interview is the round table format, where you interview with at least four different people at one time. \n\nThey each ask a set of questions: Behavioral, networking, server, and general-based questions.\n\nThey were not able to tell me the salary range or any information about benefits, but one of the interviewers said he would get me that information via email. \n\nIf offered the job I would definitely take it. \n\nI will update if I get an offer.", "Interview Questions": "They each ask a set of questions: \nWhy did you apply for this role?\nWhat is one single skill you are best at?\nWhere do you see yourself career-wise in 3 to 5 years from now?\nHow do you deal with a difficult customer?\n\nNetworking questions:\nWhat is DNS?\nWhat is DHCP?\nWhat is a VLAN?\nWhat does NAT stand for and how is it used?\nWhat is the difference between 2.4Ghz and 5Ghz?\nWhat is the difference between WPA2-PSK vs WPA2-Enterprise?\nWhat is the difference between IPS vs IDS?\nDescribe the OSI model layer?\n\nServer-based questions:\nWhat is your experience with Windows server?\nWhat is your experience with Linux?\nWhat is experience do you have working with VMs?\n\nGeneral questions:\nAre you ok with using your personal vehicle to travel from site to site?\nAre you ok with taking some form of driving test?\nAre you ok with working non-standard hours ie after-hours, weekends, and holidays? \n"}, {"date": "12 Oct 2020", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Southeastern Louisiana University", "Interview Descriptions": "Round table.  About 6 different people in the room all with their own set of questions. The process was very stressful as they expect you to have an answer to every question even if the scenario given has never applied to you or past jobs. They also combined 10 questions in 1 and expected you to remember them all when answering.", "Interview Questions": "Tell us about a time when you had to deal with a difficult student? What happened? How did you handle it? "}, {"date": "2 Dec 2022", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Southeastern Louisiana University (Hammond, LA) in Jan 2020", "Interview Descriptions": "The format is a peer interview style with the director and graduate assistants. They mostly ask situational and experience based questions. It is not too difficult of an interview process.", "Interview Questions": "How do you study for your classes?"}, {"date": "25 Nov 2019", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Southeastern Louisiana University", "Interview Descriptions": "There wasn't one for where I worked, I applied online and received a text message saying I got the position and when to come in for training. I also knew someone who also worked there and he put in a good word for me, so that may be why I wasn't interviewed.", "Interview Questions": "N/A"}, {"date": "13 Aug 2018", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Southeastern Louisiana University", "Interview Descriptions": "It was fairly casual. I was interviewed by 4 people at a roundtable.  The interview lasted roughly one hour and there was plenty of laughing and lighthearted discussion.  I only had the one interview and I was offered the position the next day.  I countered the offer with a 12% increase to the salary, and a couple of days later they re-offered the position at a 10% higher salary than what was originally offered, and I accepted.", "Interview Questions": "Very standard questions that you hear at every interview."}, {"date": "26 Oct 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southeastern Louisiana University (Hammond, LA) in Dec 2017", "Interview Descriptions": "Not very difficult. Just wanted to make sure that I met the requirements of the job description. Once that was verified, he just wanted to get to know me. Was very laid back and no curve balls. Interview process was easy.", "Interview Questions": "What was my experience with computers?"}, {"date": "26 Aug 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Southeastern Louisiana University (Hammond, LA) in Jan 2015", "Interview Descriptions": "submit an application to the office, depending on your class schedule and how much hours you'll be able to work they will give you a call. Heard about the job through a friend who used to work in that office and they wanted someone immediately. it really depends on the office.", "Interview Questions": "do you have a problem doing this/that (duties). nothing too serious."}, {"date": "19 Sept 2014", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southeastern Louisiana University (Hammond, LA)", "Interview Descriptions": "You must first gain acceptance into a graduate program.  Next, you must search the university website for Graduate Assistant opportunities and then apply to as many as you are qualified for.  The interview process is painless and quick.", "Interview Questions": "N/A"}, {"date": "15 Sept 2014", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Southeastern Louisiana University", "Interview Descriptions": "Recommended by my classmate. Two people interviewed me. Very intimidating. They studied my body language. They asked me a lot of behavioral questions. Then they proceeded to employment history. Then they started the technical questions like if i had worked in a library before. Then they asked about myself. They also reviewed my communication skills as well.", "Interview Questions": "Describe yourself"}, {"date": "8 Jul 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Southeastern Louisiana University (Hammond, LA) in May 2014", "Interview Descriptions": "Essentially, I emailed the coordinator who knew me and provided me with a link to the job application directly and as soon as I filled out the application I was selected for employment. It was not a very difficult process thankfully because the graduate school interview process was already somewhat arduous and the job interview process was not that difficult.", "Interview Questions": "How well do I work with others in a close academic environment?"}], [{"date": "17 Oct 2014", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Southeastern Louisiana University in Jan 2014", "Interview Descriptions": "For my department, they do not interview candidates. You must be hired internally. For other departments it depends on their particular practices. Most departments want to hire graduates in their feild, i.e. the English Department would want an English graduate student. If your department is full try to apply to general areas like the Office of the Vice President of Student Affairs, etc.", "Interview Questions": "After you are hired they ask for references to call."}, {"date": "12 Aug 2015", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Southeastern Louisiana University (Hammond, LA) in Jan 2013", "Interview Descriptions": "It was very simple and easy.  They reached out to me and asked if I wanted to teach a section of public speaking.  Probably the easiest job process I've ever experienced,", "Interview Questions": "Noe established"}, {"date": "2 Jul 2013", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Southeastern Louisiana University (Hammond, LA) in May 2010", "Interview Descriptions": "It is best to know someone an employee or an alumni who is in close contact with the administration. I got in through a referral from an employee who my friend had worked with. The hiring process is not tedious. It is very direct. The chances of rejection are minimal. You do have to show up on time and dress properly. They will ask very reasonable and practical questions unlike a lot of philosophical answer requiring companies.", "Interview Questions": "Based upon the job description, questions were asked if I was able and willing to work in those environments. Everybody was very friendly and acceptive of me. There were also a few questions about my qualifications and achievement."}, {"date": "27 Mar 2013", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Southeastern Louisiana University (Hammond, LA) in Apr 2010", "Interview Descriptions": "Submit application online on their website\r\nContacted by the searching chair by email to setup a phone interview\r\non site interview\r\noffer", "Interview Questions": "Do you think women is a hazadous in industrail environment?"}, {"date": "6 Nov 2012", "title": "Business Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Southeastern Louisiana University (Hammond, LA) in Apr 2010", "Interview Descriptions": "Very detailed and specific. The interviewer/manager new my resume inside and out. Was very impressed with the professionalism displayed by the interview team.  A little intimidating going into an interview with 5 different people though.", "Interview Questions": "N/A"}, {"date": "4 Jan 2013", "title": "Director, Academic Support for Student-Athletes Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Southeastern Louisiana University (Hammond, LA) in May 2009", "Interview Descriptions": "Process began with phone interview. Athletic Director provided vision of academic support unit as well as current funding and staff. Campus interview was excellent. Meetings were scheduled with campus offices including the current President, Coaches, and athletic administration. Full day of meetings including meeting with the search committee comprised of faculty, student services staff, and Head Coaches.", "Interview Questions": "Asked to describe how to determine academic eligibility for a returning student athlete."}, {"date": "12 Oct 2013", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Southeastern Louisiana University (Hammond, LA) in May 2009", "Interview Descriptions": "Phone Call", "Interview Questions": "N/A"}, {"date": "18 Sept 2012", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Southeastern Louisiana University (Hammond, LA) in Sept 2008", "Interview Descriptions": "At the time I was interviewed, I spoke to Clarissa. She laid everything out for me and was more than willing to go over the rules. There was a tiny test thrown in midway in the hiring process, and as my former state dictates, a loyalty oath(because you are working for the goverment basically).", "Interview Questions": "Honestly, there weren't any"}]]