[[{"date": "11 Jul 2023", "title": "Shop Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Savannah College of Art and Design (Savannah, GA)", "Interview Descriptions": "The single interview was mostly geared toward ensuring that the candidate is informed about basic woodworking and shop safety. Some questions to gauge candidate's priorities- not intended to be trick questions, but often people overthink.", "Interview Questions": "If you have a shift but an important school project is due the next day, what do you do?"}, {"date": "12 Jun 2023", "title": "Admission Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Savannah College of Art and Design (Atlanta, GA)", "Interview Descriptions": "3 stages: • Phone interview with Hiring Recruiter •&nbsp;Face-to-face Zoom interview with previous Hiring Recruiter, Director of Admission, and Executive Director of Admissions • Another Zoom interview I interviewed for the position but only made it to the 2nd round. If you are a SCAD alum, I think that they will instantly pull your application. I received an email for the first round of interviews that day after my application was submitted. The phone interview was only 10 minutes and the recruiter was nice and provided a lot of information. Within two days, I got the next invite for round 2, and that interview was a bit difficult. Especially since I have worked in the SCAD admission as a student, I thought that some of the questions were kind of repetitive from my previous interview and only personal depending on your own experience and background. It was almost a week after my 2nd interview that I received an email about not making the final round. I felt like I had to express how \"life-changing \"and \"amazing\" SCAD was. For me personally, SCAD did help me in my journey to my career field and I'm grateful for my time there, but there are still cons and personal experiences that if I can be honest about in a non-professional setting, I would warn students and families about the true reality of attending. Because I was familiar with what parents actually wanted to hear and questions that they had asked me from a student perspective about attending SCAD, my answers focused on the fact that the amazing faculty and students are what actually make the school what it is, not the flashy events and experiences. Because not everyone will be able to attend or experience things like studying abroad in France/Hong Kong or going to SCAD Day prior to getting in (I didn't) and I don't want to sell something unrealistic to a bright-eyed eyed 17/18-year-old kid and their parents. I guess that was not what they were looking for in the role.", "Interview Questions": "What was your SCAD journey?"}, {"date": "17 May 2023", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Savannah College of Art and Design (Atlanta, GA)", "Interview Descriptions": "First round was a phone screening with HR. Then an in-person interview with HR and the hiring manager. there was a lag time between the phone screening and the in-person interview of approx. 3 weeks.", "Interview Questions": "How do you handle conflict?"}, {"date": "24 Feb 2023", "title": "Scenic Carpenter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Savannah College of Art and Design", "Interview Descriptions": "The process took forever, about three months all together. But everyone was extremely personable and lovely once I got to the actual interviewing point. It was a duel process, first being hr and then a panel of management.", "Interview Questions": "Why do you want to work for SCAD?"}, {"date": "19 Feb 2023", "title": "Residence Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Savannah College of Art and Design", "Interview Descriptions": "A little lengthy but great questions and enthusiasm from recruiter. Most were phone interviews, and then zoom interviews with RDs, RAs, professional staff. Last interviews are with DOS and a VP.", "Interview Questions": "What experience did you have in housing?"}, {"date": "18 Feb 2023", "title": "Resident Assistant (RA) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Savannah College of Art and Design", "Interview Descriptions": "Takes about 30 minutes overall. You answer 10 questions that are mostly aboht your personal life and experiences and then have time at the end to ask them questions, if picked to move onto next stage then you do several group activities.", "Interview Questions": "What was a time where you have a different opinion than everyone else? How did you deal with this?"}, {"date": "9 Feb 2023", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Savannah College of Art and Design", "Interview Descriptions": "Amazing and very insightful. It prepares you for the future. the faculty and staff is very well connected and are involved with your process from start to finish which helps every student excel", "Interview Questions": "Where do you see yourself?"}, {"date": "27 Jun 2023", "title": "Communications Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Savannah College of Art and Design (Savannah, GA) in Nov 2022", "Interview Descriptions": "Phone call with a recruiter, zoom interview and then an in person interview with the team, the recruiters at SCAD are too notch and really communicative and kept me informed every step of the way.", "Interview Questions": "Why do I want to work for SCAD"}, {"date": "26 Oct 2022", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Savannah College of Art and Design", "Interview Descriptions": "3 interviews with increasing levels of importance all online. It was a fairly easy process but the wait times between interviews was very long. Everyone was professional and friendly. I felt valued as a candidate.", "Interview Questions": "Teaching presentation, 3 interviews. Potential scenarios in the classroom"}, {"date": "16 Oct 2022", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Savannah College of Art and Design", "Interview Descriptions": "Interviewed by a committee led by an HR representative (and not the Department Chair or Dean). Full day of interviews. Included a teaching demonstration on a topic I was given. No research talk.", "Interview Questions": "How will your experience benefit our students?"}], [{"date": "25 Apr 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Savannah College of Art and Design (Savannah, GA) in Oct 2022", "Interview Descriptions": "Zoom interview because I applied during the off-season. The interview was about thirty minutes and the questions asked were pretty easy to answer.Zoom interview because I applied during the off-season. The interview was about thirty minutes and the questions asked were pretty easy to answer.", "Interview Questions": "How would you respond to a duty call?"}, {"date": "21 Jul 2022", "title": "Managing Editor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Savannah College of Art and Design", "Interview Descriptions": "I applied for the job and heard back a couple weeks later. They invited me in for an interview and gave me a tour of the building. The interview asked your typical interview questions. They got back to me a week later saying they had already filled the position, but thanked me for my interest.", "Interview Questions": "Do you have any experience in managing a project?"}, {"date": "2 Jul 2022", "title": "Museum Docent Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Savannah College of Art and Design", "Interview Descriptions": "3questions will be asked by supppervisor\n1, generally fist one is about introduction \n2, previous experience is very import \n3, the reasons why candidates applying for the job, and  does candidates know the work is PT job.", "Interview Questions": "N/A"}, {"date": "20 Oct 2022", "title": "Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 6 months. I interviewed at Savannah College of Art and Design in Jun 2022", "Interview Descriptions": "Reached out to SCAD for roles over a year, had to push hard to getting meetings, but in the end I was passed from one HR person to another and got a standard form not-interested email from them after so many conversations. Very little to no feedback on interviews, and generally a waste of time.", "Interview Questions": "Why do you want to be a professor?"}, {"date": "3 Mar 2022", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Savannah College of Art and Design (Savannah, GA)", "Interview Descriptions": "Long and complicated interview process. Ultimately ended with a flight to Savannah and then soon after was ghosted by the organization.\r\n\r\nI have a lot of experience in the field, it's completely normal to go with another applicant...but for the love of god why are so many companies ghosting applicants?\r\n\r\nWe have to use valuable PTO, travel during a pandemic, have multiple interviews months before all for radio silence??\r\n\r\nAvoid this place (for other reasons too...)", "Interview Questions": "Very corporate organization, they want a polished elevator pitch. Do not show any ounce of personality. "}, {"date": "20 Apr 2022", "title": "Student Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Savannah College of Art and Design (Savannah, GA) in Mar 2022", "Interview Descriptions": "Online Interview using Zoom. The link was provided and the question where in regard to one's course of action in case of typical situations that develop every day in the assigned position. Then the course of the interview deviated to personal question regarding how one act in group projects or activities, finalizing with a question of one's strengths and weaknesses.", "Interview Questions": "Give me three words that people who know you would use to describe you. "}, {"date": "23 Feb 2023", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Savannah College of Art and Design in Mar 2022", "Interview Descriptions": "1 phone interview and 2 zoom interviews. Everyone was friendly and asked pertinent questions. I felt comfortable and encouraged during the interview process. Was offered the job approximately 2 days after the final interview.", "Interview Questions": "How do you work under pressure?"}, {"date": "7 Feb 2022", "title": "Fitness Center Attendant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Savannah College of Art and Design", "Interview Descriptions": "Asked about your characteristics, how you interact with people, your relationship towards athletics, what would make you a good addition, schedules you can work with, communication, flexibility, punctuality. Staff was really nice.", "Interview Questions": "-What made you apply to this position?"}, {"date": "14 Mar 2022", "title": "Director of Partnerships Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Savannah College of Art and Design (Atlanta, GA) in Feb 2022", "Interview Descriptions": "1. Phone screen with Recruiter.\r\n2. Teams interview with same Recruiter and Hiring Manager.\r\n3. Teams interview with same Recruiter, same Hiring Manager and Hiring Manager's Manager.\r\n4. In Person with same Recruiter, CFO and CHRO.\r\nCommitment after final to provide decision within one day, at the latest two business days later.\r\nI received no contact after the final interview. \r\nTotally ghosted, after what I considered one of the better interview processes I have been through, with a Senior Staff Recruiter I trusted implicitly.", "Interview Questions": "Nothing out of the ordinary.\r\nThey led many of the interviews off asking why I was still interested in the position. Which, in hindsight seems like a red flag. Almost like dating someone who confesses a slew of emotional problems and keeps asking why you want to date them. \r\nRepeatedly asked what large companies you would target in Atlanta for partnership for SCAD PRO."}, {"date": "22 Jan 2022", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Savannah College of Art and Design", "Interview Descriptions": "Overall, a well-rounded process, when I interviewed there was both a group and a one-on-one interview process giving candidates a chance to show their strengths. There are many opportunities for you to show that you would make a good candidate so if you're not that great in one part of the interview process there are other parts where you might shine.", "Interview Questions": "What are some programs you would put on for your Residents?"}], [{"date": "11 Jan 2022", "title": "Library Page Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Savannah College of Art and Design", "Interview Descriptions": "I met my supervisor at the front desk and we went into a meeting room for the interview. They asked me a series of about 5 questions and then asked me if I had any questions.", "Interview Questions": "Why do you think you're right for this job?"}, {"date": "30 Dec 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Savannah College of Art and Design", "Interview Descriptions": "The interview process consists of a phone interview once your application is picked,  pre-recorded questions you record yourself answering, a formal online interview,  and then a final in person interview.", "Interview Questions": "What makes you stand out?"}, {"date": "17 Nov 2021", "title": "Photo Retoucher Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Savannah College of Art and Design", "Interview Descriptions": "Initial contact was by a corporate recruiter by phone. It was a confusing call as there were two recruiters on the line and they had very similar voices, so it was unclear who I was talking with.  After asking me what salary I expected, I asked them what the range was for the position, but they were unwilling to share that information.", "Interview Questions": "What qualities do you look for in a boss?"}, {"date": "15 Nov 2021", "title": "Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Savannah College of Art and Design (Savannah, GA) in Sept 2021", "Interview Descriptions": "Three rounds of interviews. \r\n-Phone Screening\r\n-Zoom interview\r\n-Zoom Interview Two\r\nVery friendly and open to questions, comments and concerns. They kept me updated each step of the way and made sure every question I had was answered. Third interview was much more extensive than the first two.", "Interview Questions": "Why would you like to work here? "}, {"date": "11 Aug 2021", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Savannah College of Art and Design", "Interview Descriptions": "The supervisor is very nice. She asked me a few questions related to the job. When I was confused, she patiently explained her questions and gave me feedback very quickly after the interview.", "Interview Questions": "Q: Do you like movies?\n"}, {"date": "21 Jun 2021", "title": "Alumni Relations Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Savannah College of Art and Design", "Interview Descriptions": "I was contacted by phone and given an interview time and date.  I arrived early and was brought into the interview as scheduled. It was a panel interview where everyone was cordial.", "Interview Questions": "How did you hear about SCAD?"}, {"date": "22 Jul 2021", "title": "Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 12 months. I interviewed at Savannah College of Art and Design in Jun 2021", "Interview Descriptions": "Over the course of one year, I had 4 interviews for 4 different positions. This last one has led me to write this review. \n\nThe recruiter was amazing, he does his job well, and prepared me well for the interviews. The first is with the Dean and Director and recruiter for one hour. It went very well and I moved onto the next round - a teaching demonstration on a topic they give you one week out for 30 minutes to 8 people. Then after that, you meet for another 1.5 hour Q&A. To prepare this teaching demo you also have to prepare and submit: Homework, additional activities, and a list of additional readings and resources! \n\nThey then immediately ask you to submit your transcripts and 3 written references to their credentialing department. I asked my network to do this for me, and paid to have my past colleges send transcripts. This step usually happens after you've received an offer so it felt like a real success. \n\nHR then sends you a list of housing, options neighborhoods where other faculty live, and many links to learn about housing and activities in Savannah. All great signs.\n\nThen, I waited. 11 days. I wrote the recruiter, he called and told me I did not get the position. Just like that. \n\nAfter an entire year of many interviews, asking my network to go out of their way to stand up for me, the amount of days and time preparing the teaching demo, the transcripts, they honestly go out of their way to make you feel like you are the only candidate. I feel it was a process that greatly benefitted them, and not me. I feel used and actually told them to lose my number and throw out my resume, I had it.", "Interview Questions": "How would you expand upon this 30 minute teaching demo to a 2.5 hour class?"}, {"date": "19 Apr 2021", "title": "Foundations Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Savannah College of Art and Design", "Interview Descriptions": "Had two interviews for a Full-time foundations professor  position and then nothing. I reached out to the recruiter three times and even called and left voicemails. They Completely ghosted me.", "Interview Questions": "What classes are you comfortable teaching "}, {"date": "15 Mar 2021", "title": "Student Success Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Savannah College of Art and Design", "Interview Descriptions": "First outreach was from one recruiter in HR for a phone interview, which went well. Next, I interviewed with members of the advising department + same HR recruiter for a group interview via zoom. Lastly, I interviewed with the senior VP of admission and Director of HR + same recruiter. I really like how she was in every interview I had, answered every question I had before/after interviews, and made me feel really comfortable. She was quick to respond, polite, professional, and kind. Great interview experience when normally, higher ed interviews can be vague, unorganized, and a long process in which you never hear back. No offer yet, but just finished last interview. We’ll see!", "Interview Questions": "What draws you to SCAD specifically?"}, {"date": "8 Dec 2022", "title": "Software Tester Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Savannah College of Art and Design (Phoenix, AZ) in Jan 2021", "Interview Descriptions": "it was good. but they didnt select me i dont know why what weong on that i believe you are ok with that not understand. it was good. but they didnt select me i dont know why what weong on that i believe you are ok with that not understand.", "Interview Questions": "N/A"}], [{"date": "23 Jan 2023", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Savannah College of Art and Design (Savannah, GA) in Dec 2020", "Interview Descriptions": "3-4 interviews. The HR representative was very clear, and prepared me well. The final interview was an exhausting 2 hour presentation where I was given a topic and 24 hours to prepare a detailed mini lecture. There were 6 people on the Zoom and they all asked questions about the lecture.", "Interview Questions": "How would you engage students who were not participating."}, {"date": "10 Oct 2020", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Savannah College of Art and Design", "Interview Descriptions": "Three interviews: Phone call interview with HR, Team interview with Manager, VP interview, which is an average level difficult. HR works slow may contact you 3 weeks later after the final interview.", "Interview Questions": "Briefly introduce yourself, why you are interested in work at SCAD"}, {"date": "28 Sept 2020", "title": "Creative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 6 weeks. I interviewed at Savannah College of Art and Design", "Interview Descriptions": "I didn’t actually apply for this job, they found me. There was an initial phone interview with a not very professional sounding HR person, who made it clear that I shouldn’t have high expectations as far as compensation.  An hour long video interview with 3 people (which was postponed once to a later date) went fairly well, everyone was friendly, but there were immediate red flags, like them saying the job has poor life/work balance, and asking outdated questions like “tell us 5 things about yourself”. Then came the reddest flag: a spec project: an immortal practice which allows potential employers get free work from creative professionals. This practice, although looked down upon in the field, is still somewhat common with recent grads who are trying to get their foot in the door. Asking someone with 15+ years work experience for such a thing means a prospective employer is either looking to take advantage of you, is unable to judge an existing portfolio, or is simply trying to see how bendable (susceptive to workplace abuse) you are. \r\n\r\nI agreed to the project, thinking the gig sounds interesting enough. I should’ve known better. The actual project, which I expected to be fairly simple, was a massive, multilayered assignment that I could easily charge 10K for in the real world. Meanwhile I was asked for a cover letter two weeks after the interview. Strangely casual  emails with smiley faces also made me question professionalism of this group. By the time I was working on the project I knew I didn’t want the job, but went through with it since I gave a promise. I received a formal rejection letter on Friday morning. (HR people, don’t send these on Fridays, you are ruining people’s weekends). I am not upset that I didn’t get the job, I had some big concerns. I am however pretty angry by the amount of time and effort they demanded, and how used it made me feel.", "Interview Questions": "Are you OK with bad work/life balance"}, {"date": "18 May 2020", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Savannah College of Art and Design (Albany, NY) in Apr 2020", "Interview Descriptions": "Was contacted for interview; did follow-up and then teaching demonstration. All went pretty smoothly. Have to submit credentials and I think they'll do a background check. The interview was relatively painless with typical questions being asked of me.", "Interview Questions": "Why I wanted to work at SCAD and my experience teaching"}, {"date": "4 Feb 2020", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Savannah College of Art and Design", "Interview Descriptions": "There were no technical question asked - it was all behavioral and fit-based. There were two interviews, one with a group of two, and then with a group of three people. One of the easiest interviews I've had.", "Interview Questions": "Why should we hire you?"}, {"date": "24 May 2023", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Savannah College of Art and Design (Atlanta, GA) in Feb 2020", "Interview Descriptions": "The interview I had was a one-on-one session lasting around 10 minutes. The interviewer was incredibly friendly, creating a comfortable atmosphere. However, the intensity of the questions kept me on my toes. They posed scenarios that could potentially arise during the job and asked me to provide answers. It was a thought-provoking experience as I had to think quickly and demonstrate my problem-solving abilities. The interviewer's intention seemed to be assessing my ability to handle real-life situations and adapt accordingly. Despite the short duration, the interview was impactful and provided valuable insights into the challenges that may arise in the role. Overall, I appreciated the friendly demeanor of the interviewer, which helped ease some of the pressure, while the intensity of the questions allowed me to showcase my skills and suitability for the position.", "Interview Questions": "What will you do if you see two student fight?"}, {"date": "10 Feb 2020", "title": "Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Savannah College of Art and Design in Jan 2020", "Interview Descriptions": "Human Resources contacted me via e-mail after submitting  an application through their career portal. They scheduled an interview the next week and I spoke to HR over the phone. The interview was a little less than 20 minutes.", "Interview Questions": "How would you help a student who needed assistance with professional communication?"}, {"date": "10 Dec 2019", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Savannah College of Art and Design", "Interview Descriptions": "3 round interviews, quite professional and standard questions, group interview on-site, very smooth and comfortable conversation. Phone interview with HR, then 2 round panel interview. Be confident on yourself. They are very nice and professional.", "Interview Questions": "Why do you choose SCAD"}, {"date": "8 Jun 2021", "title": "Sculpture Instructor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Savannah College of Art and Design in Dec 2019", "Interview Descriptions": "It is a smooth and pleasant telephone interview. At first let me introduce myself, then ask me five to six questions related to teaching experience and teaching method - no unusual question.", "Interview Questions": "What is your teaching method?\nHow to connect with the market?"}, {"date": "5 Mar 2020", "title": "Rapid Prototype Operations Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Savannah College of Art and Design (Savannah, GA) in Dec 2019", "Interview Descriptions": "I applied as they indicated and sent work samples as customary. I later received a call from their HR and the woman was actually angry that I sent the sample. I asked her why and she would only say they samples are not accepted. Keep in mind this place is supposed to pride itself on creativity and original thinking and this person was angry for me expressing this and showing proof of mine. She was upset to the point that I suggested she send it back at my expense if she wanted....she didn't. Odd. I later spoke to a recruiter for a phone interview in December '19 who was a nice enough fellow who seemed knowledgeable. He said he would let me know within two weeks telling me I could call if I had any questions. He never returned calls or replied to emails. He finally let me know  March 3 '20 that I was turned down despite my having done prototyping for SpaceX, NASA, Northrop Grumman, and more. Some of my work has appeared in a Smithsonian Affiliate Museum.", "Interview Questions": "Asked about experience in both conventional and high tech prototyping?"}], [{"date": "22 Nov 2019", "title": "Summer Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Savannah College of Art and Design (Savannah, GA)", "Interview Descriptions": "After I applied for the job online, I was interviewed by two of my advisors. The process was very chill and informal, but still very professionally minded. They're main questions had to deal with being able to handle high stress situations and conflicts. There was also a lot of importance on being friendly and nice, since you also have to work as a sort of ambassador for SCAD for the parents.", "Interview Questions": "Tell me about a time you solved a conflict?"}, {"date": "30 Apr 2022", "title": "Mental Health Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Savannah College of Art and Design (Atlanta, GA) in Oct 2019", "Interview Descriptions": "Be prepared and you'll be fine. It was an easy-going process and the interview with Mr. Henderson was really nice. I would definitely recommend applying there. It helps to have a recommendation from someone working there already.", "Interview Questions": "What is one of your strengths?"}, {"date": "1 Oct 2019", "title": "Associate Chair - Creative Leadership Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Savannah College of Art and Design (Savannah, GA) in Aug 2019", "Interview Descriptions": "Countless calls, Skype interviews and time in meetings with people and Deans, including a visit to campus which is 1-2 days too long and a free consulting lesson for the School.", "Interview Questions": "How does SCAD get into the conversation with the like McKinsey and other consulting firms about the value of its graduates vs. graduates from leading business schools,  like Harvard and Wharton."}, {"date": "20 Mar 2023", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Savannah College of Art and Design in Jun 2019", "Interview Descriptions": "The interview process is typically a series of steps that a company or organization takes to assess a candidate's suitability for a job or position. The specific process can vary depending on the company and the position, but it generally follows a similar structure. Application: The first step in the interview process is usually the submission of an application. This can be done online, through email, or in person, depending on the company. The application usually includes a resume, cover letter, and any other relevant documents or information. Screening: Once the application has been received, the company will typically review it to see if the candidate meets the basic requirements for the position. This may involve a quick phone screening or a review of the candidate's online presence, such as social media profiles. First Interview: If the candidate passes the screening stage, they will usually be invited for a first interview. This may be conducted in person, over the phone, or via video conferencing. The purpose of this interview is to get to know the candidate better, assess their qualifications and experience, and determine if they would be a good fit for the company. Additional Interviews: Depending on the position and the company, there may be additional interviews with other members of the team, the hiring manager, or senior executives. These interviews may be more focused on specific skills or experience, or they may be more general in nature to assess the candidate's overall fit. Assessments and Tests: Some companies may also require candidates to take assessments or tests to evaluate their skills or knowledge in a particular area. For example, a writing sample or coding test may be given to candidates for certain positions. Reference Checks: Before making a final decision, the company may also conduct reference checks to verify the candidate's work history and qualifications. Job Offer: If the candidate has successfully completed all the steps in the interview process and is deemed the best fit for the position, they will be offered the job. The company will typically provide an offer letter outlining the terms of employment, including salary, benefits, and start date.", "Interview Questions": "Tell me about yourself. Why you chose this major?"}, {"date": "25 Apr 2019", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Savannah College of Art and Design (Savannah, GA)", "Interview Descriptions": "Very simple. Met at a conference to initiate conversation. Had a phone call with some leadership. Traveled to Savannah. Gave a presentation. Had a meeting with faculty and HR. Got Hired. \r\n\r\nHonestly there is so much turnover with faculty and staff that it shouldn't be hard to get hired. I have sat through so many interviews while here. The quality of talent that gets hired is beginning to slip since they really just need to fill positions. So if you want a job, now is the time to give it a shot.", "Interview Questions": "Kids or significant other? So you would be willing to travel?"}, {"date": "29 May 2019", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Savannah College of Art and Design in Mar 2019", "Interview Descriptions": "I was called by the HR coordinator and the screening interview was scheduled for the next day.  She did send a confirmation email but otherwise did not correspond through email. The screening interview went will. The  HR coordinator was very friendly and said I was a perfect fit for the job. It took one full  week to hear back. She scheduled an interview with the  whole department for two weeks down the road. They were about 15 minutes late for that interview but it  went well . I asked if they had any concerns and they said no. Everyone was friendly and they asked very few questions. They mostly just told me about the position and answered my questions. It appeared that I was well qualified and that I was in a good position to remain in consideration. The HR coordinator said she'd get back to me early the next week. I didn't hear back for three more weeks finally emailed and still didn't hear back for another week. I was told I was no longer being considered with no further explanation.  The process took seven weeks from the first interview.", "Interview Questions": "They did ask for a salary range in the screening interview. "}, {"date": "23 May 2023", "title": "Bachelor Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Savannah College of Art and Design (Savannah, GA) in Mar 2019", "Interview Descriptions": "they are nice, and ask to intrduce myself, good talk and they ask how i build my artworks. why i want to go here, what is my background and why i choose this major", "Interview Questions": "lets introduce yourself to us"}, {"date": "25 Mar 2019", "title": "Creative Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Savannah College of Art and Design (Savannah, GA) in Feb 2019", "Interview Descriptions": "I first had a screener call with a SCAD recruiter. Although she was personable, I questioned her HR experience because she said to me, \"you are exactly what the creative team needs\", five minutes into our phone call. Her comment didn't seem very professional and was also setting my expectations pretty high when I hadn't even gone through the formal interview process yet. She also spoke at length about salary expectations, insinuating that I should be prepared for the salary to be low. When I asked the salary range for the position she said, \"I can't discuss that unless you get the offer.\" However, she was insistent that I tell her what I wanted to make, even though I said I would prefer to learn more about the role before discussing salary.\r\n\r\nWhen I made it to the next round, a Skype call was scheduled for 4pm with two directors of SCAD's creative agency. I received a text from the recruiter at 3pm, the day of the interview, asking if I could do the Skype \"now at 3pm\" and not 4pm. Apparently, the directors had wrapped their prior interviews early and wanted to do mine right away so they could leave earlier. I thought it was really forward and unprofessional to expect a candidate to jump and do an interview an hour earlier than scheduled, with no lead time. \r\n\r\nThe two directors I interviewed with seemed unenthused and preoccupied. I had also learned, through my own research, that one of the directors (the person who would have been my direct supervisor) was leaving his position. I had come across his job title/description, on the SCAD career webpage, posted a day prior to my interview. I am not sure if that contributed to the interviewees appearing preoccupied, but I assume it contributed to the conversation feeling a bit lackluster since one of the directors had one foot out the door.\r\n\r\nWhen I did my research on the recruiter, I learned she is a SCAD graduate, working in HR on the side as a recruiter, while also owning a fashion business. She had zero HR credentials on her LinkedIn profile. I would suggest to the higher ups at SCAD HR to make sure all of their staff are properly qualified to conduct interviews. Just because an employee is a graduate of your school does not mean they are qualified to handle HR responsibilities.", "Interview Questions": "What drives you?\r\nHave you seen our work?"}, {"date": "11 Apr 2019", "title": "Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Savannah College of Art and Design (Atlanta, GA) in Feb 2019", "Interview Descriptions": "Very free flowing. The conversation went into several directions. Often I had to bring them back on track. Panel interview with several professors. Liked the way they approached the process. In short, it was fun", "Interview Questions": "Summarize how your failures have enriched your career"}, {"date": "21 Jan 2019", "title": "Student Success Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Savannah College of Art and Design", "Interview Descriptions": "Phone interview followed by in person interview. The phone interview was about 30 minutes and the in person took about an hour. The HR department was great. They called exactly on time and followed up very quickly.", "Interview Questions": "What qualifies you for this position?"}], [{"date": "22 Feb 2019", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Savannah College of Art and Design in Jan 2019", "Interview Descriptions": "The phone interview was conducted by staff at HR and at best could be described as awkward. I was given several rushed ambiguous questions about management style rather than discussions about the responsibilities and goals of the position. When I asked about the aforementioned I was offered elusive answers. The interviewer seemed not to know or care. I am very disappointed with my experience and shall not offer my services to SCAD.", "Interview Questions": "What is your management style?"}, {"date": "20 Feb 2019", "title": "Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Savannah College of Art and Design in Jan 2019", "Interview Descriptions": "I've had a lot of faculty interviews over Skype this year, this was by far the weirdest. About 10-15 minutes. The talent search only asked a couple of questions, not the questions you would naturally think they would ask. When I asked a question their answer was general and unrelated. I left wondering if the connection was scrambled because the interviewer seemed just as confused as I. \r\n\r\nHonestly, I don't think they even looked at my resume, maybe skimmed it. I received the 'thanks but no thanks' email a few days later.  This is fine, but I left wondering why they had reached out in the first place.", "Interview Questions": "Do you grade?"}, {"date": "13 May 2018", "title": "Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Savannah College of Art and Design", "Interview Descriptions": "Many calls with the recruiter and many interviews. Dragged on for over 5 months.  Ultimately I got another job during the process so I took it before continuing on with who knows how much longer to wait on an answer... I figured if they had wanted me they would have sorted it out by then.", "Interview Questions": "Things like what makes a school stand out and be great, etc... "}, {"date": "7 Apr 2018", "title": "Writer/Editor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Savannah College of Art and Design (Savannah, GA)", "Interview Descriptions": "It began with a Skype interview, which included a recruiter and manager from HR. It moved to an in-person interview with the same recruiter and the team I would be working with (unexpected panel interview). They stated that an assessment test would follow the second interview, but later informed me that they were not moving forward with me so it did not happen. I was honestly relieved. They were courteous, not kind, and clearly maintain a very strict, tense, and downright stuffy atmosphere at all times.", "Interview Questions": "Tell me about a time where you had a conflict with a coworker.\r\n\r\nHow do you handle pressure and deadlines?\r\n\r\nHow would you react if someone corrected your work?\r\n\r\nWhat would you do if you had two projects that were due on the same day?"}, {"date": "19 Feb 2018", "title": "Docent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Savannah College of Art and Design (Savannah, GA)", "Interview Descriptions": "Phone call to arrange when best to meet. Met in the museum cafe. Kindly asked several questions regarding art, and what the position entailed. Interviewer was mostly interested in seeing how you were as a person and if your intentions were legitimate for getting the job.", "Interview Questions": "Why do you want to work here?\r\n\r\n"}, {"date": "29 Mar 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Savannah College of Art and Design (Savannah, GA) in Jan 2018", "Interview Descriptions": "I applied online. I don’t know how much later, but I was scheduled for an over the phone interview. The interviewer was a bore, so yeah I was rejected. I do know what she was looking for, but I do know from the interview, she did not have those very things herself. She was the typical pretty white female with no previous experience that SCAD loves to hire.", "Interview Questions": "Questions pertaining to administrative experience "}, {"date": "19 Feb 2022", "title": "Fashion Technology Instructor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Savannah College of Art and Design (Atlanta, GA) in Jan 2018", "Interview Descriptions": "There was a phone interview, and a sewing test with in person interview. Sewing test included stitching a fly front on industrial machines and adjusting darts on a flat pattern.", "Interview Questions": "How would you calm a distressed student?"}, {"date": "4 Jan 2022", "title": "Summer Camp Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Savannah College of Art and Design in Jan 2018", "Interview Descriptions": "I had an interview with 2 people. They just asked me about my ability to work under pressure, people skills, how I dealt with difficult people or situations, if I was good at planning, so on and so forth.", "Interview Questions": "How do you work under pressure?"}, {"date": "19 Sept 2020", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Savannah College of Art and Design in Jan 2018", "Interview Descriptions": "It was very easy. It had all of the questions a person would expect for an interview for a  role like this. Literally, just google RA interview questions. Be ready to talk about program ideas.", "Interview Questions": "Are you ok with being on duty?"}, {"date": "3 Nov 2017", "title": "Summer Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Savannah College of Art and Design (Savannah, GA)", "Interview Descriptions": "Met with supervisor after emailing back and forth a bit, answered hypothetical scenario based questions and shared info about myself. Was not officially offered the job on the spot but it seemed pretty certain.", "Interview Questions": "How would you react to a parent that is experiencing a frustrating move-in day with their child, who takes out their anger on you?"}], [{"date": "6 Apr 2017", "title": "Student Mentor - Faculty Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Savannah College of Art and Design (Savannah, GA)", "Interview Descriptions": "Interviewed once over the phone, and then a second interview over Skype. Normal interview process. Asked questions regarding my background, my qualifications and what I can bring to the dynamic team at SCAD", "Interview Questions": "What can you bring to SCAD that we don't have yet"}, {"date": "9 Apr 2017", "title": "Assistant Director of Admissions Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Savannah College of Art and Design in Apr 2017", "Interview Descriptions": "Skype Interview- the interviewer split the time (30 minutes) as her half and my half to ask questions/converse. She asked about my previous experience and specific SCAD knowledge so be prepared to know some facts and be confident in talking about htem.", "Interview Questions": "What is one aspect of this position that you believe would be a challenge to you?"}, {"date": "10 Jul 2017", "title": "Illustration Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Savannah College of Art and Design (New York, NY) in Apr 2017", "Interview Descriptions": "The interviewer was really kind and understanding. They were interested in hiring somebody with experience in digital illustration and new media. It was great that they did not only asked questions about my background, but also they talked about what SCAD has to offer to students as well as to the Faculty.\r\n\r\nAfter the interview I had to fill out the online application just to be sure my application was registered. However, I never got a confirmation wether my application was received or not, and, if turned down, why.", "Interview Questions": "- What is my background?\r\n- Do I have experience with digital painting and new media?\r\n- What is my opinion about the use of technology to make art?"}, {"date": "24 Mar 2017", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Savannah College of Art and Design (Savannah, GA) in Mar 2017", "Interview Descriptions": "Two Skype sessions about a week or so apart, and then an on-campus interview. Total process took about 4-5 weeks. The Skype interviews were about 45 minutes, and the on-campus was 27 minutes total. Skype interview was very in-depth about approaches to recruitment and moving from a student development role into recruiting, and more about my goals as a professional. On-campus consisted of four people including the Staff Recruiter. I was asked to prepare a five-minute presentation imagining that my audience consisted of high school students who knew nothing about SCAD. Was asked generic questions about how to build relationships with students, how I feel about speaking in front of large crowds, had my presentation, and then was able to ask one follow question of my own. The staff recruiter is amazing. Extremely personal, gets to know you as a person, and really appreciates you as an applicant - something I don't see very often. However, the on-campus interview itself felt very impersonal. I could tell they had several interviews lined up that afternoon and was shocked that it only took half an hour. Most higher ed on-campus interviews consist of an agenda for the entire day/afternoon. I walked away pretty much knowing I didn't get the job. After three days, I received the standard HR e-mail confirming so. Overall, I was impressed with the process until the actual panel interview.", "Interview Questions": "What is your approach to recruiting students on a personal level?"}, {"date": "23 Mar 2017", "title": "Systems Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Savannah College of Art and Design (Savannah, GA) in Mar 2017", "Interview Descriptions": "Had a phone interview slated for 30 minutes. I did not get a Skype like the others so I guess that meant I wasn't getting selected, but I did not know that at the time. She asked me to recite my resume and cut me off mid stream. Then she asked me to say why I wanted to work for SCAD and I gave her a escalator speech. Then she said, \"you're right about SCAD being great... but looking at your resume, good stuff but its, idk, overqualified???\" I'm sorry, it's rude and don't try this at home, but I had to agree with her so I just hung up the phone.\r\n\r\nShe must have known that I applied for three different positions with SCAD and was only over qualified for one of them. Guess I just wanted to see where I fit in, but I could have been interviewed for either of the other two if she felt like that. The point is, that wasn't really fair because I was interviewed for something she already knew I wasn't eligible for. your resume has to go through her first before it goes past her to the hiring manager.", "Interview Questions": "N/A"}, {"date": "23 Nov 2016", "title": "Transfer Adviser Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Savannah College of Art and Design in Nov 2016", "Interview Descriptions": "I applied for the position about a month prior to my interview. I received a call from an HR recruiter to schedule a Skype interview for the following day. The recruiter sent an email with her Skype id. I skyped the recruiter the following day and I have to say, the recruiter was anything but pleasant. She  asked a lot of questions that seemed a bit unnecessary and I feel like she was trying to stump me. She sighed a lot and seemed annoyed and unimpressed with most of my answers. Lots of eye rolls, as well. Clearly this recruiter either has poor people skills or just didn't like me for whatever reason.  I honestly am glad I was not chosen for this position because having her an my interviewee was a terrible first impression of SCAD for me.", "Interview Questions": "If you put in blood, sweat and tears for a Psychology degree, why would you want a career in higher education?"}, {"date": "20 Oct 2016", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Savannah College of Art and Design (New York, NY)", "Interview Descriptions": "Three part process. One Skype, then second is with the training director and HR, then the third is a presentation you have to give as if you were giving a presentation for interested students. The third interview is with all the upper management of admissions.", "Interview Questions": "Would you be able to travel on the drop of a hat"}, {"date": "31 Jul 2016", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 6 months. I interviewed at Savannah College of Art and Design", "Interview Descriptions": "They were late...twice.  Good to mediocre questions, no dialogue, lighting was so bad I couldn't see faces. Seemed to go well twice...then months went by no contact.  I was told early on I was a top candidate, so the silence seemed contadictiry.  Never received a thank you for your time email, which is a proper university courtesy.  I wish them luck in their search, but as a seasoned worker in the field, I was left hanging and if the remote chance they would contact me, I'd be wary.", "Interview Questions": "Why do I want the position...how would I deal with conflict."}, {"date": "15 Jun 2016", "title": "Assistant Director of Enrollment (Admissions Advisor) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Savannah College of Art and Design (Savannah, GA)", "Interview Descriptions": "I applied for the position in early March and was contacted by HR in late May. The interview process took two and a half weeks. I first did a Skype interview with HR, then an in-person interview with the Director of Enrollment and an HR member, and a final interview with the Director of Admissions and an HR member that included a 5-7 minute presentation. The final interview also included lunch with two current ADEs.", "Interview Questions": "Why do you want to work at SCAD?"}, {"date": "10 Aug 2016", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Savannah College of Art and Design (Atlanta, GA) in Jun 2016", "Interview Descriptions": "Got an interview within a week of applying. The first interview was a quick interview with a staff recruiter over on Skype. Probably lasted 10 minutes. It was a pleasant interview. I was told that she was happy enough with me and that a recommendation would be made to go to the next level. Few days later I had the second interview with the same recruiter and the head of admissions. It was done over Skype too. However, since then it's been at least 6 weeks and I have had no contact, not even courtesy email. Quite disappointing!", "Interview Questions": "Why did you choose SCAD"}], [{"date": "21 Jun 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Savannah College of Art and Design (Savannah, GA) in May 2016", "Interview Descriptions": "I applied online for three different administrative assistant positions and received an email within two business days with a request for a telephonic interview for only one of them. The HR representative called me as scheduled. I asked which department the position was located (it was not listed on the site) and was given the location. Through the course of the interview, I found out the interviewer was handling all three positions to which I coincidentally applied. Upon hearing the information, I asked if the interview was just for that one position. She said, \"Yes.\" I was asked a few questions and was disappointed to hear a smug chortle when she heard my response that my work experience is greater than my degrees. I asked a few questions to which she said she couldn't answer - simple questions about benefits. I received an emailed letter of rejection the next morning and then with the next few days received rejection letters for the other two positions for which I was not even interviewed (but she was handling. I was rather shocked to be rejected for a position which would pose no more challenging than handling my own family affairs on a daily basis. I decided to do research on the interviewer and found that she is relatively young and without a doubt does not have enough work or life experience to judge anybody's capabilities for a simple desk job. During my search, I located information on this site about the company and have determined that not being offered a job must be a blessing in disguise.", "Interview Questions": "How do your recent degrees directly apply to the position you applied for? (Yes, this is how she worded the question, not me. I know that a sentence is not supposed to end with a preposition!)"}, {"date": "20 Apr 2016", "title": "Enrollment Events Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Savannah College of Art and Design (Savannah, GA) in Mar 2016", "Interview Descriptions": "I applied online and received a call from HR one week later to set up a Skype interview. The first interview lasted about 30 minutes. She only gave me the opportunity to ask one question at the end, but immediately set up a second Skype interview.\r\n\r\nThe second Skype interview included the same HR person and two people from the hiring department. It was only 20 minutes long and they interrupted me 15 minutes in to say that there was a bad connection and they'd need to finish the interview over the phone. Once again, I was instructed that they only had time for one question. They told me they'd be in touch by the end of the week. During my two interviews there was a lot of emphasis on how many hours I'd be willing to work with the understanding that it would sometimes be above 40. I got the impression that it would be well beyond 40 hours on a regular basis given how much attention they were giving to that particular aspect of one of my previous jobs.\r\n\r\nSometime the following week, I received an email from the same HR woman stating that they'd decided not to consider me for the position - but it was for a different position at the Atlanta campus. My status is listed as \"Not Hired\" for that position and I'm still \"In Process\" for the original job, which I assume is an error.", "Interview Questions": "Why do you want to work at SCAD?"}, {"date": "12 Jun 2016", "title": "Enrollment Events Manager - Tours Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Savannah College of Art and Design in Mar 2016", "Interview Descriptions": "Skype interview with HR rep. One week later HR rep called to set up face to face interview. Face to face included HR rep, director & manager and lasted about 45 minutes. Very formal, structured interview process. Over qualified for position.", "Interview Questions": "Why should we hire you?\nWhy do you want to work for SCAD?\nWhat question were you expecting us to ask?"}, {"date": "6 Jun 2020", "title": "Orientation Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Savannah College of Art and Design (Savannah, GA) in Mar 2016", "Interview Descriptions": "It is set up like a mini Career Fair (at the time anyways). It was open and comfortable. Definitely taught you how to focus while being surrounded by many moving parts. Also, since it was open downstairs, you had the opportunity to talk to other students. Helped diffuse tension a bit.", "Interview Questions": "Questions were typical. Tend to ask about experiences in leadership and interactions with coworkers. "}, {"date": "3 Feb 2017", "title": "Student Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Savannah College of Art and Design (Savannah, GA) in Feb 2016", "Interview Descriptions": "The interview was very easy-going and laid back. It only lasted about five minutes and the woman was incredibly sweet and bubbly. Went in, she asked about my experience with the school and what I would want to change about it.", "Interview Questions": "What is your favorite thing about SCAD?"}, {"date": "20 Oct 2015", "title": "Alumni Communications Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at Savannah College of Art and Design (Savannah, GA)", "Interview Descriptions": "They pulled my application from another position I applied for. After one phone interview and two in person interviews they waited two weeks before calling me back to advise that they are closing the position because they were changing the job description and requirements. This was over the course of almost 3 months and the communication was very positive the entire time until the final call. They obviously did not know what they were looking for and wasted my time from the very beginning. I will not apply for another position at SCAD because of how they treat potential employees. The recruiter was very nice but would go weeks without responding to emails or voice-mails. The whole process was not professional.", "Interview Questions": "What skills from your current position do you think align with this position?"}, {"date": "12 Oct 2015", "title": "Student Success Adviser Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Savannah College of Art and Design", "Interview Descriptions": "About 9 weeks after submitting my application I had a phone interview with HR.  Two days later I had a Skype interview with HR and two supervisors in the department, followed by another phone interview with another supervisor and two managers in the department.  (I live in another state)", "Interview Questions": "Tell us about your financial aid experience."}, {"date": "12 Oct 2015", "title": "Financial Aid Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Savannah College of Art and Design (Savannah, GA)", "Interview Descriptions": "Applied online, after several months received a phone interview, didn't receive an in-person interview until they knew I moved to Savannah, GA. Once they knew I had moved they offered an in-person interview.", "Interview Questions": "What are your 5 year goals?"}, {"date": "22 Sept 2015", "title": "Promotional Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 5 months. I interviewed at Savannah College of Art and Design (Savannah, GA)", "Interview Descriptions": "not professional. the HR and the hiring managers interviewed me all at once in one room. I didn't know whether to get more specific on the job details or answer HR types of questions!!! they mostly talked about them selves!!", "Interview Questions": "What software do you use?"}, {"date": "23 Sept 2015", "title": "Staffer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Savannah College of Art and Design (Atlanta, GA)", "Interview Descriptions": "Typical phone interview, in person interview, then return for 3rd interview.  Entire process took approximately 1 month from beginning to end.  I was offered the position and excepted.", "Interview Questions": "Future Goals and where do you see yourself in 5 years, 10 years.  Also I was asked the same questions each step of the way (during the phone interview, and both in person interviews)."}], [{"date": "26 Sept 2015", "title": "UI/User Experience Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Savannah College of Art and Design (Savannah, GA) in Sept 2015", "Interview Descriptions": "I applied through the website of SCAD. The process took 2+ weeks. A initial phone Interview. One phone interview. They asked solid questions that were related to the job. But they were very nice.  They told me after one week, I will get the answer. But until two weeks later, I still did not get any feedback.", "Interview Questions": "Tell me a little about yourself"}, {"date": "7 Jul 2015", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Savannah College of Art and Design", "Interview Descriptions": "Phone call followed by an in-person interview with direct boss and boss's boss. It was fairly casual as far as an interview goes and went section by section over my resume. I received a phone call with an offer shortly afterwards.", "Interview Questions": "What web development technologies have you worked with?"}, {"date": "5 Jun 2015", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Savannah College of Art and Design (Savannah, GA)", "Interview Descriptions": "The interview process was extremely painful because they required so many documents that don't seem that necessary. I sometimes really wonder if they look at all documents. You also have to attend a workshop that takes whole day (usually Friday or weekend) which is exhausting and they have a current RA evaluating you.", "Interview Questions": "N/A"}, {"date": "9 Aug 2018", "title": "Art Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Savannah College of Art and Design in Jun 2015", "Interview Descriptions": "Too many steps to the process and very slow to respond. Took 3 months total from start to finish and long gaps of not hearing anything back. Not good at describing the actual benefits you will receive. Very miss leading.", "Interview Questions": "Tell me about your current role."}, {"date": "9 Jun 2015", "title": "Researcher/Writer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Savannah College of Art and Design (Savannah, GA) in Jun 2015", "Interview Descriptions": "First, I was asked to do a standard phone interview with someone in the HR department. Second, I had a Skype interview with the HR representative and someone from the department that was filling the position. Next, I was asked to submit a writing sample based on a prompt that the HR representative sent me. Finally, I was asked to travel to an in-person interview in Savannah. \r\n\r\nI would say that overall, the experience was very informal. During the lunch/in-person interview, those on the hiring committee cursed (not heavily, but enough for me to note it).", "Interview Questions": "Q: How do you work on a project that doesn't interest you?"}, {"date": "8 Apr 2015", "title": "Research Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Savannah College of Art and Design", "Interview Descriptions": "Ridiculous. Slowest process ever over  months. 4 interviews, lunch interview and an offer. I wanted to negotiate parts of my contract, and suddenly had the offer rejected by an HR rep I had never met with or spoken to during the entire process. No explanation or reasoning. What a joke. Completely unprofessional.", "Interview Questions": "Describe how you organize a work load that seems unmanageable"}, {"date": "9 Jul 2015", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Savannah College of Art and Design (Montpelier, VT) in Apr 2015", "Interview Descriptions": "The process started as a phone call by HR to set up a time. She told me one time, and then emailed me a confirmation of a different time. I emailed back with no response. Since the interview was through skype, I waited around for almost an hour. once they finally called in, the questions were very scripted, it was not conversational.", "Interview Questions": "Why would you tell a student to come to SCAD?"}, {"date": "3 May 2015", "title": "Motion Graphics Artist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Savannah College of Art and Design (Savannah, GA) in Apr 2015", "Interview Descriptions": "Last more than thirty minutes and asked a lot very professional questions. It was very interesting, and insightful. It was ok during the process. They were very interested in my internship experience and asked a lot about that.", "Interview Questions": "Could you tell your background"}, {"date": "6 Oct 2015", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Savannah College of Art and Design (Savannah, GA) in Mar 2015", "Interview Descriptions": "The interview process took place over two days. The first day was in person individual interviews with resident directors and community assistants. It involved questions, responses, and turning in supplemental materials that were asked to be brought. The second day was groups processing where we worked with other potential hires to see how we worked together. It involved going to different rooms with different challenges to see how we would react.", "Interview Questions": "Which Residence Hall would you prefer to work at?"}, {"date": "18 Feb 2015", "title": "Librarian Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Savannah College of Art and Design (Savannah, GA) in Feb 2015", "Interview Descriptions": "Everything went pretty smoothly until they asked me to negotiate salary. I must have come across as too bold or too inexperienced with this. They said they were willing to have me think about it for 24-48 hours and get back to them. Early this morning, before I made my decision, I got an email from them saying that they had decided \"not to proceed further with your candidacy.\" Based on the reviews that I got from workers in this school, I am not surprised about their dismissive attitude. It sounds like they did me a favor in the long run as I wouldn't want to work for this exploitative company.", "Interview Questions": "tell me about your salary expectations."}], [{"date": "21 Apr 2016", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Savannah College of Art and Design (Savannah, GA) in Feb 2015", "Interview Descriptions": "Brief and to the point. They will ask some questions that may really stump you, but its important to try to remain calm and patiently think of a decent answer. Answering with something is better than being silent (so long as it's a somewhat intelligent response). Will mostly ask about how you would respond to 'this' or 'that' situation.", "Interview Questions": "What is your method of handling conflict, and can you give an example from your experience?"}, {"date": "7 Dec 2017", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Savannah College of Art and Design (Savannah, GA) in Jan 2015", "Interview Descriptions": "Typical: Presented to a class, toured facilities, interviewed with Dean, Dept Chair and HR staff. Had lunch with Dean and coffee with faculty. The facilities on the campus tour were impressive, all staff were prepared and helpful answering questions, and it had a great energy. All was well organized.", "Interview Questions": "Why do you want to join SCAD?\r\nWhich classes would be good fit for you to teach?\r\nWhat is relationship to the profession, business contact, how do you stay relevant.\r\nNothing unusual."}, {"date": "2 Jun 2016", "title": "Career Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Savannah College of Art and Design (Savannah, GA) in Jan 2015", "Interview Descriptions": "Phone screening and panel interview. Human resources staff member and three career advisors were in the interview. Tough interview questions. Well experienced for the position but did not receive it. More experience than those interviewing me. Some members were Snobby and self absorbed. Quick response that was within days from phone screen to interview and results.", "Interview Questions": "How do you like to be managed?"}, {"date": "19 Dec 2014", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Savannah College of Art and Design", "Interview Descriptions": "I applied on line with a resume and cover letter. I was contacted by HR for a group interview.I was called in for an interview with 4 employees. They were very nice. We discussed what the position entails and what my daily job functions would be.  Overall it was a great interview and I would recommend anyone to apply.", "Interview Questions": "They wanted to know my back ground and what I had experience in."}, {"date": "31 Oct 2015", "title": "Communications/Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Savannah College of Art and Design (Savannah, GA) in Dec 2014", "Interview Descriptions": "The process took about six weeks, and included a phone, Skype, and in person interview. The phone interview was with the recruiter, the Skype included my potential boss and her boss, and the in person was with the recruiter and my boss.", "Interview Questions": "What attracted me to SCAD."}, {"date": "21 Nov 2015", "title": "Admission Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Savannah College of Art and Design (Savannah, GA) in Nov 2014", "Interview Descriptions": "It starts with a call from human resources, then a call with your boss and immediate supervisor, then an interview with the assistant director of admissions, and finally an interview with the director of admissions", "Interview Questions": "10 minute presentation about the school"}, {"date": "20 Oct 2014", "title": "Clc Visual Developer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Savannah College of Art and Design", "Interview Descriptions": "Just simple process. Question 1: Tell me about yourself.Question 2: What is your strength? Question 3: What is your weakness? Question 4: Why do you think you can qualify this job? The lady was very friendly and I feel no pressure at all. And after interview, she even showed me around and showed the kitchen to me and gave me a bottle of water.", "Interview Questions": "N/A"}, {"date": "8 May 2018", "title": "Front Desk Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Savannah College of Art and Design (Savannah, GA) in Jun 2014", "Interview Descriptions": "This was for a work-study part-time position. I applied through the student portal and got contacted to come in for an interview. It was quick and not as stressful as I was expecting it to be.", "Interview Questions": "What does being punctual mean to you?"}, {"date": "19 Aug 2015", "title": "Senior Producer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Savannah College of Art and Design (Atlanta, GA) in Apr 2014", "Interview Descriptions": "Phone interview followed by an in-person interview with a recruiter. Directions to the facility were very poor and I had to park and ask directions from students how to get into the building. Had a very positive interview with a recruiter who assured me I was well-qualified and encouraged me to contact her to inquire about the status of the position. She never returned my calls.", "Interview Questions": "What would I bring to a new team for Video Production?"}, {"date": "6 Oct 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Savannah College of Art and Design (Savannah, GA) in Apr 2014", "Interview Descriptions": "I interviewed once via Skype and once in person. They were hiring for two different departments, so I met with both. Then they asked me which I would rather end up with, which was the one I ended up working for. My only complaint was that the time elapsed from final interview to job offer was too long (about 60 days).", "Interview Questions": "How well do you think you will work in a team?"}], [{"date": "7 Sept 2015", "title": "GM - SCAD Radio Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Savannah College of Art and Design (Savannah, GA) in Feb 2014", "Interview Descriptions": "Met with former GM and Student Media Adviser to interview for position. It was a relatively laid-back interview, with questions one would expect to be asked. If you're familiar with the station at all and passionate about advancing it, the interview should be a piece of cake.", "Interview Questions": "What opportunities do you think there are for SCAD Radio to collaborate?"}, {"date": "13 Aug 2017", "title": "Mobility Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Savannah College of Art and Design (Savannah, GA) in Feb 2014", "Interview Descriptions": "Interview process was very informal but professional.  It contained a on-line application and an multiple  interviewing panel for possible candidates in order to analyze their potential. The manner of the interviewing was a first step in order to conclude with the final one, based on the meet and greet of the actual student that I was going to work with in order to assist them.", "Interview Questions": "How would you approach a student with physical disabilities in need of assistance?"}, {"date": "17 Mar 2014", "title": "Admission Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Savannah College of Art and Design (Atlanta, GA) in Jan 2014", "Interview Descriptions": "After I applied online, I was asked to a phone interview.  It was 20-30 minutes long and very positive--the HR person was very friendly and also answered my questions very openly.  I was then asked for an in-person interview, which involved the admissions director and the same HR person. The questions were pretty easy in that they were the typical interview questions, so if you are prepared for those, you should be fine.  Then, I was asked for another in person interview with another HR person and the VP of admissions. I had to do a presentation, and the interview was a bit more awkward than the other two--sometimes repetitive, unclear questions were asked, and I wasn't sure exactly what they were asking or how to respond.  Still, the people were very friendly, and made sure to emphasize aspects of the job that would not be ideal for some people.", "Interview Questions": "Why should a student come to SCAD in particular?"}, {"date": "23 Feb 2016", "title": "SCAD Moa Docent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Savannah College of Art and Design (Savannah, GA) in Jan 2014", "Interview Descriptions": "Interviewed with the operations manager, first send resume and cover letter and received follow up email for an in person interview. The interview was right next to the museum, and it lasted for approximately 30 minutes. We discussed my education focus and then linked it to why I was interested in this opportunity as a docent.", "Interview Questions": "Asked me about prior experiences - failures and successes in projects. Also talked about former jobs and experiences that I could describe, highlights and low points - things that I have learned. The last part of the interview was about the Museum, questions like what my favorite exhibition had been and why I was seeking this position as a docent."}, {"date": "2 Mar 2014", "title": "English Language Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Savannah College of Art and Design (Savannah, GA) in Sept 2013", "Interview Descriptions": "I just sent in a resumé and was asked to interview.", "Interview Questions": "How would you deal with a student with absolutely no English skills whatsoever?"}, {"date": "11 Apr 2013", "title": "6-Month Program Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Savannah College of Art and Design", "Interview Descriptions": "I found this position through the college website. I got an e-mail from them offering to meet with me for an interview. I told them that I was interested and went in for an interview. It was quite interesting because the guy came out and asked me to fill out a four page personality test. He told me there are no wrong answers, so I just took my time and tried to fill it out to the best of my abilities. It was quiet while I was doing this, so it felt a little bit awkward. There were two people for the interview, and they seemed pretty relaxed and very kind. After I finished they just asked me to talk a little about myself, my strengths and weaknesses, some examples of how I solved some difficult problems, and whether I had any questions about the school or position. Overall, it wasn't a bad interview and the interviewers were very kind and attentive. I haven't heard back from them, but I don't think I really made an impression on them. It's difficult to make an impression on them in 30 minutes. I think it's important to show that you're adaptable in a fast paced environment and you're creative.", "Interview Questions": "Give an example when you creatively solved a problem. "}, {"date": "1 Mar 2013", "title": "Professor of Animation Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Savannah College of Art and Design (Savannah, GA)", "Interview Descriptions": "I was a graduating student with my MFA. My interview process was not that elaborate, since I was considered an internal candidate.", "Interview Questions": "Why do you want to stay and work here at the Savannah College of Art and Design."}, {"date": "7 Apr 2014", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Savannah College of Art and Design (Savannah, GA) in Feb 2013", "Interview Descriptions": "The process starts through the colleges online hiring website, where the applicant is required to provide a resume and then to follow up by signing up for an interview. (Note: The position of Resident Assistant is only hired for in February and March, there are exceptions to the rule like applying for a position in the summer after working for either the Summer Seminars Assistant Position or the Rising Stars Assistant position) On the day of the interview you are required to bring a printed version of your resume and a cover letter. They recommend bring a program or bulletin board guide and a series of question but they don't really care. You will be interviewed by two people one current staff member in the Resident Assistant position and then by a Full time Savannah College of Art and Design employee. The second part of the process happens one or two weeks later and its called Group Process and its purpose is to see how you work in a team environment and to test how your disposition as a leader.", "Interview Questions": "The question don't matter, the answers do. Target your answer towards creating community, encouraging self improvement, promoting cultural diversity and your previous leadership roles. as long as you have a couple anecdotes for these target areas you are good. As for Group Process I have been an interviewer in the past and what really mattered that you could talk casually and clearly, it also helps that you don't say anything anti-semitic, sexist, racist, or discriminatory in any other facility because you may as well just throw away your chances of getting a job right there."}, {"date": "21 Jan 2016", "title": "Graduate Mentor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Savannah College of Art and Design (Savannah, GA) in Dec 2012", "Interview Descriptions": "the interview process was easy, I went to their office and asked for an interview time. for the interview day, they looked at my resume and asked a few questions about my skills and experiences. They mentioned that it is good that i already have experience working with children.", "Interview Questions": "all the questions were casual, nothing difficult"}, {"date": "9 Feb 2016", "title": "Professor of Design Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 6 days. I interviewed at Savannah College of Art and Design (Atlanta, GA) in May 2012", "Interview Descriptions": "We sat in a room around a table with the Chair, the Dean, the VP, and two people from the Savannah Campus. They asked basic questions about me and my experience.They also wanted to have me offer problem solving questions.", "Interview Questions": "What courses could I teach?"}], [{"date": "16 Jun 2013", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Savannah College of Art and Design (Savannah, GA) in Mar 2012", "Interview Descriptions": "The process was very simple and easy going.", "Interview Questions": "It was a rather simple interview. The questions were very answerable and none of them really caught me off guard."}, {"date": "5 Jul 2012", "title": "Model Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Savannah College of Art and Design (Savannah, GA) in Jan 2012", "Interview Descriptions": "Three or four people were involved in the interview, all from HR I think. They basically asked about my previous experience, my availability, and my reasons for wanting to model. There was never a request for a photo or anything before they met me and they didn't need references. I think they basically wanted to make sure I wasn't a gross pervert and that I would show up on time--what else do you really need to ask an artists' model?", "Interview Questions": "What first appealed to you about being a model?"}, {"date": "10 Jul 2013", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Savannah College of Art and Design (Savannah, GA) in Nov 2011", "Interview Descriptions": "Quick process.  Great communication flow.  Clear and forthcoming.  Panel interview which includes another prof in the dept, the chair, the dean, the recruiter and the head of HR.", "Interview Questions": "How will you reach students that seem to be in trouble."}, {"date": "13 Aug 2015", "title": "Shop Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Savannah College of Art and Design (Savannah, GA) in Sept 2011", "Interview Descriptions": "Very professional interview.  Interviewers were serious but not over bearing.  Questions were straight forward.  No trick questions.  Dress was business casual.  Interview was held at HR building at a certain time.  They were very secure in the interview process and had some one examining the interview from the HR department.  Since it was a part time position there was not a lot of experience questions but mostly related to my previous education.  Required me to at least be able to lift 50lbs.  Thats really about it.  They let me know later that day that I was hired.", "Interview Questions": "What is my experience with machining?\r\nCan you use illustrator?\r\nDo you mind cleaning up messes?"}, {"date": "9 Dec 2013", "title": "Advancement Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Savannah College of Art and Design (Savannah, GA) in Apr 2011", "Interview Descriptions": "I was reached by phone call.  Asked to come in for interview. Panel interview (5 people).  Asked typical questions.", "Interview Questions": "They were all expected questions"}, {"date": "10 Jun 2011", "title": "Career Adviser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 months. I interviewed at Savannah College of Art and Design (Savannah, GA) in Mar 2011", "Interview Descriptions": "I networked my way into SCAD which resulted in an immediate review of my cover letter & resume & a prompt invitation to interview with an HR rep & the Associate Vice President of my now department. That being said, it still took months of waiting, following up, & a great deal of patience before I was invited to my second interview which was a 1:1 lunch with the a fore mentioned Associate VP. My understanding is that this waiting period is fairly typical. However the HR Rep & my now boss were & still are a dream team come true.", "Interview Questions": "Most of the interview revolved around discussion of the ideal academic environment; how best to guide, teach, advise, & work with a diverse & large group of people."}, {"date": "18 Oct 2015", "title": "Professor, Business Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Savannah College of Art and Design (Atlanta, GA) in Mar 2011", "Interview Descriptions": "Detailed with multiple people as well as lecture to students; started with phone interview then progressed to multiple people and video conference. Took a series of interviews to progress. Looking for both paper qualifications and personal presence.", "Interview Questions": "Why do you want to work for SCAD?"}, {"date": "17 Jun 2013", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Savannah College of Art and Design (Savannah, GA) in Jan 2011", "Interview Descriptions": "Involves one simple interview with the director of the Academic Resource Center. Mainly involves past experience, class performance, and personality review.", "Interview Questions": "There were not really tricky questions, given that personality and overall subject understanding is critical."}, {"date": "11 Nov 2010", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Savannah College of Art and Design (Savannah, GA) in Sept 2010", "Interview Descriptions": "2 interviews with hiring manager and dircetors", "Interview Questions": "A receptionist position pays a lot less than what you're used to, why are you applying for this job?"}, {"date": "10 Jun 2009", "title": "Professor of Foundation Studies Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Savannah College of Art and Design (Savannah, GA) in Mar 2009", "Interview Descriptions": "annual performance evaluation", "Interview Questions": "Teaching Effectiveness"}], [{"date": "14 Feb 2013", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Savannah College of Art and Design (Savannah, GA) in Feb 2009", "Interview Descriptions": "The interview process was fairly straight forward. I met with a small group of interviewers that asked me many of the standard fare questions. It was very easy-going and - for the most part - informal.", "Interview Questions": "Name a time where you were forced to enforce a rule or guideline that you, personally, didn't believe in."}]]