[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "technical support review", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Jun 2023", "job_title": "Technical Support Specialist in San Francisco, CA", "duration": "N/A", "pros": "Remote, and the most understanding team ever", "cons": "can't think of any cons"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "-", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "25 Dec 2022", "job_title": "Work Study Student in San Francisco, CA", "duration": "N/A", "pros": "Very friendly opportunity to learn", "cons": "No cons to my knowledge"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Inspiring mission", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Jun 2022", "job_title": "Business Development Representative in San Francisco, CA", "duration": "N/A", "pros": "Flexible work hours \nFully remote global team\nLots of work autonomy \nWorking towards a great mission \nFriendly and smart colleagues", "cons": "Business model is a bit unclear \nFully remote global team - no office space, face-to-face interaction, scheduling difficulties \nCompensation not as competitive"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Mission driven company - amazing team", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "2 Feb 2021", "job_title": "Senior Software Engineer in San Francisco, CA", "duration": "N/A", "pros": "I have had the chance to see the company more than double in size since I joined and it has been amazing to see how much everyone cares deeply about the future of education and Minerva's mission. Having Minerva Schools and Minerva Project working side by side has allowed the company to build a solid foundation and they can now leverage those learnings to support new partners very effectively.\r\n\r\nJust like many companies facing a quick growth, there were bumps on the road during the transition, but I think leadership has been very open and receptive to feedback which has helped going over the hump. Now things feel more mature, teams are better organized, the company is in a great position to move forward and accelerate its development.\r\n\r\nThe product team is still small (~20 people) but extremely competent! Even though people have areas of expertise, everybody is full-stack and gets to wear many hats. The team is diverse, distributed across the US, Europe and Middle East, and very remote friendly. There is a lot of trust and support from the managers and they really try their best to help you grow your technical and soft skills.\r\n\r\nOver the past year, there has been a tremendous effort to update the tech stack to newer technology, from the frontend (migrating Backbone to React), to the backend (migrating all services to python 3), and infrastructure (moving from opsworks to kubernetes). A lot of automation and code quality improvements have been put in place as well and engineers actively engage in weekly meetings for knowledge sharing and technology centered discussions.", "cons": "Having a small team lets you grow your skills in multiple directions and at a pretty fast pace, but the downside is that the number of roles is limited (for now). Another issue with having a small team and a quickly growing business, is that some things don't scale very well. For example, it's hard to keep up with new bugs and features while staying on track with planned work.\r\n\r\nSince COVID, even though things like \"donut\" on slack have been put in place to facilitate meeting new people in the organization, it's harder to create tight bonds with other teams like it used to be possible to when everybody was gathering at the yearly all company event."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good Experience", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Jul 2021", "job_title": "Business Development Representative in San Francisco, CA", "duration": "N/A", "pros": "Good Impact and mission for the company", "cons": "By far I have not had any major cons"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Work Experience", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Apr 2021", "job_title": "IT Specialist in San Francisco, CA", "duration": "N/A", "pros": "It is very well structured. Started with a small team and grew to a bigger one.", "cons": "None that I can think of at the moment."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Summer Intern", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "19 Jan 2021", "job_title": "Intern", "duration": "N/A", "pros": "Flexible hours, great manager to work with", "cons": "None that I can think of for interns"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great work environment", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Nov 2020", "job_title": "Curriculum Developer in San Francisco, CA", "duration": "N/A", "pros": "- Relaxing\r\n- Flexible time\r\n- Cool collegues", "cons": "- Have to be super flexible with weird time zones"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Mission-driven company, supportive environment, growth and challenge", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "4 Mar 2019", "job_title": "Engineering Manager in San Francisco, CA", "duration": "N/A", "pros": "Having worked at Minerva for >5 years I've gotten to see it in a variety of stages of development. As we've transitioned from audacious idea and scrappy startup into early maturity, there have been opportunities to wear a wide variety of hats, to take on a lot of responsibility, and to grow professionally as a result. I've enjoyed being pushed to grow by a super talented group of engineers, PMs, and designers, as well as in my cross-functional work with incredibly sharp and thoughtful coworkers on other teams.\r\n\r\nWorking with students in a variety of contexts had been stimulating - I've gotten the opportunity to work with students in technical work-study positions, to manage student teams  during summer internships, participate in student events, and share career advice with some of our soon-to-be-graduates.\r\n\r\nGetting to dogfood Minerva classes (e.g. currently trialing a forthcoming management and complexity science course aimed at graduate and professional levels) is awesome.\r\n\r\nIt's been incredibly satisfying seeing the hypotheses about better higher education come to fruition as we went from no students to graduating our first class. My experience on the Product (engineering) team have been one characterized by a surprising amount of stability and work/life balance compared to other companies I've seen peers at during a similar point in company development. I've also gotten the pleasure of working with teammates for an a period of time that's unusual in Silicon Valley startup land - roughly one quarter of the Product team over time had tenures of over 4 years, and the average tenure is a little over 3 years (including folks who were hired fewer than 3 years ago).", "cons": "The transition from scrappy startup to mature organization wasn't always smooth. It was a challenge to move from a colocated company to a distributed one, and we had to develop skills and structures (remote-first, more async communication, more proactive checkin on the part of management) along the. Staffing levels have been a concern for various teams at various times -- as we built a university from scratch we didn't always predict staffing needs accurately and this required people to stretch to cover student needs. I think that the experience of folks on the Product (engineering) about sustainable work pace and work/life balance are not reflective of the experiences that others have had."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Meaningful job with amazing team", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Aug 2019", "job_title": "Senior Engineer in San Francisco, CA", "duration": "N/A", "pros": "Having followed the educational technology industry for many years, I can confidently say that Minerva is one of the few companies that deeply care about improving student learning - on the one hand boldly believing that they can do far better than even elite universities currently do, on the other hand being humble enough to realise that we have much to learn and that success comes from strong first principles, and then an ongoing process of continuous improvement. I have been very impressed by how closely engineers and product managers work with curriculum developers and students to create more engaging experiences.\r\n\r\nThe engineering team is very diverse, highly remote-friendly, and consists of people who are both technically very strong, but also all motivated by the mission of Minerva. We work very closely with faculty, students and partners, and are able to have a lot of input into feature design, technical approaches and execution. Product team is only about 25 people, so nobody is \"just a number\", everyone have their unique skills and approaches to contribute, and my manager has been very supportive in thinking about how to grow and develop, not just as an engineer. Communication in the whole organization (almost 180 people at this time) is very fluid and open, and we often get to interact with faculty teams, but also student experience, strategic partnerships etc.", "cons": "There is a fair amount of technical debt, and a lot of the stack is based on old technology (Backbone, Django DRF), although that is slowly changing. We are very proactive about testing, but engineers often have to jump in and help with escalated issues - while it's good to see firsthand the pain points of customers, I hope we can get to a point where we will feel more confident in the code. Part of the reason, apart from the old code, is that we're currently expanding from our main partner (Minerva Schools) to a number of new partners, each requiring a fair amount of customization etc as we work on \"crossing the chasm\"."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Best Job I've Ever Had", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Sept 2018", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "The people I get to work with everyday are incredible— whip-smart, super competent, professional, kind, thoughtful and humble.\r\n \r\nThe mission is highly rewarding and we get an up-close view of how our daily work impacts our students.  These interactions remind us that our work truly matters and keeps the company from drifting too far into empty \"save the world\" promises and echo-chamber thinking that afflicts other startups.\r\n\r\nWork/life balance and remote-first culture are best in class. \r\n\r\nThe highly intentional culture of learning for the students infuses the company and vice versa.", "cons": "Growing pains— in accomplishing big things the company has difficult tradeoffs to make."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Could not be happier", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 May 2016", "job_title": "Software Engineer in San Francisco, CA", "duration": "N/A", "pros": "Amazing culture of sharing knowledge\r\nCan't beat the mission\r\nWork-life balance\r\nVery strong team\r\nThe product WORKS.", "cons": "Still lots of issues to work out, especially with student experience."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Terrible culture if you're not in product, senior leadership doesn't take feedback", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Apr 2018", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "- The mission and students. Damn, the stuff we've put up with because we love 'em.\n- A few really nice colleagues", "cons": "- Culture of overworking\n- Not enough staffing\n- Retention and growth are not valued\n- Pay is not competitive\n- Undefined promotion or career growth track\n- No clearly defined boundaries — you are expected to do things that are not your job and robably work overtime to do it"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Tech Team", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Apr 2018", "job_title": "Tech Team Lead in San Francisco, CA", "duration": "N/A", "pros": "Flexible work Time, remote work, It was generally easy.", "cons": "Insanely Low pay, Lack of proper supervision and Training."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Fascinating mission; fantastic place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Feb 2020", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "I loved my time at Minerva. Endlessly engaging mission. The students are diverse and brilliant.", "cons": "pay is a bit on the low side"}]]