[[{"date": "10 Dec 2019", "title": "Housing Stability Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Hamilton Families (San Francisco, CA) in Apr 2019", "Interview Descriptions": "It was a three-step interview process that was fairly straightforward. First, there was an interview with a coordinator, then with the program director. Then a final screening post-reference check.", "Interview Questions": "How does your experience make you prepared for this job?"}, {"date": "3 Jul 2018", "title": "Stability Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2 months. I interviewed at Hamilton Families", "Interview Descriptions": "1st is phone interview which just asks about case management experience and why you want to work for organization. after that they will schedule second interview and basically ask you about 15 basic questions regarding position. then you will go in for final interview. if they are doing reference checks you have the job. interview and hiring process is longer than needs to be,, but dont worry if you dont hear from them after 2 weeks decisions take a long time to make at his organization...", "Interview Questions": "How many years of case management experience do you have? "}, {"date": "25 Jul 2018", "title": "Chief of Staff Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hamilton Families (San Francisco, CA) in Jun 2018", "Interview Descriptions": "*as an internal applicant* Completed an online application, and within 48 hours was called to schedule a phone interview. After completing the phone interview, was told I would hear within 7 business days about scheduling an in-person interview. Was contacted in 5 business days for an in-person 1st round interview (for 2 days in the future). Completed the 1st round in-person interview and was told I would hear about next steps (Round 2 or not moving forward). I did/have not heard anything since despite reaching out twice to the HR person assigned to this requisition. It has been more than 4 weeks at this point.", "Interview Questions": "How do you define excellence?"}, {"date": "19 Nov 2017", "title": "Management Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Hamilton Families", "Interview Descriptions": "The interview was great and I enjoyed the process. However, I never heard from the agency afterwards, which really surprised me. When I've been involved in hiring, we ALWAYS contacted people we had interviewed. And I find it quite odd and, frankly, unprofessional that they did not.", "Interview Questions": "detailed questions about my management experience"}], []]