[[{"date": "26 Apr 2023", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ford Foundation (New York, NY)", "Interview Descriptions": "The process consisted of a few round of interviews, and an excel, word and PowerPoint assessment. Everyone I interviewed with was lovely. I got to the final round of interviews and interviewed with a few people at the same time. The final interview was very promising and I thought I would get the job—but didn’t.", "Interview Questions": "What are your strengths? How would you balance competing tasks?"}, {"date": "9 Feb 2023", "title": "Economic Development Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ford Foundation", "Interview Descriptions": "This was a phone interview. The interviewer was rude and abrasive. I ended up declining moving forward given that she was an indicator about how bad it would be to work there.", "Interview Questions": "What makes you qualified for this role?"}, {"date": "25 Jan 2023", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ford Foundation", "Interview Descriptions": "The interview process had several stages. The first interviews were with a HR firm. The second interview with a staff within Ford Foundation. The third interview was with the hiring manager. The fourth interview was with a senior staff member. A competence task was also done.", "Interview Questions": "Tell me about your self?"}, {"date": "25 Oct 2022", "title": "Gallery Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ford Foundation", "Interview Descriptions": "3 interview process all video call meeting with different people in the department. First was the HR manager, then the director, and then the assistant director of the gallery. All were very friendly and more of a conversation that interview.", "Interview Questions": "The main question was why I wanted to work at the Ford Foundation"}, {"date": "24 Aug 2022", "title": "Special Events Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ford Foundation", "Interview Descriptions": "Dragged me along for 4+ interviews from August to October and I had to call each time for an update, including to hear that they had gone with another candidate.", "Interview Questions": "Typical interview questions, nothing was overly challenging, other than I had to answer these questions multiple times, often to the same person."}, {"date": "15 Apr 2022", "title": "Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ford Foundation", "Interview Descriptions": "Application through website portal. The process was well organized and consistent.  Several rounds.  Meetings with various representatives from HR, department, other staff members.  provided detailed information on benefits and other perks available.", "Interview Questions": "standard, industry, related, salary, experience"}, {"date": "14 Apr 2022", "title": "Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ford Foundation", "Interview Descriptions": "The HR and interview process was quite smooth and I appreciated their professionalism. No questions were out of left field and I felt really taken care of by the HR professional on their team.", "Interview Questions": "Very specific role related work and goals for the future. It was much more of a free flowing conversation than me being grilled. "}, {"date": "2 Sept 2022", "title": "Strategic Communications Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ford Foundation (New York, NY) in Apr 2022", "Interview Descriptions": "Scheduled a phone screening with the HR rep via Calendly. The interview occurred over Zoom. The HR manager asked me questions about my current role and my job history. Then I was told the next step would be to meet with the team lead.", "Interview Questions": "Q: Can you explain the job changes reflected in your resume? It appears you have moved around. We are looking for someone who will be at the organization for the long haul. "}, {"date": "18 Nov 2021", "title": "Regional Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ford Foundation (New York, NY) in Sept 2021", "Interview Descriptions": "Interviewer identified it as a pre-interview/chat and then gave solid interview questions for about an hour. So I hadn't prepared for a full interview. Also,  it was very rushed...as if they already had a candidate in mind and merely wanted to show they had gone through a process.", "Interview Questions": "What successes have you had in Gender Programming"}, {"date": "21 Apr 2021", "title": "Summer Internship Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ford Foundation", "Interview Descriptions": "Phone-call with a recruiter, and then Google Hangouts Video interview with department that you successfully fell into. The interview process was pretty laid-back and the people you speak with are very nice.", "Interview Questions": "How did you hear about the Ford Foundation?"}], [{"date": "23 Feb 2021", "title": "Convening Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Ford Foundation (New York, NY)", "Interview Descriptions": "I received an email from an HR person to set up a time to speak over Zoom. Once on the Zoom, the HR person led me through a variety of questions, and then left room for my questions. Overall, it was a very pleasant conversation about the role.", "Interview Questions": "They asked me to describe a time I received feedback in a job and how I responded to that."}, {"date": "14 Apr 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ford Foundation (New York, NY) in Feb 2021", "Interview Descriptions": "Talked with  analyst(s) for a 30 minute phone discussion which was very basic going over the role and what I wanted to gain from it , then talked with HR on the phone for 30 minutes as well, but s/he only inquired about the initial phone discussion and how that went, not asking in depth questions about me, I didn't progress further after my rejection letter.", "Interview Questions": "What do you do at your current role?\nHow was the first call?"}, {"date": "12 Dec 2020", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ford Foundation", "Interview Descriptions": "Applied online in August, received an interview request within a week. Interviewed with an HR rep and was told I would hear back on next steps within two weeks. Followed up after two weeks and they said they were delayed due to COVID. Followed up again and never heard anything, one way or the other, was completely ghosted.", "Interview Questions": "Walk me through your resume. "}, {"date": "11 Jun 2021", "title": "Digital Experience Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at Ford Foundation in Nov 2020", "Interview Descriptions": "My interviews were during the pandemic, so they took place over Google meet. The first interview was an HR screening, the second interview was over 6 months later with four team members. Although I was told I was a finalist, no one reached out to me after the second interview. I emailed HR for an update and did not get a response. Although that was frustrating,  I would still be excited to submit an application to another opportunity since I love the work that Ford does.", "Interview Questions": "If you have experience in accessibility design, this would be a huge plus for the interview. Ford is really committed to improving in this area."}, {"date": "7 Jun 2018", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ford Foundation", "Interview Descriptions": "Friendly office staff and interviewer.  Had the option to conduct the interview via phone call or in-person at their New York office. Behavioral interview aimed at really getting to know the applicant.  Make sure you fill all requirements of internship before applying.", "Interview Questions": "How did you hear about the Ford Foundation?"}, {"date": "6 Apr 2018", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ford Foundation", "Interview Descriptions": "It was thorough in wanting to understand who I am and what I stand for. Also asked about why I was interested in it and where my interests lie.", "Interview Questions": "What drives you?"}, {"date": "4 Apr 2019", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ford Foundation (New York, NY) in Mar 2018", "Interview Descriptions": "The interview process was fairly long with multiple rounds of interview.  The interviews themselves were fine and the staff were very nice. However after the interview, they were nonrespondent to any correspondence even when I was told that I would hear from them.", "Interview Questions": "Where do you see yourself in 5 years? "}, {"date": "14 Jun 2019", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ford Foundation (New York, NY) in Mar 2018", "Interview Descriptions": "First round was a Skype Interview and the second round was an in person interview with two people in charge.  It was very relaxed and professional.  They were nice to reschedule my interview last minute due to train delays.", "Interview Questions": "Tell me something about yourself. "}, {"date": "19 May 2017", "title": "Accounting/Finance Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ford Foundation", "Interview Descriptions": "Had a brief interview with someone from HR that went fine. Got a callback 2 weeks later to interview with the manager. During the interview when I was talking about my aspirations he told me that I'm \"overqualified\" for the internship position even though I only had volunteering tax experience. Also, they kept telling me they would get back to me with a response the next week every time I emailed them. Eventually got fed up with their stalling and called in to find out they moved on with another candidate.", "Interview Questions": "Tell me about yourself"}, {"date": "25 Mar 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Ford Foundation (New York, NY) in Apr 2017", "Interview Descriptions": "1st Interview: Basic, initial skype interview with HR representative (Occurred in Early April)\r\n(office was shortstaffed so the initial interview was rescheduled multiple times)\r\n\r\n2nd Interview: Interviewed by 2 people from the department that ended up hiring me (Occurred in late April)", "Interview Questions": "Why do you want to work here?"}], [{"date": "13 Oct 2016", "title": "Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Ford Foundation (New York, NY)", "Interview Descriptions": "Applied on line. One screening interview with a recruiter. Another phone interview with department head. 2nd round interview with similar departments and potential co-workers.  Consistent communication from the recruiter. Friendly interview process. Not a lot of materials provided into review prior to the interview so I had to a lot of my own investigation into their funding and programs.", "Interview Questions": "What is your salary expectations?"}, {"date": "26 Dec 2015", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Ford Foundation (New York, NY) in Apr 2015", "Interview Descriptions": "Three separate interviews with a Human Resources staff member, your would-be immediate supervisor, and the head of the department you are applying for. There is also a background check and work sample that is required. Through each step of the process, you must account for any unexpected obstacles and be ready for a time change or technical difficulty that would change a plan.", "Interview Questions": "\"What are your plans five years from now?\""}, {"date": "24 Sept 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ford Foundation (New York, NY) in May 2013", "Interview Descriptions": "Standard. Interview with the HR department first and then the department you are applying for. The questions were very straight forward, beginning with questions about your resume and then about your strengths and weaknesses. After the interview I was sent an online skills assessment to complete. Then a few days later I was given an offer.", "Interview Questions": "List a time when you had to display leadership qualities?"}, {"date": "7 Jul 2012", "title": "Manager Communications Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Ford Foundation (Dhaka) in May 2012", "Interview Descriptions": "I was referred by an ex colleague, the HR manager rang & emailed. The first interview took place with the HR manager and 2 top level team members. They wanted to set up an in house communications  team. This lasted an hour. I was then asked to come back for another interview, with 2 other expat staff members, lasted another hour.", "Interview Questions": "N/A"}, {"date": "16 May 2014", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Ford Foundation (New York, NY) in Apr 2012", "Interview Descriptions": "Initial interview with human resources, then called back to interview with the hiring manager and a staff member. Then I was called back a third time to interview with the CFO and General Counsel.", "Interview Questions": "There were no difficult questions, pretty straight forward, the typical questions about the position and my background."}, {"date": "3 Feb 2014", "title": "Department Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Ford Foundation (New York, NY) in Oct 2011", "Interview Descriptions": "Three interviews and a skills test", "Interview Questions": "All questions were relatively easy and straightforward"}, {"date": "2 Feb 2011", "title": "Summer Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Ford Foundation (New York, NY) in May 2010", "Interview Descriptions": "The first round was a basic 1:1 interview followed by a skills test on a computer testing basic Microsoft software. The second round was with individuals from the specific department you applied to.", "Interview Questions": "Describe a situation where you were presented a challenge and how did you face it."}, {"date": "2 Jun 2014", "title": "Program Associate Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ford Foundation (New York, NY) in Feb 2010", "Interview Descriptions": "It was a very good experience, thorough and professional, they require several rounds of vetting before an offer is extended.  I was able to learn a lot through my questions about the culture of the foundation. I had a tour of the building which is quite lovely.", "Interview Questions": "Where do I want to be in 5 years"}]]