[[{"date": "20 Jul 2023", "title": "Buyer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Provincial Health Services Authority (Burnaby, BC) in May 2023", "Interview Descriptions": "I was interviewed by three people, They were typing as I was talking, and the atmosphere was friendly and formal at the same time. They each asked me questions and it took around half an hour.", "Interview Questions": "Why do you want to work with us and what will you do if a conflict rises or your coworker is difficult to handle, and more questions of how would you react in the situation described. Plus, tell us your weaknesses and strengths."}, {"date": "28 Apr 2023", "title": "Data Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Provincial Health Services Authority (Vancouver, BC)", "Interview Descriptions": "Great process. Very nice interviewers with thorough questions and genuinely interested in hearing what I had to say. It was a two part process, first completing a data entry test and then conducting an interview.", "Interview Questions": "We have to complete a data entry test and receive a minimum score to be able to move forward with interview."}, {"date": "4 Apr 2023", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Provincial Health Services Authority", "Interview Descriptions": "Interview was misleading. Important and relevant information pertaining to the duties of the job were left out (on purpose in my opinion). Job posting and interview were not an accurate representation of the job and management acknowledged this", "Interview Questions": "What software I was familiar with"}, {"date": "18 Apr 2023", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Apr 2023", "Interview Descriptions": "I was an internal candidate so the interview process was straight forward, I received an email to confirm my interest, followed by a zoom interview with a panel of 3 members. I just finished this interview yesterday and expect to hear back by the end of the week. I'm assuming that because I was an internal candidate, I only had to do one round of interviews.", "Interview Questions": "Tell me about a time you had to manage conflicting priorities?"}, {"date": "22 Apr 2023", "title": "Project Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Provincial Health Services Authority in Apr 2023", "Interview Descriptions": "Got reached out by their Talent on Demand. Then after around 2 weeks, I had the second interview with the PM and team lead. Both meetings were around thirty mins.", "Interview Questions": "How do you deal with the situation that you need some infor from the PM but no response?"}, {"date": "28 Mar 2023", "title": "Lab Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Provincial Health Services Authority", "Interview Descriptions": "1 Phone interview, then sent an offer letter. They really needed to hire someone fast during COVID. I was interviewed right away by the person who was the department lead. This person was very professional.", "Interview Questions": "What do you do if you work with someone with a difficult personality?"}, {"date": "17 Mar 2023", "title": "Clinical Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Provincial Health Services Authority", "Interview Descriptions": "After applying, HR called to discuss about availability and general HR questions later called for In-person interview. After attending the interview with manager and Senior Clinical BA. They asked me many questions about my past projects and experiences. Later manager told, you’re over qualified he said there’s another role opening in another team. He said he will refer me to that position. I told him I am interested in the opportunity that open now. I told him I told him I took day off to attend this call. If you know that am over qualified, why I was called for interview? That ended the conversation. Till now I didn’t a call from them. To PHSA management: Being a health care organization that gets paid from public taxes, you should be more responsible and accountable. I feel like I can to some scam company after listing to manager words. To the manager, if his hiring manager thinks that he’s over qualified-he wouldn’t be there to interview me. You should be ashamed of yourself with this attitude. Thanks for opportunity to express.", "Interview Questions": "N/A"}, {"date": "13 Feb 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Provincial Health Services Authority", "Interview Descriptions": "In-person or online interview Panel interview Included basic interview questions plus situational questions It was about 45 min long It started with questions for the interviewee They discussed job requirements at the end", "Interview Questions": "What is something interesting about yourself"}, {"date": "20 Oct 2022", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Provincial Health Services Authority", "Interview Descriptions": "The interview questions assessed both my soft and hard skills as well as my knowledge of key health topics in BC. Overall, the interviewers had fair questions and were willing to answer my questions too", "Interview Questions": "Tell me about yourself ?"}, {"date": "29 Sept 2022", "title": "Safety Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Provincial Health Services Authority", "Interview Descriptions": "Two interviews, first with managers and then managers and department director. They make you complete a workplace health and safety case scenario \r\nStraightforward process. They mainly look for new grads entering the OHS industry.", "Interview Questions": "Workplace health scenarios.\r\nEducation, career development questions. "}], [{"date": "14 Nov 2022", "title": "Medical Laboratory Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Provincial Health Services Authority (Surrey, BC) in Aug 2022", "Interview Descriptions": "It was good I applied for Medical Laboratory Assistant position but I didn't received any response from you for about three weeks after three weeks I received message and I did interview now I am waiting for response from you I hope can received sooner.", "Interview Questions": "Tell me about your self"}, {"date": "8 Jul 2022", "title": "Technical Support Co-Op Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Provincial Health Services Authority", "Interview Descriptions": "The interview was around 30-40mins with HR. Just went through my resume, explained to them about the projects I worked on and answered 5-6 technical behavioral questions like describing a situation where you had to disagree with your college on how to work on your project?.", "Interview Questions": "what will you do if you face a conflict with your co-worker on how to approach or solve a technical problem?"}, {"date": "15 Jun 2022", "title": "Coordinator Special Initiatives Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Provincial Health Services Authority", "Interview Descriptions": "2 interviews, the first interview focusing mostly on behavioural questions and the second interview focusing on ensuring I was a good fit for the organization. It was not really hard as the work was mostly on community engagement.", "Interview Questions": "Conflict in the workplace, how do you manage it?"}, {"date": "29 Jun 2022", "title": "Telecommunications Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Provincial Health Services Authority in Jun 2022", "Interview Descriptions": "Interview was through zoom, I interviewed with two people. Overall it felt more like a conversation at a coffee shop than an interview. Had lots of questions relating to telco terms, and lots of behavioural questions.", "Interview Questions": "Are you good doing multiple tasks at once\r\nExplain a time you had a disagreement with a coworker\r\nHow your resume relates to the job"}, {"date": "12 Feb 2023", "title": "Product Support Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Provincial Health Services Authority in Jun 2022", "Interview Descriptions": "Received an email first about the interview. It was a panel interview with Director, Manager, Senior Developer and another Senior Analyst. Received an offer after a month and a half.", "Interview Questions": "Describe your relationship with internal and external stakeholders. How do you maintain a work-life balance? Multitasking and working under pressure Decision making SQL and Power Bi Skills"}, {"date": "5 Apr 2022", "title": "Project Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Provincial Health Services Authority", "Interview Descriptions": "Overall process is almost a month & half , very slow unnecessarily but Interview process was a panel interview with 3 persons via zoom. Later on requested references , but I have to turn it down as they took such a long time and a follow up call. \r\n\r\nI felt that they weren't that serious about hiring , after even following up with references they were taking so long , manager called me up after a week of following up with references ..saying they'll finalize the decision soon and I had to mention that I have been applying to multiple positions and giving interviews. \r\n\r\nI didn't heard back from them and only after a month they sent me email. It's interesting that, during this time they think candidates are sitting ideal and waiting for their response and then companies are curious about the career gaps as well.", "Interview Questions": "It was entirely based on work experience and situation based Q's . "}, {"date": "5 Apr 2022", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Provincial Health Services Authority", "Interview Descriptions": "virtual interview that was held by the senior manager, project manager, director for ehealth services team.  There was only one interview held and it was for a temporary role with talent on demand.", "Interview Questions": "why do you want to work here?"}, {"date": "28 Mar 2022", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Provincial Health Services Authority", "Interview Descriptions": "Hired through Talent on Demand. Simple one-on-one interview. It was to be hired within Talent on Demand. Once there is a placement within PHSA available, you have to interview for that placement with the department/program manager.", "Interview Questions": "Why do you want this job?"}, {"date": "16 Feb 2022", "title": "Windows Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Provincial Health Services Authority", "Interview Descriptions": "Interview consisted of Hiring Manager and multiple senior team members. A fake friendliness to the introductions, and overall seemed unpleasant to interview with. Threw me off immensely and I left with zero interest hoping I heard back from them.", "Interview Questions": "I don't remember the questions"}, {"date": "5 Jan 2022", "title": "Software Developer Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Provincial Health Services Authority", "Interview Descriptions": "HR scheduled interview with interviewers but forgot to notify me about the interview time. Recruiter told me to hop on zoom within 5 minutes. Interview process was average, but I felt like the interviewers were not the one who read my resume since they want a person who knows AI. Nothing on my resume mentioned AI-related stuff.", "Interview Questions": "Please tell me about yourself"}], [{"date": "7 Jan 2022", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Dec 2021", "Interview Descriptions": "Round 1:\r\n40-minute one-on-one phone call with someone from HR. They were very friendly and made the conversation relaxed. They effectively communicated the way PHSA's recruitment works and guided me through the next steps with transparency - I was very impressed.\r\n\r\nRound 2:\r\nOne-hour zoom call with the Project Manager I would be working with and a Director. They had about 20mins of questions prepared, but the rest of the time was filled with my questions and some back and forth conversation. Communication on the next steps was again very clear.\r\n\r\nFollowing the 2nd interview, the HR team did a reference check then emailed me an offer. \r\n\r\nI applied for a role that was labelled as \"temporary\" on the careers page. Any applications for roles labelled as temp go through the same HR team that I talked to - called Talent on Demand. The great part about this is they connect you to opportunities that might be a good fit for you. So when you have a conversation with the ToD team, it's a very general interview, and they'll use your answers to connect you to various temporary opportunities. In this way, applying for one job is applying for all of them (all temp positions). The job that I was offered was not the same as the one that I applied for, but it worked out great.\r\n\r\nThe recruitment process would likely look different if you apply for a role labelled as \"permanent\".", "Interview Questions": "Round 1:\r\n\r\nQ1. Tell me about yourself\r\nQ2. Why do you want to work for PHSA?\r\n--- Time for me to ask questions ---\r\nQ3. What is one of your greatest strengths?\r\nQ4. What is one weakness of yours?\r\nQ5. What's the most complex environment you have worked in?\r\n\r\nI asked about 20mins of questions. If I had asked fewer, I suspect there would have been more questions for me."}, {"date": "7 Feb 2022", "title": "Intermediate IT Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Provincial Health Services Authority (Toronto, ON) in Dec 2021", "Interview Descriptions": "I had 2 interviews, the first preliminary went well, talked about past experience and what the job was to deal with, and locations. At the end of the first interview I was told they would like a second interview, to which I agreed for following week.\nThe next interview started quickly with introductions, then a 30min test (I'll add some questions below), all while they were watching me on the video. After 15min I stated that the questions were hard and technically I could open up Google and give the correct answers, but I'll continue without Google.\nAfter submitting the test, we had a formal interview asking questions about CS1000, Survivable Remote Gateway systems, Cisco programming, and past experiences of Project Coordinator and Management.", "Interview Questions": "What is a sip proxy server"}, {"date": "18 Nov 2021", "title": "Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Provincial Health Services Authority", "Interview Descriptions": "I first had a 4 person panel distanced interview that was about an hour long where I was asked behavioural and situational questions followed by two take home assignments. I was given about 3 days to complete the assignment with about 6 hours warning that they were going to send me an assignment.", "Interview Questions": "What is a project I have been most proud of, in terms of being creative or innovative in terms of approach?"}, {"date": "3 Dec 2021", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Nov 2021", "Interview Descriptions": "Phone screen and then online interview. Standard questions regarding past experience, background and reason to apply the role. Second interview with division manager and supervisor. Mostly for behavior and situation types of questions.", "Interview Questions": "How did you manage conflict opinions and what was the result."}, {"date": "22 Dec 2021", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Provincial Health Services Authority in Nov 2021", "Interview Descriptions": "Fairly informal conversation for round 1, with just the project manager. Questions were not super structured, conversation led to additional questions. After round 1, was told there would be a round 2 interview with the rest of the team.", "Interview Questions": "1) Why PHSA\n2) Knowledge of technical skillset using softwares and project management tools\n3) What attributes I'd bring to the team"}, {"date": "12 Jan 2023", "title": "Business Support Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Nov 2021", "Interview Descriptions": "I previously worked in a contract role with the IMITS team, and got promoted as a full-time BA. Because it was internal and the hiring managers knew the candidates, it felt casual; however, they still asked standard technical questions for the role.", "Interview Questions": "Describe how you would approach conflict with a difficult stakeholder."}, {"date": "27 Oct 2021", "title": "Business Support Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Provincial Health Services Authority (Vancouver, BC)", "Interview Descriptions": "phone interview with HR to review the basics, another 2 in person interviews (one with HR and another with the manager). relatively straightforward process with active communication and HR keeps you up to date.", "Interview Questions": "walk me through your resume\nwhy are you interested in healthcare\nwhat skills can you contribute to the role\n"}, {"date": "16 Oct 2021", "title": "Warehouse Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Provincial Health Services Authority", "Interview Descriptions": "Conducted over the phone.  It is fair based on your past experience as to how they relate to the job.  They ask relevant questions as to how to handle orders.", "Interview Questions": "How did you handle orders?"}, {"date": "10 Oct 2021", "title": "Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Provincial Health Services Authority", "Interview Descriptions": "Straightforward interview with scenario based questions and some subject matter questions. First 10 min were used to present the assignment received 5 days ahead, which was then followed by 50 min interview. It included time to ask questions about the position as well. The interview panel was 3 people.", "Interview Questions": "How do you deal with conflict at work?"}, {"date": "4 Oct 2021", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at Provincial Health Services Authority (Toronto, ON)", "Interview Descriptions": "First interview was a phone screening. Asked general question e.g. why do you want to work for PHSA. Lasted about 30 mins. Second interview was more technical. Panel of 3 took turn asking questions.", "Interview Questions": "Why do you want to work in the public health sector"}], [{"date": "7 Nov 2021", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Provincial Health Services Authority in Oct 2021", "Interview Descriptions": "I applied online through the internal job site. I was offered an interview after 1.5 weeks. The first interview was with 3 senior PMs and the second was with the team I would be working with. The interviewers were super warm and friendly and made me feel very comfortable. The questions were non-technical in nature and were mostly behavioural.", "Interview Questions": "Tell us about a time when you were overloaded on tight deadlines. How did you cope with the stress?"}, {"date": "30 Sept 2021", "title": "Administration Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Provincial Health Services Authority", "Interview Descriptions": "No phone screening required. Contacted by email to schedule panel interview within 48 hours. Applied to a few positions. Received confirmation emails.  HR thanked my interest in a job I didn't apply for and asked me to attend a panel interview in under 48 hours. Email confirmations did not match jobs applied for in portal.\r\n\r\nAfter accepting, contacted HR with questions you'd have during a phone screening. They were not responded to.  Other reviews state HR does not have general information. Decided not to continue with interview for job I didn't apply for because there was no discussion of anything prior to scheduling a panel interview. Informed HR. No response to emails until day of interview.\r\n\r\nYou can get an interview for a job you didn't apply for, if it's similar to what you actually applied for. They keep your information in the portal. This may not be explained to you because their thank you for your interest templates are used and sent to you to set up an interview. Other reviews state the same. Some find out during the interview, that it's for a job different from what they applied to.\r\n\r\nNo salary information. HR scheduling panel interview without phone screening and being unable to answer questions regarding position and department, prior to interview scheduled to occur in 48 hours, soured the experience.\r\n\r\nCould be miscommunication. But no one called or emailed to want to answer questions.", "Interview Questions": "Didn't make it to the interview."}, {"date": "17 Sept 2022", "title": "Blockchain Engineer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Oct 2021", "Interview Descriptions": "- panel interview\n- interviewers were 10-15 minutes late\n- very awkward wait time for interviewers to show up\n- an interviewer was literally eating at a restaurant while interviewing", "Interview Questions": "- behavioural questions\n- technical questions\n"}, {"date": "25 Aug 2021", "title": "Pathology Reception Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1+ week. I interviewed at Provincial Health Services Authority (Toronto, ON) in Aug 2021", "Interview Descriptions": "I did one interview and was hired on the spot. I took the position no later realizing it wasn't the best fit for me and decided to resign because of a hostile work environment. My next place of employment would look like a respectful and team playing environment.", "Interview Questions": "what does responsibility look like to me"}, {"date": "8 Jul 2021", "title": "Human Resources Coordinator (HR Coordinator) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Provincial Health Services Authority (Vancouver, BC)", "Interview Descriptions": "I applied online through their website. The recruitment team scheduled the interviews quickly. I had two rounds of interviews and a technical assessment. The interview questions were structured. I received the offer letter after two weeks.", "Interview Questions": "What are your areas of improvement?"}, {"date": "27 Jul 2021", "title": "Workplace Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Provincial Health Services Authority in Jul 2021", "Interview Descriptions": "I usually don't write reviews but can honestly say that I had the worst interview experience for this role. The Recruiter reached out to me during work hours and constantly called my phone, emailed, etc. until I had to stop my work and respond. The interview was last-minute and 5 minutes before the interview, I was spammed again even though it hadn't started yet.\r\n\r\nThey then mentioned that I would hear back within a week but it's been almost a month now and I haven't heard anything back. At this point, the position doesn't even appear desirable as the whole process was severely unorganized.", "Interview Questions": "What is your career path?\r\nWhy do you want to work at PHSA?\r\nProvide examples of the projects that you have worked on.\r\nWhy do you think you are suited for this role?"}, {"date": "21 Jun 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Provincial Health Services Authority", "Interview Descriptions": "it was fine, they asked relevant questions and allowed me to ask questions at the end. I was intimidating but I felt confident by the end of the interview, despite not knowing much about the job prior", "Interview Questions": "How well do you work in group settings?"}, {"date": "7 Jun 2021", "title": "Language Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Provincial Health Services Authority", "Interview Descriptions": "It was seamless, mostly customer service skills. There was just one interview. The process was fast. Be prepared to answer questions regarding previous positions and give examples. Go with a positive learning attitude.", "Interview Questions": "How do you deal with upset customers?"}, {"date": "5 Jun 2021", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Provincial Health Services Authority", "Interview Descriptions": "I applied online and was contacted by HR, after a month I was contacted by the team manager and the interview was arranged with the panel of three. They were all very nice and supportive. They made me soo comfortable.", "Interview Questions": "Tell me about yourself ."}, {"date": "13 Sept 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Jun 2021", "Interview Descriptions": "Panel interview - friendly, professional, 1 hour. \r\nInvolved recruiter and 3 leaders relevant to the role being hired for. This organization, BCCDC, is staffed by experts in their field who are passionate about their work . This team has an inspiring mission.", "Interview Questions": "Situational - follow the job description"}], [{"date": "19 Jul 2021", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Jun 2021", "Interview Descriptions": "Phone interview for 20 minutes. Mostly Job description and then HR questions and behavioural questions. They describe the expectation of the institute and then go over the team expectation and then ask you if that matches your expectation. The team of Talent acquisition is great with explaining the interview process. They mention all that they can offer and will ask about your salary expectation.", "Interview Questions": "How would your colleagues describe you?"}, {"date": "30 Jun 2021", "title": "Logistics attendant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Jun 2021", "Interview Descriptions": "The interview itself wasn't complicated. The questions were straightforward. I was expected to receive a status update from the interviewer in 1 or 2 days after the interview, but I received no feedback—horrible experience. I had to email the interviewer 9 days later just for an update. Unprofessional, didn't have the decency to inform me of the decision as expected.", "Interview Questions": "1. Tell me a time when you worked under pressure?\r\n2. Why do you want to work for PHSA?\r\n3. Tell me about the role you're applying for? "}, {"date": "29 Apr 2021", "title": "Purchasing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Provincial Health Services Authority", "Interview Descriptions": "First, I received an email asking if I was able to participate for a in-person interview on the given date. After the confirmation, I went for the in-person interview which it was very long ( 1h10m).\r\n\r\nThere were 3 people in the interview and each one took turn and asked several behavioural and situational questions \r\n\r\nThe staff was very friendly and receptive.", "Interview Questions": "Why do you want to work for PHSA?\r\nTell me more about the job you are applying for\r\nGive me an example of a creative solution for a difficult problem\r\nQuestions regarding your previous experiences\r\nYour skill level to use ERP and Microsoft programs\r\n\r\n"}, {"date": "8 Apr 2021", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Provincial Health Services Authority", "Interview Descriptions": "Standard HR + on site. Phone interview was mainly behavioral. On site was pretty easy, mostly high level questions and a mix of web design questions. Was not asked to code.", "Interview Questions": "Explain what an API is."}, {"date": "1 Apr 2021", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Provincial Health Services Authority", "Interview Descriptions": "Contacted by recruiter via email to schedule a phone screen. They contacted 4-5 candidates for a phone interview. The next step would have been video interview with hiring manager and team members.", "Interview Questions": "Tell me about yourself and your background in communications."}, {"date": "4 May 2021", "title": "Develpor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Apr 2021", "Interview Descriptions": "Began with a phone interview that consisted of basic behavioural questions. This then led to a panel interview, which consisted of deeper behavioural questions and a basic database knowledge quiz.", "Interview Questions": "Describe an instance of when you had to work with a stubborn team member. How did you act in such a situation?"}, {"date": "7 Mar 2021", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Provincial Health Services Authority", "Interview Descriptions": "There was a total of 3 interviews within the hiring process - a phone call screening, tech interview round, and finally formal interview. Although comprehensive, this  was a great experience  where we both we able to determine if we were a match", "Interview Questions": "It was mainly situational questions for the formal interview and phone call screening"}, {"date": "22 Feb 2021", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Provincial Health Services Authority", "Interview Descriptions": "phone interview with hr and hr thought that I am qualified and sent my resume to the team manager, manager will decide wether to move to next step. But I didn't get the chance of interview with the manager.", "Interview Questions": "talk about my previous projects."}, {"date": "19 Jan 2021", "title": "Leadership Role Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Provincial Health Services Authority", "Interview Descriptions": "Unrealistically long. The entire process took over 6 months to complete. Interview questions are not only grammatically incorrect, but lack imagination and aim. This is an organization that will not be 100% transparent.", "Interview Questions": "Paraphrased (Describe a time when you were faced with a difficult situation)."}, {"date": "16 Jan 2021", "title": "Program Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Provincial Health Services Authority", "Interview Descriptions": "Interviewed on Skype for 45 minutes. Very easy going and friendly. They want to know more about you. It was a panel and they took turns asking me questions. Made sure I was comfortable.", "Interview Questions": "Tell me about a time where you had to prioritize."}], [{"date": "13 Jan 2021", "title": "Project Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Provincial Health Services Authority", "Interview Descriptions": "They wanted me to do 2.5 hours of testing (typing, Word, Excel, and Powerpoint) before they would tell me:\r\n- Which position I was interviewing for (I had applied for several)\r\n- Whether the position was permanent or temporary\r\n- Whether the work was in-office or remote during COVID\r\n\r\nI asked for more information about the position, and was told I needed to complete the tests first - despite having 15 years of related experience.\r\nI was invited to 4 interviews with PHSA by 4 different HR reps, none of whom seemed to know anything about the jobs they were contacting me for.  I'll be pursuing employment with an organization with better hiring practices.", "Interview Questions": "Are you willing to do several hours of tests before we tell you which position you are interviewing for?"}, {"date": "16 Jun 2022", "title": "Scientist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Jan 2021", "Interview Descriptions": "Phone screening for 30 minutes, phone interview for 1 hr, in-person interviews for 2 hrs and three presentations were followed to different groups. It took longer than several months to complete.", "Interview Questions": "What is your weak point?"}, {"date": "7 Nov 2020", "title": "Lpn Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Provincial Health Services Authority", "Interview Descriptions": "Very complete  many questions from a panel of nurses , friendly atmosphere . Complicated by COVID restrictions though. Work environment appeared to be fantastic , great equipment and newer building. Lots of staff walking around smiling, everyone appeared very happy to be there and help.", "Interview Questions": "N/A"}, {"date": "4 Nov 2020", "title": "Receptionist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Provincial Health Services Authority", "Interview Descriptions": "I was offered to interview for another position in a completely different department. So I obviously wasn't prepared because I wasn't told in advance that I wasn't being interviewed for another position. Still, they were patient with me and didn't feel pressured.", "Interview Questions": "Do you know what we (PHSA) do?"}, {"date": "31 Oct 2020", "title": "System Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Provincial Health Services Authority", "Interview Descriptions": "It is one of the worst interview experience I ever had. After calling me for interview and answered every question they asked, they said \"You are Over Qualified\", so I dont hire you. \r\nThey just waste my time, my pay for taking day off from my current employer and they are biased.", "Interview Questions": "What you do at your current company?"}, {"date": "10 Oct 2020", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Provincial Health Services Authority (Vancouver, BC)", "Interview Descriptions": "standard process\nphone screening first then panel in person. Asked to do a presentation about previous project i did. Panel interview plus presentation took about an hour. Then one hour for teck test.", "Interview Questions": "T test and chi square test"}, {"date": "13 Oct 2020", "title": "Project Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Provincial Health Services Authority in Oct 2020", "Interview Descriptions": "Applied online on their website, entire process took 1 week.  I had 2 phone interviews in total, one with talent acquisition department and then one with the team lead. Interviews seemed very casual and each interview was about 20-30 minutes.", "Interview Questions": "Q: Do you have experience working over-time? "}, {"date": "21 Sept 2020", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Provincial Health Services Authority", "Interview Descriptions": "Very scripted and procedural, as expected. The team interviewing had mixed experience hiring and at times were unsure how to have a conversation that was not scripted. However, overall this was a good experience and functioned as expected.", "Interview Questions": "Many behavioural questions that asked \"provide an example where you ...\""}, {"date": "13 Oct 2020", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Sept 2020", "Interview Descriptions": "Two interviewers, going back and forth asking questions. Interview was approximately an hour. Questions surrounding skillset and personality. This was the first interview. Whole conversation was intended on understanding the employee, very comfortable and not overwhelming.", "Interview Questions": "What was your most successful project?"}, {"date": "1 Mar 2020", "title": "Tss Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Provincial Health Services Authority", "Interview Descriptions": "It was on time, two executives from the hiring team interviewed me and it was for half an hour. A background check was carried out. Two referrals were also asked. I received the offer two hours after I interviewed.", "Interview Questions": "General questions on my background were asked. And the question on why I would want to work for PHSA was asked. There were no difficult questions as such. "}], [{"date": "16 Nov 2020", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Feb 2020", "Interview Descriptions": "Very quick, describe yourself questions. Over the phone. Also asked about past work experience and work schedule availability. Originally spoke about a different position than the one i ended up getting hired for.", "Interview Questions": "Why do you think you're a good fit for this position"}, {"date": "19 Jan 2020", "title": "Statistical Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Provincial Health Services Authority", "Interview Descriptions": "Screening phone interview \r\nPanel interview (with director, manager and senior statistician) \r\n1-hour knowledge examination (theoretical/coding) without access to the internet on a different day\r\n20-minute presentation including questions and answers to the team", "Interview Questions": "How to manage conflicting priorities/how to ensure accuracy/difficulties and challenges"}, {"date": "27 Jan 2023", "title": "Healthcare Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Provincial Health Services Authority in Jan 2020", "Interview Descriptions": "- easy interview. just basic nd standard aanswers are acceptable. have good references and two to three weeks process in total for me. training one month. 2 interviews in total.", "Interview Questions": "Why would you like to do this role?"}, {"date": "26 Nov 2019", "title": "IT Liaison Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Nov 2019", "Interview Descriptions": "good interview, good people, pleasant, intelligent questions that seemed very appropriate/made sense, strengths and weaknesses type questions, followed by what would u do in such-and -such scenario, pleasant and positive with some very helpful immediate feedback plus a call a week later, also with extremely helpful and positive feed back,", "Interview Questions": "N/A"}, {"date": "14 Sept 2019", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Provincial Health Services Authority", "Interview Descriptions": "Straight forward interview process - phone interview, assessment, in person interview. Landed the position within two weeks of the first phone interview. The overall interview process was an enjoyable experience.", "Interview Questions": "Why do you want to work for PHSA?"}, {"date": "7 Nov 2020", "title": "Cardiac Monitor Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Sept 2019", "Interview Descriptions": "Panel interview with the supervisor and hiring manager. Quick brief questions and a questionnaire at the end to assess knowledge. They also asked character questions and scenario based questions. They also touched base on the cores and values of the company.", "Interview Questions": "How did you resolve a conflict that occurred between yourself and a patient, coworker, or supervisor?"}, {"date": "10 Sept 2019", "title": "Research Facilitaor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Aug 2019", "Interview Descriptions": "Had an informal discussion with two Directors, then a follow-up formal interview with 1 other Director.  The follow-up was very efficient followed-up when the interviewer said they would. I was invited for a chat 1 month after applying, then 2 weeks later was given a formal interview and waited another 2 weeks for an offer. Overall 2 months process.", "Interview Questions": "Tell us about a time you took initiative to make an improvement at your work."}, {"date": "27 May 2019", "title": "Corporate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Provincial Health Services Authority", "Interview Descriptions": "Two person panel made up of hiring manager and a close colleague who is frequently involved in day-to-day operations.  Both managers took turns asking questions and sharing information about the role itself.", "Interview Questions": "Can you give me an example of a conflict you were involved in and how you solved it?"}, {"date": "18 Dec 2019", "title": "Talent Acquisition Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Apr 2019", "Interview Descriptions": "I met with my manager and he explained the good, bad and why it would be a good fit.  We talked about the challenges and it was a conversation.", "Interview Questions": "N/A"}, {"date": "4 Feb 2019", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Provincial Health Services Authority (Vancouver, BC)", "Interview Descriptions": "Thorough questions were asked about previous experience and projects that were conducted and led under my leadership. Scenario questions also posed. As well, analytical skillset questions were asked and what approach is typically used.", "Interview Questions": "What were previous projects led? "}], [{"date": "1 Feb 2019", "title": "Health Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Provincial Health Services Authority (Vancouver, BC)", "Interview Descriptions": "For specific department of PHSA that uses healthcare data to provide specialized services to target demographic. After applying, was contacted for a phone interview to with general talent acquisition person to gauge general interest and qualifications, then selected for in-person panel interview on site. 3 panelists were present with different roles (epidemiologist, statistician, DBA). Panel interview commenced with generic behavioural interview questions (conflict management, time management, \"Where do you see yourself in 5 years?\" etc.). Technical interview portion was immediately after. Given a sheet of paper with SAS procedures and was asked what different blocks of code were trying to achieve and statistical methodology used. Company did not contact me regarding decision even after emailing them 2 weeks post-interview, and even though they confirmed me both during the interview and their email response that they would inform me of their decision.", "Interview Questions": "Linear regression models in SAS and their purpose"}, {"date": "20 Sept 2021", "title": "TOD Temporary Placement Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Feb 2019", "Interview Descriptions": "Friendly interviewer who swayed me to choose them instead of another big employer. I was at ease. Paid more than public education sector for similar entry level temp roles. Maybe 30 minutes max.", "Interview Questions": "When can I start, was one question "}, {"date": "24 Oct 2019", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Nov 2018", "Interview Descriptions": "They followed a standard interview questionnaire, which are the typical behavioral questions. As long as you prepared examples and answered the questions, you are good to go. Got an offer within the week.", "Interview Questions": "Think of a time when you had conflict with a coworker. "}, {"date": "19 Feb 2019", "title": "Sourcing Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Nov 2018", "Interview Descriptions": "I applied online and shortly received an invitation to meet in-person with the hiring manager, HR personnel and team lead. I expressed that I had a strong interest in the area, but did not have the appropriate training or academic background. The first panel interview went well with usual behaviour type questions. Following the initial interview, I was invited for a 2nd interview with the same panel and another clinical coordinator. This time, I was given an assignment to analyze as a business analyst and then present my findings to the panel. The presentation and analyzed data went very well. However, it appeared that I didn't fit the needs of the team lead, who I'd be working with directly. I seemed to have made an impression on the HR personnel, hiring manager as well as the clinical coordinator. The hiring manager called me personally to follow up and asked me to consider another job that they were hiring for.", "Interview Questions": "N/A"}, {"date": "6 Jan 2020", "title": "Junior Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Oct 2018", "Interview Descriptions": "pretty standard interview, kinda intimidating because my interviewer was very stern. started with a intro to what the department does... 30 word minimum so a a a a a a a a a a a a a a a a a", "Interview Questions": "how do you join 2 tables in SQL"}, {"date": "21 Sept 2018", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Provincial Health Services Authority", "Interview Descriptions": "Phone screening then online group teleconference. \r\nUnorganized but casual. \r\nOdd redundant questions and unstructured ones that aren't asking a question.\r\nAnswered technical questions correctly, polite, and engaged. Avoid mentioning you're an immigrant, as 'fit' becomes an issue quickly.", "Interview Questions": "Behavioural questions\r\nTopic-specific questions"}, {"date": "31 Aug 2019", "title": "Business Intelligence Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Provincial Health Services Authority (Burnaby, BC) in Nov 2017", "Interview Descriptions": "Applied online. In 1 week got interviewed in person. The first half was asking about relative experience at previous jobs. The 2nd half was writing a paper test about queries. Paper test was not very difficult.", "Interview Questions": "Data warehouse concepts"}, {"date": "27 May 2017", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Provincial Health Services Authority", "Interview Descriptions": "Don't bother working here.  The interview process had off-colored unprofessional remarks by one of the director who clearly moved up by politiking.  The impression that I got from my interview questions were that of a disorganized organization, people being shuffled around, and lots of politics.   I'd say move on.  greener pastures elsewhere.", "Interview Questions": "How do you move up in an organization?"}, {"date": "12 Dec 2016", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Sept 2016", "Interview Descriptions": "The interview process was an in-person interview with a panel of 3 people who worked in the research group. The questions were straightforward and they were relatively quick with getting back to me about the hiring decision.", "Interview Questions": "Why are you interested in this position?"}, {"date": "19 Aug 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Aug 2016", "Interview Descriptions": "Initially applied for a different position, HR contacted me and asked if I would be more interested in another position that was currently internal.  After forwarding me the job position, I agreed to the interview. The interview was the following day and was a 3 person panel, including HR.  It was a straightforward interview, and noted that they also had other candidates to interview.  By the next day, I was given the job offer, going through the benefits and salary.", "Interview Questions": "How did you make your personal workload, or department, more efficient?"}], [{"date": "17 May 2016", "title": "Programmer Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Apr 2016", "Interview Descriptions": "35 minutes of chat about work history. No a lot of questions. Mostly what you did before. It was a fairly short interview. Met 2 gentlemen. Easy going. Not a whole lot of questions.", "Interview Questions": "No technical questions. Just what you did before."}, {"date": "7 Feb 2017", "title": "Sharepoint Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Feb 2016", "Interview Descriptions": "Two stage interviews, phone and in-person. The phone interview is general stuff... and an in-person interview is a technical test regarding on the SharePoint technologies, .net framework, SQL server, etc.", "Interview Questions": "What is ghosted and un-ghosted means in SharePoint?"}, {"date": "19 Jul 2015", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Provincial Health Services Authority (West Vancouver, BC) in Jul 2015", "Interview Descriptions": "Had a skype interview, very nice people - one of them is the manager and the other is another data analyst, asked mainly about your previous experience in dealing with data, coding, and dealing with stakeholders. Interview lasted around 30 - 45 mins. They got back to me after a week. Then I had to provide two references for their reference checks.", "Interview Questions": "Was there a conflicting experience within your team."}, {"date": "10 Jun 2015", "title": "Laboratory Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Provincial Health Services Authority", "Interview Descriptions": "Panel interview. Situational questions, concerning communication skills, troubleshooting, prioritizing ability, organizations skills, work-life balance, leadership, difficult situations, team-building capabilities. Interview listed a bit over an hour. Was not a difficult interview,as they asked standard job interview questions. Asked if I could think of situations where I was challenged and how I overcame the challenge. Also was asked about difficult people and how to mitigate conflict.", "Interview Questions": "What are the responsibilities of the role you are applying for?"}, {"date": "24 Oct 2016", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Provincial Health Services Authority (Vancouver, BC) in May 2015", "Interview Descriptions": "Panel interview in person, four people, ten questions, no computer testing, thourough reference check, background check. \r\nHiring process took three months from the day I applied for the position to the actual start date", "Interview Questions": "Name your top 3 strenghs"}, {"date": "30 Mar 2019", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Jan 2015", "Interview Descriptions": "2 rounds of panel interviews. With a SR. Doctor, HR and SR Admin. Each of the interviews was over an hour. The panel team was very nice and the interview process was professionaland not cold.", "Interview Questions": "How did I handle a stressful situation and what was the out come."}, {"date": "1 May 2014", "title": "Support Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Provincial Health Services Authority (Vancouver, BC)", "Interview Descriptions": "I did two interviews, they mostly talked about past experience and did a data entry testing and typing test.", "Interview Questions": "Asked a lot about ability to handle stress and how to deal with conflict and ability to multi-task. "}, {"date": "10 Mar 2014", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Provincial Health Services Authority (Vancouver, BC)", "Interview Descriptions": "One interview. Scenario questions. Be prepared to be asked how to deal with clients like Medical Doctors, Dentists, and so on.", "Interview Questions": "Questions regarding your \"care\" for health care."}, {"date": "11 Feb 2014", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at Provincial Health Services Authority (Vancouver, BC)", "Interview Descriptions": "I submitted a resume to a recruiter and was hired over the phone.", "Interview Questions": "It was a phone interview asking if I was available and able "}, {"date": "22 Apr 2013", "title": "Quality Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Provincial Health Services Authority (Vancouver, BC)", "Interview Descriptions": "1 interview", "Interview Questions": "questions were standard behavioural interview questions as one would expect"}], [{"date": "17 Nov 2012", "title": "Transcription Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Provincial Health Services Authority (Vancouver, BC)", "Interview Descriptions": "Applied for jobs through internal processes.  Testing was done in their main clerical office and consisted of a typing test for speed and accuracy.  you were given three tries to meet the minimum words per minute (60).  My first go at it was 100% accuracy and 82 words per minute so they waived the other two tries.  Then I answered a multiple choice test on prefixes and suffixes of medical terms.  Third phase was a basic grammar test consisting of where the quotation mark would go in (two weeks' time, one week's duration).  After the testing had been done, it was evaluated and then you were brought into their office for the results and whether or not you were hired, when/if you started and what shifts you preferred.", "Interview Questions": "Asking what I did in my social life was a bit surprising.  Did not understand why they needed to know what hobbies I had as it was not relevant to the work I was applying for."}, {"date": "3 Jul 2015", "title": "Client Support Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Jun 2012", "Interview Descriptions": "I was called in for an hour-long interview with the department manager and two senior analysts. It was a fairly standard interview discussing the various technologies employed by the site and my experience with them, as well as my ability to pick up new information.", "Interview Questions": "How do you find out about technologies you aren't familiar with?"}, {"date": "27 Oct 2015", "title": "Project Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Provincial Health Services Authority (Vancouver, BC) in Jun 2012", "Interview Descriptions": "All behavioural questions. Just wanted to know what your education background was, your goal and why you were interested in applying. They provide training afterwards for the technical. Perhaps a bit biased on the whole process as I was referred by someone from the company. Really is an easy interview. They care more about the fit rather than your skills. Skill cap basically just involves knowing how to use Excel, copy, paste and data entry so it's good to mention your typing speed. Anything about 50 wpm and you should definitely mention it.", "Interview Questions": "Walk me through your resume."}]]