[[{"date": "14 Sept 2022", "title": "Customer Service Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCLA Housing", "Interview Descriptions": "Job postings will come up when there are available positions on the team. After submitting an application and attaching resume, you will be contacted if you are selected for an in person interview. The in person interview is with one supervisor and one manager who will both ask you a series of behavioral questions and scenario based questions. The decision on a job offer will be made within one week after reviewing all applicants.", "Interview Questions": "What are three strengths and three weaknesses you have?"}, {"date": "19 Dec 2022", "title": "Customer Service Representative (CSR) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at UCLA Housing in Jun 2022", "Interview Descriptions": "They asked basic getting to know you, work history, what would you do in this situation, computer knowledge questions. It is more of a formality to go through this interview since it is a student job", "Interview Questions": "How familiar are you with Windows, MacOS, or Linux"}, {"date": "22 Mar 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCLA Housing", "Interview Descriptions": "Detailed and fair. I met with numerous people to get a sense of the position and what they were looking for. There were 3 rounds of interviews that were about 45mins each", "Interview Questions": "I dont recall any of the questions"}, {"date": "18 May 2020", "title": "Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at UCLA Housing", "Interview Descriptions": "Interview with 2 supervisors. Pretty casual in terms of vibe. Dress business casual. Pay attention to the person you meet at the front desk, they will ask you describe the person.", "Interview Questions": "Night person?"}, {"date": "22 Dec 2022", "title": "Front Desk Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at UCLA Housing (Los Angeles, CA) in Feb 2019", "Interview Descriptions": "The overall process was very straightforward. I submitted my application and then was promptly asked to interview the next week. I had one interview with the main supervisor and then I was offered the job the next week.", "Interview Questions": "They asked me about hospitality, what I had done in difficult situations and how I handled them, as well as times when I had to work as a team with my peers."}, {"date": "21 Apr 2018", "title": "Apartment Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCLA Housing", "Interview Descriptions": "Open to current residents of married or graduate student apartments. Apply yearly. May apply as a couple. This position only lasts 1 year, and you can re-apply every year. You can work 3 years max.", "Interview Questions": "If you were a car, what would you be and why?"}, {"date": "8 Apr 2020", "title": "Front Desk Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at UCLA Housing (Los Angeles, CA) in Feb 2018", "Interview Descriptions": "Sat down with a supervisor and was asked mostly situational questions. After this interview with the supervisor, I had a second interview with the assistant regional housing manager. This interview was more formal and I was asked a series of more analytical situational questions. Overall, it was a very smooth and enjoyable process.", "Interview Questions": "What would you do if someone comes to the front desk and asks regarding a student?"}, {"date": "25 May 2019", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at UCLA Housing (UCLA, CA) in Mar 2017", "Interview Descriptions": "Communication was quick and efficient over the email to set up the interview, had 1 group interview with 2 other people, heard back quickly over email, signed paperwork over the next week and started working the quarter after", "Interview Questions": "Why do you want to work as a food service worker?"}, {"date": "5 Jan 2018", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at UCLA Housing (Los Angeles, CA) in Mar 2016", "Interview Descriptions": "The interview was extremely casual. I walked into Hedrick Study (where my interview took place) a few minutes before the scheduled interview time. A student manager was there, and we went to one of the tables and did the interview there.", "Interview Questions": "Are you willing to work late night?"}, {"date": "15 Oct 2015", "title": "Front Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at UCLA Housing", "Interview Descriptions": "Easy process. I interviewed 3 times. Twice with a supervisor and the final interview was with the assistant manager and concluded with me being hired and figuring out my first week's schedule.", "Interview Questions": "What experience do you have in customer service? Why would you be good at this job?"}], [{"date": "20 Feb 2017", "title": "Front Desk Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at UCLA Housing in Feb 2015", "Interview Descriptions": "I submitted my application and supplemental essay questions in person, received a call for an interview within the week, and interviewed with a student supervisor. The process was smooth and well organized. I got a call back with their decision within 5 days and was hired within a week after background clearance and paperwork.", "Interview Questions": "What does customer service mean to you?"}, {"date": "16 Nov 2016", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at UCLA Housing (UCLA, CA) in Jun 2013", "Interview Descriptions": "Was interviewed by other supervisors and managers. The interview took around 30 minutes and wasn't too hard. They mainly knew how you operated as a worker and what type of person you were. Most of the questions were how you would operate now as a supervisor instead of a worker. The main thing they were looking for is they could trust you as a supervisor now instead of a regular worker.", "Interview Questions": "How would you make the distinction that you are now a supervisor instead of a regular staff member?"}]]