[[{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Plenty of opportunities, Plenty of work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "8 Nov 2019", "job_title": "Education in Singapore", "duration": "N/A", "pros": "ASEF is a unique organisation, and working for it is also a rather unique experience. Being apolitical but working with governments brings its own challenges as well as opportunities.\r\n\r\nWhile bureaucracy is definitely there and could (as well as should) be diminished, overall ASEF offers their employees a great level of liberty and responsibility to take ownership of the projects they run.  The team is small, so each staff member has to step up in order for the organisation as a whole to continue evolving and improving (i.e. if you're just looking for any 9-5 job to put bread on the table without an actual interest in ASEF's vision and mission, this is most probably not for you).\r\n\r\nAnd yes, you will most probably end up working a lot. But yes, you will also be inspired and gratified by the work itself, your colleagues, your partners, your participants and other stakeholders. Only you can assess if the significant efforts you will need to put in are worth your time and dedication. If you believe it is, please give it a try.", "cons": "Your experience at ASEF can be very different depending on in which department you work. None is better than the other, each one has its own strengths and weaknesses. The collaboration between departments is not the strongest, but you can yourself influence this, if it's something that is important to you.\r\n\r\nUnfortunately Asian and European governments are not giving ASEF or the ASEM Process sufficient support (political, financial, human resources, etc.) which can lead to some challenges in relation to implementing projects. Expect hence having to come up with creative solutions to these and other challenges related to the characteristics of the organisation and its work.\r\n\r\nWhile interpersonal conflicts have existed in the past, the situation has improved the past couple of years. Such conflicts can come up again though at any time (and in any organisation/company), so it is also your responsibility to contribute (and avoid being counter-productive) to a healthy work environment, if you get such an opportunity."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": "N/A", "Senior Management": 1, "review_title": "Think twice before joining", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Nov 2021", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "- International stakeholders\n- Diverse colleagues\n- Located in Singapore, if you are interested in SEA", "cons": "IF YOU ARE\n\n- STAFF: idealistic and committed when you arrive, prepare to be drowned by meaningless tasks, as well as last-minute requests (taken for granted, no personal boundaries). As admin work occupies most of your day, you will dedicate plenty of extra hours to project work.\n- CONSULTANT/VENDOR: prepare for 90's bureaucracy and processes. You can charge the highest rates as you are expected to solve a big organisational mess.\n- PARTICIPANT: you will have a one time opportunity to network. It will take several months for ASEF to reimburse you.\n- PARTNER: weak reporting system, so you will barely know what ASEF does with your resources. If you earmark funds, your logo will be present - that's all. Only interesting because of your countributions.\n- FRIEND: all the privileges you ask for, 0 responsibilities - HR rules don't apply to you. You don't need to do anything written in your fancy job description (just personal chauffeur or clapping pet). \n- SENIOR MANAGEMENT (PROFESSIONAL): power/drama hungry individuals that would be immediately fired anywhere else but here.\n- SENIOR MANAGEMENT (APPOINTED): lack of professionalism or contact with reality. They look to another side when problems arise, only interested in their personal agenda and future postings.\n\nIF YOU WANT\n\n- IMPACT, especially in the long term\n- RECOGNITION of good practices\n- EMPOWERMENT as a worker (or just being listened)\n\nPlease consider other job prospects as you will not find this here. But suppose you don't mind working for unrespectful and entitled bosses or gradually losing your value in the job market (or your health and mental wellbeing). In that case, ASEF is the place to be."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": "N/A", "Senior Management": 1, "review_title": "Come to ASEF and coast", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "11 Oct 2021", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "Green space behind the building where you can see the wild monkeys. Inside the building you can see the circus animals (pro tip: better-behaved wildlife in the Singapore zoo)\r\nSome managers are moonlighting because they're bored. Actual work takes little time, and there is no IT screening of computer use. So you can do whatever you want.\r\n\r\nOffice politics is easy to maneuver but so time-consuming and super-childish:  1) non-seconded directors think they're the ones holding up the place, and want to be congratulated for doing their job (so tell them how fantastic and hard working they are - exactly like Joan of Arc), seconded directors don't want to hear problems so send them on foreign travels away from actual work stuff. 2) There are camps which plot against against each other  (for no reason - maybe camp A person didnt go for lunch with camp B person) - join each camp and agree with everything. Then go do exactly what you want and blame it on other sides when they complain. 3) For promotion/bonus time: be visible and sing the praises of everyone in the management team. EVERY ONE. Since the discussions happen on a vote basis in closed-door management meetings, consensus on how many people like you is the basis (there is no rationale really since there is no understanding of professional performance management). You'll get a promotion if they like you, not on your actual work performance. \r\n\r\nSalaries are not transparent either; the pay scale they use is for optics only.... there is space to grow, and you can earn a decent salary if you use the tips above (you're welcome!) \r\n\r\nCome to ASEF and coast.", "cons": "Where to start? During my time, nepotism, bullying and gossip was the order of the day. BY THE LEADERSHIP; most of the mid-level and junior staff are actually okay. Many of the unpaid interns were relatives/friends of kids of the directors; management hired friends to take on consultancies, organisational budget spent on hosting wives' gatherings or beautifying offices. The most unprofessional of leaders (2016 - 2021) surrounded by the most sycophantic of advisors, who traded morals and decency for permanent positions, or pay rises or dubious promotions where people clearly unsuited for the role were moved to new positions overnight. For those who disagreed, they were summarily dismissed. If anything goes wrong, the lowest person in the food chain is blamed for the problem.\r\n\r\nThese issues of unprofessional behavior have always existed in ASEF (at varying levels of idiocy) and will probably always exist. Diplomats are accountable to their countries, not to this organization so unless they already have good values, there is no check on corruption and power-hungry egos. Many forget they're no longer running embassies. Some professional directors have been here for so long, and in so many roles, that they are unable to see how the world has left this out-dated organisation behind; HBR articles aren't the best source of management unless you can reflect on how your own actions bring an organization down. There is a 0 accountability structure. \r\n\r\nThe new ED is doomed because by the time he can get support from his own advisors (and some of them will be actively plotting against him if he corrects their behavior), and gain consensus from 53 member board, his posting will be over, and a new diplomat from somewhere else will come in and do the same thing. \r\n\r\nYou'll learn new skills in people management but you'll give your mental health away. Flip through the 2018 and 2020 annual report to see how many people have changed."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Good as a stepping stone, lack of advancement", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Apr 2021", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "- Opportunity to travel \r\n- Multinational colleagues", "cons": "- Lack of progression - no rotation of some directors leading some departments with only managers. Also expect to wait years before being \"rewarded\" with promotion\r\n- Management doesnt listen, or pretends to listen without trying to understand leading to \"solutions\" that only make sitations worst\r\n- Bullying of subordinates happen very frequently (and not even hidden - everyone knows who's toxic yet they are there more than a decade)\r\n- Incapable/ineffective/inefficient colleagues protected, some even with significantly better salaries than others\r\n- Toxic culture"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "What a Circus", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "16 Apr 2021", "job_title": "Manager in Singapore", "duration": "N/A", "pros": "ASEF offers a unique opportunity to work with multinational colleagues. We have currently have a staff strength of 35 employees from 19 nationalities in Asia and Europe. It's a diverse and enjoyable mix albeit reminiscent of a big dysfunctional family because of different backgrounds, mindsets and cultures.\r\n\r\nASEF also offers excellent networking opportunities with international partners and counterparts. For people with a non-governmental background, it offers exposure to diplomacy especially if one's role involves dealing with the Board, and various Asian and European ministries.\r\n\r\nIn pre-COVID times, ASEF was best placed to offer travel opportunities to its staff in implementing projects across the 2 continents. In 2018, I travelled to 9 countries. Work then was exhausting yet exhilarating and I believed in the impact of our projects that brought Asians and Europeans together for cultural and intellectual exchange. \r\n\r\nThe good things end there and these positive aspects are not worth enduring the negatives ones (read cons)", "cons": "The problem with ASEF is that it seems to reset itself to Zero every 4 years when the top management changes, which is a total mess, if I may be blunt.\r\n\r\nOur leadership are seconded high-level diplomats. This means that while they may have the best of intentions to effect positive change, they are not necessarily the trained professionals needed in managing a uniquely structured and ever-evolving non-profit. They need strategic and operational help, but alas, they are surrounded by incompetent people in their immediate support team.  This, combined with 7 heads of departments with conflicting interests, results in a circus. Internal procedures are a mess, rules are non-existent, and lobbying for self-preservation is abound. \r\n\r\nThe worst part is that the staff in the Managerial level and below (Executives and Officers) suffer because of the mess on top. Work load is increased unnecessarily. So much time is spent pushing paper. \r\n\r\nOn top of that, there is no appreciation for staff apart from nice words of validation and empty and broken promises for positive organisational change and career progression. There is no growth in this place, it's just fighting fire every single day. Further, the over-performers are not only expected, but demanded to make up for the shortcomings of those who do not pull their weight. This results in burnout, overall dissatisfaction, and a loss of morale since the performance appraisal system is a big joke and under-performing staff are protected for optics and a so-called healthy head count. \r\n\r\nSenior management encourages people to \"grow\" and learn other skills/other roles within the organisation, but when one shifts from programme management to operations to fill a gap, it is not recognised as a significant contribution - actually it becomes detriment for the rewards/promotions/salary increments because the programme people are valued more than the people who make their programmes happen. \r\n\r\nThere is a lot of overtime in ASEF and this is not compensated. Mental wellbeing of people suffer too. The current senior management has open doors and staff do approach them with grievances, but there is zero action to remedy various problems. \r\n\r\nBecause of all this drama, if you are are looking for a normal 9-6 job with acceptable work/life balance, forget this place. If you are looking to be compensated for your worth, forget this place. If you despise admin work, run far, far away. Any role in ASEF is approx 80% admin/pushing paper around."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Unfriendly and health-damaging environment.", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "1 Mar 2019", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "- Located in Singapore, a beautiful and culturally interesting city. \r\n- Good for CV. \r\n- Good for introduction to the world of inter-governmental organisations. \r\n- Occasional bonding with other employees .", "cons": "- Management ignores demands of employees (e.g. regarding need for additional staff, better salary, enhanced work-life balance). \r\n- Petty office politics: employees marginalised and ostracised by other employees over petty disputes, childish plotting against one another. \r\n- Ineffective HR department: slow, ignores employees' complaints and demands. \r\n- Extra hours rarely taken into account (and thus unpaid). \r\n- Disregard for employees' mental health and well-being. \r\n- Most projects amount to the equivalent of throwing (thousands) of coins into a fountain and praying for a supreme being to grant you a wish: no reviews about the impact of projects, incredibly expensive closed-doors conferences do not seem to produce any concrete results apart from being networking opportunities for (relatively randomly selected) participants. \r\n- Refusal to evaluate, re-consider and change working methods, even when they clearly fail to produce results."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "The Heart of Darkness", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "9 Mar 2015", "job_title": "Deputy Director in Singapore", "duration": "N/A", "pros": "The conference room is nice. But this is pretty much all there is to say in terms of positive experience... Overall, the experience was like living a Kafka novel in a Siberian Gulag.", "cons": "Compensation was below poverty level. Leadership or vision were non-existent - the Executive and Deputy Executive Directors being at constant war with each other and utterly non-inspiring personalities. The overall office culture within and between teams was somewhere between total paranoia, mutual suspicion, and open hatred. Training or personal growth opportunities were non-existent."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "A good small organization for entry and early-mid levels", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "17 Jul 2014", "job_title": "Project Executive in Singapore", "duration": "N/A", "pros": "Small institution, get to know each other easily; Opportunity to travel in Asia and Europe; For those who want to experience a UN- or EU-type of diplomacy and works, this is a good place to get started, minus the bureaucracy.", "cons": "Very limited career advancement due to its small size; Salary is just OK and not really competitive for typical Singapore market; Unclear salary range."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Working in the Political and Economic Department at ASEF", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Feb 2015", "job_title": "Intern in Bukit Merah Estate,", "duration": "N/A", "pros": "Interesting project-based work which prevents things from getting monotonous, good work-life balance, nice company culture as well.", "cons": "Some projects can drag out, and not all are interesting."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Get out of it while you can.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "15 Jul 2013", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "The colleagues, the cammaraderie, the projects.", "cons": "Management has no viable HR strategy."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Looks good on your CV, but...", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 Nov 2016", "job_title": "Project Executive in Singapore", "duration": "N/A", "pros": "Travelling for projects and networking with real professionals", "cons": "Mobbing, blaming, public humiliation and bullying"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "great experience", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "10 Sept 2014", "job_title": "Project Manager in Singapore", "duration": "N/A", "pros": "travel, access to policy makers,", "cons": "low salary, long hours and bad location in Singapore"}]]