[[{"date": "17 May 2023", "title": "Sessíonal Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Douglas College (New Westminster, BC) in Apr 2023", "Interview Descriptions": "The interview process was very straightforward and friendly. I only required one step - a class showcase and a couple of questions. The interviewers were supportive and provided me with enough information to make the best decision.", "Interview Questions": "How would you describe your teaching style?"}, {"date": "15 Feb 2023", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Douglas College", "Interview Descriptions": "Have to complete the required primary courses with good grades. Minimum b+. Must have good understanding of the subjects. No technical interview. General questions about yourselfand why would you want to take up the role", "Interview Questions": "Why do you want to be a student assistant."}, {"date": "22 Feb 2023", "title": "Program Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Douglas College (New Westminster, BC) in Feb 2023", "Interview Descriptions": "The interview process was great! Although I was initially shocked to find 4 interviewers in the room, I quickly got used to it. All interviewers spoke clearly and asked relevant questions. They encouraged me to take notes and provided me with paper. They were all gracious and thanked me when I was finished providing my answers.", "Interview Questions": "Q: Walk us through your resume."}, {"date": "26 Jan 2022", "title": "Librarian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Douglas College (Vancouver, BC) in Jan 2022", "Interview Descriptions": "The interview process has asked me situations where students are borrowing books and how to put them in the system and keep track of the data, then they have asked me if someone has not brought the books back what would be my procedure to contact them and to bring the book  back", "Interview Questions": "How would you contact a student that the borrowing time has went overdue"}, {"date": "22 Jul 2021", "title": "Facilitator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Douglas College", "Interview Descriptions": "Panel interview was with 2 interviewers: the supervisor and the manager. Interviewers followed prescribed questions and took turns asking questions. Interviewee is expected to teach a relevant topic for about 10 minutes using a PowerPoint presentation.", "Interview Questions": "Walk us through your resume and describe how your experience relates to the position."}, {"date": "9 Jun 2021", "title": "Peer Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Douglas College", "Interview Descriptions": "Very lax and fair questions. Felt comfortable and the questions were more about myself rather than the job itself. Did not feel like I needed to be an expert in the area applied for. Lots of room for trainability.", "Interview Questions": "What was a situation where you tutored another person?"}, {"date": "27 Oct 2020", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Douglas College", "Interview Descriptions": "Online using Zoom. 3 people interviewed. They were very nice and calm.  10 minutes presentation. Series of twcjnical and personal questions. They were Very polite and made me feel comfortable.", "Interview Questions": "Why you want to join this college"}], [{"date": "15 Oct 2020", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Douglas College", "Interview Descriptions": "It was very casual. I was given a list of questions to review 10 mins. before the actual interview. There were 2 people interview me in a conference, one was the direct supervisor and the other was the registrar.", "Interview Questions": "If you are on the phone with a student, and you find that the instruction in the manual is different from what you have been told by your coworker, what will you do?"}, {"date": "28 Nov 2019", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Douglas College", "Interview Descriptions": "It was a very short interview process. About 45 minutes with three other interviewers. It was very casual and we mostly talked about goals in school, relevant experience, and other pretty general things such as availability.", "Interview Questions": "What is your greatest weakness?"}, {"date": "23 Oct 2019", "title": "Career Coach/Facilitator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Douglas College", "Interview Descriptions": "In person Panel Interview, you are required to do a 10 mint presentation on some topics that will be given to you. You can do using power point or your laptop.", "Interview Questions": "Common interview questions. Tell me about your experience in this field?"}, {"date": "31 Jul 2019", "title": "Student Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Douglas College (New Westminster, BC) in Jul 2019", "Interview Descriptions": "The process starts when the person applies in the careers web page of Douglas college. Then they call you for an interview and technical exam and then you are accepted or not.\r\nThe interview consisted of a panel of three interviewers who take turns asking questions. During the interview, all three interviewers take notes as the interviewee answers questions.. They start asking about the motivation of the application and the perspectives for the future. Then they make technical questions about programming (functions, basic concepts of object-oriented programming). Then they ask you about the availability", "Interview Questions": "Explain the concept of inheritance"}, {"date": "19 Sept 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Douglas College (New Westminster, BC) in May 2019", "Interview Descriptions": "Panel interview with 4 people from various departments. Was about an hour with each person taking turn and asking standard questions. The people in the interview was directors and managers.", "Interview Questions": "How would I handle challenging situations"}, {"date": "6 Jan 2020", "title": "Administrative Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Douglas College (New Westminster, BC) in Mar 2019", "Interview Descriptions": "I found the job ad on LinkedIn and applied online via Careers portal. Within a few weeks, I was contacted for a phone interview, which turned out to be easy: they asked specific questions about my experience, education, motivation and career goals. Following the phone interview, I received an invite to attend their panel interview. Final step was computer-based testing in standard office applications, data entry and typing.\r\n\r\nThe interview I had lasted for about an hour. There were three panel members asking behavioral questions. Overall, the process is formal, and all panel members were taking notes. Yet, I felt welcomed to share my stories. When I was stuck once, one of the interviewers helped me get back on track by asking follow-up questions. I felt like they genuinely wanted to get to know me better. \r\n\r\nI received a job offer three days later.", "Interview Questions": "Give me an example of a good customer service experience."}, {"date": "1 Mar 2019", "title": "CEIT Student Assistant Co-Op Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Douglas College (New Westminster, BC) in Dec 2018", "Interview Descriptions": "You get a call for an interview after a week or two of your application. \r\nInterviewers are very friendly and questions are usually behavioral and situational.\r\nYou hear back from them in one or two days.", "Interview Questions": "Name some courses that you studied at douglas college will be helpful for this role."}, {"date": "20 Apr 2019", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Douglas College (Coquitlam, BC) in Sept 2018", "Interview Descriptions": "There were questions around what do I know about WorkBC contract, processes and the ICM. There were two people that interviewed me - supervisor and manager at the time. Took about 1 week of negotiating with them and my current employer.", "Interview Questions": "How do you prioritize your case load as a Case Manager?"}, {"date": "1 Jul 2018", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Douglas College (New Westminster, BC)", "Interview Descriptions": "Long interview with standard questions about what I accomplished in the past and how I have used the skills mentioned on the resume. The questions focused on the job description, but also led to an  open discussion about the role of communications in specific case scenarios.", "Interview Questions": "I do not remember exactly the questions,  but one of them was something like, “How have you used the skills you have in your most recent  roles?”\r\nThere was also a question about how I have applied what I learned at school in my roles."}, {"date": "22 Mar 2021", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Douglas College (New Westminster, BC) in Mar 2018", "Interview Descriptions": "The interview was a combination of the usual soft skills focus. There is however a technical interview where the selection committee members are going to ask you regarding your knowledge on certain subjects that you are going to teach.", "Interview Questions": "What were your most challenging situation and how did you overcome it?"}], [{"date": "15 Oct 2017", "title": "Department Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Douglas College", "Interview Descriptions": "very common panel interview and then skill testing for an hour; interviewers are not talkative. Questions are just some normal questions, like how do you deal with the conflicts with coworkers...", "Interview Questions": "How do you keep students information confidential?"}, {"date": "7 Nov 2016", "title": "Instructor, College Or University Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Douglas College (New Westminster, BC)", "Interview Descriptions": "Lengthy interviews.Lots of promises made.constant e mails and texts,and an incredible amount of back and forthing.Took a while to realize they were desperate for instructors.It seemed like they had a quota to fill as opposed to actually caring about what they were doing.Absolutely no reference or background checks.", "Interview Questions": "Schedules,'Are you interested in advancement? etc. More concerned with the numbers of studenst and pushing them through the program."}, {"date": "8 Jun 2016", "title": "Seasonal Contract Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Douglas College (New Westminster, BC) in Mar 2016", "Interview Descriptions": "In person interview with three faculty members. Interview procedure was fairly standard (have experienced the same style at two other colleges): asked some questions, do a mini-lecture, asked more questions. The faculty members were friendly. Technology was available (for PowerPoint demonstration). They let me know when I would hear from them about getting the job.", "Interview Questions": "What courses am I comfortable teaching in the department?"}, {"date": "10 Nov 2015", "title": "Human Resources Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Douglas College (Vancouver, BC) in Nov 2015", "Interview Descriptions": "Phone interview, brief but polite.  I was asked to describe my most recent role, the department and the company. I asked some questions about the department and the role such as what were the opportunities for training and development, how big was the HR department and how was it made up.  The interviewer informed me that she would let me know in the coming days if she would like me to come in for a face to face interview at the college.", "Interview Questions": "My most recent work experience."}, {"date": "26 Nov 2015", "title": "Instructor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Douglas College (New Westminster, BC) in Oct 2015", "Interview Descriptions": "It was 45 min interview. Mini-lecture on a topic. Then some technical as well as behavioural questions. Questions were general to test the teaching abilities, knowledge of courses and the student teacher relationship", "Interview Questions": "General teaching questions"}, {"date": "9 Mar 2016", "title": "Equipment Room - Student Engagement Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Douglas College (New Westminster, BC) in Aug 2015", "Interview Descriptions": "The interview process was friendly and personable. I felt very comfortable during it, and left feeling happy about how it went. It was a time where we could each get to know each other a little better, and not stressful.", "Interview Questions": "How would I step up into the leadership position/role"}, {"date": "9 Feb 2016", "title": "Instructor, College Or University Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Douglas College (New Westminster, BC) in Apr 2014", "Interview Descriptions": "It was an hour long panel interview that included a review of work history, goals and objectives, teaching philosophy, teaching philosophy, a short teaching demonstration and a discussion about specific courses that would be taught.  This was followed with a very thorough reference check and a submission of academic records.", "Interview Questions": "To do a short demonstration of a lesson."}, {"date": "5 Apr 2013", "title": "Essential Skills Coach Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Douglas College (Coquitlam, BC) in Dec 2011", "Interview Descriptions": "Interviewed with a panel of three.  I was asked to present on how I would approach a particular project they were working (eg. business development). the rest of the interview process consisted of standard interview questions.", "Interview Questions": "All questions were standard. The scenario I had to present on was up for interpretation and vague."}, {"date": "3 Apr 2013", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Douglas College (New Westminster, BC) in Nov 2009", "Interview Descriptions": "I had to meet with a group of people and answer questions about my experience, what I taught in the past... basic questions.  I also had to do a short lecture of their choice.  I did not know what they were going to ask me to present.  This allowed them the ability to see my teach and to see if I know my material.", "Interview Questions": "Don't remember.  As long as you tell the truth, nothing should be difficult.  Unless the question is technical.  In my case, it was only a presentation."}]]