[[{"date": "30 Jun 2023", "title": "Behavioral Health Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valleywise Health (Mesa, AZ) in Jun 2023", "Interview Descriptions": "I just interviewed with them. It wasn’t bad really but when asked how they handle being understaffed they weren’t able to give me an answer. They did handle everything in a timely fashion though.", "Interview Questions": "How have you handled a situation when a patient has said something that was personal and hurtful to you?"}, {"date": "2 May 2023", "title": "OR-RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valleywise Health (Phoenix, AZ)", "Interview Descriptions": "Interviewed with the manager and educator. The process was laid back and the questions were reasonable. Both of the interviewers seemed kind and not intimidating making the process a bit less stressful.", "Interview Questions": "Why should we hire you? Tell me something your resume doesn’t? Where do you see yourself in 5 years?"}, {"date": "7 Feb 2023", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Valleywise Health (Phoenix, AZ) in Feb 2023", "Interview Descriptions": "The process is pretty standard and straightforward Apply, recruiter calls, interview , recruiter calls to give offer. There was a delay between application time and interview but that can be normal.", "Interview Questions": "What are your strengths, why do you want the position, what are your weaknesses, tell me a time you overcame a conflict with a coworker."}, {"date": "2 Aug 2022", "title": "Dietitian Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valleywise Health (Phoenix, AZ) in Jul 2022", "Interview Descriptions": "During the interview, the director made a comment about how she probably wouldn't be able to provide a jacket in my size, despite not knowing what my size was. Upon further investigation, I found out that the company does have jackets to order in \"my size\".  I found director's behavior unprofessional and did not feel welcomed during the interview process.", "Interview Questions": "Are you comfortable talking with other members of the healthcare team?"}, {"date": "29 Apr 2022", "title": "New Grad Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Valleywise Health", "Interview Descriptions": "Professional yet relaxed. It was great to hear realistic logistics regarding the unit, and to know that authenticity is accepted on the unit as well. It was great to get to know the manager, and I look forward to hearing from them!", "Interview Questions": "What is your why? Why do you want to work in this space?"}, {"date": "16 Mar 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valleywise Health", "Interview Descriptions": "Situation. Think of a similar situation that had a successful outcome.\r\nTask. What task were you responsible for in the situation? State your contribution clearly and concisely. \r\nAction. What action did you take? This is the time to highlight your best qualities and brag on yourself a little. \r\nResult. What was the result? How did you specifically contribute to the outcome? What did you learn or take away from the experience?", "Interview Questions": "Explain the situation without violating HIPAA. Don’t speak negatively on the patient or their caregiver. Instead, this is a time to show you have empathy. If you did something wrong, be sure to acknowledge your mistake and share how you corrected it. "}, {"date": "29 Dec 2021", "title": "Social Worker/Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valleywise Health", "Interview Descriptions": "virtual interview that was well organized and informative. Interviewers were personable and informative.  The interview was brief and to the point.  Multiple interviewers to streamline interview.  Overall a good interview for being virtual.", "Interview Questions": "Willingness to provide service in multiple locations."}, {"date": "4 Nov 2021", "title": "Psychiatric Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Valleywise Health (Phoenix, AZ) in Nov 2021", "Interview Descriptions": "Very easy and felt comfortable with interviewers. Questions were simple and straightforward. They told me a lot of the position and what I would be doing in this role. Overall a great experience.", "Interview Questions": "Describe yourself in one word. "}, {"date": "13 Aug 2021", "title": "Phlebotomist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Valleywise Health (Phoenix, AZ) in Aug 2021", "Interview Descriptions": "You interview with two people from the lab, basically just go over the same basic phlebotomy questions that you will experience anywhere you interview for phlebotomy. After the interview, a separate person will call you within 24-72 hours with an offer.", "Interview Questions": "How do you handle stressful situations?"}, {"date": "18 Jun 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Valleywise Health", "Interview Descriptions": "Received call a few days after applying for same day or next day interview. Interviewed with nurse in charge of unit. She asked maybe 3 behavioral questions, gave short tour and acted like I had the job. Was told I’d hear back by end of week and never heard back. Called and left message for follow up and nobody returned my call.", "Interview Questions": "Can you tell me about yourself "}], [{"date": "15 Jun 2021", "title": "Communications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Valleywise Health (Phoenix, AZ) in May 2021", "Interview Descriptions": "Steven was very inviting  introduced me to  Gabby an showed me around office\nEasy fast very nice people \nVery explanatory. An explanations about job position was awesome nice office aswell", "Interview Questions": "What are my weakness and strength\n"}, {"date": "25 Mar 2021", "title": "ICU Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Valleywise Health", "Interview Descriptions": "They make the process friendly and a welcoming environment,  not tense, two people interviewing you. ask a lot of questions regarding you as a person \r\n, how you handle stressful situations, and teamwork skills.", "Interview Questions": "Tell us something about yourself "}, {"date": "3 Oct 2022", "title": "EVS Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Valleywise Health in Feb 2021", "Interview Descriptions": "Very simple, fast, outgoing, great management, manager was very friendly funny, she made she I understood everything and if I had any questions, she met up with me on time with positive attitude and great vibe, had smiled most of the time, this place is a great place to work and good environment", "Interview Questions": "What hours I'll be available"}, {"date": "20 Nov 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Valleywise Health (Phoenix, AZ) in Oct 2020", "Interview Descriptions": "It was brief and on the phone. I think they were greatly in need of staff so they made the process as easy as possible since I had experience. Hospitals are constantly short of staff.", "Interview Questions": "We just talked about my experience and availability."}, {"date": "11 Aug 2020", "title": "Health Unit Coordinator (HUC) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valleywise Health", "Interview Descriptions": "General personality questions and background. Fairly easy. The company is mass hiring so there will be many people you will see. You go through several rounds of interviews and each round has two people in it. They will look at your resume day of seeing you. They will offer to hire on the spot at the end of your interview and draw your blood.", "Interview Questions": "How long do you plan on working here? We are looking for +3 years. "}, {"date": "1 May 2020", "title": "Patient Sitter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Valleywise Health (Phoenix, AZ) in Nov 2019", "Interview Descriptions": "Thorough, but easy going and fast. They go over your resume if you have one, but it's not mandatory. BLS Provider certificate is mandatory for patient sitter position. You'll know if you are hired usually within the week of the interview.", "Interview Questions": "What experience do you have in regards to healthcare? "}, {"date": "3 Jul 2018", "title": "Applications Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Valleywise Health", "Interview Descriptions": "Applied online and received an email from the hiring manager a week later to set an initial phone interview. After the phone interview, I was invited to do an in-person interview with the Hiring Manager and IT director. We discussed my background including education and previous work experience. They asked STAR questions. The following week I received a job offer. Overall it was a positive outcome.", "Interview Questions": "Tell me about a time you were able to successfully deal with another person even when that individual may not have liked you."}, {"date": "6 Mar 2018", "title": "RN Care Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Valleywise Health (Avondale, AZ) in Dec 2017", "Interview Descriptions": "Received a call to interview the day after I applied. Met with the Case Management Director for a very laid back, relaxed interview. She then set me up to meet with another coordinator the next day for a second interview. Finally I met with the medical director at the clinic the position was open for. Wasn’t really an interview, he just talked about he position a lot and introduced me to everyone in the clinic and showed me around. I was really excited and hoping for this position but it wasn’t offered to me. I felt like it was a waste to have me go through three interviews and not hire me. The process took over a month so a lot of time was wasted.", "Interview Questions": "What do you do in your current role?"}, {"date": "16 Aug 2017", "title": "Child Life Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Valleywise Health (Phoenix, AZ) in Jul 2017", "Interview Descriptions": "Mostly background questions with a few situations for response . I liked that most questions pertained to the job itself not mostly behavioral. It was a panel of people that you would be working with so you got to know your potential coworkers as well. The process was pretty quick as well.", "Interview Questions": "What would you bring to a 3 year olds bedside."}], [{"date": "20 Jan 2017", "title": "HIM Department Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Valleywise Health in Jan 2017", "Interview Descriptions": "I was contacted by phone 3 weeks after I submitted the online application. The interview was very light and lasted about an hour. I received a job offer 2 weeks later.", "Interview Questions": "have you ever been in a confrontational situation with a couple Co worker and what was the outcome?"}, {"date": "12 Apr 2021", "title": "Spanish Interpreter Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Valleywise Health in Jan 2017", "Interview Descriptions": "test, speak language English and Spanish. Must test to demonstrate knowledge of spoken and written words. Additionally,  interpret discussion that is medical in nature. There is nothing more to add this this section", "Interview Questions": "is this your native language; "}, {"date": "26 Nov 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valleywise Health (Phoenix, AZ) in Sept 2016", "Interview Descriptions": "Typical questions regarding experience, education, certifications. Very positive and inviting environment.  They not only asked questions about me but let me get to ask questions about them and their facility and unit.", "Interview Questions": "Why do you want to be a nurse here?"}, {"date": "21 Sept 2016", "title": "BHT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valleywise Health (Phoenix, AZ) in Jul 2016", "Interview Descriptions": "Asks for examples of situations you have encountered in the past. Panel takes turns asking questions. Allows you to ask question about company.  Panel is made up of employees who are peers, and questions are relevant to work to be performed. They are not totally honest about pay when you ask, , so that's not the best idea.", "Interview Questions": "Tell me how you have dealt with a coworker who you see breaking policies?"}, {"date": "31 Jan 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valleywise Health in Jan 2016", "Interview Descriptions": "I had a panel interview with the manager and two nurse managers that run the office. I was asked around 20 questions after one explained how the office is ran and the responsibilities I would have. They then asked if I had any question, which I did. I was offered position a week later and had to schedule an appointment with HR. From there it was paper processing and a physical exam with a drug screen, following week orientation started. During orientation there was a tour and getting to know the background of MIHS", "Interview Questions": "what was my biggest set back and how did I overcome it"}, {"date": "1 Jul 2014", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Valleywise Health", "Interview Descriptions": "it took six months to recieve a call back the interview process consisted of being interviewed by the nurse manager and the respoective charge nurses that manage the units and shifts.", "Interview Questions": "when was a time you felt overwhelmed with a patient? and how did you react?"}, {"date": "27 Oct 2015", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Valleywise Health (Tempe, AZ) in May 2014", "Interview Descriptions": "Job fair interview was set up to be a smooth, fast as well as very thorough process.  Job fair was very inviting, comfortable and very informative. APRIA HEALTHCARE and employees were inviting, friendly and informative. The building set up was nice", "Interview Questions": "What was one thing that I did for a patient that went beyond expectations."}, {"date": "3 Mar 2018", "title": "Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Valleywise Health (Phoenix, AZ) in Mar 2014", "Interview Descriptions": "They asked about past experience and how I felt I would fit in to the program. Mostly they wanted to see if i was committed and reliable. All in all quite easy.", "Interview Questions": "Describe your past experiences "}, {"date": "29 Dec 2014", "title": "RN II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Valleywise Health (Phoenix, AZ) in Feb 2014", "Interview Descriptions": "Your previous psych experience will be questioned. Also you will be asked how you dealt with a difficult psychiatric situation. Your previous years, education, and experience will be review again during the interview. There is a week of training with includes online skills and policy modules which are hospital and unit specific and of couple of days training with the electronic health record. CPR class and CPI classes are completed before working on the unit. Was interviewed by both case managers from Desert Vista and the psych annex. Only one introduced himself, the other did not. I did not consider it to be a difficult interview.", "Interview Questions": "What do you see yourself doing in 10 years?"}, {"date": "1 Jun 2013", "title": "RN Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Valleywise Health", "Interview Descriptions": "It was no sweat at all. I got a call from HR and she just asked a few questions about my resume... just clarification questions then we set up and interview date with the nurse manager. It was also a pretty basic interview. Questions were all specific to roles in previous jobs.", "Interview Questions": "N/A"}], [{"date": "4 Jun 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valleywise Health (Phoenix, AZ) in May 2011", "Interview Descriptions": "Must complete online application through MIHS.org website.  Once application is submitted you can review status.  You get the impersonal acknowledgement letter and no other feedback.  Be specific and tailor your application to ensure you highlight the job specifics, i.e., if looking for x number of years of telemetry, make sure you put that in your job responsibilities section.  Don't just rely on a standard resume. Customize your application process for each position you apply for. The job interview process uses standard questions like \"What does team mean to you?\", \"What are your strengths and weaknesses?\", etc.  Review your medication and telemetry strip skills. When I was hired I had to do a test on the first day of orientation which was a surprise.", "Interview Questions": "Nothing was too difficult or unexpected. The surprise was the telemetry and medication test that was part of the first day orientation process for skills training."}, {"date": "29 Jul 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valleywise Health (Phoenix, AZ) in Feb 2010", "Interview Descriptions": "I was a current employee so this process was easier. I applied to a job within my department, but I still had to interview because it was EOE. There where others who applied throughout the office since it was an internal only position, and they were also interviewed, but I knew I was going to get the job because of the knowledge and experience I had.", "Interview Questions": "Interview questions where pretty behavioral based."}]]