[[{"date": "6 Apr 2023", "title": "Medical Doctor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ)", "Interview Descriptions": "incredibly well made, fair, and balanced. An example for all other institutions. Could not have been more well conducted. Interviewers were professional and educated, every question was pertinent, they read my CV.", "Interview Questions": "please tell me about yourself and your history"}, {"date": "7 Nov 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ)", "Interview Descriptions": "I applied online and then I was contacted to schedule an interview. I went to the interview which wasn’t really an interview because the nurse manager just talked about the floor and asked if I had any questions…seemed a bit desperate which is a red flag. Then I had onboarding with HR…you have to provide 3 references (2 supervisors,1 coworker) so have those ready. They do criminal background, education verification, and drug screen/physical. I’m surprised they don’t do employment verification. Overall good but unprofessional experience.", "Interview Questions": "What made you become a nurse?"}, {"date": "15 Jan 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Trinitas Regional Medical Center", "Interview Descriptions": "The recruiter explained to me everything in great detail and was very helpful in the process of on boarding. Then I was sent to hiring manager and she was very detailed as well.", "Interview Questions": "Why did you go into patient care field?"}, {"date": "7 Jan 2021", "title": "Social Worker LSW Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ) in Jan 2021", "Interview Descriptions": "Interviewer reached out about interest in the position and We set up the interview for the following week. I met with 3 LCSWs and talked about my experience and talked about the position.", "Interview Questions": "What attracted you to social work?\r\nWhat do you think will be the most challenging aspect of this position?"}, {"date": "16 Jan 2022", "title": "Social Worker LSW Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Trinitas Regional Medical Center in Aug 2020", "Interview Descriptions": "Met with a team of Social Workers and the Clinical Coordinator. Interview was laid back as they are always in need of the Social Workers due to a high turnover.  Staff is nice.", "Interview Questions": "What interested you about applying for the position?"}, {"date": "10 Dec 2021", "title": "Mental Health Worker Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ) in Oct 2019", "Interview Descriptions": "The interviewer was friendly and asked generic interview questions. The interview lasted about 20-30 minutes long. The interview itself was in a small room with a lot of paperwork so it was a little uncomfortable.", "Interview Questions": "Tell me about yourself/your experience.\n\n"}, {"date": "27 Dec 2019", "title": "Telemetry Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ) in Oct 2019", "Interview Descriptions": "A smooth and great interview process.\r\nThey want to know you and they tell you about the hospital and their patient population.  The HR was so friendly that you wont feel its an interview because you're relaxed", "Interview Questions": "Tell me about yourself "}, {"date": "3 Jun 2019", "title": "Environmental Service Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ) in May 2019", "Interview Descriptions": "The interview was around a hour long but I was lucky to get my second interview and offer the same day. I met with the Hr Manager and then two Environmental Managers.", "Interview Questions": "They asked about my experience."}, {"date": "15 Jun 2019", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ) in Apr 2019", "Interview Descriptions": "She was very nice and very informative about what the job was and what I need to expect. I told her that I learn quick and would be excited to work here.", "Interview Questions": "Have i ever worked in a hospital"}, {"date": "14 Jun 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ) in Apr 2019", "Interview Descriptions": "The Recruiters are kind, approachable, respond immediately to any inquiry. They do not intimidate applicants during interview;  They have respect for the  applicants and the experience they have; They are very professional, organized in their procedures and process.", "Interview Questions": "If I am amenable to the hourly rate as a perdiem;  available to commit to a week of Hospital orientation."}], [{"date": "14 Jun 2019", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ) in Apr 2019", "Interview Descriptions": "Walking interviews.  Interview with HR and the staff coordinator. Discuss the duties of the job and the hospital overall. Basically, they wanted to know my availability and make sure I am going to be on time for work. If you have experience in clinical setting and hands-on.", "Interview Questions": "Clinical questions and a little bit about myself. Simple and quick "}, {"date": "1 Jun 2019", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ) in Apr 2019", "Interview Descriptions": "The interview process was detailed and organized with a step by step process.  I was able to meet with interviewers on different levels who made me very comfortable during the process.", "Interview Questions": "How do you deal with a difficult patient and family member?"}, {"date": "6 Jun 2019", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ) in Apr 2019", "Interview Descriptions": "The interview process is very professional and organized. I first interviewed with the recruiter then with the hiring manager of the department. Upon hiring I was given a detailed offer later and expected a reply within 1 week. I was very pleased with the whole process.", "Interview Questions": "What is your experience and background?"}, {"date": "17 Feb 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Trinitas Regional Medical Center", "Interview Descriptions": "Very generic intrview questions quick and easy , very friendly and helpful HR, worked with me / waited for me to get NJ rn license transfered. Just prepare with all the usual interview questions and you will be all set", "Interview Questions": "What is your greatest weakness"}, {"date": "10 Jun 2019", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ) in Feb 2019", "Interview Descriptions": "Applied online. Contacted a week later for first interview with HR, followed by a second interview with the nurse manager\r\n\r\nThe first interview was mainly going over my resume and learning more about the position. The second interview with the nurse manager was mainly fit questions and some hypoethetical scenarios. \r\n\r\nI simply didn't like the nurse manager at all. Within 2 minutes, I regretted applying for this unit because I realized I could not work for someone like that. She was rude, and kept smirking at my replies. I was surprised that I got an offer. I immediately declined though.\r\n\r\nThe right candidate is someone who will do as they are told, no questions asked. They really want someone who is totally and completely subservient.", "Interview Questions": "What are your strengths & weaknesses?"}, {"date": "7 Jun 2019", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ) in Jan 2019", "Interview Descriptions": "The recruiter was very professional she made the interview comfortable and informative.There was a whole process that I had to go through from background check, references, drug testing , blood work etc.... there also a second interview , if there was any information needed I was given a direct call .", "Interview Questions": "Availability "}, {"date": "21 May 2019", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ) in Sept 2018", "Interview Descriptions": "I was contacted by Director of HR after applying and had a phone interview. I then came in for a 1:1  interview and met with Director and Recruiters. I was then invited to come in for a final interview  with the VP of HR.", "Interview Questions": "What applicant systems have  I used in the past? What networking avenues do you use to get the best qualified applicants?"}, {"date": "24 Jul 2018", "title": "Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ) in Jul 2018", "Interview Descriptions": "Applied to a job, got an offer for a different one, different shift , pay less, I did not feel appreciated, I felt during the interview that they have shortage and they want to fill it in no matter what, ironically they train only 10 days for nurses to work in a long term. I felt totally discomfort.", "Interview Questions": "no questions asked they were just offering what they have and make it as no option."}, {"date": "11 Jun 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Trinitas Regional Medical Center in May 2018", "Interview Descriptions": "A complete waste of time! Ad states no experience necessary but that’s a lie! New grads are not welcomed unless a part of their bridge program Low starting pay....just a waste of time", "Interview Questions": "Describe your most memorable experience as a nurse."}, {"date": "9 Mar 2018", "title": "Information Desk Receptionst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ) in Mar 2018", "Interview Descriptions": "The process is awful. Whoever works in HR is discriminatory because regardless of whether you’re over qualified they don’t seem to want to hire students. They send rejection letters so quick that it would be impossible for them to have accurately reviewed an application. It’s a shame they rather be down staff than to simply hire and train over qualified people with wonderful work ethic.  It doesn’t matter to this medical facility if you’re bilingual, worked with at-risk youth, or have any other certifications or qualifications; Trinitas Regional Medical Center’s HR team has made it clear that they don’t seem to care if people can find and receive top-quality medical care, nor do they care to hire efficient staff. Will never be receiving care here, or recommending this to anyone. It is my recommendation to stay away from the staff and facility 100%.", "Interview Questions": "Are you bilingual?"}], [{"date": "24 Feb 2018", "title": "Info Desk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Trinitas Regional Medical Center", "Interview Descriptions": "You have to go in a little earlier then your appointment time to fill out papers but they are very punctual. The wait isn't so bad & everyone is friendly.   The woman was very nice & easy going.", "Interview Questions": "Why did i sign up for the job? "}, {"date": "15 Jan 2019", "title": "Simulation Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ) in Jan 2018", "Interview Descriptions": "The interview was straight and to the point. No excessively hard questions being asked. Generally just informs you of what skills are needed for the position and pay rate given.", "Interview Questions": "Are you a person that would be considered tech savy?"}, {"date": "3 Jun 2019", "title": "CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ) in Jan 2018", "Interview Descriptions": "Quick and easy basic questions nothing to crazy the recruiter is very nice she’ll help you out looking for a location because there are two in which one you’d like to work at she very on point and will try her hardest. To get you that job", "Interview Questions": "Where did you last work ?\r\nHow long?\r\n"}, {"date": "21 Sept 2017", "title": "Mental Health Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ)", "Interview Descriptions": "Quick simple. Very nice HR people. down to earth. They asked the generic interview questions. Where do you see yourself in X amount of years. They were pretty much quick to the source.", "Interview Questions": "Have you worked in the population before?"}, {"date": "2 Mar 2017", "title": "Department Clerk Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ) in Dec 2016", "Interview Descriptions": "I went on two interviews for Trinitas Hospital they were easy, but the interviewee had me waiting 30 minutes to see her, so the interview started late. HR did most of the talking, but did not know that much information on the position so I felt I was wasting my time.", "Interview Questions": "Why would you like to work at Trinitas."}, {"date": "4 Sept 2016", "title": "Cash Posting Clerk Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ) in Aug 2016", "Interview Descriptions": "If I could rate this company as a zero I would. I started with a phone interview with an intern. She asked very basic questions, nothing to difficult and then scheduled me for a face to face interview for the following week at 11:30am. The instructions stated to arrive early to complete necessary paperwork. I arrived at 11:10am filled out the necessary paperwork and waited for my interview to begin. 11:10 turned into 11:30 which turned into 12:00 which turned into 12:15. I went to the front desk and asked the lady if I could reschedule. The front desk woman explained she had just given my recruiter my paper work and it shouldn't be much longer. Finally, (The HR rep) decides to interview me. She did not apologize sincerely that I waited almost an hour for her. Her excuse was \"We had several candidates who had a lot to say and I didn't think I should have to interrupt them\" First of all, as a candidate ; If I had showed up to my interview 50 minutes late you would consider that rude and unprofessional and she probably wouldn't have interviewed me. So as an applicant, give me the same respect you would want. Not to mention as a \"recruiter\" you should know the average length of your interviews. Since you had several candidates that went over 30 minutes then you should have scheduled your interviews for every hour, not every 30 minutes. Then you have the nerve to be upset because I asked to reschedule. I wouldn't recommend this company to anyone. I can just imagine what the staff is like if the recruiter has a disgusting demeanor. Consider yourself warned.", "Interview Questions": "Why do you want to work for Trinitas Hospital ?"}, {"date": "9 Jan 2018", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ) in Aug 2016", "Interview Descriptions": "Easy application process on TRMC career website.  Recruiter calls you for brief phone interview or will invite you in for interview. Meet with a recruiter and then a hiring manager. Following interview (1 - 2 weeks) will receive an offer or decline email.", "Interview Questions": "Why do you want to  purse Human Resources?"}, {"date": "7 Jun 2019", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ) in May 2015", "Interview Descriptions": "Check the website, create your profile , look for a position you will qualify for or that you’re interested in click on and review scan your resume and submit and follow the additional instructions.", "Interview Questions": "They asked about my experience "}, {"date": "12 Apr 2015", "title": "Family Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ)", "Interview Descriptions": "Very comfortable setting and the two people were warm and friendly. Supervisor and an employee did the interview.\r\nAsked about my experience and my reason for wanting to work there.\r\nWanted people who really cared about the children and their welfare.\r\nWas not nervous because they asked about case scenarios with children and I had many years experience to draw from.", "Interview Questions": "How many years experience of you have?"}], [{"date": "23 Nov 2014", "title": "Supervisor Execise Physiologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ)", "Interview Descriptions": "Standard process that every hospital performs.  Initially contacted via phone, then two interview process within the department and then with the Hospital Personnel Department.  Upon accepting the offer I went through standard hospital drug screening and physical.", "Interview Questions": "Nothing out of the norm that does not happen at multiple interviews that I have gone through.  I guess talking about your strengths and weaknesses is always an interesting question to talk about."}, {"date": "27 Nov 2013", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Trinitas Regional Medical Center", "Interview Descriptions": "Very simple, clear, to the point of what was expected of the position.", "Interview Questions": "I don't remeber if there was any question that did not stay focused to the job that I was appling for."}, {"date": "8 Sept 2013", "title": "Receptionist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Trinitas Regional Medical Center (Elizabeth, NJ) in Apr 2013", "Interview Descriptions": "One interview meet with Dr. who initially conducted the interview which lasted about 15 minutes.  Noted more candidates were being interviewed for the position; however, no feedback/status on conclusion of interview.", "Interview Questions": "Asked to describe a bad day in the office."}]]