[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Excellent Work Life Balance", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Mar 2023", "job_title": "Director of Corporate Accounting in Gatineau, QC", "duration": "N/A", "pros": "No Micromanagement Excellent Culture Lay emphasis on work life balance Encourages diversity and growth Top Management has strategic vision to take the company to the next level - NPO by diversifying activities and building capacity for Indigenous people", "cons": "Rapid Expansion Short Staff Build more infrastructure"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Extreme Toxic Workplace", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "11 Jul 2023", "job_title": "Coordinator in Ottawa, ON", "duration": "N/A", "pros": "The lower level staff were the only positive about working for NWAC, people who genuinely cared about their work and impact on community.", "cons": "The entire leadership, especially the CEO, is incredibly toxic and harmful. It was probably one of the most unhealthiest workplace environments I've ever been in, and working there profoundly affected my mental health. The CEO is abusive, harrassed staff at all hours of the night, and would constantly treat everything as \"a fire\" that needed to be put out. The salary was very low, way below market, and the benefits and vacation time are not competitive. The CEO would call employees ungrateful for asking for more vacation time (low-level staff only get 2 weeks) and berate staff who complained about working too much saying she worked 80 hours a week without complaint. Employees who are fired or let go are offered a higher severance if they sign an NDA - this is what keeps past employees from reporting the CEO and NWAC to the labour board. Lastly, when I was employed the vast majority of management and leadership were men and non-Indigenous women in an organization dedicated to advancing the rights of Indigenous women. How does that work? If you value your mental health and well being, do not work here."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Terrible Organization - no respect for their employees.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Mar 2023", "job_title": "Director in Ottawa, ON", "duration": "N/A", "pros": "The CFO is wonderful and they are lucky to have Alan.", "cons": "Everything. It is a toxic work environment and does not respect employees' time. The CEO needs to be replaced in order for the structure to change. Massive turnover for layoffs and hiring."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 4, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "So Much Wasted Potential", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Jun 2022", "job_title": "Anonymous Employee in Ottawa, ON", "duration": "N/A", "pros": "There are lots of great people at the ground level. And the pay and benefits can be decent.", "cons": "There’s so much turnover and change it’s unbelievable. People change job titled every two months, and are shuffled from project to project like sheep.\r\n\r\nManagement are trying hard to change the org but are incompetent and have little respect for base level employees. Employees don’t get the most basic information to do their jobs. Salaries are grossly unequal, and sometimes ground level employees are the same or more as their managers.\r\n\r\nFinancial processes have improved but are so clumsy, and approvals take much too long.\r\n\r\nThe disorganization is embarrassing, even for important milestone events.\r\n\r\nFinancial decisions are suspect, and money gets arbitrarily taken from project budgets leaving little left to do the actual work.\r\n\r\nProject timelines get shortened to a level where the only reasonable action is to turn in a substandard product.\r\n\r\nYes there’s a fancy new building but I wouldn’t recommend anyone join this organization."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "I love working at NWAC!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Feb 2022", "job_title": "Project Manager in Ottawa, ON", "duration": "N/A", "pros": "I have worked for many not for profit organizations and I must say that working at NWAC is a real pleasure. My suggestions are listened to and I am treated with respect. The organization genuinely believes in their mission and I am so happy to be a part of making the lives of Indigenous women better. The leadership at NWAC is visionary while at the same time, down to earth. We can actually see our work in action. The CEO is smart and experienced. Her senior management team is committed to the organization and that trickles right through the work force. The benefits are excellent and the morale is high. I enjoy this job and look forward to being here a long time!", "cons": "Because of financial restraints, the organization cannot always do everything it wants to but that is no fault of NWAC's. That said, they are able to prioritize well. Also, with the impact of COVID, it is harder to work like a team but NWAC management makes an extra effort to meet on-line often to make sure we are all connected."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "best", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Nov 2022", "job_title": "Manager in Hull, QC", "duration": "N/A", "pros": "no job grantee in out", "cons": "management no faces all the time"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Overall a good place to work.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "21 Jun 2022", "job_title": "Executive Assistant in Ottawa, ON", "duration": "N/A", "pros": "The benefits are really good and management is caring.", "cons": "It's not a 9-5 job for everyone. Some days have have long hours but you get compensated for it if preapproved by your manager."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "FALSE INFORMATION BEING POSTED BY EXEC. DIRECTOR AGAIN", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Feb 2022", "job_title": "ChargÉ De Projets in Ottawa, ON", "duration": "N/A", "pros": "Only the staff who try their best...but when the EDirector fires at least 50 people a year with only a rotating staff of about 60, you there is SOMEONE who is terribly wrong.", "cons": "The Executive Director who should have been fired years ago. She is a poison to any office environment, any non profit organization and any organization that does not regulate her. So sad."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Non-Supportive of Indigenous Women", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Jan 2022", "job_title": "Executive Assistant in Ottawa, ON", "duration": "N/A", "pros": "No job security with this organization and will use the excuse of \"no money in the budget\" for anything innovative and new.", "cons": "I'm totally confused about hiring \"non-Indigenous\" people, including men into a once great organization that is supposed to be representative of ALL INDIGENOUS WOMEN across Turtle Island. This organization is not transparent enough and should be made to be accountable - especially since they put out a Policy Declaration to \"hire and be more inclusive of and with Indigenous Women\""}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Toxic revolving cycle and environment", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Jun 2021", "job_title": "Marketing Director in Ottawa, ON", "duration": "N/A", "pros": "- The CFO is amazing. He is holding the organization together.", "cons": "- CEO is toxic and egotistical.\r\n- High turnover of employees.\r\n- Very unorganized organization.\r\n- When the CEO receives any type of funding it is gone in a week and the Finance Department is always stressed. This is a consistent toxic cycle."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Policy Advisor", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 Feb 2021", "job_title": "Anonymous Employee in Ottawa, ON", "duration": "N/A", "pros": "Collaborative working groups.\r\nFelt supported by my Sr. Director and other members of the senior management team.\r\nAlways felt like my work had meaning, made me feel proud to be part of NWAC.", "cons": "I understand that Government Contract cycles makes it difficult to hire long-term staff, it would be nice if that could be changed."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "review", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Dec 2020", "job_title": "Financial Analyst in Ottawa, ON", "duration": "N/A", "pros": "keep growing my skills and learning new knowledge", "cons": "need to train and work with new staff"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not worth applying", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "10 Jan 2021", "job_title": "Executive Assistant in Ottawa, ON", "duration": "N/A", "pros": "Not much for pros - no growth no advancement", "cons": "research the organization thoroughly before applying"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Policy Advisor", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "24 Jul 2019", "job_title": "Policy Advisor in Ottawa, ON", "duration": "N/A", "pros": "NWAC has a history of strong grassroots involvement.  However, under the current sociopathic, narcisisstic monster of an executive director, the organization is collapsing from within.\nThe executive director plainly manipulates situations and employees to gain trust and then throws employees, mainly indigenous women, under the bus to achieve numbers and stats for contribution agreements.\nThe staff are aware but are treated with such toxicity that it's terrifying to think .. let alone talk or DO something that might not agree with what Lynne Groulx has in mind for what she calls HER organization.\nHer board of directors have little power over her manipulation and she uses a team of lawyers meant to represent indigenous women... To protect herself and manipulate law and human rights to achieve her goals.  Which seem very corporate and non-genuine \nOne of the fired employees leaked the document Lynne Groulx paid for to have her genealogy tested \nIt was proven that she has only three indigenous ancestors from the 1700's.  And she claims she is Metis. \nIndigenous women should be leading this organization. Not a monster of a woman who leaves a trail of tears and toxicity with every human resource hire and fire.\nDONT WORK HERE UNTIL LYNNE GROULX IS GONE.", "cons": "Executive director is a monster.  Illegal hiring and firing practices.  You will NEVER have job security. Don't sign a non-disclosure agreement... She is having new hires sign them BEFORE they are hired now."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "EXECUTIVE DIRECTOR IS A MANIACAL MONSTER", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Mar 2020", "job_title": "Policy/Program Analyst in Ottawa, ON", "duration": "N/A", "pros": "If you enjoy being left in the dark and never being able to make connections with fellow employees because it will make the monster of an E.D. jealous and think people are talking about her.. hen THATS a pro I guess.", "cons": "The executive director sheds a dark and ugly cloud over her employees. She's a classic narcissist and hires and fired people in her own game .. she now makes people sign non-disclosure agreements before she even hires them now... Think of th worst character manipulator in any horror movie . Like really sick and twisted stuff.... She's a monster... She fired a girl who got stabbed by her boyfriend over the holidays WHILE she was on th hospital.  She claims she is indigenous but her own geneoology done through McGill university and shared publicly proves she only has one indigenous ancestor from the 1700's.  There have been numerous articles about her but the federal government has made the folly of signing an accord for indigenous women through her so she thinks she is important.  She's bullied her board members when they sp am out about what she's done to the over 60 employees she's fired for no reason ... Don't work here.  It's awful. You'll hate it . It's dark and oppressive and not at all progressive. Oh and she favours french white women and treats women of colour with severe oppression. A complete wreck."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Internal Conflict and Workplace Toxicity - Avoid.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "18 Jun 2019", "job_title": "Project Manager in Ottawa, ON", "duration": "N/A", "pros": "- Staff, especially the Junior Analysts and Researchers, are wonderful and supportive amid the chaos caused by upper management.\r\n- NWAC was at least /founded/ on strong cultural values.", "cons": "- ED/CEO: I really cannot describe what’s wrong with Lynne Groulx. I gave her the benefit of a doubt for almost a year before it became apparent that her managing style is to divide and conquer. She promises new staff the world, pits them against older staff, and if anyone steps even a little out of line, she terminates them without cause and uses tax-payer money to fund non-disclosure agreements.\r\n- Workload is so heavy that many staff suffer mentally. I personally was hospitalized twice in the first few months after Lynne Groulx became CEO. \r\n- Morale is lower than the salaries. Workplace culture is divisive and stressful.\r\n- No stability due to high turnover rates, especially in HR. \r\n- Board of Directors are incompetent and lazy. No knowledge of NWAC bylaws or governance. BOD members who try to stick up for staff are removed by the CEO."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Do not accept a job offer here", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "12 Feb 2020", "job_title": "Anonymous Employee in Ottawa, ON", "duration": "N/A", "pros": "They have a good location close to transit.", "cons": "Please search the media coverage for this place before you take a job or even apply. \r\nThe CEO is extremely unstable - yells at staff and talks negatively about staff behind their backs. \r\nShe changes your job without asking you. There are regular firings even people who are doing their jobs well. \r\nThe Board has no power to lead the organization. \r\nThe CEO is most hostile to First Nations women who work there. \r\nHer senior advisor asked all staff to write positive reviews here to hide the serious negative reviews from the many who have worked there and left traumatized. He wanted the real reviews to be hidden from view. \r\nWhether you are applying for a very junior or very senior post and whether you are young or old - it is not a healthy place to work. \r\nMostly everyone who works there is scared and actively looking for other work."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Corrupt organization only interested in its online optics", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Nov 2019", "job_title": "Legal Counsel in Ottawa, ON", "duration": "N/A", "pros": "- Very quick on social media and online activity to alleviate negative (and accurate) press\r\n- Active on social media accounts\r\n- Always hiring", "cons": "- NWAC's optics are its main concern as it aggressively and increasingly attacks online reviews of its toxic work environments, i.e. editing its own Wikipedia and the upper management adding reviews on Glassdoor\r\n- Bullying from upper management upon lower level staff in the form of salary discrepancies, late night and very early morning phone calls, etc.\r\n- Inauthenticity about the Indigenous women it represents; claims to represent the three groups in Canada but does little research in the areas of Metis and Inuit women's needs\r\n- Lack of accountability (staff accountability is non-existent; performance reviews do not happen, turnover ensures lack of consistency in projects)"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Explosive, Rotund, Power-hungry CEO......", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "8 Jul 2019", "job_title": "Director in Ottawa, ON", "duration": "N/A", "pros": "Because the level of abuse and harassment from the CEO is so high, you might get a free pizza lunch every once in a while as an attempt to make you forget everything you've been through.", "cons": "A typical day at work....\r\nStart your commute to the downtown office location. Feel your blood pressure and anxiety heighten the closer you get. \r\nOpen your work email on your phone and discover the 13 emails sent to you overnight at 2 or 3 AM. Sift through the panicky-emails sent to you from the ED's admin assistant - who is verging on a complete burn-out.\r\nStand at the door of your office for a while because your door code doesn't work - someone was canned yesterday and the door codes were changed-AGAIN.\r\nSit at your desk and listen to staff member after staff member, complain and cry of how they are treated. Try to give them advice, direct them to HR.\r\nNow its time to address the 30+ condescending and belittling emails sent to you while you were talking to staff.\r\nAssign duties to your staff - overload them, convince them that this is normal and/or appropriate because the CEO doesn't care what your department's actual capacity is. She wants MORE MONEY and FAME at whatever and whoever's cost.\r\nSo we work hard, respond to unreasonable and outlandish requests from the CEO's office. Amidst the incredible pressure, we get through our tasks each day, actually do a damn good job, but there is no time for positive reinforcement from the CEO because she is already sending you nasty emails about the next thing you should be working on (that you didn't even know about).\r\nAt this point in the day, you remember that you haven't eaten yet and you should probably go to the washroom. But then you've been summoned to the monsters den where you watch her pick through today's array of snacks delivered by staff and paid by tax-payers (she works so hard micro-managing all day and night so therefore has no time to prepare and bring her own lunch) - watching her gnaw on candy as she rips you a new one has ruined sour jujubes for me.\r\nAfter a good 9 hours of work AKA \"place of many anxiety attacks\", go home and think about what craziness is in store for you tomorrow. who will be fired today? Will the police show up to the office today? Who is scheduled for the next office melt-down? Will this awful feeling ever go away when I see a jujube? I wonder if _____(insert name of the week) will ever come back from their sick leave?\r\n\r\nWords can't describe the feeling of working for this organization with the current CEO in charge. The CEO manages people using intimidation, straight up harassment and ultimatums.  She convinces herself that her crazy, spur of the moment ideas are appropriate. People are completely replaceable, \"Accountants and Policy people are a dime a dozen\". She has successfully brainwashed the on-salary in-house NWAC lawyer to not look after the best interests of the organization as a whole but rather protect her as an individual as she is NWAC - the \"Queen of NWAC\".\r\nIt is truly sad that an organization that advocates for Indigenous women is caught treating the very people they represent worse than any other agency or company I know. Horrible pay, mediocre benefits, terrible - shared working conditions, high stress, etc.\r\n\r\nDo not be fooled, you WILL be fired or pushed out of your job. If you have ethics, are empathetic or are any decent type of individual, you will not last long at this organization with the current management.\r\n\r\nIt shocks me that a Board of Directors would allow someone to do this to such an important organization. They all know what is happening at this place google NWAC and CBC."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Positive Changes at NWAC", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Oct 2019", "job_title": "Anonymous Employee in Ottawa, ON", "duration": "N/A", "pros": "Over the last couple of months I see that new members have joined the management team at NWAC.  They all have excellent credentials, backgrounds and work experience.  I am very optimistic at the new direction NWAC is taking.", "cons": "Some employees hang on to the past and can't see that the new management team are putting processes in place to make it a better organization for everyone."}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "meaningful work, good  benefits,  Elders onsite", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Nov 2019", "job_title": "Policy Analyst in Ottawa, ON", "duration": "N/A", "pros": "Meaningful work\r\nExcellent benefits short term disability, closure for 2 weeks during Christmas holidays, dental, pension, etc\r\nAll staff standup meetings every two weeks \r\nNew senior managers are experienced professionals", "cons": "Project funding creates sudden increases in workload \r\nChanges in roles and responsibilities on short notice due to growth\r\nOffices are on multiple floors"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "NWAC could be great, but the ED/\"CEO\" needs to be dealt with", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 May 2019", "job_title": "Anonymous Employee in Ottawa, ON", "duration": "N/A", "pros": "NWAC was a dream job when I first started - I was working on policy files I loved, getting experience with senior level work in an entry-level position, the relationships with my co-workers were wonderful. I worked at NWAC for a year and a half but it was really only the first six months that I felt safe and valued as an employee.", "cons": "NWAC is a great organization and is capable of doing great work, but not with the current leadership.  They have compromised on NWAC's values in their operation of the organization and have undermined the credibility of NWAC's advocacy.  I wish I could provide more context for this claim, but I truly have never met anyone more manipulative, calculated, or deceitful.  While many of these reviews mention the ED/\"CEO\", we are not just spiteful former employees.  Many were forced out for challenging the ED/\"CEO\" and others left to care for their mental health.  We followed all internal conflict resolution processes, we wrote a letter to the board of directors with our concerns, some spoke to the press - but NWAC just kept hitting a new bottom.  \r\n\r\n- Staff have no job security in their contracts and are often fired without notice and without adequate reason. These firings are frequently defended by management and blamed on unstable project funding from the government (a way they can also strategically advocate for more core organizational funding).  Staff are now made to sign non-disclosure agreements before being given their contracts which I think is for efficiency more than anything else. \r\n\r\n- Constant gaslighting - Staff are made to feel like they are asking for too much. Whether it be an adequate salary (to match the salaries of our project budgets), an adequate workspace with HR accommodations, or approval for overtime to meet the demands of the workload, we were always told there was never funding.  We were told these things are part of non-profit work, which to a degree, was acceptable.  But as time went on, it became increasingly obvious that the ED/”CEO” just operates NWAC in a state of chaos as a way to controlling staff.  When you are constantly putting out small fires, its easy to miss the larger shifts taking place.  \r\n\r\n- Intentionally weak directorship  -  Aside from a few women who are exceptions to the rule, the ED/\"CEO\" has strategically selected people not suited to director and senior management positions.  Most lack the experience to lead their units and senior-level work frequently falls to lower-level staff, but without the recognition or compensation.  For these reasons, many staff leave NWAC without a reference from a supervisor or director.  There are few opportunities for mentorship, especially given the incredibly high turnover rate.\r\n \r\n- Lack of Indigenous staff - I write this as a non-Indigenous former employee but this is incredibly important.  NWAC is a colonized space, which is likely why it has struggled to attract and retain Indigenous staff.  When the lack of Indigenous women in leadership positions was brought to her attention, the ED/\"CEO\" would constantly say that no qualified Indigenous women were applying – which to her meant no women with law degrees or PhDs were applying.  Leadership does not value lived experience or traditional knowledge, with the exception of several Elder Advisor roles.  Despite advocating for solutions to the systemic reasons why Indigenous women are under-represented in post-secondary education, NWAC continues to favour non-Indigenous folks with graduate degrees and experience in government.  Despite advocating for the economic empowerment of Indigenous women, NWAC has given the highest-paying senior positions (100k+) to white men while the majority of staff are making under 40k."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Overworked and Underpaid staff- Little to no job security", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "12 May 2019", "job_title": "Junior Staff in Ottawa, ON", "duration": "N/A", "pros": "Great colleagues who support one another.", "cons": "Salary is low, Staff are overworked, No job security, management is incompetent, when complaints are voiced, staff are not listened to, HR frequently resigns because it is impossible for them to do their job"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Just don't do it", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "15 May 2020", "job_title": "Communications in Ottawa, ON", "duration": "N/A", "pros": "Some of the people are very nice. The receive benefits. There is usually cake at lunch when it's someone's birthday.", "cons": "Everything else is a con. The workplace is toxic. Your every move is micromanaged. Everything you produce is an \"emergency\" and therefore last minute. There is no sufficient management structure. The turn over rate is high for a reason. Just don't do it."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Power hungry CEO, lack of community accountability,  underpaid, burnt out staff", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Aug 2019", "job_title": "Policy Analyst in Ottawa, ON", "duration": "N/A", "pros": "Coworkers were great. We would comfort each other when we had panic attacks.", "cons": "Underpaid, overworked junior staff. Managers are non Indigenous and don’t know much about indigenous issues ironically. CEO fires people on a whim- staff are constantly on edge worrying about being fired"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Terrible place to work", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Apr 2019", "job_title": "Anonymous Employee in Ottawa, ON", "duration": "N/A", "pros": "Working for a good cause", "cons": "CEO is a bully who treats junior staff terribly. Managers are all over worked and expected to put in unpaid overtime. Anytime a meeting is called you are afraid you will be fired. Staff are almost all underpaid."}]]