[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Working at Lifeline Foundation, Vadodara", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Dec 2022", "job_title": "Assistant Manager in Vadodara", "duration": "N/A", "pros": "Working at Lifeline Foundation, A nonprofit organization makes me proud. It has a solid ethical foundation and throughout the course of the last 5 months of my association with the organization, I have learned a lot and still adding to my knowledge. There are no shortcuts taken in the lifeline. The management is very professional. Always ready to offer the right assistance to colleagues who are having difficulties with their duties to start and complete the deadline of any given task or project. one of the things I admire about the organization is the ability to manage multiple projects and teams. Leaves have never been an issue for me., You will be expected to work harder but with that, the management will also be generous to grant leave when needed. On-time salary and job stability are the strong factors of the organization.", "cons": "Extensive Traveling, sometimes even beyond office hours as per work requirement of a trainer. But if you are a traveler, you would enjoy,"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Many things to learn and grow", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "2 Dec 2022", "job_title": "Program Officer Training & Implementation in Vadodara", "duration": "N/A", "pros": "I have been working with Lifeline Foundation, Vadodara as Program Officer Training & Implementation since 5 months now. I joined totally as a fresher and I think I have grown as person. Lifeline Foundation, Vadodara is a great place to learn and grow as a person. There is a lot of work pressure and deadlines that you will need to meet. If you are someone who cannot work in pressure better either prepares yourself of it can get difficult at times. But once you surpass this pressure you can grow in any organization you join.", "cons": "Environment is stressful and too much of work pressure. There is no time limit to work. It can sometimes feel like a 24 hours job too. But working in an EMS sector will never have a time limit. Can hamper Work life balance if you cannot handle it."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best Place to Grow", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 May 2022", "job_title": "Program Officer in Vadodara", "duration": "N/A", "pros": "Lifeline Foundation is an organization that will help you grow enormously in all the fields of life not just professional but also personal. \r\nIt is a place full of adventure and challenges, If you are a person who is always ready to face any challenge put in front of them, then welcome here.\r\nAnd the most important, you will get to travel a lot. If you are someone who loves travelling than this is the place for you.\r\nThe organization always comes with new projects which helps to expand the knowledge and expertise of each employee.\r\nWe at Lifeline Foundation believe that each and every life is precious. Therefore, We are always working in some or other way to contribute towards our goal of saving lives.", "cons": "You may feel somedays, it's loaded because there is always some or other work in a row. \r\nIt is a place full of challenges, I you get scared of challenges and it affects you negatively than not the place for you.\r\nWork life balance may get affected, but then it all depends on you how you conquer it."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Be Patient, Have Trust, working with Lifeline Foundation, will be a Ladder to your Growth.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Nov 2020", "job_title": "Training Officer in Vadodara", "duration": "N/A", "pros": "I joined Lifeline Foundation, as a fresher and now it’s been more than 2 years, I am working in the training department. It will not be wrong to say that the growth I observe in myself is just because of the seniors I work with. \r\n\r\nWhen the whole world is facing crises due to Covi19 lockdown and the work force is in difficulty , Lifeline Foundation and it’s associated companies, Baroda Life Management Pvt. Ltd. and Medicare Consultancies made sure to stand by its employees and workers. None of them has to go even a month without their salary. And this is enough to show that if you work here by heart, your interests will never be neglected.\r\n\r\nHere you can have coolest Bosses who guide you through. They groom you in every possible way and finally when you understand, you are Jack Of All Trades and patients and trust in their ways , will also lead you to know your mastery. \r\n I am not sure if any other organization can provide with such an exposure to your work and professional life. \r\n\r\nThough I am a part of the training team, but since past 2 years I have been associated with many other projects of Lifeline Foundation. No other appraisal is greater than being a part of successful projects and your reporting officers and Head of the company congratulating you in person for each and every successful step.", "cons": "Many processes followed here are traditional. It is high time to exploit the modern ways especially in documentation and accounting."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Wonderful place to work; great ideation opportunities", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "14 Dec 2021", "job_title": "Senior Consultant in Vadodara", "duration": "N/A", "pros": "A congenial atmosphere; high competitiveness and high intensity work. But a lot of bonhomie and friendliness.\n\nA great place to ideate and experiment. Opportunities to showcase talent. Brilliant mentorship to extract hidden talents.\n\nAn ideal organisation for those who are in pursuing education in social work or life sciences and want to break away from the norm and do something different", "cons": "None that I saw or perceived."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Work Experience at Lifeline Foundation", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "31 Dec 2020", "job_title": "Program Officer in Vadodara", "duration": "N/A", "pros": "- Working at Lifeline Foundation will teach you soo much in such a short duration. Working anywhere else might not have given me such varied and eclectic experiences in just a few months of work.!\r\n\r\n- Dr Das, the CEO, works extremely hard and expects his employees to do the same.. Infact the entire team appreciates and values hard work.. Only if an individual is willing to push himself/ herself to be a better and a more efficient person, can he/she enjoy working here..\r\n\r\n- The management takes care of its employees. If you are honest to your work and with your employees, they will try and help you in all ways.\r\n\r\n- You are allowed to stumble, make mistakes and learn from them!\r\n\r\n- Your work will not be limited to a single task or profile. You will learn to dabble in and learn from a variety of things..\r\n\r\n- Even during the lockdown, the employees were given work and timely salaries..", "cons": "The work-life balance gets a bit disturbed and you sometimes end up sacrificing your leaves.. especially during the time of important conferences or events.. But the teachings you receive from the time you invest more than make up for it..!\r\n\r\nIf you are looking for a time to time, monotonous, boring job of sorts, then this is not at all the place for you.."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great work place to enhance your personal and job skills", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Jan 2021", "job_title": "Account Manager in Vadodara", "duration": "N/A", "pros": "Great place to work and enhance personal skills lifeline foundation is not profit organization helps needy people. Dr.das and  Sushmita Mam is the backbone of the foundation they helps all like out of the way 24*7.\n\nPersonally I got a chance to grow up my skills in Medical Appliance bank, Non profit things like pasti and donations other than accounting field. \nWork environment and coligues of the foundation was very helpful and believes in growing together.\n\nThe support getting from Sir and Mam remarkable, they encourage and helps to grow individually. \n\nWork Timings are pretty good, handsome pay, holidays, leaves, Birthdays & celebration is life time memories.", "cons": "You should be multi tasking person to accept and completing work you haven't given before. Anyway cons. are differ from person to person and organisations too."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Good learning experience at Lifeline foundation", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "8 Feb 2021", "job_title": "Accounts Manager in Vadodara", "duration": "N/A", "pros": "Life line foundation was my first job in Vadodara when I moved to this city after marriage . The dynamic environment had provided me a wide spectrum of experience and exposure. . I served the organization with positive attitude and efficiency only because of the workplace environment and down to earth nature of top management . The reason of leaving the job was pregnancy. I will cherish all the memories I have gathered during my work tenure . I feel good getting birthday wishes every year from Ms. Sushmita Das even when it's close to 4 years since I have left the organization. I would consider rejoining Lifeline foundation when I decide to work again.", "cons": "There would be work pressure."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Working at lifeline foundation was indeed a great experience.", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 Mar 2021", "job_title": "Training Officer in Vadodara", "duration": "N/A", "pros": "1) Organization makes you learn new things and adapt to them so well.\r\n2) Work culture is amazing. Every one working here is treated equally.\r\n3) This was my first job, so my seniors in training team did considered that and would explain minutes of every new tasks which I was supposed to perform .\r\n4) There were times when I made mistakes but there were no negative reactions to it ever from the team. They would explain it to me how shal it be done.", "cons": "1) You will have to learn to Multitask ( but this cone can turn out to be on favour for you)"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "It has been a Rollercoaster Ride!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Aug 2020", "job_title": "Training Officer in Vadodara", "duration": "N/A", "pros": "One of the best firm to work with. I have been able to achieve many goals while working with the organization. I started as a fresher and wanted to learn the working environment, develop interpersonal goals, sharpening my skills and also learn alot about different topics. I have developed a lot of skills that i think i wouldn't have achieved if i was in some other firm. Great team work and amazing  office mates, and ofcourse the  best CEO's  adds up alot. I was quite satisfied of my job and work that I was doing.  Afterall thats what really matters.! I will accept that after 2 months of my work here i was about the leave the organization, but a positive feedback from the CEO gave me a chance to see the change, which actually happened!\nSincere gratitude to LifeLine Foundation.!", "cons": "I just would  say one thing that if you are quitter, this organization is not for you. This is the chance to find out your hidden talents and Sharpen your skills. Altogether a different experience!"}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "A place that builds you as a professional", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "19 Sept 2020", "job_title": "HR Administrator in Vadodara", "duration": "N/A", "pros": "I am a person who likes to read, and get to now new things. Even if they are not directly connected with my life or work. I found that Lifeline Foundation was perfect place for me. \r\n\r\nI have been associated with Lifeline for 3 different times in different roles. And I still continue to be associated every time I am required by Lifeline in any of its projects and events. And I was constantly applying my knowledge about different things here and in the process learning new things. \r\n\r\nSo, this is what I would like to say to all seeking job at Lifeline Foundation, if you like challenges, learning new things this is the place for you. Life can never be mundane or boring here.", "cons": "I am not saying it is all easy, especially as you are working with a perfectionist. Life at Lifeline Foundation has its own challenges like all places. But if you like being challenged every day, it’s the place for you"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Workplace  that encourages growth", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Aug 2020", "job_title": "Senior Accounts Officer in Vadodara", "duration": "N/A", "pros": "Medicare Consultancies is a organization which is lead by proprietor but it's mission and vision is no less than that of a corporate in the field of any service provider.\r\n\r\nThis organization allows you to explore your self capabilities and helps you grow within and beyond one's capabilities.\r\n\r\nIn this organization you will learn to be a leader and this organization will help you grow in numerous ways which will help one face and resolve the issues faced in professional as well as personal life.\r\n\r\nThis organization also provides a work environment and work culture which is friendly in nature and also makes one feel that the organization is their second home.", "cons": "There are no cons to an organization per se, any cons to one's point of view may not be some other."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Why LLF is a standalone working organisation for making STRONG employees", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "17 Aug 2020", "job_title": "Training Officer in Vadodara", "duration": "N/A", "pros": "One of the biggest motivations and blessings to me was when the CEO of the company Dr Das took me to give an opportunity to become a trainer in a field that I lacked expertise and most importantly as a fresher. \r\n\r\nA little down the memory lane story from my experience. My job expectation was simple from the company: It was to conduct First Aid and CPR training for a collection of audience from various walks of life. To me, this was the most difficult job and unfortunately it being the first job itself. So, the duties included teaching topics mostly in Hindi and local Gujarati (which I was really bad at both) and English was very minimal to be used (wherein I was very fluent at). Dr Das had his second thoughts on me but I took it up as a challenge and in three months of time, I was able to deliver topics (at least if not fluently) but to an understandable extent to the sitting audience who in time, I learnt had started to pay attention than earlier. I bought a lot of Hindi novels and local Gujarati dailies to equip my vocabulary to deliver better. \r\nIn the next three months, Dr Das gave me more training experience and this included pan-India travel and with more exposure came more feedback which we always received from the audience to rate the trainers. My ratings grew from pathetic to satisfactory and at times exceptional and Dr Das was happy. \r\nI was promoted to a Training Officer. My duties in in the job now didn't stop just there, I was also given additional roles and responsibilities wherein I used to conduct Paramedic interviews for our OHC staff and train them initially; further do B2C marketing for societies to sensitize the awareness in learning CPR and First aid; to handle the keys of the cabinet as an Admin Rep and manage them between training periods. Overall, this role, not only gave me a widespread and\r\n an over-exposure of opportunities in cultivating interpersonal skills but also the art of talking briskly, lucidly, fluently and with reason to the public; befriending strangers on the first call or first meet; taking more and more responsibilities within a short span of time based on your abilities; maintaining business etiquette while meeting top management Clients and living together as a family as the staff count was very small. \r\n\r\nToday, when I see myself from the career evolution perspective, I can handle any kind of responsibility or pressure thrown at me at any organisational or hierarchical level because I rose from scratch to top in just 9 months which takes people at least between 2 to 5 years to understand the wisdom every job has to offer elsewhere. Trust me, had I wanted to take the above as a gripe or complaint, I would have stuffed it in the CONS section. I wouldn't shun the fact that it was too much to handle at times because of the consumption of work, but at the end of the training, you feel satisfied and relieved having borne responsibilities and sacrifices. \r\n\r\nDr Das brought a life-changing moment that I won't forget in my life ever when I told him that I was taking a lot in my plate: \"If every person were to think too much of their work and life balance and say I did this and that to come here, we would get whiners everywhere all the time! That's how Amitabh Bachan and Shah Rukh Khan were made in the first place compared to thousands of thousands who wanted their big breaks but couldn't make it!\"", "cons": "If you think there are cons! Trust me, you won't be able to work or adjust anywhere. The strongest of CONS is its strongest PROS! If you've the mindset of a person who's ready to take any amount of load-work to better your career and future so that you don't go through similar situations time again like a loop in your life, you can go for this Org, else DON'T! Sometimes, we need to understand the often forgotten fact that people are made for jobs too! I'm thoroughly happy that this become my first job and in fact, a noble job. Because who gets to tell people, \"Hey, you've the ability and authority to save a life when there is a need\" ?\r\n(And if you think this is a hype review, trust me, no one paid for me, I wrote this out of sheer diligence and gratitude to the founding institution where one recognizes if they are really built up to become strong or whine and become weak!)\r\n\r\nAlso, please don't go by bad comments that say it's a terrible place to work or calling Dr Das foul words. It's a high-pressure work environment, I guarantee that and involves too many responsibilities that will only benefit and shape a person's career as they go up the ladder. Every other Org does that too! The Man is a Legend. \r\n\r\nIn my defense, I personally had to quit the firm because I had a passion to write and I couldn't find ample time to research and write."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Crusader Against Death On Highways Due To Road Traffic Accident", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "31 Aug 2020", "job_title": "Training Manager in Vadodara", "duration": "N/A", "pros": "1) Get to learn many things which we are in association with in our routine life but had no idea what they stands for.\r\n2) Systems here made me realise, what it is to rise again after I fall.\r\n3) Senior consultants are always there to help you to dive through the challenges.\r\n4) Versatile tasks to handle.\r\n5) You will be made to master the tasks well by showing where you need to improve and strengthening your knowledge on different aspects of it. This makes you so good that you can actually help your colleagues or juniors to develop them. The organisation also gives you a platform for this knowledge sharing to happen across levels and across departments.\r\n6) The organisation thereby grooms you so well that you become a team-leader.\r\n7) Higher management Dy CEO Ms Isha Popat, Dr Subroto Das & Mrs Sushmita Das has all to motivate you! They will let you fall, will let you feel the heat but will never leave you in the middle of the way.\r\n8) Dr Subroto Das has a very true saying: \"Either I will make you or I will break you!\" And I see myself where I am now.\r\n9) Trainings, Lectures, Conferences, Workshops, NGO Fairs & Events, got many things to learn as Organisation manages these programs internally irrespective if the program is on National Level or at International level.\r\n10) I personally love travelling and since I joined for my work, I have travelled more than 6 states and many cities for official work.\r\n11) At the end of the day, feel blessed to be a part of these Crusaders, who train people for Saving Lives.\r\n12) Very much strict towards health issues.\r\n13) Much impressed during COVID times. Even during WFH, no salary cut and staff from accounts putting their life at risk, managed to complete salary for on field staff (drivers, paramedics, ambulance operations team members) as well as for office staff on promised dates.\r\n14) Dr Subroto Das stays available 24*7 to guide in any medical emergencies to any of his staff members or to their family members.", "cons": "1) Quite long routed permission channels / system. At times, it leads to miscommunication / communication gaps. \r\n2) Amount of work pressure is quite good, obviously it makes you but at times, it breaks you also.\r\n3) No leave from wearing formals on Saturdays / non client visit / non training day.\r\n4) Since major programs are handled internally, it is much stressful during conference."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "I worked at Lifeline Foundation for around 1.5 years.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Oct 2020", "job_title": "Project Officer in Vadodara", "duration": "N/A", "pros": "Higher management always encourages innovative ideas and provide full freedom to employees, assist to enhance managerial skills", "cons": "Since they are into Emergency Medical Services, sometimes you have to work under immense pressure, but that teaches you to tackle crises"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Worst company", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "15 Oct 2019", "job_title": "Human Resources Assistant in Vadodara", "duration": "N/A", "pros": "No adventage to work with this bogus company.", "cons": "Worst and unprofessional work environment.\r\nNot recommend.\r\nGod knows how company's owner got padma shree"}]][[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Working at Lifeline Foundation, Vadodara", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Dec 2022", "job_title": "Assistant Manager in Vadodara", "duration": "N/A", "pros": "Working at Lifeline Foundation, A nonprofit organization makes me proud. It has a solid ethical foundation and throughout the course of the last 5 months of my association with the organization, I have learned a lot and still adding to my knowledge. There are no shortcuts taken in the lifeline. The management is very professional. Always ready to offer the right assistance to colleagues who are having difficulties with their duties to start and complete the deadline of any given task or project. one of the things I admire about the organization is the ability to manage multiple projects and teams. Leaves have never been an issue for me., You will be expected to work harder but with that, the management will also be generous to grant leave when needed. On-time salary and job stability are the strong factors of the organization.", "cons": "Extensive Traveling, sometimes even beyond office hours as per work requirement of a trainer. But if you are a traveler, you would enjoy,"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Many things to learn and grow", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "2 Dec 2022", "job_title": "Program Officer Training & Implementation in Vadodara", "duration": "N/A", "pros": "I have been working with Lifeline Foundation, Vadodara as Program Officer Training & Implementation since 5 months now. I joined totally as a fresher and I think I have grown as person. Lifeline Foundation, Vadodara is a great place to learn and grow as a person. There is a lot of work pressure and deadlines that you will need to meet. If you are someone who cannot work in pressure better either prepares yourself of it can get difficult at times. But once you surpass this pressure you can grow in any organization you join.", "cons": "Environment is stressful and too much of work pressure. There is no time limit to work. It can sometimes feel like a 24 hours job too. But working in an EMS sector will never have a time limit. Can hamper Work life balance if you cannot handle it."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best Place to Grow", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 May 2022", "job_title": "Program Officer in Vadodara", "duration": "N/A", "pros": "Lifeline Foundation is an organization that will help you grow enormously in all the fields of life not just professional but also personal. \r\nIt is a place full of adventure and challenges, If you are a person who is always ready to face any challenge put in front of them, then welcome here.\r\nAnd the most important, you will get to travel a lot. If you are someone who loves travelling than this is the place for you.\r\nThe organization always comes with new projects which helps to expand the knowledge and expertise of each employee.\r\nWe at Lifeline Foundation believe that each and every life is precious. Therefore, We are always working in some or other way to contribute towards our goal of saving lives.", "cons": "You may feel somedays, it's loaded because there is always some or other work in a row. \r\nIt is a place full of challenges, I you get scared of challenges and it affects you negatively than not the place for you.\r\nWork life balance may get affected, but then it all depends on you how you conquer it."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Be Patient, Have Trust, working with Lifeline Foundation, will be a Ladder to your Growth.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Nov 2020", "job_title": "Training Officer in Vadodara", "duration": "N/A", "pros": "I joined Lifeline Foundation, as a fresher and now it’s been more than 2 years, I am working in the training department. It will not be wrong to say that the growth I observe in myself is just because of the seniors I work with. \r\n\r\nWhen the whole world is facing crises due to Covi19 lockdown and the work force is in difficulty , Lifeline Foundation and it’s associated companies, Baroda Life Management Pvt. Ltd. and Medicare Consultancies made sure to stand by its employees and workers. None of them has to go even a month without their salary. And this is enough to show that if you work here by heart, your interests will never be neglected.\r\n\r\nHere you can have coolest Bosses who guide you through. They groom you in every possible way and finally when you understand, you are Jack Of All Trades and patients and trust in their ways , will also lead you to know your mastery. \r\n I am not sure if any other organization can provide with such an exposure to your work and professional life. \r\n\r\nThough I am a part of the training team, but since past 2 years I have been associated with many other projects of Lifeline Foundation. No other appraisal is greater than being a part of successful projects and your reporting officers and Head of the company congratulating you in person for each and every successful step.", "cons": "Many processes followed here are traditional. It is high time to exploit the modern ways especially in documentation and accounting."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Wonderful place to work; great ideation opportunities", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "14 Dec 2021", "job_title": "Senior Consultant in Vadodara", "duration": "N/A", "pros": "A congenial atmosphere; high competitiveness and high intensity work. But a lot of bonhomie and friendliness.\n\nA great place to ideate and experiment. Opportunities to showcase talent. Brilliant mentorship to extract hidden talents.\n\nAn ideal organisation for those who are in pursuing education in social work or life sciences and want to break away from the norm and do something different", "cons": "None that I saw or perceived."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Work Experience at Lifeline Foundation", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "31 Dec 2020", "job_title": "Program Officer in Vadodara", "duration": "N/A", "pros": "- Working at Lifeline Foundation will teach you soo much in such a short duration. Working anywhere else might not have given me such varied and eclectic experiences in just a few months of work.!\r\n\r\n- Dr Das, the CEO, works extremely hard and expects his employees to do the same.. Infact the entire team appreciates and values hard work.. Only if an individual is willing to push himself/ herself to be a better and a more efficient person, can he/she enjoy working here..\r\n\r\n- The management takes care of its employees. If you are honest to your work and with your employees, they will try and help you in all ways.\r\n\r\n- You are allowed to stumble, make mistakes and learn from them!\r\n\r\n- Your work will not be limited to a single task or profile. You will learn to dabble in and learn from a variety of things..\r\n\r\n- Even during the lockdown, the employees were given work and timely salaries..", "cons": "The work-life balance gets a bit disturbed and you sometimes end up sacrificing your leaves.. especially during the time of important conferences or events.. But the teachings you receive from the time you invest more than make up for it..!\r\n\r\nIf you are looking for a time to time, monotonous, boring job of sorts, then this is not at all the place for you.."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great work place to enhance your personal and job skills", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Jan 2021", "job_title": "Account Manager in Vadodara", "duration": "N/A", "pros": "Great place to work and enhance personal skills lifeline foundation is not profit organization helps needy people. Dr.das and  Sushmita Mam is the backbone of the foundation they helps all like out of the way 24*7.\n\nPersonally I got a chance to grow up my skills in Medical Appliance bank, Non profit things like pasti and donations other than accounting field. \nWork environment and coligues of the foundation was very helpful and believes in growing together.\n\nThe support getting from Sir and Mam remarkable, they encourage and helps to grow individually. \n\nWork Timings are pretty good, handsome pay, holidays, leaves, Birthdays & celebration is life time memories.", "cons": "You should be multi tasking person to accept and completing work you haven't given before. Anyway cons. are differ from person to person and organisations too."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Good learning experience at Lifeline foundation", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "8 Feb 2021", "job_title": "Accounts Manager in Vadodara", "duration": "N/A", "pros": "Life line foundation was my first job in Vadodara when I moved to this city after marriage . The dynamic environment had provided me a wide spectrum of experience and exposure. . I served the organization with positive attitude and efficiency only because of the workplace environment and down to earth nature of top management . The reason of leaving the job was pregnancy. I will cherish all the memories I have gathered during my work tenure . I feel good getting birthday wishes every year from Ms. Sushmita Das even when it's close to 4 years since I have left the organization. I would consider rejoining Lifeline foundation when I decide to work again.", "cons": "There would be work pressure."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Working at lifeline foundation was indeed a great experience.", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 Mar 2021", "job_title": "Training Officer in Vadodara", "duration": "N/A", "pros": "1) Organization makes you learn new things and adapt to them so well.\r\n2) Work culture is amazing. Every one working here is treated equally.\r\n3) This was my first job, so my seniors in training team did considered that and would explain minutes of every new tasks which I was supposed to perform .\r\n4) There were times when I made mistakes but there were no negative reactions to it ever from the team. They would explain it to me how shal it be done.", "cons": "1) You will have to learn to Multitask ( but this cone can turn out to be on favour for you)"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "It has been a Rollercoaster Ride!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Aug 2020", "job_title": "Training Officer in Vadodara", "duration": "N/A", "pros": "One of the best firm to work with. I have been able to achieve many goals while working with the organization. I started as a fresher and wanted to learn the working environment, develop interpersonal goals, sharpening my skills and also learn alot about different topics. I have developed a lot of skills that i think i wouldn't have achieved if i was in some other firm. Great team work and amazing  office mates, and ofcourse the  best CEO's  adds up alot. I was quite satisfied of my job and work that I was doing.  Afterall thats what really matters.! I will accept that after 2 months of my work here i was about the leave the organization, but a positive feedback from the CEO gave me a chance to see the change, which actually happened!\nSincere gratitude to LifeLine Foundation.!", "cons": "I just would  say one thing that if you are quitter, this organization is not for you. This is the chance to find out your hidden talents and Sharpen your skills. Altogether a different experience!"}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "A place that builds you as a professional", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "19 Sept 2020", "job_title": "HR Administrator in Vadodara", "duration": "N/A", "pros": "I am a person who likes to read, and get to now new things. Even if they are not directly connected with my life or work. I found that Lifeline Foundation was perfect place for me. \r\n\r\nI have been associated with Lifeline for 3 different times in different roles. And I still continue to be associated every time I am required by Lifeline in any of its projects and events. And I was constantly applying my knowledge about different things here and in the process learning new things. \r\n\r\nSo, this is what I would like to say to all seeking job at Lifeline Foundation, if you like challenges, learning new things this is the place for you. Life can never be mundane or boring here.", "cons": "I am not saying it is all easy, especially as you are working with a perfectionist. Life at Lifeline Foundation has its own challenges like all places. But if you like being challenged every day, it’s the place for you"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Workplace  that encourages growth", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Aug 2020", "job_title": "Senior Accounts Officer in Vadodara", "duration": "N/A", "pros": "Medicare Consultancies is a organization which is lead by proprietor but it's mission and vision is no less than that of a corporate in the field of any service provider.\r\n\r\nThis organization allows you to explore your self capabilities and helps you grow within and beyond one's capabilities.\r\n\r\nIn this organization you will learn to be a leader and this organization will help you grow in numerous ways which will help one face and resolve the issues faced in professional as well as personal life.\r\n\r\nThis organization also provides a work environment and work culture which is friendly in nature and also makes one feel that the organization is their second home.", "cons": "There are no cons to an organization per se, any cons to one's point of view may not be some other."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Why LLF is a standalone working organisation for making STRONG employees", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "17 Aug 2020", "job_title": "Training Officer in Vadodara", "duration": "N/A", "pros": "One of the biggest motivations and blessings to me was when the CEO of the company Dr Das took me to give an opportunity to become a trainer in a field that I lacked expertise and most importantly as a fresher. \r\n\r\nA little down the memory lane story from my experience. My job expectation was simple from the company: It was to conduct First Aid and CPR training for a collection of audience from various walks of life. To me, this was the most difficult job and unfortunately it being the first job itself. So, the duties included teaching topics mostly in Hindi and local Gujarati (which I was really bad at both) and English was very minimal to be used (wherein I was very fluent at). Dr Das had his second thoughts on me but I took it up as a challenge and in three months of time, I was able to deliver topics (at least if not fluently) but to an understandable extent to the sitting audience who in time, I learnt had started to pay attention than earlier. I bought a lot of Hindi novels and local Gujarati dailies to equip my vocabulary to deliver better. \r\nIn the next three months, Dr Das gave me more training experience and this included pan-India travel and with more exposure came more feedback which we always received from the audience to rate the trainers. My ratings grew from pathetic to satisfactory and at times exceptional and Dr Das was happy. \r\nI was promoted to a Training Officer. My duties in in the job now didn't stop just there, I was also given additional roles and responsibilities wherein I used to conduct Paramedic interviews for our OHC staff and train them initially; further do B2C marketing for societies to sensitize the awareness in learning CPR and First aid; to handle the keys of the cabinet as an Admin Rep and manage them between training periods. Overall, this role, not only gave me a widespread and\r\n an over-exposure of opportunities in cultivating interpersonal skills but also the art of talking briskly, lucidly, fluently and with reason to the public; befriending strangers on the first call or first meet; taking more and more responsibilities within a short span of time based on your abilities; maintaining business etiquette while meeting top management Clients and living together as a family as the staff count was very small. \r\n\r\nToday, when I see myself from the career evolution perspective, I can handle any kind of responsibility or pressure thrown at me at any organisational or hierarchical level because I rose from scratch to top in just 9 months which takes people at least between 2 to 5 years to understand the wisdom every job has to offer elsewhere. Trust me, had I wanted to take the above as a gripe or complaint, I would have stuffed it in the CONS section. I wouldn't shun the fact that it was too much to handle at times because of the consumption of work, but at the end of the training, you feel satisfied and relieved having borne responsibilities and sacrifices. \r\n\r\nDr Das brought a life-changing moment that I won't forget in my life ever when I told him that I was taking a lot in my plate: \"If every person were to think too much of their work and life balance and say I did this and that to come here, we would get whiners everywhere all the time! That's how Amitabh Bachan and Shah Rukh Khan were made in the first place compared to thousands of thousands who wanted their big breaks but couldn't make it!\"", "cons": "If you think there are cons! Trust me, you won't be able to work or adjust anywhere. The strongest of CONS is its strongest PROS! If you've the mindset of a person who's ready to take any amount of load-work to better your career and future so that you don't go through similar situations time again like a loop in your life, you can go for this Org, else DON'T! Sometimes, we need to understand the often forgotten fact that people are made for jobs too! I'm thoroughly happy that this become my first job and in fact, a noble job. Because who gets to tell people, \"Hey, you've the ability and authority to save a life when there is a need\" ?\r\n(And if you think this is a hype review, trust me, no one paid for me, I wrote this out of sheer diligence and gratitude to the founding institution where one recognizes if they are really built up to become strong or whine and become weak!)\r\n\r\nAlso, please don't go by bad comments that say it's a terrible place to work or calling Dr Das foul words. It's a high-pressure work environment, I guarantee that and involves too many responsibilities that will only benefit and shape a person's career as they go up the ladder. Every other Org does that too! The Man is a Legend. \r\n\r\nIn my defense, I personally had to quit the firm because I had a passion to write and I couldn't find ample time to research and write."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Crusader Against Death On Highways Due To Road Traffic Accident", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "31 Aug 2020", "job_title": "Training Manager in Vadodara", "duration": "N/A", "pros": "1) Get to learn many things which we are in association with in our routine life but had no idea what they stands for.\r\n2) Systems here made me realise, what it is to rise again after I fall.\r\n3) Senior consultants are always there to help you to dive through the challenges.\r\n4) Versatile tasks to handle.\r\n5) You will be made to master the tasks well by showing where you need to improve and strengthening your knowledge on different aspects of it. This makes you so good that you can actually help your colleagues or juniors to develop them. The organisation also gives you a platform for this knowledge sharing to happen across levels and across departments.\r\n6) The organisation thereby grooms you so well that you become a team-leader.\r\n7) Higher management Dy CEO Ms Isha Popat, Dr Subroto Das & Mrs Sushmita Das has all to motivate you! They will let you fall, will let you feel the heat but will never leave you in the middle of the way.\r\n8) Dr Subroto Das has a very true saying: \"Either I will make you or I will break you!\" And I see myself where I am now.\r\n9) Trainings, Lectures, Conferences, Workshops, NGO Fairs & Events, got many things to learn as Organisation manages these programs internally irrespective if the program is on National Level or at International level.\r\n10) I personally love travelling and since I joined for my work, I have travelled more than 6 states and many cities for official work.\r\n11) At the end of the day, feel blessed to be a part of these Crusaders, who train people for Saving Lives.\r\n12) Very much strict towards health issues.\r\n13) Much impressed during COVID times. Even during WFH, no salary cut and staff from accounts putting their life at risk, managed to complete salary for on field staff (drivers, paramedics, ambulance operations team members) as well as for office staff on promised dates.\r\n14) Dr Subroto Das stays available 24*7 to guide in any medical emergencies to any of his staff members or to their family members.", "cons": "1) Quite long routed permission channels / system. At times, it leads to miscommunication / communication gaps. \r\n2) Amount of work pressure is quite good, obviously it makes you but at times, it breaks you also.\r\n3) No leave from wearing formals on Saturdays / non client visit / non training day.\r\n4) Since major programs are handled internally, it is much stressful during conference."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "I worked at Lifeline Foundation for around 1.5 years.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Oct 2020", "job_title": "Project Officer in Vadodara", "duration": "N/A", "pros": "Higher management always encourages innovative ideas and provide full freedom to employees, assist to enhance managerial skills", "cons": "Since they are into Emergency Medical Services, sometimes you have to work under immense pressure, but that teaches you to tackle crises"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Worst company", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "15 Oct 2019", "job_title": "Human Resources Assistant in Vadodara", "duration": "N/A", "pros": "No adventage to work with this bogus company.", "cons": "Worst and unprofessional work environment.\r\nNot recommend.\r\nGod knows how company's owner got padma shree"}]]