[[{"date": "18 Jun 2023", "title": "Community Engagement Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at RSPB (Royal Society for the Protection of Birds) (London, England) in Jun 2023", "Interview Descriptions": "Very quick turnaround, interview 1 or 2 weeks after I initially applied. The interview was Online. Interviewed by a panel of three people, 2 of whom were going to be on the project. Was not asked to do any preparation for the interview beforehand. Everyone was very friendly.", "Interview Questions": "Fairly basic questions that were easy enough to answer. Eg. - Describe a time you had to communicate the same thing to different stakeholders - Describe a project you have been a part of - Describe a time at work when you and someone else had differing views."}, {"date": "15 May 2023", "title": "Conservation Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at RSPB (Royal Society for the Protection of Birds)", "Interview Descriptions": "The interview was online with a panel of three. I started by gaving a short presentation that I was asked to prepare beforehand. The panel then asked questions and in the end I had a chance to ask questions myself.", "Interview Questions": "It was a mix of questions that assessed knowledge and skills."}, {"date": "22 Feb 2023", "title": "Volunteer Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at RSPB (Royal Society for the Protection of Birds) in Dec 2022", "Interview Descriptions": "Online- easy and basic questions. They were just the typical questions you get asked in interviews. The interviewer was very kind and made me feel at ease. A positive experience overall", "Interview Questions": "A time you worked in a team, how you overcame disagreement in a group and experience with analysis"}, {"date": "26 Sept 2022", "title": "Governance Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at RSPB (Royal Society for the Protection of Birds) (London, England) in Sept 2022", "Interview Descriptions": "I thought the process was a little over the top in comparison to the salary on offer. I had to prepare a presentation and some answers to questions in advance. It took me days to prepare my presentation and at the end it appeared that they were quite uninterested. I've received an email with some feedback the following week, which read more like a teacher's \"constructive criticism\" leaving no room to fully understand why I wasn't offered the post. All and all not a horrible experience, but maybe need to rethink the salary offered vs. what they want from the candidate.", "Interview Questions": "how would you effectively provide charity trustees with confidence when implementing changes to a governance system to keep in line with the best thinking about good governance in a large charity like the RSPB? How have you see it done well in the past? "}, {"date": "23 May 2022", "title": "Human Resources Systems Administrator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at RSPB (Royal Society for the Protection of Birds) in May 2022", "Interview Descriptions": "I applied online and interviewed remotely. There were x2 rounds of interviews both conducted via MS Teams. The full process took 2 months. It was a very positive experience and it was lovely to meet so many members of the team.", "Interview Questions": "What attracted you to this role at the RSPB?"}, {"date": "24 Mar 2022", "title": "Marketing Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at RSPB (Royal Society for the Protection of Birds) (London, England) in Nov 2021", "Interview Descriptions": "Easy interview, simple questions and answers to find out more about experience. There was no task or prework to do other than research the company. Interviewed by two staff members who were friendly and gave detail of the role and what its like to work there, generally very positive experience.", "Interview Questions": "General experience led questions to understand skills"}, {"date": "12 Apr 2021", "title": "Visitor Experience Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at RSPB (Royal Society for the Protection of Birds)", "Interview Descriptions": "Informal and friendly interview one-on-one at the regional headquarters. Mostly determining my passion for the role rather than job-specific knowledge. Interview was with my line manager and was a good opportunity to see whether I would be a fit for that team.", "Interview Questions": "What is the biggest challenge in engaging young people in nature conservation?"}, {"date": "10 Mar 2022", "title": "Content Creator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at RSPB (Royal Society for the Protection of Birds) in Apr 2021", "Interview Descriptions": "Before getting to speak to anyone about the role, I had to complete a creative task responding to a brief. This was unpaid work that I then never received any feedback for after being unsucessful.", "Interview Questions": "Completing a creative marketing task"}, {"date": "5 Apr 2021", "title": "Project Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at RSPB (Royal Society for the Protection of Birds) (Denby Dale, England) in Mar 2021", "Interview Descriptions": "After introductions with the three person panel: HR, the regional coordinator, the senior project manager; the interview followed a three part structure that was clearly set out in three sections:\n\n1. About the candidate's background\n2. Brief answers regarding the role and relevant experience\n3. Longer answers on the particularities of the role and broader discussions", "Interview Questions": "What would policy resource would you use to help guide you on this project?"}, {"date": "28 Jun 2021", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at RSPB (Royal Society for the Protection of Birds) in Dec 2020", "Interview Descriptions": "Lots of interview questions spread over an hour and two friendly interviewers that gave me plenty of time to answer each question. Conducted via Microsoft Teams. Overall a good experience that left me feeling confident.", "Interview Questions": "Tell us about a time when you had a conflict at work? "}], [{"date": "27 Oct 2020", "title": "Policy Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at RSPB (Royal Society for the Protection of Birds) (London, England) in Oct 2020", "Interview Descriptions": "The interview  was competency-based and was hosted online by three senior policy officers who were assessing the interviewees. Before we got started they explained the interview process and then each asked around 2 questions.  It lasted around 45 minutes.", "Interview Questions": "In your opinion what are the most pressing environmental challenges of our time? "}, {"date": "7 Sept 2020", "title": "Conservation Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at RSPB (Royal Society for the Protection of Birds)", "Interview Descriptions": "Was fair and practical/example based. The application form gave a good insight into the kind of questions that would be asked. I would apply for another position again based on the application process", "Interview Questions": "What would you do in this situation"}, {"date": "30 Aug 2020", "title": "Senior Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at RSPB (Royal Society for the Protection of Birds) (Edinburgh, Scotland) in Jul 2020", "Interview Descriptions": "Presentation on initial tasks prepared for in advance then 10 minutes on the topic followed by about 12 questions on skills and experience. \r\nThere were 3 panel members and the process was on Microsoft Teams.\r\nThe task was how I would hit the ground running when I started in post with the RSPB. \r\nThe presentation had to be in layman's terms.", "Interview Questions": "How would I hit the ground running "}, {"date": "10 Oct 2019", "title": "Membership Venues Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at RSPB (Royal Society for the Protection of Birds) (Bangor, Gwynedd, Wales) in Oct 2019", "Interview Descriptions": "Interviewed with 3 people, asked several questions to start with, then completed two practicals. One was I was given 4 venues and had to describe what factors I would use to book them or not. The other was a roleplay phone call.", "Interview Questions": "What are your main strengths, which would be why we should choose you, and what made you apply for the role?"}, {"date": "26 Mar 2021", "title": "PR Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at RSPB (Royal Society for the Protection of Birds) (Sandy, England) in Oct 2019", "Interview Descriptions": "An interview with three managers in the wider team, and a casual chat with someone else in the team. The team were lovely in offering a lift from the nearby train station, and the grounds are stunning.", "Interview Questions": "Why did I apply for the job?"}, {"date": "22 Jan 2019", "title": "Conservation Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at RSPB (Royal Society for the Protection of Birds)", "Interview Descriptions": "Lasted for about an hour. The panel consisted of three people. All were quite friendly. They mostly asked questions about the skills and experiences the job required. Provided hypothetical situations and asked me how I will solve or react to those issues.", "Interview Questions": "Why are you interested in the position?"}, {"date": "22 Sept 2018", "title": "Membership Recruitment Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at RSPB (Royal Society for the Protection of Birds)", "Interview Descriptions": "There was phone call to the get the interview.  \r\nIn the interview the panel of 3 questioned my sales abilty, this also involved a role play section. \r\nThen I was moved on to another location for a live example of my skills", "Interview Questions": "Ask me to name a few birds on  a picture sheet?"}, {"date": "25 Nov 2018", "title": "RSPB Fundraising Direct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at RSPB (Royal Society for the Protection of Birds) (Leeds, England) in Sept 2018", "Interview Descriptions": "One telephone interview which is very simple mostly just them explaining the job to you a bit - checking you have a car and can do weekends, skype interview with team leader, and face-to-face trial fundraising for an hour.", "Interview Questions": "Mostly generic questions about; working independently, resilience, motivations for raising money for conservation. Face to face is more to see how you interact with the public so just be chatty and confident. One weird question was \" if you could save one species/animal what would it be and why?\" - this was in the skype interview"}, {"date": "27 Aug 2018", "title": "Community Engagement Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at RSPB (Royal Society for the Protection of Birds) (Edinburgh, Scotland)", "Interview Descriptions": "Phoned a few days after submitting application online. I had to prepare a 15 minute membership ask using their story telling technique. This was followed by a 30 minute interview. This was followed  by working for 1 hour at an RSPB stall attempting to sell memberships and engaging with the public.", "Interview Questions": "Are you good at multi-tasking."}, {"date": "26 Sept 2018", "title": "Membership Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at RSPB (Royal Society for the Protection of Birds) (London, England) in Sept 2017", "Interview Descriptions": "Easy application.  Called in to interview with 2 people.  Easy questions.  Small role play on sales.  Asked a bit about why the rspb.  No actual wildlife questions.  Took  about 30 mins", "Interview Questions": "what have you done to give nature a home?"}], [{"date": "22 Nov 2017", "title": "Community Engagement Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at RSPB (Royal Society for the Protection of Birds) (Glasgow, Scotland) in Mar 2017", "Interview Descriptions": "Interviews  usually last an hour and the panel consists of  two or three people usually. You are asked questions and expected to answer stating examples of when you have demonstrated that particular skill etc. Depending on the job, you may also have to prepare a presentation or do a spiel in a role play scenario.", "Interview Questions": "How have you handled difficult customers/ situations "}, {"date": "7 Jul 2017", "title": "Membership Development Officer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at RSPB (Royal Society for the Protection of Birds) (Glasgow, Scotland) in Feb 2017", "Interview Descriptions": "Telephone interview  which lasted approximately 35 minutes - the job description does not really tell you about the job - says will require some weekend work , evening work and over night stays - when I asked about this it's every weekend and there are no over night stays as they are into conservation so don't want to waste money on unnecessary expenditure \r\nDon't waste your time applying if you are not into hard selling", "Interview Questions": "Do you think getting  3 new members a day is achievable/realistic?"}, {"date": "25 Apr 2017", "title": "Corporate Partnerships Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at RSPB (Royal Society for the Protection of Birds) (Brighton, England) in Feb 2015", "Interview Descriptions": "Very strenuous double interview. Part one included a standard format interview with questions from a panel, the second part required a pitch to be given to the panel on a relevant issue.", "Interview Questions": "- give an example of a time you have excelled in a team?\r\n- what would you do in this 'hypothetical' situation?\r\n- what do you think are the most important things when dealing with corporate clients?"}]]