[[{"date": "31 Dec 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Americares", "Interview Descriptions": "The process started with an HR phone call followed by an interview with the person who would be my manager during my internship. Everyone I spoke to was very nice and the interviews were relaxed and easy.", "Interview Questions": "Why do you want this internship?"}, {"date": "7 Nov 2022", "title": "HR Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Americares (Stamford, CT) in Aug 2022", "Interview Descriptions": "There are three interviews for this position, first usually a phone screening from a recruiter, then a 30 minute interview with the hiring manager, finally a panel interview with the team you will be working with.", "Interview Questions": "Focused on what skills you will bring"}, {"date": "7 Jul 2022", "title": "Disaster Response Volunteer: Mental Health and Psychosocial Support Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Americares (Nashville, TN) in May 2022", "Interview Descriptions": "I had my first general interview in March and was told I moved onto the second clinical- based interview. I did not hear anything until May for the second interview. I received an offer immediate after the second interview pending the background check.", "Interview Questions": "How do you handle secondary trauma?"}], [{"date": "8 May 2020", "title": "Medical Cadre Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Americares (New York, NY) in Apr 2020", "Interview Descriptions": "Interview with HR manager \r\n4 main questions and brief overview of work history \r\nover the phone and lasting approx 45 mins \r\nHave know been accepted for second round interview \r\n...........", "Interview Questions": " - How would you manage / plan your day \r\n- 3 qualities you appreciate in a supervisor \r\n- How / example of time you have had to work in a limited resource environment \r\n- Time you have had to resolve a disagreement \r\n"}, {"date": "13 Aug 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Americares", "Interview Descriptions": "I had two phone interviews. One with the HR Manager, and the second was with my supervising manager that outlined the job position and how my past experiences would be useful in this position.", "Interview Questions": "Describe a challenging situation and how you overcame it?"}, {"date": "9 Jan 2017", "title": "Funding Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Americares (Monrovia) in Sept 2016", "Interview Descriptions": "The americares process start with an application followed by a phone interview. Once you are successful, your are then called for a written test and basically, i received one question. To draft a concept for a specific call. This is followed with another interview and skills verification. The final stage is the Human resources documentation and verification on all aspect of the CV and citizenship as well as benefits identification.", "Interview Questions": "What unique idea will you bring and change Americares work?"}, {"date": "21 Jun 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Americares", "Interview Descriptions": "I applied online and got a call from the recruiter who asked about my background and interests and then set up an in person interview with the Director. The interview was very comfortable and asked about my background and what I was interested in and discussed the position. I heard back the next day with an offer.", "Interview Questions": "Tell me about a difficult situation and how you handled it?"}, {"date": "17 Apr 2016", "title": "Media Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Americares (Stamford, CT) in Apr 2016", "Interview Descriptions": "The hiring process for this opportunity came suddenly to fill the very big shoes of a very talented young Media Manager advancing their career outside the company. The interviews were carefully coordinated, bundled with a wealth of information and the expectations set are achievable as well as clearly defined and laid out.  \n\nThe HR representatives warmly welcomed me to the organization and presented a truly wonderful and insightful overview of the history of AmeriCares, the expectations of the role, and a solid first step on what my first 90 days will comprise of.\n\nOverall the HR team follows in their leadership's values and professionalism, transforming what seemed like an overwhelming spot to fill into an achievable and desirable employment opportunity. Truly excited.", "Interview Questions": "How do you tell stories through video production?"}, {"date": "27 Oct 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Americares (Stamford, CT) in Jan 2016", "Interview Descriptions": "The interview process consisted of two 30 minute phone interviews with HR and Supervisor. Basic generic questions to get to know you and some of your prior work experience. Ask you why would you want to work here and how could you benefit the company.", "Interview Questions": "Why are you interested in interning at Americares?"}], [{"date": "3 Nov 2015", "title": "Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Americares", "Interview Descriptions": "The interview was an hour long, we discussed the job, the work environment, my background and experiences. They asked how I would react in certain relevant scenarios, what I was comfortable with, and how my skills could apply to the job. Nothing surprised me or caught me off guard.", "Interview Questions": "How do you organize yourself"}, {"date": "25 Nov 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Americares (Stamford, CT) in May 2015", "Interview Descriptions": "I applied in April, which was fairly late in the process. I applied via the AmeriCares website. I got a call a few weeks later asking if I was interested in the position they had open. The interview was just one Skype behavioral interview.", "Interview Questions": "What type of leadership style do you have?"}, {"date": "26 Apr 2015", "title": "Global Partnerships Position Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Americares (Stamford, CT) in Mar 2015", "Interview Descriptions": "I received two interviews. The first was a brief  phone screening  from the hiring manager, where I was asked basic questions about my interest and knowledge about the company. The second interview was a half hour interview with the supervisor. In the second interview, I was asked to speak in the target language.", "Interview Questions": "They asked if I knew how use databases and pivot tables."}, {"date": "23 Jul 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Americares (Stamford, CT) in Jan 2015", "Interview Descriptions": "it was a great process, not much was different than other interviews. They were  very nice about everything and I moved on to the next process. Regular things. Just do your research and you will do great. Prepare yourself as you should with any interview.", "Interview Questions": "Regular interview questions. "}, {"date": "1 Jun 2018", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Americares (Stamford, CT) in Jan 2014", "Interview Descriptions": "The interview took place in phases and was a comprehensive process with thought provoking scenario based questions.  I had a phone interview which was then followed by an in-person interview with several individuals.", "Interview Questions": "Why this job?"}, {"date": "16 Nov 2013", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Americares (Stamford, CT)", "Interview Descriptions": "Phone interview, in-person interview and then a panel interview. Questions are asked about previous experiences, analytical, technical and behavioral questions. Interview is more like a conversation that you engage in. Interviewers are very positive and they have a great attitude. I think they study your body language and behavior. If you pass the in-person interview they give you an assessment to do (relevant to the duties in your role)", "Interview Questions": "Technical questions about a random technical skill in your resume. Be prepared to answer exactly how you performed it!"}, {"date": "14 Mar 2013", "title": "Summer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Americares (Stamford, CT)", "Interview Descriptions": "Standard. Very quick with follow up. Every one I talked to was very friendly.", "Interview Questions": "N/A"}, {"date": "19 Nov 2012", "title": "Writer/Editor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Americares (Stamford, CT) in Jul 2011", "Interview Descriptions": "They started with a phone interview. After that I had an in-person interview at the HQ, where I met with HR and the direct manager for the position. My third interview was again in-person at the office, where I met with the direct manager, the HR director, and about four other people all involved in the job in some way. Each interviewed me after I took an editing test.", "Interview Questions": "I wouldn't call it difficult, but the most frequently asked question in the third round was how I worked. I'm not sure what they were looking for in this answer, but everyone asked it. Specifically they asked how I went about finding out information for the stories I would be writing. I could only draw on prior experience for this one - and I'm not sure it was what they were looking for. The best question I was asked concerned what my favorite piece of writing was, and why.  "}, {"date": "7 Oct 2011", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Americares in May 2011", "Interview Descriptions": "The process was handled very professionally and the culture and warmth of the company came through. It was fairly low-key, with standard questions such as \"walk me through your resume\", long-term career goals, etc. I started with a phone interview with the recruiter and then scheduled a one-on-one interview in the office some two weeks later, which was actually more of a \"get-to-know-you\" conversation than an interview. I think it was important to them that I demonstrated my commitment to the work through my previous expierences. The culture of the office is pretty mission-driven so they like to bring like-minded people on board.", "Interview Questions": "What do you know about us?"}]]