[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Empowering Work Environment with a Passionate Mission", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 May 2023", "job_title": "Anonymous Employee in Vancouver, BC", "duration": "N/A", "pros": "- Mission-Driven Organization: Working at Brightside means being part of a mission-driven organization that leads the sector, and is dedicated to making a positive impact in the community, adding a sense of purpose and fulfillment to the work. - Hybrid Work Schedule: Brightside offers a flexible and supportive work environment, allowing for a hybrid work schedule that promotes work-life balance and adaptability. - Supportive and Friendly Staff: Colleagues at Brightside are known for their helpfulness and friendly nature, creating a collaborative and positive work atmosphere.", "cons": "- High Workload at Times: Due to the nature of the work and the organization's commitment to its mission, employees may experience periods of high workload and tight deadlines. Balancing multiple projects and responsibilities can be challenging, requiring strong time management and prioritization skills."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Always striving for improvement.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Feb 2021", "job_title": "Anonymous Employee in Vancouver, BC", "duration": "N/A", "pros": "Over the last few years, I have seen Brightside become a better and better place to work. Benefits have improved, we are making great progress on our redevelopment projects creating many more affordable homes and are working on become a more inclusive place to work.", "cons": "As a relatively small not for profit, there aren’t always opportunities to advance as quickly as some would like."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Needs Improvement", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Jan 2021", "job_title": "Anonymous Employee in Vancouver, BC", "duration": "N/A", "pros": "Work from home, decent benefits, some flexibility in hours, wellness allowance", "cons": "Management is lacking, cannot move up in your job, relational aggression among staff, dishonesty"}], []]