[[{"date": "9 Mar 2022", "title": "Business Change Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at One Housing", "Interview Descriptions": "Very straight forward and process was quick\r\nI had an interview with a  3 person panel where I shared my skills and experience and was asked given the opportunity to also ask questions about the role", "Interview Questions": "How would you measure and track benefts?"}, {"date": "26 Oct 2021", "title": "HR Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at One Housing in Oct 2021", "Interview Descriptions": "The worst interview experience I have ever had. Impersonal, cold and without any connection to the actual position advertised. The 2 interviewers didn't smile once, never asked me what was my interest in the position or if I know anything about the company. Went straight into questioning and it felt like they hated being there. Terrible place and I will never apply for a role with them.", "Interview Questions": "Tell me about a time when you had to meet a deadline. "}, {"date": "25 Aug 2021", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at One Housing", "Interview Descriptions": "Not stressful, questions that help you expand on your answers. Didn't feel any pressure so interview went well.\n\nRecruitment agency helped me prepare and gave me tips on what to say.", "Interview Questions": "Give an example of how you would deal with this situation?"}, {"date": "17 Oct 2021", "title": "Housing Safety Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at One Housing (London, England) in Aug 2021", "Interview Descriptions": "I applied online with a cv and covered the person spec and I thought I was applying to the company directly so I was very surprised to get a call from Reed saying that I would be offered an interview - it would have been helpful to have known from the onset that a recruiter was involved so it seemed a bit random getting the call. The recruiter was in touch a lot seeing I was ok for the interview and making sure everything would go smoothly. \n\nThe interview was a 2 person panel they seemed friendly enough and I answered the questions to my best ability and thought I gave an ok enough interview - so am not sure quite what they were looking for. \n\nAnyway one week later NO response. Its usually quite quick if a recruiter is involved...by now it had been 2 weeks and I'm thinking well I probably definitely haven't got the job but nevertheless its courtesy to respond back to the interviewee so I phoned the recruiter and emailed - no response. I emailed and called again a few days later - no response. By now I was seething as it showed a complete lack of respect towards me with Reed just ghosting me. So I thought I may as well contact the company directly  as I had the interviewers details on the Teams invite and explained that I had not heard back from the recruiter and if they could help at all. \n\nCue the next morning 2 missed calls from the recruiter and an email saying I had been unsuccessful and if I wanted feedback etc etc. \n\nI have had such a negative experience and it was all because of the recruiter putting the company in a bad light - however its their call if they want to use a recruiter who doesn't get back to candidates and then ignores them.", "Interview Questions": "Name 2 strengths and 2 weaknesses "}, {"date": "31 Mar 2023", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at One Housing (London, England) in Aug 2021", "Interview Descriptions": "After a brief application, the interview was with two managers. Asked generic interview questions mostly about past experiences but also wanted to see how much you had researched the company.", "Interview Questions": "Generic interview questions about previous experience"}, {"date": "18 May 2021", "title": "Healthcare Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at One Housing in Mar 2021", "Interview Descriptions": "Applied online, recruitment was done through a recruitment agency so had someone prep me with potential questions a few days before and kept me updated on the process and how the interview went. Interview was a zoom chat. Quick and friendly.", "Interview Questions": "Why do you want to work for One Housing? "}, {"date": "6 Oct 2020", "title": "Support Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at One Housing", "Interview Descriptions": "I had a phone conversation with a recruiter from a third party company, who was very professional and kind. I then had an online interview which involved a mock risk assessment. Interview was roughly 30 minutes + 25 minutes for the risk assessment. Very positive experience overall, great interviewers who seemed passionate and empathetic. However:\r\n\r\nThe recruitment process involved giving my information and reference details to three different parties; The HR department, the recruiting agency and the branch. It took over a month and a half from I was offered the job till I started the role. I needed a contract urgently to sign for an apartment, which ended up not happening because of miscommunication between different departments. Overall a very positive experience with the interviewers and recruiter, who were passionate and kind, but really quite negative with the corporate branch.", "Interview Questions": "Why I wanted to work for them, what I would do if I were asked to do something that didn't adhere to protocol, what qualities are needed for the role, and how i possess them. "}, {"date": "17 Sept 2020", "title": "Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at One Housing (London, England) in Mar 2019", "Interview Descriptions": "Was fairly straight foward. They asked a few scenario questions and why you wanted to apply for this particular job role. Safeguarding came up as usual as this is a care role and requires you to know this.", "Interview Questions": "What understanding so you have of safeguarding? "}, {"date": "14 May 2019", "title": "IT Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at One Housing (London, England) in Nov 2018", "Interview Descriptions": "I went in my lunchbreak from work - I was made to wait 40 minutes in reception. Interviewers had clearly either forgotten or were unprepared. Offices shabby and disorderly. I asked the interviewers what was the best thing about working for One Housing: they couldn't really answer.", "Interview Questions": "Asked my skills and experience"}], [{"date": "18 Oct 2017", "title": "Human Resources Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at One Housing (Camden Town, England) in Aug 2017", "Interview Descriptions": "Generic questions such as what is your weakness and strengths. Also, tell me about your self? They also ask a question that if you were a biscuit which biscuit you will be and why?", "Interview Questions": "What type of biscuit are you?"}, {"date": "4 Dec 2017", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 1+ week. I interviewed at One Housing (London, England) in May 2017", "Interview Descriptions": "Telephone/Face-to-Face. The Agency  screened me first and then I was sent for another role.\r\nThe interviewers for this role felt I was more appropriate for the data analyst role. I was interviewed by senior application/architecture experts", "Interview Questions": "Values/team values/personal goals"}, {"date": "30 Mar 2017", "title": "IT Service Desk Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at One Housing (Chalk Farm, England) in Mar 2017", "Interview Descriptions": "Applied online via Reed and then filled in application form\r\nCalled for phone interview and was explained the role duties \r\nanother called for arranging meeting in person\r\nMeet in person with IT service delivery manager  for tech assessment which featured detailed and interesting questions", "Interview Questions": "Why would you wanna work for us"}, {"date": "18 Feb 2017", "title": "Portfolio Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at One Housing (London, England)", "Interview Descriptions": "Telephone interview with a recruiter, placed forward for a Face to Face interview. Sat in front of a panel at the office. Walked in by the team, Manager and senior manager present, another staff member from a different section of the company. Questions on motivations and situation, expectations and how to deal with people in situations.", "Interview Questions": "What motivates you to do this job"}, {"date": "24 May 2017", "title": "Learning and Development Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at One Housing (London, England) in Feb 2017", "Interview Descriptions": "Phone interview for 30 minutes then a face to face Interview and 2 presentations in front of a panel of people.  The presentation was one before describing best practise and future of department and then to design a course.  You then had 3 questions that they had given you to answer,", "Interview Questions": "How would you help managers deliver appraisals to 8000 staff."}, {"date": "29 Sept 2016", "title": "Human Resources Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at One Housing (London, England)", "Interview Descriptions": "I had a one off interview. the people were very nice, welcoming and very great company. I had two interviewer and it lasted roughly 45 minutes. Very good impression about the people and the company. the overall experience was great", "Interview Questions": "if you were a cake what would you be and why?"}, {"date": "9 Sept 2016", "title": "Graduate Project Management Scheme Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at One Housing (London, England) in Aug 2016", "Interview Descriptions": "Started with a CV and Cover letter upload on their website; then online psychometric tests followed by an group assessment day. Whole process took about a month after the deadline closed.\r\n\r\nOnline psychometric test was a timed task- started with two touch typing tasks, then a mix of maths, english and visual patterns lasting about 50 minutes in total. Heard back the following week to attend assessment day at their HQ in London.\r\n\r\nThe assessment day was from 11.30am- 4pm; there was only 4 candidates being interviewed and only one position in pre-construction management available. There was five tasks during the day and a short lunch where you could meet previous graduates and management.\r\n\r\nThe first task was a group task to build the tallest possible structure out of provided materials (paper, sellotape, marshmallows, sticks etc.) to a budget. This was focusing on how you work in a team and solve a problem; each candidate had a member of management watching how they interacted so try and contribute during this and assist others, they are looking for team players not so much leaders!\r\n\r\nThere was 1-1 interviews with management, very basic questions asked including why this company? why this scheme? biggest achievement? biggest disappointment? where do you want to be in 5 years? what can you tell us about yourself we can't get from your CV?\r\n\r\nThere was two data analysis tasks we were rotated around- one was to analyse company reports and suggest improvements; the other was mock emails you had to prioritise the tasks and halfway through you were given more to re-prioristise- a mixture of tasks including calculating costs, analysing technical drawings for mistakes and customer complaints.\r\n\r\nThere was also a negotiation task with a manager, who goes very method as a building contractor.. so be prepared.. to negotiate on behalf of the company an over-run build. The focus is on lowering the cost and keeping to an agreed time frame, so researching average build costs and schedules would help with this.\r\n\r\nOverall its an enjoyable process, management is really friendly and encouraging, making it a relaxed atmosphere. It is very competitive and being prepared with knowledge of the company is essential. This scheme is not a rotational one so you will only be working in the sector you applied for which is worth considering for future career progression.", "Interview Questions": "What can you tell us about yourself we can't get from your CV?"}, {"date": "2 Jan 2020", "title": "Team Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at One Housing (London, England) in May 2016", "Interview Descriptions": "2 panel interview with 2 managers, there were situational and behavioural  questions asked and examples are required, so prepare answers based on a variety of situations and what you would do or how you would react", "Interview Questions": "A time when you have had to deal with an aggressive customer"}, {"date": "5 Jan 2016", "title": "Project Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at One Housing (London, England)", "Interview Descriptions": "Sadly a waste of time - I spent time learning about the company and role on offer, however this was a waste of my time as it seemed clear from the interview that they had already found somebody for the role but just wanted to go through the motions to say that they had held interviews. The interview only lasted 20 minutes and I was asked only a total of 6 questions - only one of which touched upon my previous experience. I later heard that I had been unsuccessful in getting the job as another candidate had better experience - strange as I was only asked one question regarding my previous experience so they actually found out very little about it.", "Interview Questions": "Only 6 basic questions, only one of which involved my previous experience."}, {"date": "21 Dec 2015", "title": "Graduate Fast-Track Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at One Housing (Camden Town, England) in Jul 2015", "Interview Descriptions": "Stage One: Submit CV and Cover Letter online. Applied via Targetjobs. \r\nStage Two: Telephone interview with recruitment company to discuss case study that was sent via email prior to interview. Lasted about 15 minutes. \r\nStage Three: Online Maths/English/Computer literacy tests.\r\nStage Four: Assessment Centre - 25 candidates, completed a day of activities (presentation, role plays, group task, 'speed-dating' interviews, e-tray exercise, 1:1 interview) followed by networking.", "Interview Questions": "- Do you feel our business model of using commercial profit for social investment is fair?"}], [{"date": "7 Jul 2014", "title": "Support Officer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at One Housing (London, England) in Oct 2010", "Interview Descriptions": "I was already in placement in the job via an agency and applied for a permanent position.  I was given two interviews on the same day, for a Floating Support Officer and a Young Person's Support Officer.  The first interview was a panel of two interviewers and the second a panel of three.  The interviews were both very similar, with the Young Person's role asking questions relating specfically to young people and supported housing.", "Interview Questions": "Nothing unusual.  A safeguarding question; lone working; time management; how to deal with a challenging customer etc."}]]