[[{"date": "N/A", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Stormont Vail Health (Topeka, KS) in Sept 2022", "Interview Descriptions": "First was a phone screen, then an in person with recruiters, and then a final round in person with the nurse manager on the unit. It was a simple process and was relatively painless and quick.", "Interview Questions": "Greatest weaknesses - typical questions."}, {"date": "21 Mar 2023", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stormont Vail Health (Topeka, KS) in Mar 2023", "Interview Descriptions": "Quick and easy, did a web interview and heard back from HR in a very timely manner after the interview. They asked some pretty generic questions about my experiences as a nursing student and gave me plenty of time to think through my answers.", "Interview Questions": "How do you go above and beyond for your patients?"}, {"date": "21 Aug 2022", "title": "Clinical Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stormont Vail Health", "Interview Descriptions": "In person interview with hiring manager, clinic manager, and other support pharmacist. Standard Interview questions and tour of facility and workspace included in hour long interview in a relaxed environment.", "Interview Questions": "Standard interview questions during interview "}, {"date": "15 Mar 2021", "title": "Advanced Practice Provider Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stormont Vail Health in Feb 2021", "Interview Descriptions": "Initial phone call from practice manager. Follow up via audio-only Skype. Very limiting. Seemed very off, lack of flow throughout the interview. Quite different from initial phone call. No follow up info from team that interviewed me.", "Interview Questions": "Professional background and experience, willingness to relocate. "}, {"date": "16 Feb 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stormont Vail Health (Topeka, KS) in Feb 2020", "Interview Descriptions": "The interview process was very easy. I was contacted by email to schedule an appointment. I called the number provided to schedule an interview that worked best with my schedule.", "Interview Questions": "Why did you decide to purse nursing? "}, {"date": "23 Sept 2021", "title": "APRN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Stormont Vail Health (Topeka, KS) in Apr 2019", "Interview Descriptions": "Conference room with panel of two physicians one clinic director and one surgical director.  Reviewed job requirements and my experience.  There weren’t any co-workers present in the room, and not any technical questions.", "Interview Questions": "What makes you think you’re a good fit for this job?"}, {"date": "9 Feb 2019", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Stormont Vail Health (Topeka, KS) in Jan 2019", "Interview Descriptions": "Interviewed with HR Recruiter.  Interview was mostly questions about work background and experience.  Had no chance to even interview w/ the hiring mgr before being sent a rejection email.  Asked for some sort of explanation as to why I didn't receive a chance to interview with the hiring mgr, but was ignored.  Extremely unprofessional!", "Interview Questions": "Tell me about a time you went above and beyond in your current job?"}, {"date": "8 Aug 2016", "title": "Clinical Secretary Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Stormont Vail Health (Topeka, KS)", "Interview Descriptions": "First interview was with general HR. Basic questions. Next interview was with department. Must pass a basic medical terminology test and drug screen. Little job specific training and staff can be cold until you become part of the team.", "Interview Questions": "Basic interview questions: How would you handle stressful situations? What would you do in X situation?"}, {"date": "25 Apr 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Stormont Vail Health", "Interview Descriptions": "I received a call right away with HR.  The representative was very friendly and laid back.  She explained that I had to apply to every position I was interested in and would hear from those units directly if they wanted to schedule an interview.  I received interviews with four units.  The application system does not provide updates to candidates regarding their progress, so I called HR frequently for updates.  After each interview, there was no form of communication regarding the status of the interviews.", "Interview Questions": "Tell about a time you experienced conflict and how you resolved it."}, {"date": "28 Oct 2015", "title": "Staff RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stormont Vail Health (Topeka, KS)", "Interview Descriptions": "I was contacted less than a week after my application was submitted for an HR interview.  The interview was very laid back and the interviewer was extremely friendly.", "Interview Questions": "Why did you choose nursing?"}], [{"date": "1 Oct 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stormont Vail Health (Topeka, KS)", "Interview Descriptions": "First interview was over the phone with HR representative.  Second interview was with the nurse manager of the unit.  The questions asked focused on getting to know me (work experience background), and my individual strengths, weaknesses, and conflict resolution.  This was my first interview experience as a new nursing grad.  Stress experienced with both interviews was minimal.", "Interview Questions": "Describe a specific time you experienced conflict in your prior employments and state how the conflict was resolved."}]]