[[{"date": "3 May 2023", "title": "Programme Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Alan Turing Institute (London, England)", "Interview Descriptions": "Good interview process consists of a presentation, a panel interview, and then a third interview with the department director. There were three panel members on the panel and the presentation lasted for twenty minutes.", "Interview Questions": "Explain how you implemented a process that resulted in efficiency for your team"}, {"date": "11 Jun 2023", "title": "Project Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Alan Turing Institute (London, England) in May 2023", "Interview Descriptions": "Only one stage for this role which is good. 30 minutes panel interview and 30 minutes assessment will give a scenario and write an email as they provide details. They replied their decision for three days which is nice and quick.", "Interview Questions": "What is your successful project experience?"}, {"date": "23 Sept 2022", "title": "Research Data Scientist/Research Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Alan Turing Institute in Jul 2022", "Interview Descriptions": "There were three stages to the application process: first submitting the CV, first round interview, second round interview.\r\n\r\nThe first round interview was fine: engaged interviewers and fair questions about a project I presented.\r\n\r\nAfter that things started to go downhill: I first received a rejection e-mail, and was then told that this was a mistake and that I had an interview at a time with no option to change when it was.\r\n\r\nDuring the interview, I was repeatedly asked to make medical recommendations despite not being medically qualified, the job not being medical, and none of the panel being medically qualified. This was entirely inappropriate and unethical, and I have still not received any response about this after communication my concerns.\r\n\r\nWhen I asked about maternity leave policies, the senior member of staff was not able to answer on any details, deferred the question to the only woman on the panel, and then interrupted her.\r\n\r\nUpon receiving my rejection and asking for feedback, it was seemingly copied and pasted and primarily consisted of suggesting I do an unpaid internship for the organisation.", "Interview Questions": "Why did you choose this programing language for this project?"}, {"date": "4 Jul 2022", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Alan Turing Institute (London, England)", "Interview Descriptions": "Panel interview. A one hour competency based interview + questions aimed very specifically at the project being hired for. Different panel members tested/probed different areas of expertise required for the post.", "Interview Questions": "How do you check your code?"}, {"date": "11 Jan 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Alan Turing Institute", "Interview Descriptions": "I had a video interview with 3 interviewers. I was asked about my experience and why I was interested in the Institute. After the interview, I was not informed whether I was successful or not. Months went by and I never heard anything, let alone receive any feedback on my interview. Very disappointing.", "Interview Questions": "Q. How would you describe artificial intelligence? "}, {"date": "18 Jan 2022", "title": "IT Support Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at The Alan Turing Institute (London, England) in Nov 2021", "Interview Descriptions": "Very nice and simple and well relaxed. questions tailored to the job specs which makes it predictable to the kind of job you are expected to do. only 2 stage interview. know your IT fundamentals is very crucial.", "Interview Questions": "windows, SharePoint, and desktop management"}, {"date": "29 Oct 2021", "title": "Research Data Scientist/Research Software Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Alan Turing Institute (London, England) in Oct 2021", "Interview Descriptions": "The 3-stage process was made very clear before I applied. Stage 1 was submission of a CV and covering letter. Next was an online presentation over Zoom to a 3-person panel incl. a few questions about your background and why you want to work there. The final leg was described as a more in-depth online interview about competencies together with a data science problem that you work through while treating the panel as subject area experts.\r\n\r\nI didn't make it to the final stage so I can't comment on that.\r\n\r\nI received an email inviting me to interview about a month after the closing date for applications. They notified me just over 2 weeks before the interview, allowing me plenty of time to prepare the 10min presentation that they requested (was not required to submit this prior to the interview date). The topic was either an algorithm that you believe is important to data science or scripts demonstrating good research software engineering practices.\r\n\r\nIntroductions with the panel were brief and friendly before launching into the presentation. They were very engaged and asked interesting questions throughout the presentation. Initially, these were familiarising questions and clarified how well the models apply to the problem I'd chosen. Once we moved onto the code, questions were a mix of explaining how specific functions work, together with good software engineering practice questions e.g. how would you improve this section of the code (think testing, variable naming, documentation), how would you make this machine readable etc. At the beginning, the panel advised that I could take my time to think through answers so I didn't feel rushed. Due to the number of questions the presentation took maybe 30-40mins.\r\n\r\nAfter that they spent a short while asking me some general questions about my work history, why I wanted to work there and inviting questions from me. The entire interview ran to about an hour.\r\n\r\nI got a response within a few days. I requested some feedback and I was impressed with the quality of the pointers they provided over email.\r\n\r\nOverall, it was a positive experience. I'd happily apply for roles there again.", "Interview Questions": "How did you account for <issues that are commonly known about problem domain>?\r\nDo you know if there are any disadvantages to using this method/algorithm/model?\r\nCan you explain in detail how <algorithm  referenced in presentation code but called from ext library> works?\r\nHow would you work on this code collaboratively?\r\nAre there any improvements you would make to the code before production?\r\nHow would you make this script machine readable?\r\n\r\nWhat was your experience like working with <programming language> on <project in CV>?"}, {"date": "22 Nov 2021", "title": "Research Data Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Alan Turing Institute (London, England) in Sept 2021", "Interview Descriptions": "Two stage interview. \n\nFirst stage consisted of presenting some work which was previousley done. \n\nSecond stage was a technical interview with panel, and was over an hour long.\n\nTake a really long time for them to get back to you regarding any feedback.", "Interview Questions": "various questions on basic ML and DS questions."}, {"date": "27 Oct 2020", "title": "Research Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Alan Turing Institute", "Interview Descriptions": "One round of interviews, with an excel test. The interview lasted 45 minutes, and was competence based.  No feedback was given on the interview itself.  The interviewers were reading question after question from a script. Overall an adequate experience, not particularly impressive.", "Interview Questions": "Give an example of when you didnt't get along with a colleague.\r\nGive an example of how you managed a project in which this or that happens.."}, {"date": "21 Sept 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Alan Turing Institute", "Interview Descriptions": "I sent in a coverletter, a cv, a writing sample and the contact details of several references. I was contacted a few weeks later by HR to organise a 30 minute panel interview with the team. HR was responsive in regards to setting up the interview. I was interviewed by three people on the team and although I was very nervous, the interviewers were friendly and made me feel at ease. I was told that the panel interview would be the entire process and I would be contacted in a week about the outcome of my application. As promised, they reached out and let me know that I did not get the job. They offered that I could contact them for feedback and when I did ask for feedback, they never got back to me.", "Interview Questions": "Walk through my CV, talk about a time when I had to juggle multiple projects, several questions about the current trends in the industry and my opinions about them. "}], [{"date": "16 Feb 2020", "title": "Research Data Scientist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Alan Turing Institute (London, England)", "Interview Descriptions": "When I arrived for the interview itself my three interviewers were generally nice and personable. Although I didn't get the job it was nice to receive feedback via telephone after the interview. However, I should note a few points about the interview process.\r\n\r\n- The online interview arrangement system doesn't work well. Although I confirmed my attendance, HR emailed me a few days before asking me to confirm as they hadn't seen my confirmation.\r\n\r\n- I was asked to provide my presentation 24 hours before interview which was quite a rush as it was my last week of work at another job. In the end this 24 hour deadline was not necessary as we just ended up using the version on my laptop.\r\n\r\n- Up until the moment I sat down in the interview, I had not been told that there would be two interviews on separate days. Not in the job description, and not anywhere in email communications had this been explained. Not a big deal but it threw me off a little. I was expecting a single interview.\r\n\r\nOverall I would say this, nice to get feedback, generally nice people, very disorganised application process. I would add that it felt very strange being asked to launch straight into deep technical discussion without first some niceties discussing the role itself, what would be expected of me, and what made me apply. Perhaps that's what the 2nd interview would have been for, but if so the order of things should be reversed. Lastly,  given the computational expertise available at the Turing Institute I was astounded at how useless the online application portal was.", "Interview Questions": "How could you improve X aspect of your software?"}, {"date": "24 Jun 2018", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Alan Turing Institute", "Interview Descriptions": "Standard phone interview and onsite. The onsite interview included discussion about previously developed scientific software and a couple of standard technical questions.\r\n\r\nUnfortunately, after the rejection they didn't provide any feedback even after asking for a short one. Other companies provide. \r\n\r\nMoreover, they didn't cover the travel expenses. Other companies do.\r\n\r\nThe  interviewers seemed to be nice guys. Congrats to them for the sort interview (1 hour) not like the crazy interviews other companies have.", "Interview Questions": "OOP, good practices for developing software."}]]