[[{"date": "30 May 2023", "title": "Branch Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at FINCA International (Lahore)", "Interview Descriptions": "The interview process was good . It was started from professional experience and then education and then professional achievements in a story type . Then how u achieve the goals stc", "Interview Questions": "What is your professional experience"}, {"date": "28 Feb 2023", "title": "Audit Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at FINCA International", "Interview Descriptions": "the process was smooth and the interviewers were professional and had a friendly attitude. i was interviewed by the head, senior manager and deputy managers. overall it was a good experience", "Interview Questions": "Q. Previous experiences and the clients i had worked at"}, {"date": "6 Sept 2022", "title": "Marketing/Communications Role Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at FINCA International (Washington, DC)", "Interview Descriptions": "The interview process was somewhat lengthy and involved for the level of the role. I had an initial phone interview, an \"assignment\" to complete, and 3 separate in-person interviews requiring me to take time off for and go into their offices 3 separate times over a month. It wasn't a horrible process but could benefit from some streamlining to be mindful of candidates' time.", "Interview Questions": "Standard interview questions regarding past experience, applicability to the role, conflict resolution, etc."}, {"date": "12 Jul 2021", "title": "Fundraising Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FINCA International", "Interview Descriptions": "The interview was pleasant and flowed like a normal conversation. It would have been a positive experience, except I was told that I would hear back in 2 weeks and never beard anything. Had to email the internship coordinator three times to find out I did not get the internship.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "28 Jul 2021", "title": "Bank Teller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at FINCA International (Lahore) in Apr 2021", "Interview Descriptions": "The interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates and making a hire.", "Interview Questions": "asked about the hobbies, experience etc"}, {"date": "17 Jan 2021", "title": "Major Gifts Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at FINCA International", "Interview Descriptions": "Interviewer was really friendly and asked all the common questions. She also gave me a great overview of what my responsibilities would be in the position, and gave me specifics based on the new programs that were being added to the company", "Interview Questions": "Tell me about yourself\nWhat are your strengths\nWhat is your weakness"}, {"date": "8 Sept 2020", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at FINCA International", "Interview Descriptions": "The interviewer was very friendly and it seemed more like a conversation. I was asked basic questions about microfinance and my experience in monitoring and evaluation. I was also tested a bit on statistical concepts.", "Interview Questions": "Q: Why FINCA?\nQ: Have you conducted surveys before?"}, {"date": "26 Jun 2020", "title": "HR Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at FINCA International (Tbilisi)", "Interview Descriptions": "the first step was test. test was from HR field. therre was four questions one was about vacation. there was also some calculations of payroll. some writings for newslatter, and was given a position and we have to create job descreptiom", "Interview Questions": "labor code"}, {"date": "31 Jan 2020", "title": "Security Guard Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at FINCA International (Tbilisi)", "Interview Descriptions": "The hiring and interview process was online and it was share of your education and news for very important opinion for very important global news . global news and basic of your country knowledge is very necessarily .", "Interview Questions": "i am asked about my plan outside ."}, {"date": "9 Nov 2017", "title": "Investigator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at FINCA International", "Interview Descriptions": "First interview was over Skype with the head of investigations. I was living in a remote country with unreliable Internet. I had multiple Internet options, but all unfortunately failed at the scheduled interview time. The interviewer told me she understood, but they never gave me a second chance. Disappointed.", "Interview Questions": "I wasn't given the opportunity to answer any questions "}], [{"date": "8 Jan 2020", "title": "CEO Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at FINCA International (Washington, DC) in Aug 2017", "Interview Descriptions": "The process was good as it allowed you to get a full understanding of the requirements needed.  It also allowed you to ask pertinent questions on whether or not you would be a great fit within the company culture", "Interview Questions": "How can you help the organisation move forward "}, {"date": "15 Nov 2017", "title": "Executive Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at FINCA International in Apr 2017", "Interview Descriptions": "First applied online; then phone screen; then asked to send in writing samples, college coursework relevant to position and work; final phone interview or in-person interview based on availability (I did phone interview as I was at school)", "Interview Questions": "Describe finance in terms of development"}, {"date": "28 Jul 2017", "title": "TOP EXECUTIVE Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FINCA International (New Delhi) in Mar 2017", "Interview Descriptions": "Very good i very much appreciated the questions as they were all logic to help to think.\r\nI scored 149 over 150 first level\r\n146 over 150 2nd level\r\nAnd 145 over 150 3rd level", "Interview Questions": "Several"}, {"date": "23 Mar 2017", "title": "Data Analyst Volunteer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FINCA International (Washington, DC) in Mar 2017", "Interview Descriptions": "Applied on the college system and got an email requesting for interview in Finca office by the senior analyst. She was gentle but she will test you out based on your resume. The position require VBA, Logical Regression, SPSS and you would be asked to describe the model you used in your resume. Basically it is all about technical skills. The job needs at least 6 months.", "Interview Questions": "How comfortable are you in transfer the results into Excel."}, {"date": "14 Nov 2016", "title": "Global Anti-Fraud Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at FINCA International in Sept 2016", "Interview Descriptions": "It was a Skype Interview with two employees. The interview was a behavioral one, and the questions were relatively standard. Overall, the interview process was alright, but seemed rather abrupt as though they did not have a lot of time to conduct the interview. This may have been because it was an internship position.", "Interview Questions": "Would you be willing to work in another country?"}, {"date": "22 Apr 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at FINCA International (Washington, DC)", "Interview Descriptions": "Very lax, but they test out your knowledge. Sometimes I wonder if I was only hired because they couldn't find anyone else...This was for an intern position, so I don't know what the interview process is like for a more serious role. They clearly do not see interns as essential assets to the company, even though they say they do.", "Interview Questions": "Do you prefer more informality or formality?"}, {"date": "1 Dec 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at FINCA International (Washington, DC) in Apr 2015", "Interview Descriptions": "Applied online. Began with a phone interview with HR after a two-week application review process. After passing the first interview, had an in-person interview with the hiring manager. After the in-person interview, had a week before receiving an online skills test. Then had another 10 day wait before receiving an offer. Process was long but not particularly difficult.", "Interview Questions": "Why do you want to work in finance? Describe finance in terms of development."}, {"date": "5 Feb 2015", "title": "Global Communications Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at FINCA International (Washington, DC) in Jun 2014", "Interview Descriptions": "The process was very thorough but moved along quickly. I was very impressed by how well planned and well organized the entire process and each step of it was along the way. Communications from HR and from the department hiring manager were excellent (they always kept in touch and kept me informed, and they were always very thoughtful and courteous).\r\n\r\nI was initially contacted by the head of global recruiting and she conducted a telephone interview with me. She asked very interesting, intelligent, and relevant questions (not the silly old-school hiring questions) that really got to the heart of what it would take to do the job and also to fit into the FINCA culture. We spoke at least two languages during the interview! (That was not a requirement, but it was a flavor of the wonderful, global nature of the organization.) Speaking with the global recruiting director impressed me greatly and spoke volumes about the high quality of staff and the culture at FINCA. Off to a good start!\r\n\r\nShortly after that phone conversation (I think a matter of days), I was contacted by the department hiring manager. We talked at length (about one hour). Within a couple of days I was asked to provide work samples and then to respond to five questions that required a fair amount of research and writing. \r\n\r\nAfter my work/presentation was reviewed, I was advanced in the process and invited to participate in person for a panel interview with three of the organization's senior executives. I also had the chance to meet the CEO at the end of the panel interview. \r\n\r\nI received an offer shortly after the panel interview.", "Interview Questions": "I was asked about my perception of the sector and the relative position of FINCA and its peers"}, {"date": "19 Mar 2014", "title": "Staff Accountant - Accounts Receivable Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at FINCA International (Washington, DC)", "Interview Descriptions": "4 interviews one at a time with manager of each finance team", "Interview Questions": "understanding reading financials "}, {"date": "10 Sept 2013", "title": "Senior Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 5 months. I interviewed at FINCA International", "Interview Descriptions": "The administrative staff are all very friendly. There's a strong emphasis on being \"business-like\" and \"bank-like\". The culture lacks that passion for mission-driven work that many other non-profits have. The initial interview was a small group interview led by an employee and joined by a consultant. The second and final interview was with the department's VP. The interview process varies depending on the position. For very senior jobs, there are more rounds of interviews.", "Interview Questions": "All of the questions were very standard questions. There were no technical questions (although the interview was for a technical position), there were no behavioral questions or anything else. Just questions like, \"Why do you want this job?\", \"Why FINCA?\", and \"Tell me about yourself.\" The most unusual question was regarding how I managed and prioritized tasks and projects. I answered that I use the Franklin Covey planning system as I once attended the FC Achieving Your Highest Priorities one-day workshop. That was the \"right\" answer. FINCA has historically preferred that employees use the FC system, although many employees don't. "}], [{"date": "13 Jul 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at FINCA International (Washington, DC) in Aug 2013", "Interview Descriptions": "I had a phone interview and then an assessment task that had to be completed within 24 hours. It was to write a memo about a topic specific to FINCA, advocating for a product. The interview consisted of general interview questions about past experience, qualifications and why FINCA. Overall, it was a good interview process.", "Interview Questions": "Tell me about your experience. "}, {"date": "21 Jan 2013", "title": "Internal Control & Compliance Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at FINCA International", "Interview Descriptions": "I was being head-hunted. After a lunch with the CEO, i was a match of ideas of how to develop an IC Department that it will be also acting as a ERM department at the same time.", "Interview Questions": "Where would you like to be 10 years from now? I would understand forecasting in 3-5 years, but in 10 years whatever i would say the possibility of getting close to reality would be Zero. So i responded by saying; \"I do see myself continuing on learning and grow and take on new challenges as they come, and see where i will end up in 10 years time\". "}, {"date": "7 Jul 2016", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at FINCA International (New York, NY) in Apr 2012", "Interview Descriptions": "I completed an online application for an internship position and got an email back a few weeks later a position opened up that I would be good match for and had a Skype interview twice with the talent manager. I was hired with a group of other interns. I got an offer, made some agreements and negotiations and then had a mini online training session about Microfinance. Then went off to the country where I got assigned to.", "Interview Questions": "Tell me why you want to work for FINCA?"}, {"date": "12 Jun 2015", "title": "SQL Server Database Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at FINCA International (Atlanta, GA) in Feb 2012", "Interview Descriptions": "Was called by third party head-hunter who told me about the job. He set up an interview with the Enterprise Architect and the Regional Manager. We discussed by background and I was asked some technical questions regarding my knowledge of data warehousing, SQL, general programming, Unix and Windows administration and scripting, and ETL tools.", "Interview Questions": "How much experience do you have with data warehousing?"}]]