[[{"date": "18 Jul 2023", "title": "Cat Care Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cats Protection", "Interview Descriptions": "Lasted roughly 45 minutes. I was made to feel very welcome by my interviewees. Format is formal - the panel had about 10 questions to ask me which were obviously from a script designed by Cats Protection. I was not offered the job and received feedback that was constructive, but in some ways also quite unfair. I think going forward Cats Protection would benefit from moving away from the archaic \"one size fits all\" questions and tailoring their questions to the individual, based on their background and experience. There were a couple of questions I had to ask for further clarification for, and one in particular, which I think was what cost me the job offer, was unnecessarily vague in its wording, even after asking them to elaborate. Interview questions should be accessible to all - generic questions lead to generic answers. To be told in feedback I didn't have a good understanding of something that is critical in my current role was disappointing to say the least! However, it isn't deterring me from applying again one day as it's a wonderful organization. I just hope Cats Protection have taken a second look at their interviewing process and techniques by then.", "Interview Questions": "What do you know about Cats Protection? What is the value of having volunteers within the charity?"}, {"date": "22 May 2023", "title": "Regional email officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Cats Protection in May 2023", "Interview Descriptions": "Just one interview. Received an invite one week after applying. The interview was ok, two staff members were on reading from a script and writing down answers. I felt the questions on the script were very cliché and dated. The staff were pleasant. I received a rejection and feedback a week later, that was appreciated but at the same time the feedback given would have been ascertained from my CV if they had read it.", "Interview Questions": "How have you delivered bad news to a workmate?"}, {"date": "8 Dec 2022", "title": "Cat Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Cats Protection", "Interview Descriptions": "Interview was about an hour long. About 10 questions, but each question had about 3 questions rolled into one. 2 managers taking turns asking the questions and making notes after each answer.", "Interview Questions": "Story of how you got to that point (career, education, volunteering), high and low points, how you dealt with these."}, {"date": "2 Nov 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cats Protection", "Interview Descriptions": "The whole process was disorganised and came across as chaotic so I withdrew from the process after the second interview. Due to the volume of applicants they appeared to be adding additional stages to the process but this wasn't well communicated and it meant that after the second interview there would be a third 'meet the sponsor/team' and the whole process at this point was 8+ weeks after submitting the application.", "Interview Questions": "Interviewing for lots of posts so except lots of generic questions. They had 11 standard interview questions to get through in one interview which left no time to ask questions back to them"}, {"date": "14 Oct 2022", "title": "Campaigns Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cats Protection", "Interview Descriptions": "Application (very user-friendly), 2 x interviews and 1x informal interview. Got back to me promptly and always kept line of comms open. Questions were thoughtful and varied. A very positive experience all round.", "Interview Questions": "Q: talk me through your experience Q: how do you manage lots of internal stakeholders?"}, {"date": "14 Nov 2022", "title": "Rehoming and Welfare Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Cats Protection in Sept 2022", "Interview Descriptions": "Interview is about 30 minutes, it is a script with about 20 questions. You can see a lot of these questions in STAR Interviews, just google it and you will find a lot of the question Cats Protection is using. last job responsibilities, about difficult colleges, how to deliver bad news, when you helped colleges, how to handle a sick cat, experience with cats,", "Interview Questions": "how to deliver bad news, when you helped colleges, how to handle a sick cat, experience with cats,"}, {"date": "19 Jul 2022", "title": "Marketing Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Cats Protection", "Interview Descriptions": "Entirely competency based with scoring system, not much room for getting to know the candidate as a person. The scoring system helps to avoid potential unconscious bias though. \r\n\r\nNo mention of salary negotiation.", "Interview Questions": "How do you keep track of KPIs"}, {"date": "25 Jul 2022", "title": "Cat Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cats Protection (Mansfield, England) in Jul 2022", "Interview Descriptions": "Approximately 2 weeks after submitting my application, I received an email inviting me to interview. This felt very relaxed and they were flexible with the interview date (I was away on the initial interview date). The interview was over Teams and I got a friendly, positive vibe from the manager and deputy. Interview lasted approximately 40 minutes with questions centering around my experience from my last job, my views on euthanasia and generic interview questions (working well as a team, solving problems etc). The following day, I received a phone call offering me the job, which I accepted. Following this, I was invited to an induction. No unpaid trial day was required (which I have had with similar jobs). The manager and deputy were also happy to answer any questions I had. Overall, the process was very straightforward and I look forward to starting at the Mansfield branch.", "Interview Questions": "Tell us about your most recent job and what your responsibilities were. "}, {"date": "21 Mar 2022", "title": "Social Media Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cats Protection in Mar 2022", "Interview Descriptions": "Process was very strange and impersonal. I was sent an automated email with a link to record myself answering questions and submit. Felt unnatural.\r\n\r\nHeard back a few days before the \"interview\" would have been planned to find out I hadn't gone to the next stage.\r\n\r\nFelt that they just couldn't be bothered to put the time in to meet candidates - judging by the other reviews I think I was right in that feeling.", "Interview Questions": "Tell us about a time your team had to rely on you"}], [{"date": "6 Nov 2022", "title": "Cat Welfare Adviser Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cats Protection in May 2021", "Interview Descriptions": "Via Teams due to covid. Interviewers were nice and welcoming. Questions were all pretty standard format, nothing too challenging, quickly realised that the scope of the job was too much for the salary I would be offered", "Interview Questions": "What do you know about Cats Protection"}], []]