[[{"date": "10 Jul 2023", "title": "Programme Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at World Food Programme", "Interview Descriptions": "The process includes Written Exam and interview Written exam covered couple job spesific technical questions and two budget related questions. Three hour exam but it can be finished earlier. Not very detailed but very technical questions", "Interview Questions": "Passed the exam but they suspended the position and informed the candidates with an e-mail"}, {"date": "16 Dec 2022", "title": "M & E Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Food Programme", "Interview Descriptions": "It was an online process via Teams. I could not directly see everybody because they were all in the same room and the camera position did not include them all.", "Interview Questions": "How did you deal with a colleague who was performing less than he or she should?"}, {"date": "23 May 2021", "title": "Assistant Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at World Food Programme", "Interview Descriptions": "testing procedure is 2 and half hour. The selection process is very long. I am waiting how the process go and would inform you guys tomorrow better when i have a clearer idea after the test", "Interview Questions": "what is your field of study"}, {"date": "10 Mar 2021", "title": "Programme Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Food Programme", "Interview Descriptions": "Had a written test. 5 questions and 2 hour time limit. The essay was sent to e-mail and i was asked to send back both pdf and word versions. Currently waiting for the next interview in case i pass the written exam", "Interview Questions": "Haven't had an interview yet. Waiting their response. "}, {"date": "15 Oct 2020", "title": "Government Partnerships Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Food Programme", "Interview Descriptions": "It was a panel  interview over the phone,  composed of a mix of competency based and technical questions. It took about 30 minutes in total - one panel member was questioning my responses posing tricky follow up questions, the other 3 were very kind and easy to have a dialogue with.", "Interview Questions": "Describe a time you successfully dealt with a donor."}, {"date": "13 Apr 2021", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Food Programme (Ankara) in Jul 2019", "Interview Descriptions": "Mostly competency-based questions to assess the performance in a particular key area or skill that is attributable to the job description. There is an interview panel consisting of 3-5 people each asking different questions in different areas.", "Interview Questions": "Give me an example of a challenge you faced in the workplace and tell me how you overcame it."}, {"date": "20 Oct 2020", "title": "Programmer Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Food Programme (Istanbul) in Jan 2018", "Interview Descriptions": "after technical and written exams selected ones invited to the face to face interview . I met the people I were supposed to work with and they asked mostly how to handle this that. What is the hardest situation etc questions .", "Interview Questions": "How to handle difficult person in the work place\n"}, {"date": "11 Jun 2017", "title": "Policy Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Food Programme", "Interview Descriptions": "The invitation letter to written test came after 2 months of application. There were 5 questions to be answered within 2 hours. Mostly assesting your past experience and skills.", "Interview Questions": "Tell us about innovative approach that you applied during the project monitoring and reporting."}, {"date": "5 Mar 2017", "title": "Business Support Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at World Food Programme (Ankara) in Feb 2017", "Interview Descriptions": "The process included written test and oral interview. Three weeks after written test, we have been invited for oral interview. It took about 20 minutes. There were 4 panel members, including HR assistant.", "Interview Questions": "Tell me about yourself "}, {"date": "9 Jan 2017", "title": "Finance Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Food Programme (Ankara) in Dec 2016", "Interview Descriptions": "I got an email about the written test two weeks (I'm not very sure but it was not more than three weeks) after the deadline of the application. A week later I entered the written test. A week later I got an email stating I passes the written test and I would have an interview 10 days later. The interview was completely based on the competency. It was not about assessing my knowledge about finance. It took almost 25 minutes. Approximately 4 weeks later I got an email starting with \"We regret to...\"", "Interview Questions": "Tell us a time when your counterpart was reluctant and you had a strict deadline. How did you hande the situation?"}], [{"date": "2 Jun 2016", "title": "Human Resources Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Food Programme (Ankara) in May 2016", "Interview Descriptions": "I was invited for a written exam , 1 month after I was intivited for an interview, It was a panel interview with 4 people, they were very kind and friendly.All questions were about the job description.  I have been asked 4 different scenarios and expected to give examples from my previous experiences.", "Interview Questions": "What are the tools of Human Resources Management?"}]]