[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "16 May 2023", "job_title": "Staff Associate in New York, NY", "duration": "N/A", "pros": "I really enjoyed my time at CMI and learned a lot.", "cons": "Communication between the organization could be better."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Dynamic Environment, Important Work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "31 Mar 2023", "job_title": "Management in New York, NY", "duration": "N/A", "pros": "The mission to help kids with mental health disorders could not be more important as there is a crisis that was accelerated by Covid and hasn't let up since. CMI uniquely delivers direct care, but also creates free resources, public awareness campaigns, and conducts revolutionary science. Growth of exciting new initiatives is exploding, the staff is very smart, caring, and generally supportive of one another. Pay and benefits are strong for a nonprofit organization.", "cons": "The accelerating number of grants and projects are running ahead of the staffing. This provides opportunities for personal growth, but can also be stressful and even chaotic at times. Diversity is solid at low to mid-levels, but thin near the top."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Worked there a long time ago", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "27 Jan 2023", "job_title": "Staff Associate in New York, NY", "duration": "N/A", "pros": "Unlimited sick time, great team", "cons": "Low pay, others in same position making a lot more"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Positive & supportive environment", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Dec 2022", "job_title": "Intake Coordinator in New York, NY", "duration": "N/A", "pros": "Opportunities for growth, supportive teams", "cons": "Salary disparities, wide scopes of responsibility"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 4, "Diversity and Inclusion": 1, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "n/a", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "10 Nov 2022", "job_title": "Patient Navigator in New York, NY", "duration": "N/A", "pros": "great exposure clinical work done by phd level psychologists. as an entry level person you learn a lot.", "cons": "very demanding environment. pay is low considering how much they charge."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "toxic and stuck up work environment", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Dec 2021", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "nice facilities, get to interact with children, some learning opportunities for support staff, some great clinicians and you get to hear about their research", "cons": "All clinical and support staff try to find a way to place the blame of something on someone else. Not enough assistants for the number of clinicians and their clients. Environment can get very hectic and overwhelming during the day. Most superiors don't treat their \"teams\" very well, if thats even what you want to call them. No one works together and everyone is very bland and fake. Salaries really not worth it for beginning support staff. They mostly hire younger girls just out of college for these roles and they will overwork you."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Avoid", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "30 Apr 2021", "job_title": "Manager in New York, NY", "duration": "N/A", "pros": "My immediate team was full of smart people who wanted to do something good or otherwise interesting. I was given opportunities to work on evolving projects related to a cause I care about. I learned an immense amount about project management, the subject matter, and what not to tolerate from future employers.", "cons": "The president makes people feel small if they don't have money or an advanced degree. He barks orders, makes asinine demands, and belittles people, and the senior management team follows suit. They blame their teams when they don't reach completely arbitrary and unreasonable goals. Conveniently, they're quick to claim ownership over successes. They make wispy attempts at connecting with staff that are laughable at best, but mostly insulting. The corner offices were a duo of cold, disrespectful, inefficient, and ineffective leaders.\r\n\r\nThe public-facing messaging would make you think the mission is to help children - and there are people there who do that or who want to. But at its core, the entire organization seems to exists to make one small man (and the elite few he deems worthy) feel big."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great organization mission terrible employer", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Sept 2021", "job_title": "Staff Associate in New York, NY", "duration": "N/A", "pros": "Great staff and community to work with", "cons": "Underpaid employees for massive workload"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "People who care about the mission", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 May 2021", "job_title": "Marketing Executive in New York, NY", "duration": "N/A", "pros": "Deeply committed people making a difference for kids with mental health and learning disorders. Reasonable work-life balance. Smart co-workers, but not arrogant. Passionate leadership.", "cons": "Tries to take on too many \"new ideas\" rather than taking the best of the prior ideas and expanding them."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Staff Associate", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 May 2021", "job_title": "Staff Associate in New York, NY", "duration": "N/A", "pros": "Good for people in graduate school hoping to gain insight into psychology careers", "cons": "Not a lot of room for growth. Big egos among senior clinicans"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "CMI looks great on paper, but, unfortunately, that's where the good ends.", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "12 Mar 2015", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "The operations team on the foundations side of the agency was fantastic.  Friendly, sweet, passionate...they made coming in every day tolerable. Salary was OK for the position. Location was easily accessible and the hours were standard 8am-4pm. HR was also fair.", "cons": "Harold is a bully and a tyrant. Unless you were a PhD, you were treated like a second class citizen by the psychologists/clinicians. I've never been made to feel so little before in my life. My supervisors were misleading, condescending and unreasonable. Training was lacking and if you made a mistake or asked a question for clarification, you were made to feel like a burden. Although many places have incorporated a 30 minute lunch break, you felt guilty for taking it. No other breaks were offered. The place caters to the elite and if you're not that...they'll make sure you're aware of it."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "meh", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Apr 2021", "job_title": "Staff Associate in New York, NY", "duration": "N/A", "pros": "good experience and team people", "cons": "horrible admin and work expectations"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Feb 2021", "job_title": "Supervisor in New York, NY", "duration": "N/A", "pros": "A lot of opportunities for growth.", "cons": "None at this point in time."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "An Exceptional Opportunity", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Nov 2016", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "I sensed from the beginning that this wasn't like any other nonprofit organization where I had worked before. There's a strong sense of mission and ownership of the work by almost every professional -- which creates a fun, engaging atmosphere and culture. The pace is fast and there are clear expectations for performance, but overall the culture is very fair. It tends to attract top talent in, and outside of, the nonprofit industry. It's a fantastic place to learn, grow, and work with a sense of passion toward a great mission -- which is helping treat, research, and educate about children's mental health and learning disorders. Highly recommended.", "cons": "If you are not the type of professional who handles constructive criticism well, or if you prefer a slower pace in your work, this may not be for you. Child Mind Institute functions more like a for-profit company at times, with what can be a demanding work load and intense schedule. (That said, the days are fairly traditional business hours, 9:00 to 5:30 or 6:00.) If you like this sort of challenge, however, it's a great place to experience many new opportunities and grow."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Clinical Team", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Oct 2017", "job_title": "Senior Staff Associate in New York, NY", "duration": "N/A", "pros": "sense of community, passionate and intelligent clinicians who want to teach you and guide your career growth, open-door policy, fast-paced environment with plenty of access to clinical training opportunities.\r\n\r\nI worked as a Staff Associate for the Anxiety & Mood Disorders Center for two years and am fortunate to now be in my top choice doctoral program due to the training, experience, and relationships I cultivated throughout my time at CMI. If you put in good, quality work, have an open mind, and are a self-starter you can easily succeed given the opportunities you have within the clinical team. The support staff is all highly driven, kind, compassionate, and smart. We truly worked as one unit to provide the best support to the clinicians as we could, and most days, were happy to do so. I feel very fortunate to have worked at CMI and am incredibly grateful for the memories and friendships I took with me upon leaving for school.", "cons": "management can be difficult at times if you are in a position to work with them on a regular basis. criticism tended to feel personal rather than constructive in some instances."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Good mission, driven colleagues, demanding work environment", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "14 Nov 2018", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "This org makes an actual difference in the lives of kids and families. The clinical staff is excellent, idealistic and committed; the research is cutting-edge and community-oriented; the community and public education programs are free and growing and helping families worldwide. Benefits and compensation are excellent. Originality and initiative are rewarded. Clinical and research training seems to lead to advancement and is well regarded in the field. Leaders are very well connected, allowing for networking. Growing commitment to staff development and positive work culture.", "cons": "This org continues to have a start-up attitude at the senior management level that allows knee-jerk decision making. Strategic plans and goals are vague or poorly communicated. This can be destabilizing and demoralizing particularly for foundation admin staff trying to support org vision but stymied by shifting goalposts and KPIs. Lean staffing on foundation/public education side leaves little opportunity for advancement or professional development."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Decent Nonprofit Job", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Oct 2018", "job_title": "Coordinator in New York, NY", "duration": "N/A", "pros": "Great leadership - they're really invested in the mission and their passion is contagious.\r\nLots of variety - because there's lots going on, there is no risk of falling into a daily routine that feels like a rut. Always something new!\r\nSupportive coworkers - consistently kind and helpful coworkers who are willing to answer questions and lend a hand during crunch time.", "cons": "Growing rapidly, so some growing pains in terms of getting what you need in time and knowing where to look.  Lots of unspoken assumptions about how things work."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Oppressive, toxic work environment on foundation side", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Sept 2015", "job_title": "Research Assistant in New York, NY", "duration": "N/A", "pros": "Good location, standard salary, great coworkers", "cons": "You are very often expected to work 70 hour workweeks and work through lunch to clean up some EMERGENCY that needs to be done NOW that is only an issue due to poor planning by the management, and it turns out after you finish the project that it wasn't so time-sensitive after all. This happens WEEKLY. \r\n\r\nThere is a toxic, tense environment on the foundation side (not speaking for the clinical side). I HIGHLY recommend that you skip out on a job offer here and wait for something else. This an absolutely horrendous place to work and I am looking forward to quitting as soon as I can secure something else. I have stuck it out for over a year now and it is only getting worse."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "SO Disappointed: Great Mission, Smart Clinicians, Toxic Executive Environment.. I should've heeded other reviews", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Jul 2016", "job_title": " in New York, NY", "duration": "N/A", "pros": "Beautiful office, smart clinicians and nice staff associates. Good benefits, generous PTO, monthly staff lunches, high-profile organization.\r\n\r\nFOUNDATION: Great mission, good fundraising ability, good hours.\r\n\r\nCLINICAL:\r\nVery smart, nice clinicians and staff associates. They do great work, and are leaders in their field.", "cons": "Where to begin?  I should've heeded the previous reviews, but they're absolutely accurate about CMI being a toxic environment. CMI execs/HR know very well about these reviews, but simply choose to disregard them (as I did, to my detriment).\r\n\r\nFOUNDATION: \r\nManagement is untrustworthy (as is HR), unfocused (at the whims of the president), and unorganized. Many staffers don't have the skillsets needed for their jobs, but are hired because most others are scared away from applying (I now know why), or have some connection to the Board or donors.\r\n\r\nExecutive leadership is poisonous: self serving, disorganized, and quick to blame others (usually junior staff).\r\nManagement frequently is indecisive or doesn't want to take responsibility for projects, so if they are unsuccessful (in reality, or just in the president's view), they won't be blamed. Routinely, decisions are compelled to be made by consensus of a number of influential staff that have no expertise in that particular project. \r\nAnother review mentioned having to work on 'emergency' projects that have become so because of poor planning by management -- this is absolutely accurate, and happens very often, if not weekly.\r\n\r\nJunior staff follows Executives' lead, and work in fear, seeking to avoid being blamed for something. Due to indecisiveness of executives, they lack real direction and leadership, and isn't able to grow. Junior staff has also become infamous for filing complaints with HR or management for any perceived slights.\r\n  \r\nThe president is an NYC socialite, obsessed with celebrities, and a bully, and sets the tone for the organization. It's a running \"joke\" amongst staff that he's feared, unreasonable, and obsessed with celebs.  (there have been quite a few lawsuits found in the public record) YELLS (!) at staff... often.\r\nHe's elitist, and tends to judge staff by their background/connections/school. (which is ironic, knowing his background).  He often creates chaos when he gets an idea or a goal in mind (viable or not), and staff is compelled to make that a top priority, regardless of other projects.\r\n\r\nExtremely high staff turnover -- staff often talks about how people come and go quickly.  Executive leadership has continued to change drastically for a number of years, due to the above."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Very Rewarding Experience", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Mar 2013", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "Coworkers are hardworking and dedicated to the cause. Everyone was knowledgable and the work environment was friendly. It was definitely a good place to learn and grow as an employee.", "cons": "The compensation was not as good as other organizations, but is understandable due to its nonprofit nature. The work environment could sometimes be too relaxed, but this is not necessarily a bad thing."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Disappointing", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Jul 2016", "job_title": "Associate in New York, NY", "duration": "N/A", "pros": "Not sure. Some nice people but they are ignored or fired. They like uppity folks who do no real work and treat men and women badly. HR can be", "cons": "Executive leadership poisonous: petty, self serving, mean, and blaming of others. The man next to me cried after meetings every week and yelling continued. We worked so hard through emergencies and still were yelled at when it was not our fault. Development turnover very high"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Pediatric Psychological Innovation", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Nov 2018", "job_title": "Data Analyst in New York, NY", "duration": "N/A", "pros": "The organization is dedicated to transparent innovation in a difficult domain. In just the 2 years I've been here, the company has grown extraordinarily quickly, which is good because we always have more research questions than humanpower.", "cons": "Since we always have more research questions than humanpower, the workload sometimes feels endless, and as a nonprofit, the payscale is below market for New York City."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Supportive culture and great work environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Nov 2018", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "The collaborative environment and supportive people at the Child Mind Institute are one of a kind. Everyone at the organization is passionate about making a difference.", "cons": "Child Mind Institute might not be the ideal fit for you if you are not flexible and willing to take on additional tasks from time to time."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Terrible place to work, revolving door of talent", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Mar 2017", "job_title": "Communications Coordinator in New York, NY", "duration": "N/A", "pros": "Great talented people despite the obvious terrible reviews.", "cons": "The top level executives run the org as a playground, it mostly feels like you're being bullied at work."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Sterile", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "26 Sept 2020", "job_title": "Patient Navigator in New York, NY", "duration": "N/A", "pros": "Clean, beautiful office building and location", "cons": "“cold” work environment, job descriptions need to be reworked or hire more staff. Many great clinicians but support staff team needs to be reworked."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not geared towards public sector", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Jul 2017", "job_title": "Research Assistant in New York, NY", "duration": "N/A", "pros": "Free coffee and tea is available most times. Centrally located and near Chase bank and Grand Central plus museums. Fair insurance coverage.", "cons": "Frequent turnover and burn out. Lower level staff treated as commodities. Very elite staff with emphasis on sound bytes and marketing rather than nonprofit work or serving others."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "A unique place for research and practice", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "10 Aug 2019", "job_title": "Scientist in New York, NY", "duration": "N/A", "pros": "A great potential for conducting translational research and implementing evidence-based practice\r\n\r\nThe location of office (57th/Park Avenue; the center of Manhattan)", "cons": "HR's weak grasp of organizational issues, particularly those within the research"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great Place for Researchers", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Oct 2017", "job_title": "Junior Research Assistant in New York, NY", "duration": "N/A", "pros": "There is a laid back but professional atmosphere that helps you to relax and enjoy the workplace", "cons": "The communication between teams can be lacking"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Just awful", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Mar 2015", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "only the location that's it I try hard to think what is good about working here but I can't come up with much pros", "cons": "Did another reviewer say toxic environment? Yes that is true I agree"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Mission Statement is a Sham", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Jul 2020", "job_title": "Manager in New York, NY", "duration": "N/A", "pros": "There are no pros to this work environment", "cons": "Toxic work culture that values elitism, nepotism. Undercurrents of racism and misogyny."}]]