[[{"date": "7 Jul 2023", "title": "Engagement Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth (Denver, CO)", "Interview Descriptions": "Had two interviews and it was a good experience. The first interview was a one-on-one and the second interview was with the entire team. I think they could have had a better job description of the role on the application and that is why I gave this role a neutral experience.", "Interview Questions": "Share your experiences with us."}, {"date": "4 Jul 2023", "title": "Patient Access Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCHealth", "Interview Descriptions": "It is the Standard questions that every interview has such as tell me about yourself, work experience, biggest challenge, and opportunities for improvement. They are usually in person and very easy to talk to.", "Interview Questions": "Name one of your biggest strengths."}, {"date": "25 Jun 2023", "title": "Dual Role Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UCHealth (Aurora, CO)", "Interview Descriptions": "7 people sat around the conference room table... all of them interview me simultaneously. I was given no warning about this and felt overwhelmed. Some of them were rude and asking questions that felt irrelevant.", "Interview Questions": "How would you handle working in the call center even though you applied to work directly with patients only."}, {"date": "14 Jun 2023", "title": "Dispatcher Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth (Aurora, CO)", "Interview Descriptions": "Interviewed twice and everything went well. Had a VM from HR with a job offer and was then ghosted by the entire department. Was a rather traumatic experience. My texts and calls just went unanswered.", "Interview Questions": "Questions about leadership mostly really."}, {"date": "6 Jul 2023", "title": "Cerified Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UCHealth (Colorado Springs, CO) in Jun 2023", "Interview Descriptions": "Lots of questions, took about an hour, it took about two weeks to get an offer. Once I got an offer there was a lot to complete but over all it’s been a moderate process", "Interview Questions": "Why do you want to work for uc health ?"}, {"date": "14 Apr 2023", "title": "Advanced Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCHealth (Loveland, CO)", "Interview Descriptions": "The interview process was streamlined. I received all the information I needed within a reasonable amount of time. I did the interview over video. Every person was very nice and timely.", "Interview Questions": "Explain a time when you were under pressure, how did you handle it?"}, {"date": "1 Apr 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCHealth (Denver, CO)", "Interview Descriptions": "Spoke to two nurse managers and they took turns asking questions. Both managers were very nice and I was offered the positions a few hours later. You are given 3 days to decide and they send benefits and salary information documents.", "Interview Questions": "How to handle different patient scenarios"}, {"date": "4 May 2023", "title": "Patient Access Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCHealth (Denver, CO) in Apr 2023", "Interview Descriptions": "Denver Metro Area, end of April/early May 2023. TLDR; experience was fine overall, but in the end, I was offered $20/hour. I tried to negotiate since the posted range was $19-$24, was told his \"hands were tied,\" and I declined the offer. I first spoke with a recruiter over the phone. It was VERY standard, just asking about availability, schedule, etc. I asked questions about the role, expressed my skills and what I anticipated the role to be like. He was impressed and shared that he thought I'd do very well in the interview. I was scheduled for a virtual interview next. The interviewer was really nice, great experience. She went over what locations I could work in, any time off I might need, etc. Then she asked me a bunch of behavioral interview questions. Tell me about a time when... conflict with a coworker, dealing with a difficult customer, learning a new computer system, etc. There were 4-6 questions. She gave me an opportunity to ask questions and told me they'd be in touch shortly. Later that day I received an email request to submit 5 references into their online system. It sent them an online survey of some sort. That same day, I got a call from the recruiter offering me the job, pending references. I was offered $20/hour. I asked for three business days to think about it and to make sure my references had a chance to respond. I called a couple days later and tried to negotiate a higher wage. The posted range was $19-$24. The minimum required experience was \"none.\" Preferred experience/skills was customer service, working independently, assisting patients check in, insurance verification, etc. I don't have a lot of formal healthcare experience, but I have 9+ years of customer service experience in a variety of roles, 4 years of HR experience, and 2 years tech industry experience. I also have a B.A. I was willing to take $23, maybe even $22, because I wanted to start a long-term career with UCHealth given the growth opportunities. I'm flexible with my schedule and with the location I travel to. I made my case to the recruiter and he said his \"hands were tied.\" I politely declined, it's just not a sustainable wage in this area. Also, why post such a wage range if there really isn't a range? Just an FYI for people interviewing! Maybe ask about wage upfront!", "Interview Questions": "Tell me about a time when... you had a conflict with a coworker, you had to deal with a difficult customer a time when you had to learn a new computer system, etc. There were 4-6 questions behavioral interview questions."}, {"date": "24 Apr 2023", "title": "NICU RN Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UCHealth (New York, NY) in Apr 2023", "Interview Descriptions": "Interview process went great. Basic interview questions. I was called and given an offer (part-time) which was less than I make at my FT job, I counter-offered and was told they would call me back. I never heard back from the recruiter after multiple emails. I don't care if they moved on to other candidates, but they wasted my time with their poor communication.", "Interview Questions": "tell me about your experience?"}, {"date": "24 Mar 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth", "Interview Descriptions": "Very thorough. It involved a phone conversation with the recruiter and 2 in person interviews. Everyone was polite and respectful. I felt very much at ease and was able to ask questions of them as well.", "Interview Questions": "Describe a situation where you had to deal with conflict"}], [{"date": "24 Mar 2023", "title": "Customer Service Representative (CSR) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCHealth", "Interview Descriptions": "1 month after applying did an video questionnaire. 1 month after that got invited for a video interview 1 day later. It was a teams and 2 members of management interviewed me about 20 mins.", "Interview Questions": "How to handle a difficult situation."}, {"date": "23 Mar 2023", "title": "Desktop Support Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at UCHealth (Denver, CO) in Feb 2023", "Interview Descriptions": "Applied for a position and received an interview request pretty quickly. I think it took about a week. I was interviewed via Microsoft Teams by the IT Manager and the District IT Manager. They asked a few questions, the conversation flowed pretty well, they joked about my dog who was in the background, etc. Near the end, they said they would let me know within a week. It took 4-5 weeks to hear back from them and the \"not selected\" email was cold and impersonal.", "Interview Questions": "How would you add a computer to a domain and where would you go to do it?"}, {"date": "11 Jan 2023", "title": "Senior Marketing Research Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UCHealth (Denver, CO) in Dec 2022", "Interview Descriptions": "Phone and on-site interview. They're using the on-site to farm new ideas. Most of the team seem confused about what the job role entailed. A few hours after the on-site I received an email stating that they had selected another candidate.", "Interview Questions": "How do you like to work? Can you write code? How does your experience tie into the role?"}, {"date": "14 Feb 2023", "title": "RN Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UCHealth (Fort Collins, CO) in Dec 2022", "Interview Descriptions": "It was a 45 min long interview that included one supervisor and two other managers. The supervisor and one of the managers were in person and the other manager interviewed me over TEAMS.", "Interview Questions": "What is your leadership style?"}, {"date": "15 Feb 2023", "title": "Business Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UCHealth (Aurora, CO) in Dec 2022", "Interview Descriptions": "My first Interview was in December 2022 and asked for all my references. The manager went on vacation for a month and I heard from her in the beginning of January and then I had to reach out 2 weeks later. I didn't get the job. It took over 2 months and the process was very long.", "Interview Questions": "How do you handle difficult Physicians?"}, {"date": "16 Nov 2022", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCHealth", "Interview Descriptions": "1 30-45 min interview with hiring manager 1 45 min interview with department manager 1 30 min interview with every team position will be working with, 4 teams 1 45 min interview with CMO", "Interview Questions": "Tell me about your experience in management"}, {"date": "26 Oct 2022", "title": "Talent Acquisition Partner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCHealth", "Interview Descriptions": "Fairly quick process. Opportunity to talk with multiple members of TA team and learn about challenges they were facing in filling open roles. Overall good interview experience. Kept me informed throughout the process.", "Interview Questions": "Discuss previous experience and challenges that you overcame with tough to fill positions."}, {"date": "2 Nov 2022", "title": "Rehabilitation Therapy Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCHealth in Oct 2022", "Interview Descriptions": "The process started with a zoom interview, followed by an in person meeting and tour of the workplace. The overall process tok around a month but that was longer than expected by then due to the needs of the position shifting a bit.", "Interview Questions": "Background and experience, why I enjoyed the work, what my future plans are"}, {"date": "19 Sept 2022", "title": "Health Care Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UCHealth", "Interview Descriptions": "1 phone interview. 1 video interview- thats it. Never heard anything back. Tried emailing hr. No response. Also I had difficulty with sound during video interview. I don’t know if that was only in my end or theirs too.", "Interview Questions": "What are your greatest  strengths?"}, {"date": "25 Aug 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCHealth", "Interview Descriptions": "I submitted a general resume, then had a zoom call with the nursing manager and assistant manager, and finally had an in-person meeting with the unit nursing manager. It was all straight forward but I was quizzed on vitals and situations where I had to make hard decisions.", "Interview Questions": "What would you do if a patient needs their blood sugar checked, another one is calling, and another patient’s fall alarm is sounding?"}], [{"date": "22 Aug 2022", "title": "Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UCHealth", "Interview Descriptions": "never called for interview. unable to get in touch with anyone to schedule it for two weeks. interview difficult because I had no outline of the interview process to go by.", "Interview Questions": "Why are you interested in this role?"}, {"date": "13 Aug 2022", "title": "RN, Bsn Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UCHealth", "Interview Descriptions": "The interview process was virtual due to Covid. It lasted about 45 minutes and there were several people on the call asking questions. I started by introducing myself and then they got into the job position.", "Interview Questions": "Describe an experience where you’ve had to prioritize. "}, {"date": "11 Aug 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCHealth", "Interview Descriptions": "They used STAR interview questions. Such as, tell me a time when you had an issue with a coworker. Tell me three of your best qualities. Tell me why you would be a good fit.", "Interview Questions": "N/A"}, {"date": "25 Aug 2022", "title": "New Grad RN Residency Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UCHealth in Aug 2022", "Interview Descriptions": "The initial Microsoft teams interview was scheduled ~1 week after I submitted my application, and then the job offer email outlining benefits & next steps was received ten days after that. There were 3 managers from different units at the interview. I am still waiting on the official offer letter after a week. Sounds like a great company and love that the new grad program is CCNE accredited.", "Interview Questions": "I was given a scenario question about a patient who had been A&O and they have a sudden change in LOC. "}, {"date": "12 Sept 2022", "title": "Scheduling Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at UCHealth (Aurora, CO) in Aug 2022", "Interview Descriptions": "Before I was called to interview I had to send out a reference survey to 5 former colleagues. I was then contacted and had a 45 min interview. Then was ghosted, after already asking for references, ", "Interview Questions": "Not many pertaining to the role mostly about my experience"}, {"date": "9 Jul 2022", "title": "Graduate Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth in May 2022", "Interview Descriptions": "I went through the application, which was very thorough then a recruiter emailed to set up an interview with managers of the units I wanted to apply for. The interview was relaxed. They asked a mix of general questions and scenario questions. I got an offer a few hours later and had a week or so to decide.", "Interview Questions": "You are a new grad nurse floated to a different unit. A patient goes down hill. What do you do? "}, {"date": "17 Apr 2022", "title": "AHT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UCHealth", "Interview Descriptions": "Interview. General interview. All managers there so three. A lot of interpersonal questions. Integrity question. I have not much to say but this website make me write 30 thirty words.", "Interview Questions": "How would you describe integrity? "}, {"date": "12 Apr 2022", "title": "Psychiatrist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UCHealth", "Interview Descriptions": "Initial interview was awkward with rapid fire questions and multiple people present. Then you tend to meet with people who align more with your interest. Those meetings were more layed back", "Interview Questions": "Behavioral situations about patient care and teamwork"}, {"date": "7 May 2022", "title": "Marketing and Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at UCHealth (Aurora, CO) in Apr 2022", "Interview Descriptions": "I was recruited for a senior director role by an executive recruiter and then had several interviews with the supervisor and other team members over three months. I had to submit written assignments. I was identified as a strong candidate and finalist. Went to be interviewed on-site, traveling across the country; and it was downhill from there. On-site the decision-makers seemed more concerned with my recent job gap and decision to leave a toxic boss and position just short of a year, even though I had so much other experience and had been vetted significantly before being identified as a finalist. Leadership interviews were either superficial and impersonal or very granular. I felt like I got thrown under the bus. And the whole thing was disorganized- technology failing left and right, agenda for the day constantly changing, no warm welcome- I even got dropped off at the wrong hotel and they did not want to pay for my taxi back to the airport. I observed a lot of good and dedicated people but also saw the other side. For example, a top executive reprimanding my potential supervisor instead of greeting me as I waited to meet her, last minute questions about my resume with heavy scribbling in the margins as I fielded what should have been initial screening questions, and  lowball statements  like “why would you move here if you think where you live now is beautiful?” It was cat and mouse for sure, and I have several examples about how this played out. A lot of talk about brand and valuing the patient experience  but my recruitment experience was surprisingly poor. Red flags everywhere. My recruiter and the supervisor did not do their due diligence before I arrived or I would not have been answering basic questions about my last job or resume- it should have been higher level or just do not being me forward.  HR got involved post-interview knowing nothing and the people who knew better sandbagged me. I wish I had never interviewed at UCHealth. I took the brunt of their poor internal communication and was not respected or deemed worthy. After all my effort, I did not even get a phone call or any constructive feedback when they decided not to proceed with my candidacy. I received a perfunctory email. I was very disappointed the supervisor could not even give me the courtesy of a phone call. I thought that they cared about people but I must be the exception.  The guy I would have reported to looked exhausted but not sure where his head was. Guess I dodged a bullet.", "Interview Questions": "Why did I leave my last job?"}, {"date": "30 Mar 2022", "title": "OR Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UCHealth", "Interview Descriptions": "A very straight forward process. Interview with recruiter followed by a panel interview with charge nurse and managers! Be ready to provide examples to scenarios.  Also know the mission behind UC Health.", "Interview Questions": "Tell me about a time you handled a stressful situation. "}], [{"date": "28 Mar 2022", "title": "Medical Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UCHealth (Colorado Springs, CO) in Mar 2022", "Interview Descriptions": "For a virtual interview,it was it was ran nice with their team there ready to ask and answer questions. They were informative  about the day to day tasks and job responsibilities.", "Interview Questions": "How I handle conflict in the work space "}, {"date": "9 Mar 2022", "title": "New Grad RN Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UCHealth in Mar 2022", "Interview Descriptions": "super great communication along the way. Long written application then I interviewed with the managers of my top three units plus some other managers for units that are related. Got first offers within 24 hours with all offers from the interview rolling out within 3-4 days. Very clear offer summarizing pay, next steps, and benefits.", "Interview Questions": "Why do you want to be a nurse? What would you do if you were not a nurse? Why these units? Why UC health? Time you had a challenge? Time you made a difference in patient care? Best part of nurse and worst part for you?"}, {"date": "3 Jul 2022", "title": "New Grad RN Residency Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UCHealth (Denver, CO) in Mar 2022", "Interview Descriptions": "Panel interview with selected units (up to 3)- one unit manager didn’t show up at all. Done over Teams call in 30 minutes, fairly general interview questions with 2 clinical based questions.", "Interview Questions": "What would you do if a fall risk/within arm’s reach patient is adamantly requesting you leave them alone in the bathroom for privacy?"}, {"date": "22 Nov 2022", "title": "Administrative Operations Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at UCHealth (Denver, CO) in Jan 2022", "Interview Descriptions": "There were three rounds of interviews. The first was a phone screening. The second was a panel with three current employees, and the final round was with several members of the c-suite executive team. All were held virtually and included a period of behavioral questions followed by a period of questions specific to interest in UCHealth.", "Interview Questions": "Describe a time you had to overcome an obstacle and how you learned from this experience."}, {"date": "6 Feb 2022", "title": "Acute Care Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at UCHealth in Jan 2022", "Interview Descriptions": "2-part interview that consisted of an explanation of job roles, benefits, career ladder, etc. with two supervisors and then the actual interview by a PT and an OT. The questions asked by the PT and OT were of average difficulty and afterwards, the PT and OT fielded any questions I had about the position.", "Interview Questions": "What was one of your most complex patients (and how did you provide them great care)."}, {"date": "6 Dec 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UCHealth", "Interview Descriptions": "Very fast and straight to the point! Interviewing with multiple units at once can be hard because most people like to relate to each unit differently.  I apply to units for different reasons", "Interview Questions": "Describe a time you had a conflict with a coworker and how you managed it "}, {"date": "4 Oct 2021", "title": "HR Business Partner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth", "Interview Descriptions": "I had a brief phone interview with the hiring manager that went well. She was informative, prepared, and pleasant. I never heard back from anyone following this discussion which was disappointing.", "Interview Questions": "Standard initial phone screen questions about my background and experience as it related to the position."}, {"date": "26 Apr 2023", "title": "Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UCHealth (Charleston, SC) in Oct 2021", "Interview Descriptions": "Clear interview questions and process. Great communication and follow up from the beginning of the interview process through to the end. Provided direction for the day and expectations for who would be preset during the interview.", "Interview Questions": "If offered this position, tell me what may be one challenge you expect,"}, {"date": "20 Sept 2021", "title": "Pharmacy Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCHealth", "Interview Descriptions": "Recruiter called and left voicemail for scheduling an interview. I called back and left a voicemail and received no response. I am disappointed in the process. For this position it should have been understood that I am a student and would have been in class; therefore, I think email should have been the primary form of communication (instead of randomly calling me while I was in class). I guess it worked out not to be called back to officially schedule an interview as it seems there is not much understanding for students.", "Interview Questions": "No official interview, but was required to provide five official references (two being a current or previous supervisor) "}, {"date": "10 Sept 2021", "title": "Patient Access Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at UCHealth (Colorado Springs, CO) in Sept 2021", "Interview Descriptions": "The questions were pretty regular - \"why do you want this job?\"  \"can you give an example of a time where you had to resolve a difficult situation with a co-worker or client?\" \nI met with the clinic lead/manager on site and met the area manager via Microsoft Teams. Both asked questions.", "Interview Questions": "\"What do you do to take care of yourself?\"\n\"Why do you want to work for UC Health?\"\n\"What personality traits of yours would complement this role?\"\n\"Can you give an example of resolving conflict with a co-worker?\"\n\"How do you handle a situation where your co-worker doesn't communicate with you?\"\n\"What are your strengths?\"\n\"What are your weaknesses?\"\n"}], [{"date": "26 Feb 2022", "title": "Senior Recruiter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UCHealth in Sept 2021", "Interview Descriptions": "Process was simple. Submitted an application, attended a virtual hiring event/information session, scheduled an interview. \r\n\r\nInterview was done entirely remotely through Zoom. \r\n\r\nThe interview panel were all very nice and I had a great time. I believe that I was not offered the position simply because they found someone with more experience than myself (I have 4+ years).", "Interview Questions": "Tell me about your experience as a recruiter and the challenges you have faced during COVID-19."}, {"date": "29 Sept 2021", "title": "Social Media Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UCHealth in Aug 2021", "Interview Descriptions": "I interviewed for a social media specialist role and took the time during my vacation to find the right setting and room for a video conference only to have it be a phone call that could have happened anywhere. Wasting my time on vacation started us off on the wrong foot. \r\n\r\nI had a great background, and we connected pretty well, but UC Health fetishizes paid Facebook ads even if finding success with organic is harder. (And I can tell they prefer paid Facebook posts because they need help on their boring organic copy. Yikes!) They wanted someone with a budget experience of $100k, and I only had several hundred to a few thousand campaign experience. What a ridiculous demand! \r\n\r\nWhat made matters worse was the rejection email claiming I was on \"a great path for learning.\" I know that this response was well-intentioned, but I am a little too far along in my career to be \"on a great path of learning.\" I ran the social for the nationwide brand for 4-plus years, and before that, I have 3 years in B2B. You write that if TikTok marketing were a requirement and not being picky with having enough paid experience (from a budget standpoint).", "Interview Questions": "What were examples of Facebook paid ad campaigns you managed?"}, {"date": "31 Aug 2021", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UCHealth in Aug 2021", "Interview Descriptions": "There was an online application along with a quick video interview. They were very welcoming and  kind. I interviewed for the L&D unit. They were able to referr me to another department.", "Interview Questions": "What was a positive patient experience you have had?"}, {"date": "4 Sept 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at UCHealth (Denver, CO) in Aug 2021", "Interview Descriptions": "They were very thorough, responsive, and engaging.  I started with a phone interview and then I had an opportunity to shadow the workers in the office before a formal interview.  I have one more interview with staff that wasn’t  there during my first formal interview and hope to revive an offer.", "Interview Questions": "Why I wanted to work there"}, {"date": "25 Jul 2021", "title": "Registered Nurse Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCHealth", "Interview Descriptions": "First, a phone interview and then a sit down with the manager. Was also able to meet with coworkers in an interview. There was time to ask questions and felt very positive.", "Interview Questions": "How did you handle a difficult situation?"}, {"date": "20 Jul 2021", "title": "Telehealth RN Call Center Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCHealth", "Interview Descriptions": "Zoom interview with 2 leaders. Reviewed my background and went on to triage scenarios. They would read a scenario and you need to tell them what the best plan of care is for the patient.", "Interview Questions": "Tell me about your background "}, {"date": "12 Jul 2021", "title": "RN, Bsn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCHealth", "Interview Descriptions": "Phone interview easy spoke with managers and asked some sensation questions about pt care situations . Like most typical interviews. Long orientation. It was a very good interview and hiring process", "Interview Questions": "What would you do with a BS of 50"}, {"date": "2 Jul 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UCHealth (Aurora, CO)", "Interview Descriptions": "Physician panel, Executive director interview, All-day interview sessions with Specialty RNs and staff. Excellent opportunity to identify role and responsibilities and assess culture of the organization. Staff was very welcoming and collaborative.", "Interview Questions": "Why I wanted the job"}, {"date": "28 Jun 2021", "title": "Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UCHealth", "Interview Descriptions": "Thought I was only meeting with manager of unit, and was blind sided by two more people. One was quite unfriendly. After interview, I was asked if I was interested in a prn position, but I was interviewing for a full time position. Communication and follow up was poor.", "Interview Questions": "Tell me about a time you resolved a patient conflict."}, {"date": "11 Mar 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at UCHealth in May 2021", "Interview Descriptions": "They were hiring urgently for a role as a Research Assistant, but the interview process was extremely long and drawn out. I interviewed 4 times, and they delayed the timeline several times. They told me they would give me a final answer by a certain date and I waited an extra two weeks. In one of the interviews, I had to speak Spanish, which I was not told ahead of time. They ended up hiring someone with more experience than me - although it was advertised as a part-time, entry level position.", "Interview Questions": "Describe your past research experience."}], [{"date": "5 Jan 2022", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at UCHealth (New York, NY) in Apr 2021", "Interview Descriptions": "I applied late April was contacted about a week later for my interview and had a position offered about 24 hours later. Had about 2 weeks of training in the Leprino building and 2 weeks of shadowing.", "Interview Questions": "Tell me about a time you had to handle a difficult situation with a coworker and how did you handle it? \nWhat did you learn from that?"}, {"date": "21 Mar 2021", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth (Lone Tree, CO) in Mar 2021", "Interview Descriptions": "Very brief, over all an average interview.  Interviewer was a nurse on the floor. She was very kind and kept the interview moving. Also explained the role very well.  Answered all my questions very thoughtfully. 30 minute maximum, about 10 questions", "Interview Questions": "What does care mean to you?\r\nWhat would you report to a nurse?"}, {"date": "10 Feb 2021", "title": "Patient Access Liason Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth (Aurora, CO) in Feb 2021", "Interview Descriptions": "2 step interview process. I applied at the beginning of January and got a job offer beginning of February. It was a long process but easy virtual interviews due to Covid.", "Interview Questions": "If you didn’t know how to hook up dual monitors, how would you figure it out?"}, {"date": "27 Jan 2021", "title": "Medical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UCHealth", "Interview Descriptions": "It was a 4 people interview. Very friendly but professional. They seemed very open and honest. They showed me the different departments  and their respective instrumentation. They gave me a brief summary of the test that they run.", "Interview Questions": "What is Team work for you?"}, {"date": "8 Jan 2021", "title": "Medical Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at UCHealth (Denver, CO) in Jan 2021", "Interview Descriptions": "Incredible and swift experience. The interview panel was wonderful at describing the position and work environment and provided thoughtful answers to questions regarding the job and work environment. The response times happened quickly and were communicated effectively.", "Interview Questions": "How would your prior employers describe you?"}, {"date": "20 Jan 2022", "title": "Materials Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth in Jan 2021", "Interview Descriptions": "A normal average interview process. It was easy. There were a lot of steps in the process. Thanks for reading. One interview, reference check, orientation. Started job after that. Good luck", "Interview Questions": "Biggest accomplishment that you had in your career "}, {"date": "10 Dec 2020", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth in Dec 2020", "Interview Descriptions": "Easy formal questions with some what if and behavior questions. It was a panel interview. they were focused on lawson experience and what you could built out of given data.", "Interview Questions": "how would you rate your excel knowledge?"}, {"date": "24 Nov 2020", "title": "Rad Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UCHealth", "Interview Descriptions": "The process was smooth, I am looking forward to working with this hospital. The hr are very efficient and keep in contact regarding the potential hiree. I am very excited.", "Interview Questions": "Tell me about your experience "}, {"date": "15 Dec 2020", "title": "Centralized Scheduling Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth (Colorado Springs, CO) in Nov 2020", "Interview Descriptions": "I received a call to be interviewed and they wanted to interview me the next day. I explained I worked 8:30 to 5 so was told to do the interview via Microsoft teams over my lunch break.  Because of this I had to interview on my phone out of my car. \r\nThat evening around 6:45pm I received an email saying I had to have 5 coworkers complete a 30 question survey about me. 25 multiple choice, 5 written. Two had to be managers. This had to be completed within 24hours, participants had to complete within 72hrs. \r\nInterviewed via Microsoft Teams on the phone the day after initial call. Two people interviewed me at the same time. Their camera was set up facing a wall, not them so I was unable to see who I was communicating with.   Interview was scheduled for 30 minutes however lasted about 10-15. \r\nI was assured regardless if being offered the position or not, I would hear from them no later than the end of the following  week.  I never heard from them again.", "Interview Questions": "How do you get to know coworkers? \r\nWhat makes you the best candidate for this potion? "}, {"date": "7 Dec 2020", "title": "Registered Nurse Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth (Colorado Springs, CO) in Nov 2020", "Interview Descriptions": "The first one was okay, it was zoom and there were 3 people present- nurse manager, a day charge and night charge. They were seated at a table with masks on so it didn't feel as personal or comfortable as it wold in person or if I could see their faces. Under current COVID circumstances it was understandable. They were very nice and answered my questions easily. \r\n\r\nMy second interview was just with the manager over zoom but it was almost like 'facetime' with no mask and felt more personal. This interview felt more comfortable and the interaction was easy going. Very nice!", "Interview Questions": "Q: where do you see yourself in 2-5 years? \r\n\r\nQ: Why UC Health, why Colorado, and why this unit? \r\n\r\nQ: What is your secret talent/hobby? \r\n\r\nQ: What are your expectations of me if I were your manager? \r\n\r\nQ: What would you do if you saw a peer doing something wrong or unethical? \r\n\r\nQ: what would you say is your greatest achievemnet professionally? \r\n\r\nQ: Give an example of a difficult situation at work and how did you deal with it? "}], [{"date": "10 Jan 2021", "title": "New Nurse Graduate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth (Denver, CO) in Nov 2020", "Interview Descriptions": "I spoke with recruiter via email and phone to set up a Microsoft Teams virtual interview with the unit manager(s). The interview was relaxed and the managers explained the unit, my role, and then asked me questions. Then I was given the opportunity to ask questions.", "Interview Questions": "Why did you become a nurse?"}, {"date": "20 Nov 2020", "title": "Customer Service Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth (Denver, CO) in Oct 2020", "Interview Descriptions": "Two interviews one phone one video with Microsoft team app!!!!!!!! Still in process will have second interview soon. Nothing else to say yet have not  finish second interview just here to do research", "Interview Questions": "What do you see your self in 10 years"}, {"date": "30 Sept 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UCHealth", "Interview Descriptions": "The interview process was done over the phone via skype. I interviewed with the manager and the assistant manager. It was a formal process but comfortable experience. Although I didn't get to tour the unit when it came to the orientation they were very helpful with the details.", "Interview Questions": "Describe a time a didn't get along with someone. "}, {"date": "22 Sept 2020", "title": "Administrative Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UCHealth", "Interview Descriptions": "One phone interview and one Skype interview. Tell us about yourself and other behavioral questions. Each interview was about an hour long process. Make sure you know your information about the organization and what you want to learn. They want operational and analytical individuals on their team.", "Interview Questions": "Behavioral questions and one case study"}, {"date": "18 Sept 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at UCHealth", "Interview Descriptions": "They communicated well throughout the whole process and are very direct. It was difficult doing everything virtual but is understandable given the circumstances. It is very competitive so come prepared with your interview answers!", "Interview Questions": "Why this hospital? Why this unit? "}, {"date": "10 Sept 2020", "title": "Medical Laboratory Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth (Denver, CO) in Sept 2020", "Interview Descriptions": "It consisted of a panel of 3 interviewers. They were all very welcoming. The interview consisted of common questions. A couple dealing with how you deal with conflict, and how you receive/ give feedback.", "Interview Questions": "-An example of a conflict, and how you came to an agreement?\r\n- Name a time where you were given feedback. How do you react to feedback?"}, {"date": "20 Jan 2021", "title": "Manager Security Investigations Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth (Aurora, CO) in Sept 2020", "Interview Descriptions": "I was contacted about two months after I applied. The first interview was with the hiring manager (security director), second interview was a panel interview with the security team, the third interview was with random hospital directors within the UCHealth System, and the final interview was with the security director again. The entire process felt like they were making it up as they went, honestly. The security director was kept looking at his clock during my 4th interview and was very short. I found it quite rude. Not surprisingly, I didn't get the job and they wasted a lot of my time.", "Interview Questions": "What steps would you take if an employee was threatened and had a restraining order on someone?"}, {"date": "25 Sept 2020", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at UCHealth (Denver, CO) in Sept 2020", "Interview Descriptions": "Interview was good. Staff made me feel comfortable- I was initially nervous but they did a good job of not making it so intimidating.  Questions were general and nothing too crazy.", "Interview Questions": "General questions about myself and how I would act in certain situations"}, {"date": "10 Aug 2020", "title": "Fitness Center Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UCHealth", "Interview Descriptions": "Started by giving a tour of the facility. \n\nGroup interview, simple questions, some questions were situational, many questions were customer service based questions. Have examples ready and how you would have done better.", "Interview Questions": "Explain a time when you provided excellent customer service"}, {"date": "30 Mar 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UCHealth (Denver, CO) in Aug 2020", "Interview Descriptions": "You have a set video time of not of your choosing. You will interview with the manager and assistant manager as well as the educator and possibly charge nurses. It will last about 30 minutes.", "Interview Questions": "If you could choose a different career other than nursing what would it be."}], [{"date": "1 Jul 2020", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UCHealth (Denver, CO) in Jun 2020", "Interview Descriptions": "There were no in person interview due to COVID-19 so all interviews took place via Microsoft Teams.  I interviewed with 3 people from the hiring unit.  They were all really nice.", "Interview Questions": "If you didn't chose nursing, what career would you have?"}, {"date": "9 Jun 2020", "title": "Nurse Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UCHealth (Denver, CO) in Jun 2020", "Interview Descriptions": "Panel of people asked me questions about why I wanted to work for UCHealth, why they should hire me, what are my strengths and weaknesses, how do I handle stress/rude comments", "Interview Questions": "If you could do anything other than nursing what would you do and why?"}, {"date": "6 Apr 2020", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at UCHealth", "Interview Descriptions": "After applying online, I received an email to setup a phone interview with the manager of the unit.  The interview was very relaxed and consisted of typical questions that you would get with any other interview.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "17 Mar 2020", "title": "PCT/CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UCHealth", "Interview Descriptions": "I first spoke to someone briefly before scheduling the interview. The person spoke to made me feel excited to possibly work for the team. During the interview I felt welcomed and the flow was very easy going, but still professional.", "Interview Questions": "What was prior work experience I had?"}, {"date": "11 May 2021", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UCHealth (Colorado Springs, CO) in Jan 2020", "Interview Descriptions": "Panel Interview. Customer service oriented and patient centered. Around 30 minutes in the interview. Be there ON time, or you will miss the opportunity. Good luck and please dress appropriately. Regular questions - nothing out of the norm. Regular questions - nothing out of the norm. You will be working with patients, so must be empathetic.", "Interview Questions": "Regular questions - nothing out of the norm."}, {"date": "20 Dec 2019", "title": "New Grad Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UCHealth", "Interview Descriptions": "Applied online, they have you submit references for a reference survey, schedule phone interview, phone interview with the units that are interested and it is conference style interview over the phone", "Interview Questions": "describing different times and experiences, strengths weaknesses etc."}, {"date": "17 Jan 2020", "title": "Registered Nurse for the Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at UCHealth in Dec 2019", "Interview Descriptions": "Over all this was a great interview. The hiring managers and nurses were extremely kind and I could tell that they loved their jobs. There was a panel of multiple nurses asking me questions. They all were enthusiastic and answered all my questions about the nurse residency program very well.", "Interview Questions": "If you could choose a career other than nursing, what would you choose?"}, {"date": "3 Dec 2019", "title": "ICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UCHealth in Dec 2019", "Interview Descriptions": "Because I live out of state they did my interview over the phone. Asked me to describe nursing experience,  describe myself.  Asked about conflict with someone at work, doctor, coworker, manager,  etc and how I handled it. Asked about a time I had to handle difficult patient or family member.  Asked how I advocated for my patient. Asked what type of patient I prefer not to take care of, or what makes them hard. My goals in next 3 years. What type of management team do I need to flourish.", "Interview Questions": "Describe a time I had conflict with someone at work. What was situation? With whom? Why? And how was it handled?"}, {"date": "14 Sept 2019", "title": "LCSW Medical Social Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at UCHealth (Aurora, CO) in Aug 2019", "Interview Descriptions": "Waited about 3 weeks after application before getting a call. waited another 2 weeks for an interview. was told a decision would be made by a certain date. did not hear back one way or the other. noted they were still interviewing, so I assumed that I am no longer in the running. would have been nice to at least get notification since I took time to attend interview, etc.", "Interview Questions": "describe certain scenarios, nothing too unusual"}, {"date": "25 Jul 2019", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at UCHealth", "Interview Descriptions": "Had a phone interview and then was called for a interview with two managers. Talked about all the options and benefits, PRN and FT positions.  Filled app online and got an email within a day, call a day later and was asked to fill out my references after my interview", "Interview Questions": "How did you handle a difficult situation or patient?"}], [{"date": "2 Jul 2019", "title": "Chaplain Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UCHealth", "Interview Descriptions": "I met with the Director of Spiritual Care Services, another educator, and a staff chaplain, who interviewed me for about a half hour.  The interview atmosphere was relaxed and felt informal. It was clear that they were looking for someone who can articulate their experience in a natural, integrated way, while being themselves.", "Interview Questions": "How has my ministry in a congregational setting shaped me for chaplaincy?"}, {"date": "13 Mar 2021", "title": "Senior Professional Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UCHealth (Aurora, CO) in Jul 2019", "Interview Descriptions": "Met with the principal investigator and also had mini interviews with the main members of the lab to assure we would all get along. Also had a tour of the lab area.", "Interview Questions": "What are your future plans?"}, {"date": "19 Jul 2019", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UCHealth (Aurora, CO) in Jun 2019", "Interview Descriptions": "From the second I walked into the hospital, everyone was so kind and helpful. While waiting in the lobby for my interview to begin with a few other waiting candidates, the hiring recruiters there made us feel very comfortable and kept us updated about when we would be going back. I went back for my interview pretty quickly (I interviewed with oncology/BMT and pulmonary), but there were other units who were running a bit late on their interviews. When I went back for my interview, the interviewing team was so welcoming and kind, too. There was another interview going on in the same room, which threw me off a bit at first, but after getting into the groove of things, I didn't even notice it. The most stressful part of everything was interviewing with five people sitting across from me and five pairs of ears and eyes focusing on me. No matter how nice they were, it's still a bit stressful to have that many people judging you and your abilities. I would advise practicing answering questions with several people with you to better prepare for this, as I only practiced with one person.  The whole interview process took about an hour, and I was offered a position by e-mail less than a week later.", "Interview Questions": "What do you know about UChealth and the unit you're applying for?"}, {"date": "13 Jun 2019", "title": "RN New Grad Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UCHealth", "Interview Descriptions": "Easy going, behavioral based questions. Asked to bring in the seven page application from applying but wasn't asked for. Panel type interviews from nurse manager(s) and/or charge nurse from unit", "Interview Questions": "What was an instance in the clinical setting where a patient was upset with you and how did you handle it?"}, {"date": "25 Apr 2019", "title": "Behavioral Health Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UCHealth (Denver, CO) in Apr 2019", "Interview Descriptions": "The actual interview was fine. The people I interviewed with were friendly and asked typical behavioral interview questions. \r\nI was given an offer for an entry level position, but because I had no prior experience (for an ENTRY LEVEL position) they decided to change the job title, drop the pay, and gave me TWO HOURS to make a decision. I have never heard of something like this. When I asked what the difference was between the new job title, the lady did not even know and I had to call someone else, who also did not fully know. It seemed like this new job title was the same as the one I interviewed for, but it was just a lower pay and worse hours. There was no clear outline of what exactly this job title was, and I was given two hours to accept or decline.  I just cannot believe how un-professional this was.", "Interview Questions": "How do you define boundaries?"}, {"date": "30 Mar 2019", "title": "Respiratory Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UCHealth (Loveland, CO) in Mar 2019", "Interview Descriptions": "I was called a few days after submitting online. My first interview took place in front of a panel of five supervisors and managers. After the initial interview, I waited a week and was called back for a second. The next day I was informed of the results over the phone.", "Interview Questions": "Is your Advanced Practitioner title something Banner Health just made up?"}, {"date": "2 Mar 2019", "title": "Billing Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth", "Interview Descriptions": "The process was several interviews. It was a good oppertunity to meet the team and get a feel for the overall culture. I was asked to return for an interview for a more advanced position. I feel it was a good experience overall.", "Interview Questions": "Do you work better by yourself or in a team?"}, {"date": "6 Feb 2019", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth (Aurora, CO)", "Interview Descriptions": "Typical generic questions, took weeks to get a call back, somewhat slow process depending on your start date. My start date was about a month out so they moved slow at times but I received my offer letter the day after my interview", "Interview Questions": "Tell me about a time you had a conflict with a co worker and how did you deal with it? "}, {"date": "12 Jan 2019", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth", "Interview Descriptions": "Interviewed from multiple floors, all very nice. Managers and assistant managers at the interview, total of about 8-10 people if I remember correctly. Questions very basic, strengths and weaknesses, etc. Would recommend applying for a job and accepting if given the opportunity.", "Interview Questions": "Tell us about a time you dealt with a conflict, and how did you handle that?"}, {"date": "26 Nov 2018", "title": "Medical Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UCHealth in Oct 2018", "Interview Descriptions": "I applied in September and didn't hear back until October from the direct manager to set up a phone interview. The phone interview was fairly simple asking a little bit about your background and what you knew. I was able to get an in-person interview with the manager and two other lead techs. They started out with a quick tour around their lab which I noticed lots of techs pretty much standing around and talking to each other. It seemed like a very busy and crowded environment. For the interview, they each had questions already printed out on a form. I was to answer 20 questions along with extra technical questions. They did not acknowledge nor give feedback when I responded to their questions and you could feel that if you did not answer the technical questions right, you were pretty much out of consideration. One of the techs interviewing, pretty much expected me to get everything right when in reality no one's a walking encyclopedia. Once the interview was over, they said they would let me know if you are considered for a second interview. The next day I received a request for 5 references on Skill Survey where the references are sent an email to complete a 20 plus survey based on you.  I completed them all and had followed up with them. No answer and no rejection email. As a business, at least let the candidate know they are not considered. Even a generic email will do considering going through all the work especially with the references.", "Interview Questions": "What does Integrity mean to you?"}], [{"date": "2 Oct 2018", "title": "Paramedic Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth", "Interview Descriptions": "Typical how would you handle questions’ sat in front on 4 people and they each asked questions. All personality base questions. Very short too. It took all day though due to the physical ability test and the interview as well. Physical ability is extremely easy for the average person", "Interview Questions": "A difficult situation and how did you deal with it"}, {"date": "25 Oct 2018", "title": "Intake and Access Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UCHealth in Oct 2018", "Interview Descriptions": "Met with 2 people, mostly asked basic interview questions and some personal/ conversational question. I had 2 interviews before I was offered this position. The second interview was with the lead doctor and his clinical staff and was more discussing the duties of the role in depth.", "Interview Questions": "Why are you leaving your current job?"}, {"date": "20 Sept 2018", "title": "Travel RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UCHealth", "Interview Descriptions": "Spoke with Manager via phone and she was very pleasant, explained the role, expectations, and different units I would work in as float pool RN. Only asked a few nursing questions.", "Interview Questions": "What information do you like to pass on in shift report "}, {"date": "25 Sept 2018", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCHealth (Colorado Springs, CO) in Sept 2018", "Interview Descriptions": "Applied on line, then was asked to come in for an interview. After scheduling that, they sent me an e-mail asking for 5 references, 2 of which had to be supervisors. Further, those references had to use an online service individually to answer a 20+ question survey in order to be my reference. Whatever happened to a phone call? I did not feel comfortable asking my references to complete that, and so withdrew my application.", "Interview Questions": "When setting up the in-person interview over the phone they asked basic questions like when I want to work, why I want to work there, that sort of thing. "}, {"date": "16 Oct 2018", "title": "Development Engineer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UCHealth in Aug 2018", "Interview Descriptions": "Applied online, quick phone call, then they brought me in. I live an hour and a half away, so they put me in a hotel for the night - which I still didn't get reimbursed for. Oh, and I just never heard back. They said they'll follow up in a few days, then ghosted me. \r\n\r\nVery unprofessional.", "Interview Questions": "Name your experience with SDLC "}, {"date": "12 Jun 2018", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UCHealth (Aurora, CO)", "Interview Descriptions": "1.  30 Minute telephone phone screen with hiring manager.\r\n2.  One-hour group panel interview with team of six.  I had to present a 10 minute powerpoint  presentation of a project I worked on.  I spent many hours preparing.\r\n3.  One-hour interview with the hiring manager and had to present the same 10 minute powerpoint presentation. \r\nI was asked to have 5 previous supervisors and peers submit long detailed references with twenty questions rating my performances on a scale of 1-7 (I had to submit their information and have them complete the questions within a 48 hour window).\r\n\r\nI never received a response either way.\r\nAll that work, wasting my time and the time of my valuable references.   As a professional, the reference step is the most upsetting.  How many times is it acceptable to ask people to fill out long reference questionnaires immediately?  I just wasted one of those favors for nothing.\r\n\r\nThis experience was unprofessional and very disrespectful.", "Interview Questions": "Tell me about a time when you had a conflict and how did you handle it?"}, {"date": "6 Apr 2018", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at UCHealth", "Interview Descriptions": "Three different meetings, one with director, then met entire team and allowed them to ask questions of me in a conference room, then met with CMO. I was made an offer and countered, which counter offer was accepted", "Interview Questions": "What is your take on Education for team members"}, {"date": "3 Sept 2019", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at UCHealth (Aurora, CO) in Mar 2018", "Interview Descriptions": "Submitted my resume with an employee referral. Seems like the only way to get into UCH is to know someone on the inside. Came in for an interview two days later, met with the RN Floor Manager, interviewed, and was told I'd hear something in two days since she had three other people to interview. Got a call not even 20 minutes after I left for a job offer.", "Interview Questions": "Tell me about yourself. "}, {"date": "29 Mar 2018", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth (Denver, CO) in Feb 2018", "Interview Descriptions": "Phone interview with the usual questions regarding customer service, face to face interview asking for examples of experience dealing with patients.\r\nQuite laid lack, only one person interview.\r\nInvited for a 'working interview' a week later. Basically sat next to staff and watched them work.\r\nWas slightly disappointed that the interviewer said they would contact... Waited 3 weeks and got a generic email saying someone else was hired. But this seems to be the standard for most companies nowadays.", "Interview Questions": "Generic 'give examples of' questions"}, {"date": "24 Jan 2018", "title": "HR Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCHealth (Denver, CO)", "Interview Descriptions": "Very formal. A board room full of people each with prescripted questions. Not conversational. But mostly standard questions (challenges, weaknesses, strenghens, etc.) Super nice folks just following a system I believe", "Interview Questions": "How do you handle conflict?"}], [{"date": "27 Apr 2018", "title": "ACP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth (Aurora, CO) in Jan 2018", "Interview Descriptions": "Sent an applications and was contacted by Paul Lavine, a recruiter, to schedule an interview. About 15 minutes,  in front of 3 nurse managers from two different units that I applied for. They had a paper of questions front and back and would write down my answers.", "Interview Questions": "Give an example of when you went above and beyond for a patient?"}, {"date": "11 Dec 2017", "title": "Advanced Care Partner Program Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at UCHealth (Aurora, CO)", "Interview Descriptions": "Pannel interview with several departments who were interested in your application. It was a full day of applicants scheduled at different times, so the waiting area was a bit tense. The whole application and interview process was facilitated by a very nice guy (Paul L.), who help ease the nerves. Before the interview day Paul had sent out a document that had listed on it the date and time of everyones interview, along with the departments who will be present at your interview.", "Interview Questions": "Q: \"In a clinical setting, you have two call lights going off, the 1600 vital signs are due to be done, one pt needs a blood glucose level check, and a code alarm is going off. Which to you attend to first? Which would you check second?"}, {"date": "16 Dec 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UCHealth in Nov 2017", "Interview Descriptions": "Applied online, was contacted a week or two later by a charge nurse to set up an interview. My interview took place with two charge nurses and the nurse manager. They were all very welcoming and friendly and gave me a tour of the unit afterwards.", "Interview Questions": "Strengths/weaknesses\nBehavioral and situation based questions. The whole interview took 15-20 minutes with pretty typical interview questions"}, {"date": "24 Oct 2017", "title": "Project Manager, Supply Chain Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UCHealth (Aurora, CO)", "Interview Descriptions": "Acronym rich interview.  For an external candidate, the questions are seemingly riddled with unknown internal standards and guidelines. This can be problematic considering organizations use \"key terms\" or descriptions of \"providers\" differently. There can be a missed opportunity due to communication or lack thereof.", "Interview Questions": "The interviewer gives you a spreadsheet with a likely scenario. \r\nYou have 10 minutes to decide which vendor to choose for an onboarding clinic process for blood serum services. "}, {"date": "11 Sept 2017", "title": "New Grad Nurse Residency Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at UCHealth (Colorado Springs, CO) in Sept 2017", "Interview Descriptions": "The nurse recruiter first introduced herself, and explained what was going to happen for the day. First went into a room with 3 nurse educators who asked me to tell them a little bit about myself and then they explained what the program was like and gave me a chance to ask questions. There was then a 10 minute interview in a separate room with 8 people, different nurses representing each floor/unit available for offers. I then went into a 30 minute interview with the Cardiac floor separately with 4 people. Overall, a really great process and won't be notified about offers for another 2 weeks. I liked that they were very clear about the entire process, and gave me a time frame on when to hear back from people.", "Interview Questions": "Tell me what you do to intentionally connect with your patients."}, {"date": "13 Sept 2017", "title": "New Grad RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth (Aurora, CO) in Sept 2017", "Interview Descriptions": "The interview process was organized and efficient. The recruiter getted myself and others who had scheduled interviews and they also had the option to schedule a hospital tour. I sat before a panel of 3 nurse leaders from the specified unit that I was interviewing with and they were all super friendly and welcoming.", "Interview Questions": "How would you describe patient experience?"}, {"date": "8 Nov 2017", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UCHealth (Aurora, CO) in Aug 2017", "Interview Descriptions": "The interview process involved a phone screen and an on site interview.  The interview was initially scheduled for July but in the leading days up to the interview they cut all communication and would not respond to a simple email or voicemail.  Two weeks after the initial interview date, they reached out and asked to reschedule the interview for early August.  After being interviewed on site they again went completely dark on me and neglected, or refused, to return any emails or phone calls regarding my status as an applicant.   Of all the organizations I interviewed with, the UCH Strategy and Planning department was the least professional in their handling of the hiring process.", "Interview Questions": "What was the most challenging experience you have faced in your time at college or at work?"}, {"date": "29 Jun 2017", "title": "New Grad Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UCHealth (Fort Collins, CO) in Jun 2017", "Interview Descriptions": "A group of four nurses performed the interview. They asked the standard set of questions and some other harder questions. What was the most difficult was they gave me what was basically four small case studies and asked what I would do in each situation. I get that this is a new grad position, but it seemed a little excessive.\r\nToward the end, I got to ask questions and they seemed to brush them off and kind of beat around the bush as far as their answers. Additionally, I was not offered a tour of the unit, which I have been offered in every other interview I have had at hospitals. I was honestly relieved when I did not get offered the job. Dodged a bullet.", "Interview Questions": "Who is your \"nurse\" role model?"}, {"date": "14 Mar 2020", "title": "Environmental Services Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UCHealth (Loveland, CO) in Jun 2017", "Interview Descriptions": "A lot of the interview was based on what was on my resume. I was a graduated high school student, so I did not contain much work experience. However, it was very straight forward.", "Interview Questions": "Why Environmental Services?"}, {"date": "31 Jul 2017", "title": "Nurse Residency Program Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth (Aurora, CO) in Jun 2017", "Interview Descriptions": "I applied online and received an email on when my interview was scheduled. There was no choice on when your interview was. The interview was behavior based questions with a panel of nurse leaders from the units interested in hiring you.", "Interview Questions": "How would you describe \"patient experience\"?"}], [{"date": "9 Jun 2017", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UCHealth in May 2017", "Interview Descriptions": "It was a short interview, fairly typical but important questions. I interviewed with the manager of the department and the educator; they were informative and friendly. UCHealth does require 5 references after the interview, so be prepared for that.", "Interview Questions": "What do you think your job description as a CNA is? What kind of things would you report to the nurse? "}, {"date": "8 Jun 2017", "title": "RN Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UCHealth (Denver, CO) in May 2017", "Interview Descriptions": "Interviewed with the manager and she was extremely friendly and professional. Made a very inviting atmosphere. When HR called to offer the position the pay was dramatically lower than working as a nurse on the floor and I sadly had to decline the position due to financial reasons. It seems like a lovely place to work.", "Interview Questions": "Why are you leaving your current job?"}, {"date": "11 Aug 2017", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth (Aurora, CO) in Apr 2017", "Interview Descriptions": "Interviewing process was fine.  Onboarding process was a mess.  Horrible confusion - emails from my recruiter but he didn't know why I was being deferred.  I had quit my job, got deferred and then went 2 weeks without income.  Was hard as I'm a single mom.", "Interview Questions": "How do you handle an irate patient"}, {"date": "28 Aug 2017", "title": "ACP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth (Denver, CO) in Apr 2017", "Interview Descriptions": "I sat down with the leaders from every department and they asked me a bunch of questions. The first one and I could tell this was a huge test question was what do you know about UCHealth, so do your research.", "Interview Questions": "What do you know about UCHealth"}, {"date": "27 Jul 2017", "title": "Applications Developer Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UCHealth (Aurora, CO) in Mar 2017", "Interview Descriptions": "Worked through a couple of programming problems on a white board. Diagrammed some work I had done on database design at my previous position. The entire department came in at the end to ask me questions.", "Interview Questions": "Write a function to tell if a string is a palindrome."}, {"date": "28 Apr 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at UCHealth in Feb 2017", "Interview Descriptions": "Everyone at UCH was really passionate about healthcare and excited to interview the potential interns. I had a very positive experience. They asked fairly difficult behavioral questions and situational questions about healthcare. There was a phone interview and skype interview.", "Interview Questions": "Choose one word you would like a peer to use to describe you and why. "}, {"date": "5 Feb 2017", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UCHealth (Aurora, CO) in Jan 2017", "Interview Descriptions": "One of the hiring managers called me over the phone and we talked for 10 minutes and she decided to bring me in for a more formal interview. \r\nThe interview was a bit off and right off the bat, you could feel the tension in the room. The hiring manager and another manager were in the interview together. They asked the usual behavioral questions. \r\nWhen I asked them a question they didn't answer the same way I did. I asked \"what's the culture like ?\" Their response \"it's great!\" That's it.", "Interview Questions": "Tell us about a time when you had to deal with an upset patient and what was the outcome?"}, {"date": "23 Sept 2021", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at UCHealth (Colorado Springs, CO) in Jan 2017", "Interview Descriptions": "It was a panel review with about 5-6 people and everyone asked questions.  It was comprised of fellow assistants, doctors and directors.  After passing the panel review, there was individual reviews with each person I was working for and the directly in charge of the my position. They were all very responsive during the interview and contacted me in a timely fashion between interviews to let me know how I did and what would happen next.", "Interview Questions": "Why do you think you are a good fit for this position?"}, {"date": "10 Dec 2017", "title": "Business Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UCHealth (Colorado Springs, CO) in Jan 2017", "Interview Descriptions": "My Supervisor requested that I apply for the position. It did take several months after I interviewed to find that I had the job.  I was interviewed by a board of 6 people.", "Interview Questions": "What is your biggest strength and your greatest weakness"}, {"date": "31 May 2017", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UCHealth (Aurora, CO) in Dec 2016", "Interview Descriptions": "Started with an initial phone call, which ultimately led to an in person interview a few days later. Was taken back to meet with the clinic manager as well as another manager, asked brief but defining questions. The interview in its entirety lasted about 15 minutes, and I was able to ask questions at the end.", "Interview Questions": "What makes you want to work for UCHealth?"}], [{"date": "27 Oct 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UCHealth in Aug 2016", "Interview Descriptions": "normal process, meaning: call from human resources, email from recruiter with interview date. interview with unit director and manager. offer submitted within one week, and accepted. great unit atmosphere, competent staff, competitive pay", "Interview Questions": "why am I a nurse"}, {"date": "8 Jun 2016", "title": "Billing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at UCHealth (Houston, TX)", "Interview Descriptions": "I walk in one day and ask if they were hiring they said yes I left my resume with front office receptionist. Three days Iater i had a interview. One of the doctors called me and the other interviewed me. It was a short and easy process it was comfortable but to straight and direct.", "Interview Questions": "Do you know medical terminology and how to spell?"}, {"date": "27 Feb 2019", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UCHealth (Fort Collins, CO) in May 2016", "Interview Descriptions": "They called me  about a week after I applied online. I came in for an in person interview. They asked typical questions. They called a week or 2 later with a job offer.", "Interview Questions": "How do you exemplify the companies values?"}, {"date": "15 Sept 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UCHealth (Aurora, CO) in May 2016", "Interview Descriptions": "Came to unit I was interviewing on and I was greeted by Unit Secretary. I waited for the manager in the waiting area. When I met the manager I was ushered into a room with 4 other managers and the interview began. Several other managers came in and out during my interview. After the interview, I was given a tour of the unit (upon my request) and then I was show to the elevators. I received an offer from HR the next day.", "Interview Questions": "What's a mistake you have made in your nursing practice?"}, {"date": "24 Apr 2016", "title": "Referral Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCHealth", "Interview Descriptions": "I applied online and received an email from a manager to set up a time for an interview. Showed up early for the interview and met with an awkward hiring manager , who talked through his teeth the whole time. The whole short 15 minute interview was hostile and unexpected. It was apparently just a screening where the hiring manager grilled me about my BA in Public health and why I didn't choose to go on a more clinical path. I found the whole interview to be weird especially since the position  didn't require a BA degree.  After 15 minutes of awful small talk he informed me that this was just the beginning of the process and I would hear back via email. Three weeks later I received a generic rejection email. I don't think I will be applying  for any other positions. After speaking with others it seems they have a hostile interview style that doesn't mesh well with my personality. Also ,on a side note , the manger went on and on about a family atmosphere, but I got the feeling that if you were different or didn't fit into the current environment , they wouldn't be hiring you. I am personally not a fan of mixing my personal life with my work life.", "Interview Questions": "Tell me about yourself? How would your classmates describe you? How big are your classes? \r\n\r\nAKA nothing about the job itself "}, {"date": "29 Sept 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at UCHealth (Aurora, CO) in Apr 2016", "Interview Descriptions": "I interviewed with the Assistant Manager and the Clinical Educator for the unit. I traveled from out of town and they were very accommodating with my schedule and allowing me to pick a specific interview date and time. They were very welcoming and friendly and asked a lot of good questions on the interview. I was also given a tour of the unit and met some of the nurses on the floor as well.", "Interview Questions": "What are some things that you struggle with as a nurse?"}, {"date": "29 Mar 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UCHealth (Colorado Springs, CO) in Mar 2016", "Interview Descriptions": "I applied online.  Then, I was contacted by a recruiter who arranged an interview with the hiring manager.  I was out of state, so I had a phone interview with the hiring manager.  The next day, I was contacted by the recruiter with a job offer.", "Interview Questions": "What is my greatest strength?"}, {"date": "7 Apr 2018", "title": "HIPAA Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UCHealth (Loveland, CO) in Mar 2016", "Interview Descriptions": "Panel interview consisting of the Hiring Manager, Team Lead, and a HIPAA specialist.  Each asked a series of fairly basic interview questions as well as some questions specific to the position.", "Interview Questions": "How much experience do you have with release of information?"}, {"date": "28 Feb 2016", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UCHealth in Feb 2016", "Interview Descriptions": "Received a call to do an over the phone interview, which led to an in-person panel interview with 3 different departments. First, went over my resume and then continued on with all the basic interview questions. Make sure you bring plenty of copies of your resume to pass around.", "Interview Questions": "How do you handle a difficult customer\r\nWhy do you want to work here?\r\nHave you ever dealt with a difficult co-worker?"}, {"date": "13 Jan 2016", "title": "Patient Access Registrar Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UCHealth (Colorado Springs, CO) in Jan 2016", "Interview Descriptions": "The interview process was pretty easy. I interviewed with 3 members of the team: manager of Patient Registration and two team leads of the the teams the manager overseas. The manager began with an overview of the position, added new information that was not included in the job announcement, went over the duty hours, the location, and work setting. The questions were pretty common: How do you handle conflict? What is the most stressful situation you had to deal with at work and how did you handle it?, etc.  They were very upfront with the number of candidates they were interviewing for the position and let me know they would contact me via e-mail with job offer or rejection within the next couple of days. I received a \"sorry we went with another candidate\" e-mail a week and 1 day after the interview.", "Interview Questions": "What does patient experience mean to you?"}], [{"date": "14 Dec 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at UCHealth (Colorado Springs, CO)", "Interview Descriptions": "Very friendly welcoming interview.  Hire based on whether you are a good fit for the position as opposed to years of experience.  \r\nA charge nurse and the floor manager interviewed together.  Then manager showed you the floor.  \r\nGot the job within 48hrs.", "Interview Questions": "What was a difficult situation that you encountered and how did you handle it."}, {"date": "30 Sept 2015", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCHealth", "Interview Descriptions": "2 interviews. One with the hiring mgr and a second with a team of managers from the dept. one one one interview was about 40 minutes but the panel interview took about 2 hours. People would call in and ask their questions then drop off.", "Interview Questions": "What is a primary key?"}, {"date": "19 Sept 2015", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCHealth (Denver, CO)", "Interview Descriptions": "Phone followed by In person meeting followed by team meeting.  Then waited for hr to call with an offer.  All contingent on background and drug testing.  There was a test on personality and skills", "Interview Questions": "What was your most fun project to work on"}, {"date": "18 Jul 2015", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at UCHealth (Colorado Springs, CO) in Jul 2015", "Interview Descriptions": "Interviewed by one the supervisors, was given a tour of the department, sat in a conference room and was asked several behavioral questions, was given the opportunity to ask questions.", "Interview Questions": "On your last review, what was one of the items you were going to work on for the upcoming year?"}, {"date": "17 Apr 2015", "title": "Staff RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UCHealth (Denver, CO)", "Interview Descriptions": "I applied for the job. A few weeks later I was called by a recruiter asking for days and times I was available for an interview with her.  She never called me on those dates and times and withdrew me from consideration for the jobs.", "Interview Questions": "N/A"}, {"date": "7 May 2015", "title": "CRA Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCHealth in Apr 2015", "Interview Descriptions": "Department manager called. 45 minute telephone interview. Led to over two hours face-to-face. An hoir with the msnager and another hour with the team. Serious consideration about an offer being given was made evident by the hiring manager and that HR would get back to me in 2 business days max to extend the decision. This never occurred. 4 out of 5 required references were given prior to interview and 5th reference gave her reference 5 business days after the interview. A total of 6 references given and the waiting game continued. By day 17, no email and no call. A quick check on the HR system, no job offer. A HUGE waste of time which is unfortunate because the team was nice. 5 references is overkill but whatever. I gave them 6.", "Interview Questions": "Are you looking to do your own research?"}, {"date": "30 Sept 2016", "title": "ACP Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at UCHealth (Aurora, CO) in Apr 2015", "Interview Descriptions": "It was an email correspondence, then interview with HR, then interview with 3-7 members of the unit you're applying for.  I ended up on the neuro floor when I wanted ICU, they hand you off to other floors if they like you enough but not enough to keep themselves. I was disappointed, the interview went really well and I got a totally different floor. The whole diversity bit they love, but they don't employ diverse people, or people with opinions. They just want mindless workers that will be willing to stick it out for the long haul. Make sure you say you are dedicated and hardworking, and have stories for each positive and negative quality (if it's negative, make sure you then say how you overcame it and how you're working on being a better person).", "Interview Questions": "How did you overcome a stressful time?"}, {"date": "13 Nov 2015", "title": "Clinical Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCHealth (Denver, CO) in Feb 2015", "Interview Descriptions": "Online application. Brief phone screen via recruiters. Phone call for invitation. 1 hour interview consisting of program director, Clinical Specialists and Clinical Pharmacists. Call back within 20 days.\r\nThe environment was very friendly with the Director meeting me in the lobby and walking me out, taking this time to ask some non-formal, but important questions. \r\nOverall it was a very smooth process.", "Interview Questions": "Basic interview questions to assess your 'fit' for the department. The interview panel did a great job reviewing my CV and asking questions pertaining to my experience and how I could benefit the department and how the department could benefit me. "}, {"date": "24 Aug 2015", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at UCHealth (Littleton, CO) in Feb 2015", "Interview Descriptions": "Jackie was through no nonsense type women she had called the school and I was highly recommended so it was like I had job already when I arrived she was telling me about position benifits etc rather then asking questions", "Interview Questions": "Does this sound like a good fit for you?"}, {"date": "5 Dec 2018", "title": "RDCS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at UCHealth in Feb 2015", "Interview Descriptions": "meet and greet, questions, role play, job responsibilities, on call, shift work, tour of facility, explanation of benefits,  show locker room, review application, meet charge personnel, answer basic  and standard interview questions.", "Interview Questions": "What would you do in this situation?"}], [{"date": "30 Dec 2014", "title": "Occupational Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UCHealth", "Interview Descriptions": "When I applied, a recruiting person emailed me 2 weeks later asking me to complete a brief phone interview. When she called she asked questions like \"What made you choose this company? What do you look for in a job?\" I think it was really just to gauge the person's interest, then she said she would pass my resume along to the hiring manager and they would contact me at a later date for either another interview or if they were not pursuing me further.", "Interview Questions": "What do you typically look for in a job?"}, {"date": "3 Dec 2014", "title": "Program Support Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth (Aurora, CO) in Nov 2014", "Interview Descriptions": "I received a call from a recruiter maybe 2-3 weeks after applying on University of Colorado Health's job site. The recruiter asked me questions about my where I saw myself in the future maybe five years from then and my career aspirations. The recruiter then asked me to fill out a reference survey with five references. It took about three business days for them to email me asking me to call them to schedule an interview. The interview consisted of two employees and were all typical behavioral interview questions. The interview only lasted about half an hour.", "Interview Questions": "Name a skill you do better than others, one you are about average in and another you need to work on.\r\n\r\nHave you handled a difficult situation with a co-worker? How?"}, {"date": "27 May 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UCHealth in Nov 2014", "Interview Descriptions": "Quick, efficient.  Phone interview with admin. team, department vice chair and department chair and staff I'd be supporting.  On every level/ step of interview process, I was made to feel comfortable.  Some questions were typical.  I liked how they made me feel during the interview process.  It was like a conversation, get to know each other type of interview.", "Interview Questions": "Some questions were typical.  Skill set, why I wanted the job, describe certain situations and how I handled them."}, {"date": "17 Jul 2015", "title": "Patient Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth (Aurora, CO) in Nov 2014", "Interview Descriptions": "Group panel interview about 6 employees in department taking teens asking questions.  Most of the questions situational.  \"In the past how have you handled a difficult patient \"asked several questions then asked if I had questions.  Then I was called in to experience the job and basically be interviewed by a person with the same job in the department.  I was an internal applicant so i had additional steps to transfer and was forced to basically leave 2 months notice with my current department at the time.", "Interview Questions": "How would you handle down time?"}, {"date": "22 Apr 2014", "title": "RN Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at UCHealth", "Interview Descriptions": "Applied online in April.  HR called for first interview in June.  Second interview with clinical manager was set up for 2 weeks after.  Received call for third interview another 2 weeks after that.  Received job offer over the phone from HR and started in August.", "Interview Questions": "Situation questions: Please describe a time when you had to use team work. Please describe a time when you were unsure of what you were doing and what steps you took.  \r\nThey also had quite a few chain of command questions: Another nurse wants you to break protocol to administer some medications, what do you do?"}, {"date": "18 Mar 2014", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UCHealth (Fort Collins, CO) in Feb 2014", "Interview Descriptions": "Online application process, called for interview by manager, interviewed following week with panel of 6 current managers. Placed at head of the table, 20+ questions and scenarios for over an hour, challenging but not impossible if prepared. Temp of room 10-15 degrees warmer than needed, everyone had refreshments, none offered to me. Possibly to see if they could make the interviewee uncomfortable?", "Interview Questions": "All expected, no surprises...and all challenging when it's one after another. Grueling interview process, UN-neccessarily so."}, {"date": "30 Mar 2014", "title": "Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at UCHealth in Jan 2014", "Interview Descriptions": "People are treated like objects they can use and discharge", "Interview Questions": "Waste of time, they already knew who they were going to hire, they just use people for their benefit. "}, {"date": "24 Aug 2015", "title": "Nutrition Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at UCHealth (Aurora, CO) in Jan 2014", "Interview Descriptions": "They have you do a group interview and sell some products.  They are looking to see how you are as team player and social skills. If they like you they will have you interview with a supervisor.  It's pretty basic.", "Interview Questions": "How do you respond in a stressful situation."}, {"date": "26 Sept 2014", "title": "Care Team Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at UCHealth in Dec 2013", "Interview Descriptions": "I was hired by word of mouth. I e-mailed an application to the doctor I was friends with she gave it to my now boss and they called me a few days later for and interview.", "Interview Questions": "Why do you think you would be a good fit for this job?"}, {"date": "23 Feb 2016", "title": "CRC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UCHealth (Aurora, CO) in Aug 2013", "Interview Descriptions": "You go through two rounds. Its through a search committee, about 4-6 persons.  If you make it through the first round, they recommend you to the second. You stand a better chance if more than half of the committee like you and find you fit. Start days are usually the 1st or the 15th of the month. If you are used to biweekly pay, get ready to make some adjustments, as you will have to wait until end of the month to get paid. They definitely reach out to your references, if you list someone down, make sure they are legit and can truly give accurate information.", "Interview Questions": "Tell us about yourself, why are you interested in the job, strengths and weakness - very cooperate like."}], [{"date": "19 Jul 2013", "title": "Registrar Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UCHealth (Colorado Springs, CO) in Jul 2013", "Interview Descriptions": "I was interviewed by 3 women for a registrar postion. The interview questions were way over the top and I did not even understand half of them. I have 8 years of experience in the medical industry and it don't take much knowledge to be a registrar.", "Interview Questions": "What type of programs do you work on give an example from the beginning to end, it was something like that. The questions were technical and had nothing to do with registration. Another question was name a time when you had to help a coworker."}, {"date": "26 Jul 2017", "title": "RN, Bsn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth in Jun 2013", "Interview Descriptions": "I had a new grad interview several years ago. It was very professional.   There were 5 people that interviewed me in a round robin fasion.   They asked various questions ranging from experience to when I made a mistake in the past. I talked about my past expereince in ortho and my brothers accident.", "Interview Questions": "When was the time you made a mistake"}, {"date": "9 Aug 2017", "title": "Patient Account Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth (Fort Collins, CO) in Apr 2013", "Interview Descriptions": "Pretty normal laid back interview. Wasn't difficult or overly stressful. They kept in contact throughout the process and I always knew what was expected. I felt at ease with the people who interviewed me and they did a great job answering my questions.", "Interview Questions": "If I was bilingual and how I'd handle very difficult people."}, {"date": "8 Dec 2013", "title": "Trainer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UCHealth in Jan 2013", "Interview Descriptions": "After initial telephone screening, had an \"audition\" with two other candidates in the room. Was asked to present a brief lecture on a technical topic. Took several weeks between interview and job offer, with little communication in spite of efforts to follow up.", "Interview Questions": "What adjective has someone used to describe you that came as a surprise?"}, {"date": "27 Jul 2015", "title": "Flex B Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UCHealth in Oct 2012", "Interview Descriptions": "The interview was a one-on-one phone interview with a unit manager. I had applied a month or two before getting the call. The interview was straight forward. A few personality questions, asking how I deal with conflict, how I manage difficult situations, clinical experience, and a few clinical questions.", "Interview Questions": "How do you handle conflict? What type of patients do you have experience with?"}, {"date": "10 Jul 2014", "title": "Account Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UCHealth (Denver, CO) in May 2012", "Interview Descriptions": "I interviewed, and then participated in interviews for other team members in the following few years.  You need to have a good clinical and IT background. You need to have experience working with providers and have good personal skills.  You need to be good at troubleshooting.  You need to be good at answering tough questions, both in the interview and on the job.", "Interview Questions": "What is more important: data integrity or customer service. "}, {"date": "20 May 2014", "title": "Environmental Services Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UCHealth (Loveland, CO) in Mar 2012", "Interview Descriptions": "None experienced applicants are hired before interdepartmental employees are given the job. Always have openings in this department since they lose employees every month due to transfers or quitting. Many new hires have no experience and that possibly is what management wants so you can be overworked beyond your job description and you wouldn't know any better.", "Interview Questions": "Why do you feel you are a great fit for this job?"}, {"date": "15 May 2014", "title": "Director of IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at UCHealth (Aurora, CO) in Sept 2011", "Interview Descriptions": "It started with one hour phone interview with the HR Director and then a video interview with the hiring manager. They had me fly over for a 2 days interview.", "Interview Questions": "How would you have business units to buy into your ideas?"}, {"date": "29 Jul 2015", "title": "Systems Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UCHealth (Fort Collins, CO) in Aug 2011", "Interview Descriptions": "Very well thought through interview where both parties asked many questions, technical and otherwise and both agreed that I would be well suited for the position.  Everyone was willing to explain the details of the job and available to answer in questions I may have had during and after the interview", "Interview Questions": "Tell me about Active Directory"}, {"date": "6 Apr 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 6 months. I interviewed at UCHealth (Aurora, CO) in Jan 2011", "Interview Descriptions": "Must have an excellent resume and it was a drawn out process. They have an interview board. This is many managers that interview throughout the year. Five will be asked to interview on a specific day. Eventhough it might not even be the manager for the position you are applying for.", "Interview Questions": "What can you offer to the facility."}]]