[[{"date": "5 Jul 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Lethbridge (Lethbridge, AB)", "Interview Descriptions": "star format answers and behaviour based and situation based took about a month from interview to offer. Review the companies mission statement and understand the roles and responsibilities and you should be fine", "Interview Questions": "A difficult situation you have been in"}, {"date": "27 Aug 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at University of Lethbridge", "Interview Descriptions": "This was a Summer Research Student Award. You need to submit your academic transcript, letter of intent, a reference letter, and a proposal letter. The interview will be in person or over the phone and you will be notified in a few weeks whether you got the job or not.", "Interview Questions": "What makes you a qualified candidate for this position?"}, {"date": "2 Jan 2021", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Lethbridge (Lethbridge, AB) in Jan 2020", "Interview Descriptions": "As a part-time employee, I just had a short interview with the supervisor and we just had a conversation about my experience. Actually, he just wanted to be sure that I am familiar with the type of research that we were supposed to do.", "Interview Questions": "I worked there as a part-time temporary employee and the supervisor asked me about my proficiency in scripting with python."}, {"date": "16 Feb 2017", "title": "Student Advisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Lethbridge", "Interview Descriptions": "Worst interview I have ever been a part of. The panel was disinterested and felt like they were unprepared and just going through the motion. Disrespectful and clearly have no problem showing it.", "Interview Questions": "What is Freedom of Information act?"}, {"date": "31 Aug 2016", "title": "IT Support Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Lethbridge (Calgary, AB) in Jul 2016", "Interview Descriptions": "The interview went quite fluidly, I felt very comfortable with the four-person panel. The first part of the interview focused a lot more on procedure and dealing with different situations with end-users. The second part was mainly for technical knowledge and how I would deal with and resolve different hypothetical technical issues. The rest was mainly getting to know my overall personal side.", "Interview Questions": "How would I prioritize my work for the day?"}, {"date": "21 Jun 2016", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Lethbridge (Lethbridge, AB) in May 2015", "Interview Descriptions": "Interviewed with three different people; one asked mainly personality, one behavioural & skills, the other simple describing the job expectations and team dynamic. Two of the people interviewed me individually in person while the third phoned me later on in the day (process ended up lasting about 6 hours if you include wait time).", "Interview Questions": "When I was expected to graduate university (applied as a student)"}, {"date": "7 May 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at University of Lethbridge (Lethbridge, AB) in Apr 2015", "Interview Descriptions": "Very casual and informal. I was a student who responded to an email sent through an email list to all students in my faculty. I sent an expression of interest, then received an invitation to an interview. My superior set up a meeting in their office, and we had a very casual and unstructured interview. The experience was comfortable and enjoyable. Even though I performed poorly during the interview, my superior was understanding, and gave me the position.", "Interview Questions": "Why do you want to work here?"}, {"date": "13 Feb 2017", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Lethbridge (Lethbridge, AB) in Sept 2014", "Interview Descriptions": "first you apply online then phone interview and last panel interview then background checks, you meet the human resource person to discuss your skills and then exams to test you IQ level of the subject area then you meet a panel to discuss your vision for the next 10 years and how successful you will be on the job.", "Interview Questions": "why lethbridge university?"}, {"date": "6 Aug 2014", "title": "Bookstore & Athletics Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Lethbridge", "Interview Descriptions": "Applied and heard back in about 1 week. Asked a lot of situational based questions like what would you do in a certain situation. Also wanted to see a piece of writing material.", "Interview Questions": "What ideas do you have to change student and staffs negative perspective of the Bookstore?"}, {"date": "22 Jul 2015", "title": "Advancement Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Lethbridge (Lethbridge, AB) in May 2014", "Interview Descriptions": "Rushed and no time for me to inquire about things.  They expected my current employer to give me a reference which presented a challenge.  It is not very tactful especially when the offer has not been made and I wasn't sure I wanted the position yet.", "Interview Questions": "Describe a challenging encounter with an external individual."}], [{"date": "26 Sept 2013", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at University of Lethbridge (Lethbridge, AB)", "Interview Descriptions": "There wasn't actually an interview process, just sort of fell into the position after graduation because of the relationships I had previously made with faculty and staff. The Hiring process was smooth, sort of a handover from the person previously employed in my role. More job direction came as I stepped up for more duties.", "Interview Questions": "N/A"}]]