[[{"date": "19 Jun 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "Interview process in my experience takes awhile. Human Resources is a bit disorganized , but every manager and staff member I spoke with was lovely. It depends on the department, but I had to do 2-3 interviews for each job I applied for following a phone screen", "Interview Questions": "How would you deal with a difficult patient"}, {"date": "26 May 2023", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL)", "Interview Descriptions": "The interview process was friendly and fairly simple. I interviewed with both the team and dept leaders so was able to get a questions answered as well as a feel for the culture of the group.", "Interview Questions": "Describe a problem you have run into in the past and how you resolved it."}, {"date": "18 May 2023", "title": "Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "Initial phone screen, small group phone call, large group Teams call, follow up email with offer. I did have to reach out to the manager after a month to see if they were still interested after they promised an answer in 2 weeks.", "Interview Questions": "How would you have changed this presentation now that you’ve had the chance to share it with us?"}, {"date": "13 Apr 2023", "title": "Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Mar 2023", "Interview Descriptions": "I went to the hospital and unit I was interviewing for, where I met with a nurse manager who asked me several questions. Following the formal interview, I was able to shadow a nurse. I then completed a clinical critical thinking questionnaire.", "Interview Questions": "What would be your course of action in a situation in which the patient or their family was unwilling or unmotivated to help with their out-of-hospital cares post discharge?"}, {"date": "19 Dec 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "Applied online and received an email a few weeks later to schedule a phone screening and interview. Was one of the first applicants as the position was posted within the hour when I applied on their website. I scheduled the soonest available time as soon as I received the email. The day came and no call. I emailed after double the scheduled time window passed. Later that day I received a reply to my email stating the manager already selected a finalist and no longer was taking interviews. They could have at least informed me or canceled the scheduled call, but instead had very poor communication and wasted my time. Very unprofessional throughout.", "Interview Questions": "Schedule a time you are available."}, {"date": "10 Nov 2022", "title": "Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "I interviewed for an Improvement consultant position. I was very unimpressed with the entire process which took around 3 months. For the final interview, they wanted me to interview with 15+ consultants, and also share a quality improvement presentation. I put a lot of time and effort into the interview process. However, it has been 2.5 months, and I have yet to hear back from the hiring manager. I tried reaching out to the hiring manager on 3 separate occasions to inquire about an update, but she failed to respond. It is perfectly fine if I was not selected, but it’s basic courtesy to send an email to inform me that I was not selected.", "Interview Questions": "Share a quality improvement project that you worked on?"}, {"date": "10 Nov 2022", "title": "Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "I interviewed for an Improvement consultant position. I was very unimpressed with the entire process which took around 3 months. For the final interview, they wanted me to interview with 15+ consultants, and also share a quality improvement presentation. I put a lot of time and effort into the interview process. However, it has been 2.5 months, and I have yet to hear back from the hiring manager. I tried reaching out to the hiring manager on 3 separate occasions to inquire about an update, but she failed to respond. It is perfectly fine if I was not selected, but it’s basic courtesy to send an email to inform me that I was not selected.", "Interview Questions": "Share a quality improvement project that you have worked on?"}, {"date": "26 Oct 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "The interview process was very comfortable and friendly. I was given the opportunity to shadow on the unit I would be working on, which made me feel they really valued my opinion and wanted to make sure it was a good fit for me as well.", "Interview Questions": "\"What are some of your strengths and weaknesses?\" \"Name a time you felt challenged by a patient and how you handled it?\""}, {"date": "21 Nov 2022", "title": "Student Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Sept 2022", "Interview Descriptions": "The interview process went well. I even toured the unit. I received an email stating I got the job position and I took my drug screen. I then tried to contact the hiring recruiter and left seven messages but I did not get a call back. I then reach out the the unit manger and she seem lost. Afterward I called the recruiter again and she answered to tell me there was something wrong with my reference, I asked her what did needed to provide, she could not give me details. She told me they basically took the job back from me and I was no longer considered. All my references are legal and I work with every single person and have a strong relationship with them and I always use the same individuals due to our relationships. I honestly don’t believe they gave me a bad review. I honestly don’t know what happened, but worst experience every, especially when I contacted the recruiter and left voicemails several times regarding a stating date and she never got back to me until I contact the unit manager, I felt some was not right.", "Interview Questions": "Are you currently enrolled in school and have completed fundamentals and one clinical rotation"}, {"date": "8 Oct 2022", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Aug 2022", "Interview Descriptions": "the interview process was smooth and effortless. the interviewer was very professional, and allowed for questions to be asked about the company, location, benefits, etc. overall it was a good experience, and i will definitely recommend others to interview them.", "Interview Questions": "1) What role do you see yourself in? 2) How does this role help you in fulfilling where you would like to be in the future?"}], [{"date": "17 Jun 2022", "title": "New Grad RN Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Jun 2022", "Interview Descriptions": "Shadowed on the unit for the first half, then interviewed along with other candidates and the managers. Very general questions, managers were super nice and easy going, but the group interview made it intimidating and a bit nerve-racking. Received a verbal offer within 2 weeks.", "Interview Questions": "1. Tell us about yourself.\n2. Why this unit? What makes you unique to this unit? \n."}, {"date": "25 May 2022", "title": "New Grad RN Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "Very easy-going individuals, felt in a comfortable environment to ask questions. I was shown around the unit, then had an interview with the manager, along with other nurses on the unit. The interview ended with a critical thinking assessment and any follow up questions.", "Interview Questions": "5-year goal, weaknesses, and strengths, tell me about yourself, the experience of an ethical dilemma, the experience of not seeing eye-eye with another coworker and manager. "}, {"date": "3 May 2022", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Apr 2022", "Interview Descriptions": "Contacted via email from the unit manager to set up interview. In person interview April 2022. I met with the manager for 30 minutes and then was able to shadow with a nurse for 20 minutes. \r\n\r\nFew behavioral questions, mostly discussed previous work experience and answered questions regarding the job.", "Interview Questions": "What three words would your former supervisor use to describe you?"}, {"date": "14 Feb 2022", "title": "Student Nurse Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "HR contacted and scheduled an in person interview. My interview was on the unit with two nurse managers. The interview was quick and they asked basic questions about resume and work history.", "Interview Questions": "Tell me a bit about yourself. "}, {"date": "2 Feb 2022", "title": "Nursing Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Jan 2022", "Interview Descriptions": "Very welcoming staff. Relaxed and comfortable interview. Took a couple weeks for them to reach out about setting up an interview. Haven't heard back yet, said I would receive a call no matter what decision they make.", "Interview Questions": "Can you tell me about yourself.\r\nWhat would you do if you had conflict with a coworker?"}, {"date": "7 Dec 2021", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago in Nov 2021", "Interview Descriptions": "Everything was seamless! The wonderful HR coordinator was amazing! She found  my résumé In a huge pile, connected me with an incredible person and leader ship, and they offered me the job within a couple of weeks. It is the smoothest interview process I have ever experienced.", "Interview Questions": "Why do you want to work at Lurie Children’s Hospital?"}, {"date": "23 Oct 2021", "title": "Psychiatric Social Work Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "First there was a preliminary interview with a Psych LCSW. If invited to second round of interviews, met with SWs from each Psych program separately and ranked selections for internship. Heard back within a week of second interviews.", "Interview Questions": "Asked about previous experience and schooling"}, {"date": "20 Jan 2022", "title": "Clinic Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Winfield, IL) in Oct 2021", "Interview Descriptions": "I applied via lurie children’s website. I attempted to set up an interview in august with HR and heard nothing back.. (thought they weren’t going to offer anything). 1 month later I got an email from a different HR person to schedule an in person interview. The in person interview was first with the Dr I was going to be working with in the clinic and the diabetic educator as well. The interview lasted about 45 minutes with them. It was not hard at all! It was more of a conversation about what they can offer and what I was looking for. Next, I met with the clinic staff manager which lasted about 15 minutes to discuss things like hours, pay etc.", "Interview Questions": "Why did you choose nursing?\r\n"}, {"date": "8 Sept 2021", "title": "APRN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "Went through the interview process quickly, talked with several people. Three rounds total, all video interviews due to covid. Easy process overall. Waiting to hear back still, wish me luck !!!", "Interview Questions": "Why are you interested in this position "}, {"date": "21 Jul 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "2 step \r\nScreening interview+second interview \r\nAsked about preferences \r\nExperience \r\nLeadership \r\nWhy you want to be a nurse \r\nHow you best deal with conflict and what you would do \r\nInterview lasted atleast half an hour", "Interview Questions": "Why do you want to be a nurse ? "}], [{"date": "19 Jul 2021", "title": "CVICU Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "In the interview I was asked situational questions, I filled out a critical thinking quiz, and was provided with a 2 hour shadow experience. The nurse who i shadowed actually recommended me to the managers as well.", "Interview Questions": "why pediatrics, workplace conflict, examples of kindness demonstrated during work"}, {"date": "25 Jun 2021", "title": "EVS Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "Easy going ola was a little hectic but overall great interview and company would highly recommend to anyone looking for work.  The questions did get difficult at times but I was given time to respond", "Interview Questions": "Please Tell us about yourself?"}, {"date": "16 Apr 2021", "title": "Student Nurse Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Apr 2021", "Interview Descriptions": "I applied online 1 month ago. HR get back to me two weeks before and scheduled an interview. Then, after the phone interview, I was offered a position the other day. The process was smooth and nice.", "Interview Questions": "Why are you interest in Lurie?\nTell me a time when you were working in a team, what was your role?\nWhy this unit?"}, {"date": "25 Mar 2021", "title": "Research Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "Typical hospital department interview, meet with team, md, nurses grill you for minimum of 30 mins, hr in general has no idea what teams are really looking for or need. Huge disconnect there. Very high demands from nurses with a pay range that doesnt match.", "Interview Questions": "Describe your past experience working with x population, describe how you handle difficult/stressed  parents, what are you known for within your current team?"}, {"date": "4 Mar 2021", "title": "New Grad RN Residency Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "After waiting over a month, I had an in person interview with 3 managers on the unit. It lasted about an hour. I felt good about the interview, but unfortunately Lurie never got back to me. I finally reached out about 2 weeks later  and learned I was not offered the job. I was shocked they did not have the decency to send a rejection letter. If you apply to this program, I would be prepared for a very long wait. They assume you are willing to drop everything else to work at their hospital.", "Interview Questions": "Tell me what brought you into nursing\r\nTell me about a time you had a difficult patient in clinical and how you handled it."}, {"date": "24 Jan 2021", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL)", "Interview Descriptions": "Best interview process I've ever incountered in my entire professional career. The recruiter & interviewers were VERY timely, helpful, pleasant,  excited about the opportunity, transparent, & thorough about the position, department, & the organization. The follow up process was great! The recruiter stayed in contact with me to let me know next steps & where they were in making a decision, instead of leaving me in suspense, wondering if I was still a candidate. That little thing is so important!", "Interview Questions": "What interest you about this position?"}, {"date": "25 Jan 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "Short call asking basic questions about position, experience, expectations and such. Very friendly and open to questions. Overall a great experience and not at all stressful. Came out of it feeling confident and excited to see what would come next.", "Interview Questions": "Why did I want to be a CNA?"}, {"date": "28 Dec 2020", "title": "Technical Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "The interview took two meetings.  The first is a general interview and the second more focused. There is a  lab test for tuberculosis after the interview. After that you can start work.", "Interview Questions": "You have to take a tuberculosis test."}, {"date": "28 Dec 2020", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Nov 2020", "Interview Descriptions": "30 minutes-45 minutes phone conversation with the manager. She asked about my previous experience and told me I was one of the stronger candidates but i never heard back from them after that", "Interview Questions": "Why should we hire you?"}, {"date": "6 Dec 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Oct 2020", "Interview Descriptions": "From submitting my application to receiving a call for an interview took 1-2 months. But once I had the phone interview, everything moved very quickly. I had a job within a week.", "Interview Questions": "Tell me more about yourself and your nursing experience. "}], [{"date": "19 Oct 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Oct 2020", "Interview Descriptions": "Easy to look through open positions through their posting website. You apply online. Interview was via Skype due to the pandemic. Interviewed with the unit manager and education director. Very straightforward. The whole process took about 2 months total.", "Interview Questions": "What is one thing you want us to tell the unit about you?"}, {"date": "15 Sept 2020", "title": "Online Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "eh it was fairly easy for someone who is articulate. Didn't feel that anxious. overall felt great for me. Just he prepared for common questions and follow the basic rules for interview.", "Interview Questions": "why do you want to apply for this job?"}, {"date": "9 Jan 2021", "title": "Regustered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Aug 2020", "Interview Descriptions": "I was only selected for a group interview. I feel as though I did not get a chance to prove myself in the group interview because everyones answers sounded extremely similar. It made it more stressful in my opinion.", "Interview Questions": "Why do you want to work at Luries?"}, {"date": "27 Apr 2022", "title": "Clinical Research Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Jul 2020", "Interview Descriptions": "Typical of an academic medical center : phone screen, round 1 and then panel interview. The process at lurie childrens is slow overall and hr is very disorganized. The hiring department is better equiped to screen and arrange interviews. Be aware lurie hires internal candidates almost always despite your potantially more exhaustive experience compared to internal candidates  so nicely  ask upfront so you aren't wasting your time and energy or simply ask if you are their \"back up\" option.", "Interview Questions": "Overview of my experience and academic paper authorship. Past scenarios with difficult family interactions, what you do when you don't agree with treating physician, why interested this particular specialty."}, {"date": "20 Jun 2020", "title": "Research Technician II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago in May 2020", "Interview Descriptions": "It was several phone/zoom calls (due to the pandemic), and standard cover letter/resume writing. Some the zoom calls were over an hour long, and I had several other emails I had to write to reach out to the lab in question efficiently.", "Interview Questions": "Why do you want to be a research technician?"}, {"date": "19 Feb 2020", "title": "Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "Fair! Quick. Very kind staff! Fair questions regarding resume and why I want to work with children. The interview consisted of a tour of the unit, a shadow, and the interview portion.", "Interview Questions": "Why I want to work at this hospital "}, {"date": "8 Apr 2020", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Feb 2020", "Interview Descriptions": "It took a long time but everyone was very nice and easy to talk to. They communicated with me via email and always got back to me. Overall it was a positive experience.", "Interview Questions": "Where do you see yourself in 5 years? "}, {"date": "6 Jan 2020", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "Started with just a phone call. I personally was having trouble getting any interest from HR until I got an employee referral. Started with an unscheduled phone call to see if you are good on your feet and unprepared. The onsite interview was next and I met with a lot of individuals. I interview with the manager, division head, several physicians, and a group of potential CRC peers. I met with 6 individuals at once at one point, which was somewhat intimidating, but no questions were particularly difficult. Emphasis placed on how well you could interact under pressure and how well you can talk about yourself and previous experiences.", "Interview Questions": "Very standard interview questions with no crazy curveballs. Google top 10 interview questions and you will be prepared."}, {"date": "26 Dec 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "I was called within the hour of applying. Standard, why are you interested questions. I was scheduled to interview the Unit Manager and had a peer review with an assessment test.", "Interview Questions": "How do you deal with dissatisfied families?"}, {"date": "15 Oct 2020", "title": "Communications Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Dec 2019", "Interview Descriptions": "Process was straightforward through to in-person interviews. The final round was a massive panel interview with more than 20 people around a huge boardroom table. Though the ultimate answer was “no”, it was an interesting process.", "Interview Questions": "Bring a portfolio of projects?"}], [{"date": "26 Nov 2019", "title": "Research Technologist II Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "I heard back fourth months after I applied for the job. I was flown out to interview a few weeks after a phone interview, and received an offer a few weeks after that. After accepting, it took over three weeks to hear from HR, and they presented a different salary than originally discussed.", "Interview Questions": "Discuss relevant experience"}, {"date": "29 Aug 2019", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Jun 2019", "Interview Descriptions": "3 interviews which are faced to face, a shadow, then a phone interview. I had a face to face interview at a job fair with the managers of my department, then I went in for a shadow and a brief second interview then I had the phone interview.", "Interview Questions": "Common interview questions "}, {"date": "22 May 2019", "title": "Epilepsy Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "Prolonged time for response, but eventually got a call. I was CALLED by the manager, spoke to her over the phine for a bit, and then HR with usual HR questions had called over the phone again. Then came one-on-one with manger and team", "Interview Questions": "Why I wanted to work at Lurie, and my experience with kids ."}, {"date": "11 Jun 2019", "title": "Senior Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago in Apr 2019", "Interview Descriptions": "I was approached by the executive search firm which handled the recruitment of this newly established position via LinkedIn. The recruiter sent me a message via LinkedIn and invited me to a phone conversation about the new position. Although I was not actively looking, I was interested in learning more about the position because of Lurie's reputation. My experience with the recruiter was not good and her approach resulted in me withdrawing from the hiring process before the recruitment team at Lurie had the opportunity to talk with me. During my first call with the recruiter, she was not adequately organized and did not send me the job description ahead of time, although it was available. She asked for salary expectations on the first call and current salary at the second email. The recruiter requested current salary aggressively via email threatening not to continue the interview process which in any case is irrelevant since I had already provided salary expectations. At the same time, the recruiter did not reciprocate by confirming a range that Lurie had in mind. In my 15 years of professional experience in healthcare, this was very unusual, disrespectful, and unprofessional, especially for this level of leadership position, when trying to attract professionals from other leading hospitals who currently hold leadership positions, and when it's a new position where institutional knowledge is still growing. In addition, the state where I am currently located has already banned the question on current salary to promote gender equity and although Illinois had not yet banned this question in the private or academic sector, it is still an unacceptable approach at this early stage of the process.  I emailed the recruiter letting her know that I will not continue the recruitment process as this is not a good fit and since our values are not aligned, and I never heard back from her. I hope that this does not represent Lurie's hiring practices, culture, and values and that this was a rare exemption that will not harm Lurie's reputation and human resources practices.", "Interview Questions": "What is your current salary? Why are you looking for a new job?"}, {"date": "17 Apr 2019", "title": "Media Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Mar 2019", "Interview Descriptions": "I was called initially to interview. I met with the director and another supervisor and had a pleasant experience. The 2nd interview was 25 days later with about 6 people.", "Interview Questions": "Why are you changing jobs?"}, {"date": "1 Mar 2019", "title": "Athletic Training Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL)", "Interview Descriptions": "The Interview was very good. It was more conversational than question by question. We started off by walking to Starbucks and talking. Then she showed me around the facility. We ended up in a conference room where we spent a while going over my resume.", "Interview Questions": "If you could be anything in an athletic training bag, what would you be. "}, {"date": "27 Feb 2019", "title": "Education Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "The interview was a short 20 minute interview with the supervisor I was applying to work with. She asked a few behavioral questions and we went over my resume together. Process took about 3 weeks.", "Interview Questions": "Tell me about your resume. "}, {"date": "8 Jul 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago in Feb 2019", "Interview Descriptions": "Applied online. They emailed me, and I went in for a interview with  management about a week later. I was offered and accepted the position about 2 weeks after the interview. Everyone there is super nice and supportive. I highly recommend working for this company!", "Interview Questions": "How did you go above and beyond for a pt."}, {"date": "18 Mar 2019", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Feb 2019", "Interview Descriptions": "I was emailed about a month after applying to attend a interview.  After the interview, I was told to wait for an email. Four weeks later I was offered the position via email. The interviewers were very friendly. The first 30 minutes was a unit tour, and the second half was a interview. It was a very positive interview.", "Interview Questions": "Tell us about yourself?"}, {"date": "4 Apr 2019", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago in Feb 2019", "Interview Descriptions": "Took 4 weeks to hear back for an interview offer. I was interviewed by all managers on the unit, they each asked me a couple questions. I was notified whether I got the position or not within 3 weeks.", "Interview Questions": "Where do you see yourself in 5 years? \r\nHow did you deal with a difficult patient or family?\r\nMost challenging about starting a new position?"}], [{"date": "28 Aug 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago in Dec 2018", "Interview Descriptions": "On the plus side, the Human Resources staff was kind but not very efficient.\r\n\r\nHuman Resources did not call me when my 1:1 phone interview was scheduled; Human Resources made an error on my interview schedule, therefore, I sat 1 hour waiting for the interviewer to arrive; Human Resources did not get back to me when promised.", "Interview Questions": "Tell me about yourself.\r\nTell me how you work with others."}, {"date": "19 Nov 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "Phone screening in which you talk your about your background and education, then an in person interview with scenario questions. Tour of the unit and peer interview. Loved every bit of it.", "Interview Questions": "Why did you choose to go into this speciality? "}, {"date": "4 Nov 2018", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "The interview process took a while, but it was relatively simple. First, I was called by a recruiter and asked basic questions, like if I was comfortable around children, why I was applying to this job, and what I thought this job was. I was also asked if I was interested in a different position, which I was. Then, I was told they would talk to the hiring manager about an interview. A couple days later, I received another call asking when I could come in for an interview. The interview was, at first, me talking to the manager of the department I was applying to. It was more of a \"getting to know you\" versus questions that were targeted. She asked basic questions, like about who I was, why I wanted the job. I used a lot of examples and spun my answers to show how I was a good worker. Then, I briefly met with the rest of the clinical research coordinator team and they asked questions of me, like if I was good at organizing. I was asked about my interests and if I was going to be capable of managing a lot of data. The whole process was about 45 minutes. A week later, I received another HR call offering me another interview. This interview was with the PIs of the team. They just told me about their research and asked general questions about my resume and past experiences. They said they were impressed and the interview was done after about 30 minutes. A couple days after this, HR offered me the position over the phone (which was a weird thing) and then we talked about salary.  They were not clear that it was an hourly position, so my negotiations were not very good and I am not particularly happy with the compensation. They were kind of pushy about me making a quick decision on the salary and position. Nevertheless, I took the job and they told me my start date was in two weeks. However, my start date got pushed back two times due to administration delays, which was very frustrating. Overall, the experience was mostly positive.", "Interview Questions": "Give us an example of how you maintained organization and orderliness."}, {"date": "21 Oct 2018", "title": "Social Worker-Spina Bifida Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL)", "Interview Descriptions": "I was contacted by phone and email by the Clinical Manager of Social Work Services to determine my interest in the position and availability to interview. From there, I was given a date to interview.", "Interview Questions": "What do you know about spina bifida?"}, {"date": "13 Oct 2018", "title": "Central Registrar Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Oct 2018", "Interview Descriptions": "HR emailed me about my application then called me for a phone interview. A week later I was scheduled for a face to face interview with the manager of the department. There were 4 people in the interview, which took me by surprise. It seemed like they liked me, but I didn’t get the job so I guess they were just being nice.", "Interview Questions": "Tell us about yourself? Where do you see yourself in 5 years? Typical bs questions."}, {"date": "19 Nov 2018", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Jul 2018", "Interview Descriptions": "Although a lengthy process, it went well.  Everyone from HR to the department took their time with me. The interviewers were very thorough with questions.  I was able to shadow prior to job offer.  It was a good experience.", "Interview Questions": "Why do I want to work at Lurie's?"}, {"date": "4 May 2018", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "This was a phone interview for the Pediatric intensive care unit (PICU) at Lurie for an acute care nurse practitioner. First a recruiter for Lurie emailed me and then set up an appointment with the APN hiring manager", "Interview Questions": "What questions do you have for me? (This was the first thing I was asked before I was asked any interview questions)"}, {"date": "4 Dec 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL)", "Interview Descriptions": "I interviewed only with the director of the NICU and HR, it felt like quite a simple hiring process - it took a very long time to get an offer however, I interviewed in October and got an offer in January to start in 3 weeks which was a shock because I had to move cross country.", "Interview Questions": "What type of patients and care are you familiar with? "}, {"date": "1 Nov 2017", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "Applied for clinical research assistant position online, received a phone screening with HR about a week and a half later, then after the phone screening was contacted via email to schedule an in-person interview with the team. Had one additional in-person interview with additional members of the team. Received an offer via phone call from HR after several days.", "Interview Questions": "Describe your clinical experience/experience working with people."}, {"date": "31 Jan 2018", "title": "Clinical Research Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Nov 2017", "Interview Descriptions": "2 step Process.\r\nHiring Manager\r\nInterview Panel - 9 members\r\nIt was a 2 step process with initial HR screening, followed by hiring manager in house interview and final Interview with a panel.", "Interview Questions": "Previous Experience, Skills for the job, Multitasking, setting priorities"}], [{"date": "5 Oct 2017", "title": "CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Oct 2017", "Interview Descriptions": "After applying on line you will get an email. The email will inform you of an upcoming phone interview to which you will reply your best availability. If all goes well you will be called in for a face to face interview.", "Interview Questions": "Have you ever worked with kids."}, {"date": "30 Sept 2017", "title": "Admin Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "Phone Interview  with a recruiter then in person interview with hiring manager and staff.  Very nice people. Excited to work with and for them. Chill process, do your research before the interview.", "Interview Questions": "Why Lurie and not Northwestern (Children vs Adults)"}, {"date": "6 Jul 2017", "title": "RNProgram Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "Interviewed by 2 hiring managers and unit director, group interview with 2-4 other applicants answering questions. Then shadow with nurse for 30-45 minutes for chance to ask questions about unit and for them to get to know you better. HR brought in group before going to floor to go over benefits and salary, but not HR interview process.", "Interview Questions": "Why Lurie? Example of a time you used effective communication. How do you deal with stress? "}, {"date": "4 Mar 2019", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in May 2017", "Interview Descriptions": "Had two phone interviews, one with HR and one with an epidemiologist in the division. I then I was brought in to meet the department in person.  Everyone was very friendly, but the process was slightly drawn out.", "Interview Questions": "Why do you want this role?"}, {"date": "10 Jul 2017", "title": "Systems Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago in Apr 2017", "Interview Descriptions": "HR called to schedule interview. Interviewed with Director then peer interview. Director said next step was HR screen since they failed to do so prior. Reached out to HR multiple times by email and attempted by phone, no response. Even when the job posting was taken down, I did not even get the rejection email. I have gotten this email for other roles so I know they send them. But for this specific role, nothing.", "Interview Questions": "Requested to describe background with specific project examples. "}, {"date": "2 Mar 2017", "title": "IT Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL)", "Interview Descriptions": "It is pretty intense, I had 4-5 interviews in one day. I met with HR, then one of the managers, then another manager, then the director, and finally with the team. Long day!", "Interview Questions": "All questions were either typical questions you can lookup online, and then some job specific questions. How do you handle difficult situations, discuss a time you had an angry doctor and how you handled it, etc."}, {"date": "9 Oct 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Mar 2017", "Interview Descriptions": "Was interviewed by office manager and clinical staff. Then asked to return to interview with provider for another day. I received a call from HR and was given an offer the prices took a total of seven days.", "Interview Questions": "Why do you want to work here? "}, {"date": "9 Jul 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago in Feb 2017", "Interview Descriptions": "The interview process was harsh when you are seeking an internship as a black student and seems like their mind was made up beforehand. Was able to receive a response as I was walking out the door.", "Interview Questions": "What modality do you like to use"}, {"date": "28 Nov 2016", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "The interview was located at the hospital. I met with one manager and he was very warm and easy to talk to. The interview was only 30 minutes. He asked about previous work experience and told me about the job.  That night I was contacted to do an over the phone interview with another manager the following day.  She called the next day and the interview went great.  The following week I was contacted for my references. The three I chose had to do an survey.  A week later, I was offered the job.", "Interview Questions": "Why do you see yourself working for Robert H Lurie?"}, {"date": "11 Oct 2016", "title": "CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL)", "Interview Descriptions": "Interview process was easy. Also did a hands on work during interview process. I was interview by phone on a Monday by HR then Friday I had a face to face interview where I also shadowed other employess. Later that day Ibrecieved a call saying that I was selected to move foward to the next step of providing references.I did not move any further because the two people I listed who were nursing supervisors did the reference from the same IP address. My mom was a previous supervisor and her BEST FRIEND was also a supervisor of mine. I didn't think it would be a priblem but I guess it was.", "Interview Questions": "Why did I want to work at the hospital with children."}], [{"date": "21 Sept 2016", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Sept 2016", "Interview Descriptions": "Roughly a 3 hour interview meeting with the various managers, doctors, and Human Resource personnel one on one discussing the job description and answering questions, etc.  Met with each level of the team and all the players that make up the people you would be working with.  They look over the resume as well as open to answering any questions.", "Interview Questions": "What is your ideal working environment?"}, {"date": "6 Jul 2016", "title": "Medical Technologist - Third/Graveyard Shift Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Jun 2016", "Interview Descriptions": "Better than other locations. My interviewers did not carry around a set of questions so there no animatronic questions. Instead they manufactured questions in a way to determine the type of person you are, but without asking weird situational questions that people could lie about. A lot of questions revolve on determining personality and character rather than what-would-you-do if a certain situation arises.", "Interview Questions": "N/A"}, {"date": "19 Oct 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Jun 2016", "Interview Descriptions": "The interview was nothing special through the HR department. Interview with unit was laid back on the unit. It was more of the managers want to get to know you", "Interview Questions": "Why Lurie’s? "}, {"date": "23 Oct 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Jun 2016", "Interview Descriptions": "Did a phone interview and then went inside to meet with everyone. Introduced me to all doctors and each one interviewed me as well with basic questions. Didn't actually know what I was getting myself into hence the reason I quit after. But it was a fun time though.", "Interview Questions": "How do you overcome difficult situations?"}, {"date": "9 Nov 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Aug 2015", "Interview Descriptions": "Over the phone. It was a two part interview process. One with the department head and the other with my HR rep. The phone conversation lasted about 25 mins. with the HR rep. I was a new grad so the interview was less detailed.", "Interview Questions": "If I was willing to switch to nights."}, {"date": "14 Dec 2016", "title": "Milieu Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Jun 2015", "Interview Descriptions": "It took a while to hear a response, but my interview was very casual and comfortable. I felt as though I really was able to get to know my supervisor and express why I was a good fit for the role.", "Interview Questions": "Provided scenarios in which problem solving would be necessary and asked to elaborate on my approach, questions about why I was a good fit, and inquiries about career goals."}, {"date": "11 May 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 days. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "Interview was formal I would wear a suit minimum. HR was very informative and welcoming. I could tell they were interested in what I had to say and offer from the beginning.", "Interview Questions": "Tell us a situation where you comforted someone"}, {"date": "18 May 2015", "title": "Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "Interview process was fair and quick.  The HR team was nice and got back to me quickly.  They asked basic questions and were more concerned about my fit within the team.", "Interview Questions": "There weren't any difficult questions."}, {"date": "30 Apr 2015", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL)", "Interview Descriptions": "I applied online. I was contacted by HR a few weeks later (or maybe closer to 2 months) to schedule an in-person interview. Once on-site I interviewed with HR, director, and PI. I liked that I had a chance to meet/interview with multiple people so that I could get a better feel for the organization. I would recommend taking a cab or the train to the hospital as parking downtown in one of the garages is very $$.", "Interview Questions": "Standard behavioral questions ie: \"tell me about a time when you...\" and asked me to review my resume. Overall -- everyone was very friendly. "}, {"date": "29 Apr 2015", "title": "Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL)", "Interview Descriptions": "I first met in person interview with scientist, and then I did a phone interview with HR. HR also asks for an extensive list of references to fill out a survey about your professional experience.", "Interview Questions": "What is your greatest strength and what is your greatest weakness?"}], [{"date": "10 Oct 2015", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Mar 2015", "Interview Descriptions": "Two phone screenings with a Human Resources representative and one in person interview with four different people separately. It was a friendly and welcoming experience although the location is in a highly congested area in Chicago. I waited about four minutes and was walked to four different offices for more personal interviews.", "Interview Questions": "Tell me about a time you dealt with difficult people? - I was asked this three times by various people."}, {"date": "23 Jan 2017", "title": "Cook Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Feb 2015", "Interview Descriptions": "Everything progressed smoothly and quickly.I applied online then about 2 days I had a phone interview. She was a very pleasant hiring manager.She listened and answered all of my questions very professionally", "Interview Questions": "Tell me about your culinary experience."}, {"date": "22 Jan 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Jan 2015", "Interview Descriptions": "Formal interview with HR representative and hiring manager at main hospital after submitting resume and cover letter.   I was familiar with hiring manager and day-to-day of work environment already.", "Interview Questions": "General behavorial type questions.  Strengths, weaknesses.  Fun question: if you had a super power what would it be? "}, {"date": "13 Mar 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Jan 2015", "Interview Descriptions": "The interview process is quite extensive. You may meet with multiple people, including Human Resources, managers and peers. An applicant may receive a tour of the facilty and have  an overview of the benefits package.", "Interview Questions": "What are your strengths? "}, {"date": "1 Jun 2017", "title": "Fellowship Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Dec 2014", "Interview Descriptions": "Disorganized. Late. No respect for my time.,rescheduled x3, no parking reimbursement. No one reviewed my resume. My questions made more sense. I submitted information timely and organized. Found out later my boss never read it.", "Interview Questions": "What is your experience?"}, {"date": "21 May 2015", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Oct 2014", "Interview Descriptions": "very professional Interview process. Took a while to get called back for an interview but well worth the wait. It was a thorough interview and was one of the best ones I've ever had", "Interview Questions": "why do you want to work here"}, {"date": "20 Aug 2014", "title": "Research Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "Called first and then emailed to confirm interview time, phone interviews back to back - first with HR then hiring manager, each interview lasted 20-30 minutes\r\nHR seemed a bit overwhelmed and not very clear on the position, hiring manager was much more informative", "Interview Questions": "How would you expect to handle more than 50 research studies at a time?"}, {"date": "22 Sept 2015", "title": "Point of Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Aug 2014", "Interview Descriptions": "Interview with numerous managers and directors with them taking turns asking questions and you answering them.  Only a one day interview.  Interview was easy, not sure if it was different because I was already employed with Lurie.", "Interview Questions": "Why did I want to leave my current position"}, {"date": "26 Sept 2016", "title": "International Patient Services Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Aug 2014", "Interview Descriptions": "I went through a third party temp agency for 2 months before being hired full-time by the hospital. When going through the process of being hired as a full-time employee, I reapplied for a newly created position and carried out multiple interviews with different members of management. I went through the same application process as other applicants though I had the advantage of having worked within the team and having developed the new position myself.", "Interview Questions": "What experience do you have with cultures from around the world?"}, {"date": "29 Jul 2015", "title": "Summer Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in May 2014", "Interview Descriptions": "Not to difficult the normal phone interview then get called in for a face to face. Everyone was very nice and friendly and wanted to make me feel comfortable. Didn't stress out and came in well prepared for questioning.", "Interview Questions": "How you work with others and how you will be in an environment like a childrens hospital"}], [{"date": "3 Apr 2014", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "Very basic questions. Some technical. Mostly personality", "Interview Questions": "What is your greatest weakness?"}, {"date": "27 Mar 2014", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago", "Interview Descriptions": "1st round: basic interview with hiring manager\r\n2nd round: interview with HR and interview with hiring manager", "Interview Questions": "Describe a time you had a conflict with a coworker"}, {"date": "6 Aug 2014", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Feb 2014", "Interview Descriptions": "Phone screening, HR in-person screening, face-to-face with 3 individuals. Thought position was at the hospital itself, but it was in another building. Met with 3 people with the first person saying there are no funds allocated for professional development. Met a second person whom I would not even be supporting so this was perplexing. The last person I met with was going to be transferring out in 2 months.", "Interview Questions": "How do you define success?"}, {"date": "12 Oct 2016", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Jan 2014", "Interview Descriptions": "It was very difficult to schedule and I had to drive to the city twice because they had to reschedule the first last minute. It took way too long to schedule and the actual interview process was only about 10 minutes. They just needed me to come in for a formal interview but couldn't care less about me being there. The HR department was very disorganized and the entire process took much longer than it needed it.", "Interview Questions": "Very generic questionnaire, it was a huge pain to schedule and come in for and we ended up talking for only 10 minutes. The entire HR department was disorganized and make the on boarding process much more complicated than it needed to be. Once I was offered the job it took about 6 weeks for HR to get the paperwork finished for me to start."}, {"date": "24 Nov 2015", "title": "Point of Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Oct 2013", "Interview Descriptions": "The interview process was pretty long. Phone interview first and then they call you in to meet with the recruiter who called you in addition to the hiring manager/s. However, in my instance they hired somebody but they never showed up and that's when they called me back two months later. I came in for the in person interview with the recruiter and it went amazing well. I met with two hiring managers and it went extremely well too. Two days later they called me with an job offer and I accepted.", "Interview Questions": "Why did you apply for this position?"}, {"date": "8 Feb 2016", "title": "Applications Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Feb 2013", "Interview Descriptions": "I interviewed with Human Resources in a phone interview. A few days later I had a more thorough interview with human resources, hiring manager, and a panel of staff (potential colleagues) all in one day. The entire interview day lasted about 4 hours.", "Interview Questions": "A lot of situational questions. Questions on leadership."}, {"date": "3 Apr 2015", "title": "Operation/Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Oct 2012", "Interview Descriptions": "The interview process was very and organize. Plus easy to understand the interviewer spoke clear and made it very easy to follow direction. However, the process took along time and I believe it could have been ran a little different due to other worker got hire for other position.", "Interview Questions": "Tell me something about yourself"}, {"date": "11 Jul 2013", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Jul 2012", "Interview Descriptions": "I was screened by phone but I interviewed in person first with a physician, then with a panel, then with a manager. It was pretty relaxed but I could tell I disliked one of the women.  They called the same day to offer me the position.", "Interview Questions": "What is your biggest weakness?"}, {"date": "9 Sept 2016", "title": "Purchasing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Jul 2012", "Interview Descriptions": "Purchasing manager inter-departmental interview, internal employees apply online in-house, manager or department leadership from department with job opening contacts employee and manager of said employee, then interview is scheduled. During interview department leadership or manager asks questions regarding the position being inquired about and interviews, person applying for said position.", "Interview Questions": "how would I make changes to better the department"}, {"date": "10 Apr 2012", "title": "Clinical Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Jan 2010", "Interview Descriptions": "The first interview I spoke individually with HR, then with 3 different members of the department, and finally with a panel of the people I would be working with on a daily basis. I was called back for a second interview since not all members were present. I was told that they interviewed for this position in the past and no one filled the description they were looking for so no one was hired. I was surprised since I was told the work for this position was in back log for a few years. They were very thorough and  friendly and felt confident I would be hired. I called back a few times to check in but was notified over a month later by mail that I was not accepted for the position. Good thing I accepted a different position.", "Interview Questions": "What is the mission statement of the Children's Memorial Hospital?"}], [{"date": "3 Jul 2011", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Jan 2010", "Interview Descriptions": "2 initial screening interviews by recruiter and hiring manager", "Interview Questions": "Why are you leaving current employer"}, {"date": "30 Oct 2013", "title": "Desktop Analyst Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in Feb 2009", "Interview Descriptions": "The interview process can be a bit tedious. Prior to meeting with the hiring manager, you will be interview by a member of the human resources department. The purpose of that interview it to determine if you have the basic skills to interview for the position you applied for. Once you successfully complete the human resources interview, you will interview with the hiring manager of the position that you applied for.", "Interview Questions": "N/A"}, {"date": "19 Mar 2009", "title": "Data Entry Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Ann & Robert H. Lurie Children's Hospital of Chicago (Chicago, IL) in May 2008", "Interview Descriptions": "I had 1:1 interviews with a consultant for the department, someone in HR, then my boss, my bosses boss, and a director from a related department.  5 interviews for what I think is a glorified entry-level position (though it certainly paid better than entry level).  It was annoying because I could not keep track of who did what, everyone had a different opinion of what my role would be, there were 3 different locations across the city for the interviews and screening and no one knew the address of the one location after giving me bad directions, so that wasted an hour.  Too many cooks in the kitchen.  The one person I didn't like turned out to be my boss, but i didn't know that until after accepting the offer.", "Interview Questions": "Do you think this job is below your skill level?"}]]