[[{"date": "29 May 2023", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Baptist Health Care (Pensacola, FL)", "Interview Descriptions": "Three step process with recruiters, then manager and finally a peer interview before hire. Once hired you start a longer process for a back ground , drug screen etc. depending on the are you will work.", "Interview Questions": "Tell me about a time you had a difficult co-worker and how did you handle it?"}, {"date": "5 Apr 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Baptist Health Care (Montgomery, AL)", "Interview Descriptions": "Very easy, laid back and didn’t take very long. Manager was very nice and didn’t mind me asking questions myself. Also met the staff and they seemed very happy to meet me as well.", "Interview Questions": "Why do you want to work here?"}, {"date": "7 Aug 2022", "title": "IT Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at Baptist Health Care (New York, NY)", "Interview Descriptions": "The manager isn't a technical guy at all , just a hospital guy with a iT masters degree(pillow promoted I assumed) so he had two technical leads at the interview for vetting. They asked basic questions, anybody thats not an idiot can be technical in it though so it was no pressure at all. They needed people BAD so I again , easy process", "Interview Questions": "how do you verify if the PC has connectivity"}, {"date": "18 Apr 2022", "title": "Sr Cyber Security Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Baptist Health Care (Miami, FL) in Mar 2022", "Interview Descriptions": "One of the most unprofessional experiences of my life. The recruiters are terrible and don't understand proper communication. The interview process needs to be revamped and streamlined. I wasted hours with this organization for all my interviews and in the end got a below market salary offer. THIS PLACE DOES NOT PAY and they do not tell you the salary in the initial pre-interview screening.  ", "Interview Questions": "basic questions cyber security questions"}, {"date": "19 Oct 2021", "title": "PT Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Baptist Health Care", "Interview Descriptions": "Very friendly and easy to talk to. They talked about the company and the positions they were looking to fill. Also covered the role and allowed me to share about my qualifications/why I would be a good fit.", "Interview Questions": "Why did you apply for this job?"}, {"date": "14 Aug 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baptist Health Care", "Interview Descriptions": "The virtual process was flawless. Prompt communication and follow up.\r\nHuman Resource personnel were knowledgeable, resourceful and accommodating, The interview with the panel and hiring manager was organized, methodically. Leadership styles are clearly communicated.", "Interview Questions": "What is your leadership style?"}, {"date": "27 Jun 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health Care (Pensacola, FL) in Apr 2021", "Interview Descriptions": "For the peri-op program, it was a zoom interview. Management spoke about the program and asked about my nursing experience. They also wanted to make sure OR was something I was genuinely interested in since you have to sign a 2-year contract.", "Interview Questions": "Why do you want to switch from bed side to OR?"}, {"date": "2 May 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Health Care (Gulf Breeze, FL) in Apr 2021", "Interview Descriptions": "Very easy interview process. I reached out to the nurse recruiter and told her to expect multiple applications to different RN positions. Within 72 hours I was contacted to set up an interview with office manager. Next day had a peer interview. The following day I received an offer and start date.", "Interview Questions": "They asked the typical interview questions"}, {"date": "3 Jun 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Health Care (Pensacola, FL) in Feb 2021", "Interview Descriptions": "On site, personal, asked direct questions, Good with no experience, prepared to train you and mold you to their idea of nurse. I was offered the job. They seemed eager to hire.", "Interview Questions": "How do you feel about delegation"}, {"date": "30 Aug 2018", "title": "Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Baptist Health Care", "Interview Descriptions": "Interview process was very informal and easy! They quickly showed me around after the interview and I had an offer within a week. Nothing like prior interviews, as it was so relaxed.", "Interview Questions": "What prior experience do you have with healthcare or why are you passionate?"}], [{"date": "26 Jun 2018", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health Care (Pensacola, FL) in Jun 2018", "Interview Descriptions": "They do the overall basic standard questions such as how do you handle hostile environment or negative work environment, tell them about yourself and your work experience.  They usually will give you an overall spiel of what the job description is, a brief synopsis of the providers and said offices. I always felt they do not engage much with newly fresh out of school students. I never received a call back when I have reached out, phone calls are being ignored as well I have had emails been ignored. I call the whole interview process within that job title a joke at least with Baptist Health Care. Like ideally, I’d feel like a larger company would prefer to engage with a new certification to tailor the trainee exactly how they want versus someone who is been in it for years. But, I feel it’s handle differently. I’m also the person who generally puts a lot of effort when it comes to ensuring I have a copy of my resume, references, certifications, as well a cover sheet, and so still have been shot down.", "Interview Questions": "Tell me about yourself?"}, {"date": "28 Apr 2018", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Baptist Health Care (Pensacola, FL) in Apr 2018", "Interview Descriptions": "The interview process has been long. There was a phone interview but still have not heard anything about how I did or if I will go further in the process. I am not sure how long the process normally takes, but seems to be a little longer than what I'm used to.", "Interview Questions": "What type of projects have you led?"}, {"date": "5 Oct 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Baptist Health Care (Pensacola, FL) in Sept 2017", "Interview Descriptions": "Went on company website and filled out application. I heard back from supervisor of the unit I was applying for within 4 days. Went in for interview, offered job in the end.", "Interview Questions": "What is a mistake you have done in the past, what was the outcome?"}, {"date": "14 Aug 2017", "title": "ER Patient Access Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health Care (Gulf Breeze, FL) in Aug 2017", "Interview Descriptions": "to was a good very re-lacks  but in the end she told me that she had someone in mind for the postion. and why just didnt let me know and just come way to gulfbreeze which she made up her mind already", "Interview Questions": "she asked why should we hire you "}, {"date": "7 Apr 2017", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Baptist Health Care (Pensacola, FL) in Mar 2017", "Interview Descriptions": "I submitted my resume and was contacted by recruiting initially to set up the interview with the unit manager. I was given a tour of the workplace and introduced to potential coworkers then interviewed. No surprise questions just standard one on one. I was chosen to replace a person who decided to leave but at the last minute retracted and returned to her position. No hard feelings as it is a super place to work.", "Interview Questions": "I was asked about strength and weakness."}, {"date": "19 Oct 2016", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Baptist Health Care (Miami, FL) in Oct 2016", "Interview Descriptions": "First you have a phone interview with the recruiter, then you get called in for an interview with HR and your last interview will be a panel/peer interview.. mine consisted of 5 people but it all depends on the department. I got a call 2 days after my last interview offering me the job and i couldnt be any happier! Dont stress! Everyone at baptist is so welcoming.. you will do great.", "Interview Questions": "Where do you see your self in 5 years?\r\nWhy baptist?\r\nWhy should we hire you? \r\nHave you ever worked or volunteered at a hospital?\r\n\r\n\r\nNothing to crazy.. just these questions and a few situational questions."}, {"date": "10 Nov 2015", "title": "Planning Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health Care (Pensacola, FL) in Sept 2015", "Interview Descriptions": "The interview process was pretty easy. I applied online and within 2 weeks my interviewer emailed me to set up an interview date and time.She basically asked questions about the experience I had with analyst work, if I ever had an issue with another employee and how I handled it, and where I see myself in the future. The interviewer was really nice and easy to talk to.", "Interview Questions": "Describe a difficult work situation and how you overcame it."}, {"date": "13 Oct 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Baptist Health Care (Pensacola, FL) in Mar 2015", "Interview Descriptions": "Application online and was called relatively quickly by RN recruiter who then forwarded my application to all appropriate areas. I received a call within a few days asking for an interview. At the time of the interview I was immediately scheduled for a peer interview for day position and for night position. I was offered the position within a few days.", "Interview Questions": "Why did I want to work for Baptist Hospital"}, {"date": "23 Feb 2015", "title": "Nutrition Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health Care (Pensacola, FL) in Feb 2015", "Interview Descriptions": "Gone through first interview, was offered position. Have heard there's a lot of hoop jumping during this next step. Tests & whatnot but I'm not worried. I don't smoke or do drugs, was truthful about everything on my application/resume, I'm healthy so although it may take a bit more time this process weeds out undesirables.", "Interview Questions": "How would you react to patients treating you badly?"}, {"date": "17 Dec 2015", "title": "PT Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Baptist Health Care (Crestview, FL) in Feb 2015", "Interview Descriptions": "It was wonderful. Spoke directly to director over coffee. Went to job locations and was presented with a tour and peer interviews. Accepted job immediately upon receiving offer from human resource representative.", "Interview Questions": "What are your biggest cons to your personality?"}], [{"date": "20 Dec 2013", "title": "Cook II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Health Care", "Interview Descriptions": "I had 2 interviews with BHC, however the over all hiring process is a bit more involving than I've previously encountered (this was the first hospital I worked for). A physical is required before working there, beyond the typical drug screening. Tests for tabacco use as they no longer higher smokers. Also screened for illnesses. As far as the interview went it was also a little different than what I am used to as the manager was not the only one that interviewed me that day, I had a peer interview with 3 of the other cooks.", "Interview Questions": "Describe a decision you made that was a failure. What happened and why?"}, {"date": "30 Jun 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Baptist Health Care (Pensacola, FL) in Nov 2013", "Interview Descriptions": "I submitted my application on line and received a phone call from the manager asking if I could come for a peer interview. I was asked to come at 11:30 pm to interview with night shift because I had applied for a night position. When I arrived at the hospital I was unsure where to go to get in. I had not been informed that all of the doors were locked at that time. When I finally made it to the nursery the two nurses that were working had no idea I was coming nor had they been provided a copy of my application or resume. I had a copy of my resume with me so I gave it to them to review. They didn't have any real \"interview\" questions for me just basically told me about the normal routine of the shift. I was there for about 15 to 20 minutes and truthfully I ask way more questions than they did.  I left with a bad vibe and thinking that this particular job may not be a good fit for me. The nurses were very unfriendly to me. The next morning I called to inform the manager that I had done the peer interview and to thank her again for the opportunity to interview. I ask if she wanted me to meet with her at anytime and she said no. She told me that there were a couple more applicants to interview and that she would be in touch by the first of the next week to let me know either way. After two weeks of waiting, I called her back. She seemed to have no idea who I was. I had to remind her of who I was by giving her a synopsis of my nursing background and she said, \"oh yes... I remember now. I've been meaning to call you. We've decided to go with someone else for the position. \" I thanked her again and ask if she could provide feed back as to why I might not have been chosen because I was qualified. She said,\" oh, the staff didn't think you would be a good fit. They were afraid you would get board. \" Honestly, even though my feelings were hurt, I was relieved because my initial gut feeling was not positive.", "Interview Questions": "I wasn't asked much if anything but they did ask why I wanted to return to this area of nursing?"}, {"date": "20 Jan 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health Care (Pensacola, FL) in Aug 2013", "Interview Descriptions": "Fine. Friendly. Casual. Peer interview which allowed for more of a mutual question answer situation.  My peer interview consisted of nurses.  I now know how pressed nurses are for time and realize I was meeting with them during their precious thirty minute break in a long twelve hour day. Sorry nurses... I didn't know!", "Interview Questions": "Why choose us"}, {"date": "9 Jun 2015", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Baptist Health Care (Pensacola, FL) in Jul 2013", "Interview Descriptions": "interview was very informal, they hardly seemed interested in what i could do, very brief and hurried. They asked the typical questions of how much experienced i had in the position i applied for, and then they started going other ways with questions that had nothing to do with the job. I understand that they were tryig to get to know me, i could tell from that day management was going to be awful.", "Interview Questions": "yers of experience"}, {"date": "10 May 2017", "title": "Entry Level Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Baptist Health Care (Pensacola, FL) in Feb 2013", "Interview Descriptions": "Completed phone screening, returned for hiring manager interview, returned for peer and presentation, returned for director, and returned again for senior leader interview.  Too many visits to the hospital.  Appeared unorganized and not considerate of candidates time.", "Interview Questions": "No difficult questions asked.  "}, {"date": "16 Aug 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Baptist Health Care (Corbin, KY) in Jul 2012", "Interview Descriptions": "Interview process was simple.  Received call after applying for job within a week.  Set up interview for approximately a week later.  Met with nurse manager on unit assigned to work in her office.  She was extremely pleasant and easy to talk to.  Not intimidating at all.  Interview process was overall a good experience.", "Interview Questions": "Why did you choose nursing as a profession?"}, {"date": "31 Oct 2015", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Baptist Health Care (Pensacola, FL) in Nov 2011", "Interview Descriptions": "After your application is reviewed, and if they are interested, you will receive a pre-screening interview. If that goes well, you will be called in to interview with your immediate supervisor. If that one goes well, you will then go in for a peer interview. It is a very good/effective process.", "Interview Questions": "How do you feel about working in an ever changing healthcare environment?"}, {"date": "26 Jan 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Baptist Health Care in Apr 2011", "Interview Descriptions": "Met with nurse manager whom was very nice and answered all questions, took me on a tour of the unit and introduced me to staff.\r\nPeer interview was awkward. Smiles appeared as smirks, and very few questions were asked.", "Interview Questions": "none, all questions were routine interview questions."}]]