[[{"date": "3 Jan 2022", "title": "Contract Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Community Reach Center (Denver, CO) in Apr 2021", "Interview Descriptions": "Overall, streamlined interview process, mobile, and only one interview. My interviewer was also my trainer and contact while I was getting my bearings. She made herself available when clarification was needed.", "Interview Questions": "What I was looking for in the position. I found this to be helpful."}, {"date": "12 Feb 2021", "title": "Clinical Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Community Reach Center", "Interview Descriptions": "Panel interview with other managers and people from the team, fairly standard interview questions with some scenarios, friendly and welcoming, gave a good overview of the position and team and the agency.", "Interview Questions": "Scenario question related to the role"}, {"date": "3 Nov 2020", "title": "Marketing Manger Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Reach Center in Sept 2020", "Interview Descriptions": "First interview was a check in with HR, short and to the point. About a week later I received an email to set up another interview which turned out to be a panel interview with 4 people including the hiring manager. They went around the room and asked a wide variety of questions. HR was in touch the next day and scheduled a third interview. In that interview the questions were more challenging, still a panel style interview with different people except the hiring manager.", "Interview Questions": "Without experience in this industry, how will you make the transition into this role?"}, {"date": "30 Jul 2020", "title": "Front Desk Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Community Reach Center", "Interview Descriptions": "The interview process begins with a short phone interview. Then a panel style interview is conducted. The panel members may consist of two direct managers and the Human Resources Recruiter.", "Interview Questions": "The predictable and traditional questions are asked (i.e. Why did you choose to apply here? Where do you see yourself in 3 years?) "}, {"date": "15 Aug 2019", "title": "School Based Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Community Reach Center (Denver, CO) in Jul 2019", "Interview Descriptions": "I applied for the position and heard back within 3-5 days to schedule an interview.  Pretty informal I felt totally at ease. They asked a lot of situational questions and questions about modalities used and getting to know you questions.", "Interview Questions": "Why do you want to work here?\r\nHow would you handle a suicide crisis?"}, {"date": "7 Jan 2019", "title": "Anonymous Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Community Reach Center in Nov 2018", "Interview Descriptions": "The interview process was about what you would expect. I applied online, and got an email invitation for an interview the following week. I had two people interview me, and the interview lasted about 30 minutes. I was told to expect to hear back regarding their hiring decision within the next two weeks. It has now been 8 weeks since this interview, and I never heard back, not even so much as an automated email stating that they have filled the position. Obviously, I have made the assumption that they chose another candidate, but the lack of communication is extremely unprofessional.", "Interview Questions": "Describe one of your strengths and one of your weaknesses"}, {"date": "21 Aug 2018", "title": "Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Community Reach Center (Denver, CO)", "Interview Descriptions": "It was more intense than I expected.  There were maybe 10+ behavioral interview questions with multiple people interviewing me.  I was not told that there would be multiple people in the room, so I got nervous when I was informed of this, as we were walking to the room.  The interviewers were nice, but it was still intimidating, having 3 of them watching me scan my brain for all these situational questions.", "Interview Questions": "How do you feel about flexibility and change?  "}, {"date": "30 Jan 2017", "title": "Case Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Community Reach Center", "Interview Descriptions": "HR dept. interviewed me. You could tell by the interview they weren't interested in getting to you know, just interested in weeding candidates out. Took 6 weeks to respond to me only to tell me I didn't get the position. I think this is normal for bigger companies. If you don't hear back from them in a few weeks, just forget about it and move on. There were about 8-10 interview questions, such as \"why are you interested in community reach center?\",  \"what are 2 most important qualities that one should have for this position\" (I think \"organization\" is what they want to hear),  \"what kind of management do you like\", \"what kind of co-workers do you best get along with\",  \"how do you adapt to change in the workplace\", \"where do you see yourself in 3 years from now\" (they want you to tell them that you'll still be at their company, which I didn't), \"what are your greatest strengths and weaknesses\",  \"tell us about a time where you had a disagreement with a co-worker\", \"tell us about a time where you received constructive criticism/ feedback in the workplace and how did you handle it\" etc.", "Interview Questions": "tell us about a time where you received constructive criticism/ feedback from a co-worker / manager and how did you deal with it ?"}, {"date": "26 Apr 2018", "title": "Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Community Reach Center (Denver, CO) in Mar 2016", "Interview Descriptions": "I interviewed with 2 people and it the interview was mostly behavioral and situational based. It was one of the longer interviews I have done for this position and pretty difficult.  I didn't get the job, I had just graduated from college and had little experience.", "Interview Questions": "Tell us about yourself"}, {"date": "25 Aug 2015", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Community Reach Center (Denver, CO)", "Interview Descriptions": "Interviewed by 8 people- Told me they would get back to me 7 days about the job\r\n\r\nI waited 2 1/5 weeks, to get an automatic email saying the position has been filled.\r\nI hate getting impersonal responses like that, and they have sent the same 3 mail a few more times- Thanks- stop rubbing it in my face! Ha", "Interview Questions": "A lot of situational questions\r\n(ex. tell us of a time when you...)"}], [{"date": "17 Nov 2015", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Community Reach Center (Thornton, CO) in Jul 2013", "Interview Descriptions": "There were a lot of situational questions, what would you do if (scenario).... And also questions to see if you're a good fit with the management style. So be prepared to talk about what management style you like in a supervisor. Also good to show passion and conscientiousness, how you keep organized, time management skills, what motivates you, past work-related experiences, etc.", "Interview Questions": "How do you adapt to changes?"}]]