[[{"date": "8 Jun 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Western Washington University (Bellingham, WA)", "Interview Descriptions": "The interview was overall fairly easy. They just were asking what classes I’m taking and what skills I think I could apply to the position. My interviewer was very approachable and I felt comfortable.", "Interview Questions": "What classes are you taking right now?"}, {"date": "21 Jul 2022", "title": "Accomodations Service Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Western Washington University in Jun 2022", "Interview Descriptions": "Interviews went well. Simple questions but they weren’t really prepared for contemporary questions. Their questions were simple and direct. You are interviewed by six to eight folks at a time which is very difficult to manage and track. There was not a screening interview.", "Interview Questions": "How do you handle professors who see accommodations as an infringement of their academic freedom?"}, {"date": "11 Apr 2022", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Western Washington University", "Interview Descriptions": "The interviewers gave me the questions at the start of the interview and allowed me time on questions to think about an appropriate response. They were polite and responsive. Overall the interview and hiring process was smooth, and the job was good.", "Interview Questions": "N/A"}, {"date": "15 Feb 2022", "title": "Accounting Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Western Washington University (Bellingham, WA) in Oct 2021", "Interview Descriptions": "Zoom interview with questions given before hand walked through all the questions with 3 people switching turns asking questions.  Application through online, communication through email then zoom interview. Fast interview 10 questions.", "Interview Questions": "Asked me about diversity and how it is important for this role and my opinions on this topic. "}, {"date": "28 Sept 2022", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Western Washington University in Jul 2021", "Interview Descriptions": "It was an informal process where we video chatted, the role was described to me, and then I was offered the job later that night. I was not stressed during the process and they didn't ask any questions.", "Interview Questions": "Why do you want this role"}, {"date": "1 Sept 2020", "title": "Admissions Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Western Washington University", "Interview Descriptions": "Panel style interview with stakeholders, followed by a campus tour, interview with students, and final interview with the Director of the department.  It was a 4 hour process that seemed like overkill.", "Interview Questions": "What would your colleagues have to say about you?"}, {"date": "22 Apr 2021", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Western Washington University (Bellingham, WA) in Apr 2020", "Interview Descriptions": "Phone interview, wanted to know about personality and academic background and how it can be used to help out students.\r\nPhone call was quick, it takes about 30min and interviewer was extremely friendly and helpful.", "Interview Questions": "How do you feel like you can help with students?"}, {"date": "16 May 2023", "title": "Computer Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Western Washington University (Bellingham, WA) in Jan 2020", "Interview Descriptions": "A very easy process that involved just one round of basic behavioral that asked more about my experiences on my resume. They also got back to me in a timely manner.", "Interview Questions": "I can't say because NDA"}, {"date": "20 Nov 2019", "title": "Restek - Software Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Western Washington University", "Interview Descriptions": "1 coding homework assignment before interview. Interview consisted of behavioral questions, discussing the homework assignment, explaining a code snippet, and a technical question. Received offer for interview directly after resume application", "Interview Questions": "Array manipulation and computation "}, {"date": "13 Aug 2019", "title": "Mail Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Western Washington University", "Interview Descriptions": "The interview process was very straightforward. After a couple of days, the manager at the time invited me into the workplace and asked me about my experience and availability. After, they called with an offer.", "Interview Questions": "What is your availability?"}], [{"date": "5 Aug 2019", "title": "Management Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Western Washington University (Bellingham, WA) in Jul 2019", "Interview Descriptions": "Disorganized panel interview; all interviewers we’re wearing casual clothing and I was placed at table in the middle of a room with interviewers in each side.  They all took turns asking questions and all but one seemed uncomfortable. Interview lasted about 45 minutes.", "Interview Questions": "Describe how others would describe your part in a project that failed?"}, {"date": "9 Apr 2019", "title": "Communications Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Western Washington University", "Interview Descriptions": "I applied online and it took me a couple of hours to write a cover letter and submit answers to their questionnaire. I didn’t actually get an interview since after the opportunity closed, I called 2 days later and found out they already filled the position? I felt like I just wasted my time applying for a job that they clearly already had someone in mind for.  Don’t waste your time applying for this organization! Why have a closing date if you’re not going to consider applicants that apply before that deadline? Seems they only hire internally people that either went to school at WWU or are already employed.", "Interview Questions": "N/A"}, {"date": "2 Jan 2019", "title": "Communications Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Western Washington University (Bellingham, WA) in Dec 2018", "Interview Descriptions": "I applied online. Heard back two weeks after the position closed and had a phone interview the day after which took about 20 mins with three other people on the phone. \r\n\r\nTwo weeks after my phone interview I was invited to have an interview in person which was scheduled for the following week.\r\n\r\nThe in-person interview took around two hours which consisted of a brief one-on-one meeting with the position supervisor. Afterwards the interview started with six people and took about 45 mins. The panel took turns asking questions. After a short pause another six or so people from the department joined and were able to ask questions. I felt this was a continuation of the actual interview and some of the questions asked were very similar to the ones I already answered in the first group session.\r\n\r\nI experienced both interviews as pleasant. The people I met and spoke with were all very friendly and professional. Though it took a long time and there was a large group of people involved, it didn't feel stressful.\r\n\r\nAfter another two weeks I received their decision by letter in which they explained they chose a different candidate.", "Interview Questions": "What is your biggest strength and weakness?"}, {"date": "19 Aug 2018", "title": "Student Custodian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Western Washington University", "Interview Descriptions": "It was a very straightforward interview, they mostly wanted to know why I was applying. Very simple, they asked about prior experience but it was not an issue if you didn't have experience.", "Interview Questions": "N/A"}, {"date": "23 Oct 2022", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Western Washington University (Bellingham, WA) in May 2018", "Interview Descriptions": "Asked about myself and my personal goals. Wanted me to learn and didn’t expect that I would come in and already know everything. It was great and overall friendly. I enjoyed interviewing with the people that had taken the time.", "Interview Questions": "What type of communicator am I on a daily basis."}, {"date": "14 May 2018", "title": "IT Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Western Washington University in Apr 2018", "Interview Descriptions": "The process was very comfortable. Being out of state, we conducted an online interview. It was very conversational. I was very pleased with the actual interview and the process. Very pleasant and respectful panel.", "Interview Questions": "Mostly performance related questions relating to the job I was interviewing for. Also, how do I handle diversity in the workplace."}, {"date": "9 Jan 2018", "title": "Graphic Designer, University Advancement Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Western Washington University (Bellingham, WA)", "Interview Descriptions": "I applied for this position online and received a call back four days later. The interview was very casual and included a tour of the office space but did seem a little rushed.", "Interview Questions": "What do you see as your greatest weakness?"}, {"date": "1 Oct 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Western Washington University", "Interview Descriptions": "I was called on the phone and was given details about the internship, it was pretty relaxed. I wasn't 100% sure how much extra work was going to be included in the internship, so I made sure to ask a few questions. Overall was a quick and easy experience.", "Interview Questions": "What is your experience using Windows? "}, {"date": "26 Oct 2017", "title": "IT Specialist II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Western Washington University (Bellingham, WA) in Oct 2017", "Interview Descriptions": "I was scheduled a 30-minute phone interview.  About 3 weeks later, I got call for in-person interview which consisted of a 30-minute \"ice breaker\" with one of the staff member, 1 hour interview with the search committee of 6 people for technical and behavioral questions (including a presentation), and finished off with 45-minute \"open forum\" with 8 of the staff members of the department. The open forum seemed more of an extension of the interview.", "Interview Questions": "How do you handle multi-tasking?"}, {"date": "10 Sept 2018", "title": "Desk Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Western Washington University in Sept 2017", "Interview Descriptions": "First met with several individuals from University Residences back in April or May, but I did not receive the job initially. I chose to be placed in a hiring pool should there be a vacant position, and in September I was invited to interview with a dorm's assistant resident director.", "Interview Questions": "Why do you want to be a desk attendant?"}], [{"date": "12 Dec 2017", "title": "Assistant Director, Ca Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Western Washington University (Bellingham, WA) in Aug 2017", "Interview Descriptions": "The first interview was a phone screen .  The second interview was an in-person, three hour interview with four different groups of stakeholders, including students. Some of the questions for each group were the same and some were different.", "Interview Questions": "Why do you want to work at Western?"}, {"date": "20 Mar 2017", "title": "Office Assistant III Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Western Washington University (Bellingham, WA) in Mar 2017", "Interview Descriptions": "Contacted by email to schedule a telephone interview.  Phone interview lasted 10 minutes.  Contacted by email to schedule in person interview and testing.  Testing consisted of spelling and grammar test, excel spreadsheet test and letter writing proficiency test.  In person interview lasted 30 minutes.", "Interview Questions": "tell us about yourself"}, {"date": "17 Sept 2021", "title": "Academic Student Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Western Washington University in Mar 2017", "Interview Descriptions": "Panel interview, nothing unusual. Several candidates were chosen. Relevant skills were tested and the interview overall felt fair. There was a segment where the candidates had to work together, in order to test our teamwork skills, as this was very important for the role (we had to coordinate for events).", "Interview Questions": "They asked me to create a small on-the-spot presentation and deliver it (10 mins prep time or so)"}, {"date": "23 Sept 2016", "title": "IT Specialist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Western Washington University", "Interview Descriptions": "Panel Interview very fair, there was maybe 30 questions, by the end of it I felt they had a pretty good idea as to what kind of employee I would be. Western reached out to me the following month. my only criticism is that the process was slow.", "Interview Questions": "How do you handle mistakes"}, {"date": "27 Oct 2016", "title": "Diversity Recruitment & Retention Specialist (Education) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Western Washington University in Sept 2016", "Interview Descriptions": "After being selected from the candidate pool, I received a phone call to ask if a particular salary range (up to mid-50s) was acceptable and if I'd like to continue in the interview process. The first interview was a 30 minute phone interview. There were at least 8 individuals on the other line while I interviewed. Individuals included faculty, staff (admissions), and a student.\r\n\r\nI was asked about 10 questions and then given an opportunity to ask my own. What was odd is that I asked 1 question and then was cut off and told we were out of time even though there was 10 minutes left.", "Interview Questions": "How do you distinguish mentoring from advising?\r\nWhat experience do you have working with diverse populations?"}, {"date": "29 May 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Western Washington University (Bellingham, WA) in Sept 2016", "Interview Descriptions": "Cover Letter and Transcripts were required and also being eligible for work study for income budgeting from the school. Very simple and straight forward after meeting with faculty head.", "Interview Questions": "Experience with lab equipment and what characteristics were a strong reason for being hired. "}, {"date": "12 Sept 2016", "title": "Program Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Western Washington University (Bellingham, WA) in Jun 2016", "Interview Descriptions": "The Interview process was very formal with two steps: Phone interview and then In-person interview.  The In-person interview consisted of committee interview, Vice President interview and excel test.", "Interview Questions": "How do you prioritize tasks?"}, {"date": "26 Mar 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Western Washington University (Bellingham, WA) in Mar 2016", "Interview Descriptions": "Submitted application was called within two weeks to set up a time to have an interview. I was told to be prepared to bring my resume and that I would be interviewed in a panel, not just by one person. I was told after the interview I would hear back within two weeks about whether I got the job or not, via Email.", "Interview Questions": "Do you make judgement about people based on first impressions?"}, {"date": "21 Mar 2018", "title": "Student Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Western Washington University (Bellingham, WA) in Mar 2016", "Interview Descriptions": "I submitted my application consisting of a resume, cover letter and references. Afterwards I was contacted and interviewed over skype once and again in person for a second interview. Both times I was interviewed by a panel of three people and asked to run through scenarios that I may encounter in the position.", "Interview Questions": "What is my biggest strength and biggest weakness? "}, {"date": "4 Nov 2015", "title": "Web Applications Developer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Western Washington University (Bellingham, WA) in Oct 2015", "Interview Descriptions": "I was asked for my availability and made an appointment.\r\nThe interview was comprised of a small panel of 2 people in a small room in the administrative building on campus. The interview was a little over an hour long and I heard back from them within a week.", "Interview Questions": "They asked about a 10 behavioral questions and 3 whiteboard questions. \r\nAs long as you have some programming experience you should be fine. "}], [{"date": "23 May 2017", "title": "Graphic Designer (Associated Students Publicity Center) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Western Washington University (Bellingham, WA) in Jun 2015", "Interview Descriptions": "The interview process consists of about 15 questions, most of which are available to preview on the Associated Students website. The interviewers can't ask you any questions they don't ask other candidates and won't ask anything personal.", "Interview Questions": "The AS Has a strong commitment to diversity, inclusion, and being accessible to all Western Students. What does it mean to you to have a commitment to diversity and inclusion? How have you demonstrated that commitment? How would you see yourself demonstrating it in this position?"}, {"date": "23 Aug 2016", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Western Washington University (Bellingham, WA) in Feb 2015", "Interview Descriptions": "I applied many months prior to being called to interview, but the first part of the process was a Skype interview with the Dean of the department and an assistant.  They asked questions pertinent to my field and were very generous and polite - though I felt I had done a terrible job.  I should have prepared more, I think.  I heard a few days later from the program director that I had gotten the position.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "8 Jan 2015", "title": "Web Applications Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Western Washington University", "Interview Descriptions": "Small panel interview. If you have every interviewed with another company for a technical position you probably had a more difficult interview than this one. Just be prepared for some behavioral and technical questions.", "Interview Questions": "Design a website."}, {"date": "12 Feb 2018", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Western Washington University (Bellingham, WA) in Sept 2014", "Interview Descriptions": "I was called in for an interview during orientation. It was pretty standard, with no questions that were particularly tough.The person doing the interview was very nice. I was offered the position on the spot and accepted.", "Interview Questions": "When have you exhibited leadership skills?"}, {"date": "16 May 2014", "title": "Research Assistant - Software Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Western Washington University", "Interview Descriptions": "One face to face interview. Asked about previous work experience, basic computer skills (excel, word) and web development experience, HTML, Adobe Dreamweaver, etc. Stressed emphasis on customer service and student/work balance life", "Interview Questions": "Very straight forward, no curve balls here."}, {"date": "26 May 2015", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Western Washington University (Bellingham, WA) in May 2014", "Interview Descriptions": "2 Steps: Phone & In Person\r\nBoth were panel interviews with 6-8 people on the search committee. The process moved fairly quickly with less than 2 weeks between the phone and in person interviews.", "Interview Questions": "This position will work with others both in person or over the phone.  Sometimes situations can prove to be difficult.  Tell us about a time when you had to communicate under difficult circumstances and how you handled it."}, {"date": "16 Sept 2016", "title": "Graphics Production Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Western Washington University (Bellingham, WA) in May 2014", "Interview Descriptions": "You are interview by three students that are currently in the Associated Students in a 30 minute interview with give or take 15 questions pertaining to your position and diversity.", "Interview Questions": "What does diversity mean to you on campus?"}, {"date": "5 Apr 2017", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Western Washington University (Bellingham, WA) in May 2014", "Interview Descriptions": "The interview process was a basic search committee/panel structure found at most government agencies. It consisted of a phone pre-screen with some members of the panel followed by an in-person onsite interview with the full panel.", "Interview Questions": "Why do you want to work for Western?"}, {"date": "20 Apr 2016", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Western Washington University (Bellingham, WA) in Dec 2013", "Interview Descriptions": "The standard at WWU is that a job is open to Internal Candidates first (anyone who is a permanent position currently), then it goes to any lay offs, then it goes External. They don't review applicants until it closes. If you don't meet the minimum requirements, they wont consider you. No exceptions. You must explain and demonstrate in your cover letter and resume how you meet those requirements. After that, if you are the top candidates, they will interview you on the phone and or in person. It could take 2-6 weeks to hear back for an interview. After that, if you are selected as a finalist they will reach out to your three references. After the interview process it could take an additional 2-4 weeks to get a letter of offer because of the paperwork involved at WWU. They can reach out to you and let you know they are still in the process.", "Interview Questions": "Blah blah department's value is around cultural inclusive and diversity, how has your background prepared you for working in this environment?"}, {"date": "7 Mar 2014", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Western Washington University (Bellingham, WA) in Oct 2013", "Interview Descriptions": "Telephone Interview", "Interview Questions": "Nearly all questions began with: \"What do you find most difficult about....?\""}], [{"date": "20 Apr 2014", "title": "Payroll Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Western Washington University (Bellingham, WA) in Jun 2013", "Interview Descriptions": "There was a phone interview, followed by an in person, panel style interview. I met with 3 people from the payroll department (the supervisor for the position and two potential coworkers). They took turns asking questions. At the end of the interview, they had the person who was leaving the position come in and talk to me about what the position was like.", "Interview Questions": "I was asked what I would do if it was my first day and a project was handed to me without proper instruction and everyone left but it was clear that there was a tight deadline for completion. The asker said that the scenario was not outside the realm of possibility and I wasn't sure she was joking."}, {"date": "1 Sept 2017", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Western Washington University (Bellingham, WA) in Apr 2013", "Interview Descriptions": "Submitted Resume and Cover Letter, did a short assignment, had a 30 min phone interview, came to campus for half day in person interview, conducted a teaching demonstration. It was a long drawn out process that took months.", "Interview Questions": "What's the latest research in the field that you are interested in?"}, {"date": "23 Nov 2015", "title": "Resident Advisor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Western Washington University (Bellingham, WA) in Mar 2013", "Interview Descriptions": "It was a two on one interview with two Residence life superiors. (It has now changed with an initial group interview with other candidates and then a 1:1 interview). It had some very tough questions and you don't hear back until at least a month later. It's harder for women who are applying since they get so many female RAs applying and they can't have female RAs in the all-male residence halls.", "Interview Questions": "What are some of your experiences encouraging diversity in the workplace?"}, {"date": "26 Oct 2016", "title": "Photographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Western Washington University (Bellingham, WA) in Sept 2012", "Interview Descriptions": "Spoke with Supervisor and Design Manager and discussed my portfolio and photography experience. They were both professional and very easy to talk to. They were interested in what I had to share, my values, experience, and physical resume and portfolio. I felt respected, appreciated, and able to speak about my past jobs and current skills and ideas for the photographer position.", "Interview Questions": "How long have you been a photographer, and how could you apply those skills to this job?"}, {"date": "10 May 2012", "title": "Program Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Western Washington University (Bellingham, WA) in Jun 2011", "Interview Descriptions": "Interview process was relaxed, yet comprehensive.  The people were great and the work culture appeared to be cooperative.", "Interview Questions": "What are you most proud of?"}, {"date": "18 Jul 2011", "title": "Customer Service Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Western Washington University (Bellingham, WA) in Jun 2011", "Interview Descriptions": "I applied in person, dropping of the application and resume to the Front Desk. Towards the end of the Academic Term, the department called me saying they would like to interview for the position the next term. On the day of my interview, I showed up to the building a little early and the receptionist wrote down what time I came in and I'm fairly sure a description of how I approached the receptionist. Right when the interview was scheduled to start, I was called into the room where 5 of the current employees were seated down opposite of an empty chair. The interview was a series of situational questions and personality questions. After that interview I was told that I would hear back from the department later that week for a 2nd interview if I made it through this one. I got that call and met with the Front Desk Manager and a building supervisor. They asked more indepth questions about how I would handle various situations and what I would have done differently given different scenarios. After that interview I was told that I would be given a 3rd interview if I passed this one. I got the 3rd interview, but it was more of a team building exorcise with the entire existing staff and 5 interviewees. So preformed a series of team builders. I was then told that the staff would talk about how we fit in with the group. After that I got the job!!", "Interview Questions": "What color is your brain?"}, {"date": "31 Mar 2014", "title": "Desk Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Western Washington University (Bellingham, WA) in May 2010", "Interview Descriptions": "Online Application, was called for an in person interview with the resident advisor.", "Interview Questions": "N/A"}, {"date": "16 Jul 2010", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Western Washington University (Bellingham, WA) in Jun 2008", "Interview Descriptions": "Students in the graduate program applied to be Graduate Assistants.  Some of us were chosen and given interviews with leaders from the specific area of the university at which point a decision was made.", "Interview Questions": "What sort of experience do you have with Adobe/MSOffice/Video Editing?"}]]