[[{"date": "3 Aug 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Augustana Care", "Interview Descriptions": "It was fine. We talked about past jobs and cares. We discussed what the job would entail. I enjoy that we can med pass. It seems like a nice facility. I am excited.", "Interview Questions": "Mostly about past jobs and cares"}, {"date": "18 Jan 2022", "title": "RN NURSE Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Augustana Care", "Interview Descriptions": "Not bad, didn't take long to get hired. The questions were relevant to the job I was applying for. They were very flexible in making appointment.  Looking for caring people.", "Interview Questions": "Tell us one situation where you solved a problem. "}, {"date": "25 Oct 2020", "title": "Supply Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Augustana Care (Apple Valley, MN) in Oct 2020", "Interview Descriptions": "The interview was a phone interview.  It was an ok interview but the lady was very disorganized and was rude. She just kept repeating the questions. The description of this job is not what the job entails.  This job is for stocking all of the nurses' closets in all buildings and going into residences rooms to stock health products in the rooms. The first impression of this place for me is that they wanted someone in school and someone with lots of experience but was described as an entry-level position.", "Interview Questions": "Can you start on Monday?\nHave you worked in a hospital setting?\nDo you have a stocking experience?\nAre you in any educational program now? (This question seemed very important to them)"}, {"date": "8 Dec 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Augustana Care (Hopkins, MN) in Oct 2020", "Interview Descriptions": "Interview process was great. A phone interview was first and followed by an in person interview. A tour of the place was given as well. Staff were all very nice and friendly.", "Interview Questions": "What interest you into the nursing profession? "}, {"date": "15 Aug 2016", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Augustana Care (Hastings, MN) in Feb 2016", "Interview Descriptions": "I was to get certified as a nursing assistant and I would be hired.   I took classes for 2 months and took the state test and passed to become certified.  I had 2 weeks of training on the job and 90 probationary period.  My position was contingent upon me passing this test.  I found the management to be friendly and helpful.", "Interview Questions": "If I felt I could obtain a CNA."}]]