[[{"date": "21 Apr 2023", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Mary Free Bed Rehabilitation Hospital", "Interview Descriptions": "There was an initial prescreen with human resources and then a multi-panel interview with prewritten and standardized questions. There was not much feedback or conversation given at the time of interview.", "Interview Questions": "Multiple scenario questions were asked"}, {"date": "8 Mar 2023", "title": "Physical Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mary Free Bed Rehabilitation Hospital (Cadillac, MI) in Feb 2023", "Interview Descriptions": "I was given a phone interview initially, then moved to an in person interview. They gave me a tour of the OP clinic and IP clinic. After we did a round table interview with the region director, clinic manager, 1 PT, and 1 PTA.", "Interview Questions": "Give an instance where you were working with someone with you did not get along with; how did you solve the problem?"}, {"date": "11 Apr 2022", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mary Free Bed Rehabilitation Hospital", "Interview Descriptions": "Very well run interview process that gave an accurate picture of the role and the organization. The questions were fair and gave an opportunity for strengths and skills to be shared.", "Interview Questions": "What are your strengths with patient care? "}, {"date": "5 Jan 2022", "title": "Patient Care Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mary Free Bed Rehabilitation Hospital in Nov 2021", "Interview Descriptions": "Pretty easy and straightforward inteview. Panel interview with the management team asking about 10-15 behavioral questions.  Lasted about 45 minutes. Not sure if there is there another interview after this one.", "Interview Questions": "What is the most difficult decision you've had to make in the workplace?"}, {"date": "11 Jan 2020", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mary Free Bed Rehabilitation Hospital", "Interview Descriptions": "I was a previous employee so I just had to fill out the application and I did not do a formal interview. I know they now do panel interviews and ask present employees to sit in on the interviews and get their input about the potential employees.", "Interview Questions": "Why do you want to work for the company"}, {"date": "23 Mar 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Mary Free Bed Rehabilitation Hospital (Grand Rapids, MI) in Apr 2018", "Interview Descriptions": "This place is simply the best! Everyone is so nice and encouraging! I trust without a doubt that they will meet my expectations! Professional manners and big smiles! Truly exemplifies restoring hope and freedom", "Interview Questions": "What is your five year goal?"}, {"date": "30 Dec 2018", "title": "Nurse Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mary Free Bed Rehabilitation Hospital (Grand Rapids, MI) in Feb 2018", "Interview Descriptions": "They mostly ask questions about how you've handle a certain situation in the past. Come prepared for the interview and bring a folder with answers to potentially questions. Don't be nervous, they were very kind during the interview process! They also do a peer review where potentially coworkers sit in and ask questions.", "Interview Questions": "Describe a time at work when you did the right thing "}, {"date": "19 Jan 2018", "title": "Medical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mary Free Bed Rehabilitation Hospital", "Interview Descriptions": "The interview process was very quick and easy. Started with a phone conversation from the human resource recruiter and then a phone interview with the team. Very quick and very informative. MFB has great customer service", "Interview Questions": "Was there a time that you needed to deal with an escalated patient or family?"}, {"date": "8 Apr 2019", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Mary Free Bed Rehabilitation Hospital (Grand Rapids, MI) in Mar 2017", "Interview Descriptions": "Productive and relevant. The experience was handled with care and questions that would allows the interviewees to better understand your situational skills and thoughts. Everyone was very friendly, helpful, and understanding.", "Interview Questions": "What did you do when your team member did not perform to their full capability? "}, {"date": "30 Sept 2014", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mary Free Bed Rehabilitation Hospital in Nov 2013", "Interview Descriptions": "it was very short and sweet the manager and the clinic staff was very nice it was lean and everybody else in each department was nice, i like that the hospital is connect to the clinic", "Interview Questions": "N/A"}]]