[[{"date": "27 Mar 2023", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bentley University", "Interview Descriptions": "Very easy process. One phone screen and two rounds of interviews. The overall process was on a longer side. It took almost 3 months between applying and signing the offer.", "Interview Questions": "Previous experience. Why you choose this job to apply to?"}, {"date": "7 Feb 2023", "title": "International Student Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Bentley University", "Interview Descriptions": "Easy interview, talk about your experience and what you can bring to the team. Big on customer service, and your experience as a student. How would you answer to a student when asking about different type of questions", "Interview Questions": "How would you respond a student when they ask this"}, {"date": "6 Oct 2022", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bentley University", "Interview Descriptions": "I applied online and interviewed in person with very nice interviewer! She asked pretty standard questions and was friendly and easy to talk to. The whole process was very organized.", "Interview Questions": "Tell me about yourself/walk through your resume. Describe a time when you overcame a challenge."}, {"date": "26 Oct 2022", "title": "Transfer Student Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Bentley University (Waltham, MA) in Sept 2022", "Interview Descriptions": "very easy to get, very professional but made me comfortable. kind of the same questions over and over again. ended very quickly. Did not end up getting the job but learned from the experience", "Interview Questions": "Tell me about yourself Why do you want this What would you tell transfer students"}, {"date": "28 Nov 2022", "title": "Peer Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bentley University (Waltham, MA) in Sept 2022", "Interview Descriptions": "the interview was held online; quick and sweet; questions were very repetitive; didnt last more than 15 minutes; didnt get the job; overall a positive experience although could be improve but asking more general questions", "Interview Questions": "How would you help students transferring in?"}, {"date": "11 Apr 2022", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Bentley University", "Interview Descriptions": "The process was very through with all interviewers showing respect towards the selection. Involved a group activity where you had to collaborate and an individual process where they asked about skills and qualities", "Interview Questions": "How would you describe yourself to others"}, {"date": "11 Oct 2022", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bentley University in Mar 2022", "Interview Descriptions": "The person doing the phone interviews through HR was easy to talk to and clear and transparent about the interview process. The group I interviewed with on zoom were somewhat rude. I could see them multitasking and doing other work during the call, and they seemed annoyed that they had to meet with me. I got the feeling they already had someone they knew in mind and wanted to rush me off the call.", "Interview Questions": "Typical interview questions on telling about a time you overcame a challenge"}, {"date": "20 Feb 2022", "title": "Language Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Bentley University", "Interview Descriptions": "I was referred by a friend to apply for the position, interviewed with the head of the language lab in person. Heard back a couple of weeks after with an offer.", "Interview Questions": "Purely behavioral questions and no questions on my language proficiency"}, {"date": "14 Feb 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bentley University", "Interview Descriptions": "Three Virtual Interviews, each with multiple staff members. Each interview was well structures and stuck to the time constraints.  had really good questions and follow-up questions. Post-Interview follow-up was as described.", "Interview Questions": "Why do you want to take on this role?"}, {"date": "8 Feb 2022", "title": "Development Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Bentley University", "Interview Descriptions": "Team was unsure of the actual responsibilities of the position, lots of different information from different interviewers. Took many interviews to get full picture of position. Required a test project too. So much time was spent in the interview process and lacked clarity. Unfortunately too many red flags for me.", "Interview Questions": "How would you handle [insert situation here]? Asked to brainstorm innovative ideas on the spot. "}], [{"date": "27 Jan 2022", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bentley University", "Interview Descriptions": "Wonderful! Very thorough, informative, and overall good. It included a number of interviews and helpful sessions. I met with numerous faculty at different levels, and they were all very encouraging.", "Interview Questions": "What is your approach to teaching and how would you teach business students? "}, {"date": "24 Mar 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Bentley University (Boston, MA) in Sept 2021", "Interview Descriptions": "Got the interview invitation very quick. The interviewer is very nice and only ask about my past experiences and technical skills. The whole process is very efficient. No behavioral questions or technical questions.", "Interview Questions": "Past experiences and skills, such as softwares and programming languages. "}, {"date": "24 Mar 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Bentley University (Boston, MA) in Sept 2021", "Interview Descriptions": "Got the interview invitation very quick. The interviewer is very nice and only ask about my past experiences and technical skills. The whole process is very efficient. No behavioral questions or technical questions.", "Interview Questions": "Past experiences and skills, such as softwares and programming languages. "}, {"date": "27 Aug 2021", "title": "HR Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bentley University (Waltham, MA) in Jul 2021", "Interview Descriptions": "I applied online and was contacted for a phone screening with the recruiter a couple weeks later. After discussing general aspects of the position and benefits offered, I had two rounds of interviews with the hiring manager and other members of the team. Overall, everyone was communicative and transparent about the process.", "Interview Questions": "How do you manage multiple projects/deadlines?\nWhere do you see yourself regarding career goals in 5 years?\nDescribe a situation where you had to deal with conflict and how you resolved it."}, {"date": "2 Dec 2021", "title": "Assistant Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bentley University in Jul 2021", "Interview Descriptions": "Inclusive and easy to navigate. I was in communication with many people in the athletic department and I was easy to talk with all of them.  I was able to complete it all online due to covid so it was convenient.", "Interview Questions": "What made me interested in the role at Bentley? "}, {"date": "23 Jun 2021", "title": "Career Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bentley University", "Interview Descriptions": "Started with an HR phone screen and then two rounds of interviews with managers and team members.  All behavioral and resume questions and very conversational.  Great balance between learning about me as a candidate and telling me about Bentley and the role.  Came away with a solid grasp of the role & team by the end of the interview process.", "Interview Questions": "Tell me about yourself?\nHow would you advise a student?"}, {"date": "24 May 2021", "title": "Bentley Person Support Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Bentley University (Waltham, MA)", "Interview Descriptions": "Good process. very kind and aware of the experience. much was learned and acquired with the interviewer. No complaints whatsoever. qualitative and quantitative skills are needed in this rapidly changing environment. I enjoyed the process and collaboration of all parties involved. Very good job. Thorough process and challenged constantly. need a growth mindset. I thought it was very good you need to be aware of your surroundings and work well with others and a team approach is highly encouraged and is essential in this job market. Many times your cycle throughout different spots to interview but it was good for thinking on your feet and adapting to anything that would come your way. Furthermore, it was a stress-free environment and it was very good. They provide support and many benefits as well. You will learn a lot in come out of it as stronger person and more prepared for the business world.", "Interview Questions": "Describe an experience where you took on a leadership role?"}, {"date": "12 Apr 2022", "title": "Trading Room Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Bentley University in Jan 2021", "Interview Descriptions": "Ad hoc Bloomberg and Factset questions about functions and technology. Also, general questions to explore the depth of knowledge in financial markets. Two senior analysts conducted the first round and the hiring manager conducted the second round.", "Interview Questions": "Q: Pitch an AAPL Bond Maturing in 10 years on Bloomberg"}, {"date": "27 Aug 2020", "title": "Client Services Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bentley University", "Interview Descriptions": "* Met contact at higher-ed job fair; applied via web \n* Phone screen interview with supervisor\n* Face to face  interview with supervisor, division peers and employees\n* Face to face  interview with division vice-president", "Interview Questions": "* What will the biggest challenge for this job be?\n* Strengths/weaknesses"}, {"date": "8 Mar 2021", "title": "Atc Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bentley University in Aug 2020", "Interview Descriptions": "the process took 20 mins where i spoke to my supervisor right now and it was very pleasant. i belive it was one round through zoom and  I just talked about my experience and why it is a good fit for me", "Interview Questions": "tell me about your self "}], [{"date": "29 Dec 2019", "title": "Technology Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bentley University", "Interview Descriptions": "Very easy and simple interview, few questions were asked by Molly Gilroy. The recruiter just wanted to know your technology experience and your communication ability. But be careful, Molly is a control freak!!", "Interview Questions": "Do you have any Zoom using experience?"}, {"date": "2 May 2019", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bentley University", "Interview Descriptions": "It wasn't too bad, it was all about your work experience and what you have done. I believe it was straight forward in understanding the work and it felt great.", "Interview Questions": "Tell me about your experiences"}, {"date": "13 Jan 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Bentley University (Waltham, MA) in May 2019", "Interview Descriptions": "The interview was easy going and straight forward. I was asked typical professional and personal questions. The interviewer referred to my resume multiple times during the process. She was very personable!", "Interview Questions": "Describe a time when you overcame a challenge."}, {"date": "4 Apr 2022", "title": "Senior Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Bentley University (Waltham, MA) in Apr 2019", "Interview Descriptions": "The interview process at Bentley University varies throughout different departments, but my interview was fairly casual. I met with my boss that reported to directly, and because they were short on staff I was hired on the spot.", "Interview Questions": "Describe a situation where you had to solve a problem under stressful circumstances"}, {"date": "25 Mar 2021", "title": "International Student Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bentley University (Waltham, MA) in Nov 2018", "Interview Descriptions": "Overall, great experience! Very organized and comprehensive of the role, university, and expectations. Interview process required meeting with internal department members, colleagues from other departments at the university, and students of the university.", "Interview Questions": "How do you see yourself supporting international students in this role?"}, {"date": "28 Jun 2018", "title": "Admissions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Bentley University", "Interview Descriptions": "Completed two phone screens with the same recruiter which covered the same questions and information on both calls. Recruiter was dismissive of professional history because my experience apparently was from an inferior school. I was never followed up with after two phone calls. Needless to say, I wasn’t interested in moving forward anyways.", "Interview Questions": "The questions were incredibly quantitative in nature."}, {"date": "19 Jun 2018", "title": "Teaching Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Bentley University", "Interview Descriptions": "Got an email about an interview for teaching assistant. Emailed back immediately, never hear back. Emailed again within a week. No reply. Later found out they already hired someone. It's kind of funny because here at Bentley they teach you that a good employer will always get back to you.", "Interview Questions": "Please let us know when you are available for an interview."}, {"date": "27 Apr 2018", "title": "Digital Media Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bentley University in Apr 2018", "Interview Descriptions": "Applied on their website and got an email to schedule a phone interview about three weeks later. The phone interview was pretty typical, about twenty minutes or so. I really appreciated that the HR rep I spoke to was fully up-front about the salary range for the position to make sure it was within what I was looking for. He said that I should hear from them either for next steps or otherwise by the end of the following week, and I did. I didn't get called in for an in-person interview, but I felt good about the process.", "Interview Questions": "He pressed a little about where I was in my job search as a whole, how wide I was casting my net, etc."}, {"date": "11 May 2017", "title": "Assistant Director of Admission Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bentley University", "Interview Descriptions": "Applied online in February - two weeks later received an email to set up a phone interview  with HR for the following week. \r\nA few days after the phone interview I received an email from HR with an invitation to campus. I came to campus about two weeks later and met with two senior staff members. \r\nA few days after that I received a invitation to come to campus a second time for the final round. About  two weeks later I had a final interview with the director, then met with the person who would be my supervisor, followed by a student lead tour, and then a final meeting with HR to discuss salary, starting date, benefits, and timeline for hearing back. \r\n\r\nI was told I would hear back within two weeks, at the very latest, either way. The HR rep was very insistent that I would hear from her, personally, with news on what was happening.\r\nAbout two weeks had passed and I had emailed the HR rep to see if there was any update. After about a week of no response,  I called and left a voice message and I sent one last follow up email which was not returned. A few days later I emailed the woman that would have served as my direct supervisor, as she had given me her business card during the interview and told me to reach out with any questions at all. A week later I heard back from her as she was out of the office traveling for work - she insisted that it should not be much longer, and asked if I was able to \"hold on\", as decisions should be finalized by the end of the week, at the latest.  \r\nThe end of the week came and went with no word from anyone. About a week and a half later, I sent an email to the director, who also gave me her contact information, asking if their was any update on final decisions. She responded almost immediately with a very friendly greeting stating \"That position has already been filled by an alumni, I am so sorry that no one ever informed you of that!\".\r\n\r\nOverall, this was the worst interview experience I have ever had. I have never heard of a finalist not hearing back. It was very challenging having to ask other institutions I was receiving offers from at the same time for more time, to only not ever hear back from Bentley. My issue lies with HR, as I was told I would hear directly from them (all offers come from HR at Bentley), and never heard a word from them after 3 contact attempts. As a 1st round candidate, I could understand, but as a finalist who had just spent 6 hours on campus, this is unacceptable and flat out rude and unprofessional.", "Interview Questions": "What I knew about the school."}, {"date": "28 Nov 2016", "title": "Associate Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Bentley University (Waltham, MA)", "Interview Descriptions": "After a 5 minute talk with HR over the phone, had a 3 hour long interview on campus. Met with a few different staff members and discussed experience, goals of department, mutual connections, etc. The interview seemed to go pretty well, in my opinion, but I didn't get my hopes up because I'm sure they had very qualified candidates.\r\n\r\nGlad I wasn't holding my breath. It's been close to five months since I applied and the online portal has changed from \"Finalist\" to \"Hold B\" to \"In Progress\" back and forth about a dozen times now, no rhyme or reason, no closure and no explanation of what each status actually means. Nobody has reached out to me and, worse, all have continued to ignore my requests for any kind of status update.\r\n\r\nI've clearly moved on after this amount of time and have accepted a job elsewhere, but felt the need to express my disappointment and, frankly, my complete shock at how the hiring process at Bentley was handled. It's a pity because I enjoyed the team and could have seen myself working there, but after this whole mess I don't think it would ever be a good fit. I generally expect my teammates and colleagues to be responsive and respectful, even if a clear answer isn't available. Bad first impressions tend to stick.", "Interview Questions": "General questions about my experience and how it applies to their job/mission. Nothing \"out there\" or unexpected, fairly easy/standard interview."}], [{"date": "14 Dec 2016", "title": "DA At UXC Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Bentley University (Waltham, MA) in Nov 2016", "Interview Descriptions": "Very casual atmosphere. The interviewer is really smooth and no stressful at all. Basically you were asked to share your experience in the past and what you expect in the future, especially at UXC.", "Interview Questions": "Why do you want to work here?"}, {"date": "17 May 2016", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Bentley University in Nov 2015", "Interview Descriptions": "Easy interview. They asked 8 questions. The interview lasted 15-30 min. The interviewer are the Resident director and a current Resident assistant. They are really good people, do not be scared. Be on time, dress appropriately, and be confident. First 5 mins is about yourself. For example, where are you from, etc.", "Interview Questions": "Personal experience"}, {"date": "12 Jul 2015", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bentley University (Waltham, MA)", "Interview Descriptions": "There was an initial screening over the phone which was not difficult.  A week later, they invited me on-campus for one-on-one interviews;  I was there for about two hours.  Everything went well and they asked me to return for a second visit to meet with students, have a group interview with potential colleagues, and to offer a formal presentation.  Everyone was very pleasant, very professional.", "Interview Questions": "Questions were all standard interview questions, nothing difficult or out of left field."}, {"date": "12 Apr 2019", "title": "Computer Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Bentley University (Waltham, MA) in May 2015", "Interview Descriptions": "I applied online, they emailed me for an on campus interview. When I arrived I was interviewed by the helpdesk manager and the lead helpdesk technician. They were both very nice, and they mostly asked me questions about my resume.", "Interview Questions": "What my experience was with hardware"}, {"date": "12 Feb 2016", "title": "Financial Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Bentley University (Waltham, MA) in Dec 2014", "Interview Descriptions": "Very fast process. I was introduced to the opportunity by an employment agency recruiter. They wanted somebody available right away. So, I got an offer next morning. Very comfortable atmosphere during interview. Great interviewers. It was before Christmas, the office was all decorated, it gave me a feeling like at home. I could relax, wasn't nervous and talked with my interviewers like with people whom I've know for a long time.", "Interview Questions": "Why do you want to work in Higher Education industry?"}, {"date": "14 Apr 2014", "title": "Help Desk Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Bentley University", "Interview Descriptions": "One Interview", "Interview Questions": "Just talked about the resume"}, {"date": "24 Feb 2014", "title": "Help Desk/Computer Technical Support Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Bentley University (Waltham, MA)", "Interview Descriptions": "Cucchi, Suzanne (Admin. & Technical Coordinator) contacted me to interview with Fred Bachofner, The Manager of the Help Desk and Computing Services. \r\n\r\nI spoke to Fred in the interviewed and he informed he wanted to hire a person who would take a pay cut as the position would only pay about $18 Hourly. He Asked me a few IT related questions, which I answered correctly. ( I have about 10 yrs in the IT industry). After the interview process ended (20 minutes) he mentioned he would notified me the next week of the next step.\r\n\r\nI waited the 1 week and not response back from Fred. I email him the next week and still no response. By this time all the high hopes I had being part of this institution were fading away as I realized that these folks were not going to get back at me.  Weeks later I review their website portal and the position was still available but I could not apply again since I already had been interview. This position was open for weeks/months - until.\r\n\r\n3 months later I received an email notifying me that the position was filled.\r\n\r\nI personally think that i should've been at least notified immediately that I did not qualified for this position if they had determined that my 10yrs strong background did not meed their needs. \r\n\r\nBentley University has poor ethical morals for folks looking for a job. they have no respect for people actively seeking employment opportunities and cannot be trusted as a responsible institution due to the fact that they lack commonsense, common cortesy and and deeply self-centered in making more money and reducing cost by paying the least amount of wages as possible. \r\n\r\nI used to view this institution as credible but now a-days they are a pathetic, commercial dollar store enterprise without common courtesy.", "Interview Questions": "we are paying around 15-18 hourly - how do you feel about taking a pay decrease ??"}, {"date": "12 Nov 2015", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Bentley University (Waltham, MA) in Jan 2013", "Interview Descriptions": "It took about 3 months in total from initial reach out to starting in my new role. I met with a team of people; the final interview day was about 5 hours.", "Interview Questions": "Strengths and Weaknesses\r\nHow do you handle conflict?"}, {"date": "11 Dec 2014", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 6 weeks. I interviewed at Bentley University in Jan 2012", "Interview Descriptions": "I applied online and it was through the university website. All the guidelines were on the Bentley University website. I was put on the waitlist then the year after I was chosen to be a RA.", "Interview Questions": "If you were a superhero, who would you want to be and why?"}, {"date": "7 Jun 2015", "title": "Undergraduate Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Bentley University (Waltham, MA) in Oct 2011", "Interview Descriptions": "The entire hiring process was very quick and easy; I applied online through Bentley's employment website and was contacted by the supervisor within a couple of days for an interview.  During the interview, the supervisor was extremely friendly and kind.  She further explained the position to me, introduced me to the other assistants in the department, and asked me about a few basic qualifications (ex. Microsoft Office).  Since the position was pretty basic as far as qualifications and skills, I believe the interview was more focused on finding a candidate that was friendly and professional.  Within the week, I was hired.  Overall, the position was a hugely positive aspect of my college career and I would recommend it to any student applying for the position!", "Interview Questions": "Would you be free to work primarily on Tuesdays and Thursdays?"}], [{"date": "26 Feb 2012", "title": "Department Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 1 day. I interviewed at Bentley University (Waltham, MA) in Jan 2010", "Interview Descriptions": "They test your knowledge or current events and the effect on the capital markets.", "Interview Questions": "Na"}, {"date": "1 Sept 2010", "title": "Office Aid Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bentley University (Waltham, MA) in Sept 2009", "Interview Descriptions": "Came in at time requested in email. was told about the job.", "Interview Questions": "No Questions asked."}, {"date": "25 May 2010", "title": "Software Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Bentley University (Waltham, MA) in Feb 2008", "Interview Descriptions": "I met with the supervisor and we talked about my qualifications, interests, and hobbies. They seemed to match what she was looking for in being apart of the team.", "Interview Questions": "N/A"}]][[{"date": "27 Mar 2023", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bentley University", "Interview Descriptions": "Very easy process. One phone screen and two rounds of interviews. The overall process was on a longer side. It took almost 3 months between applying and signing the offer.", "Interview Questions": "Previous experience. Why you choose this job to apply to?"}, {"date": "7 Feb 2023", "title": "International Student Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Bentley University", "Interview Descriptions": "Easy interview, talk about your experience and what you can bring to the team. Big on customer service, and your experience as a student. How would you answer to a student when asking about different type of questions", "Interview Questions": "How would you respond a student when they ask this"}, {"date": "6 Oct 2022", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bentley University", "Interview Descriptions": "I applied online and interviewed in person with very nice interviewer! She asked pretty standard questions and was friendly and easy to talk to. The whole process was very organized.", "Interview Questions": "Tell me about yourself/walk through your resume. Describe a time when you overcame a challenge."}, {"date": "26 Oct 2022", "title": "Transfer Student Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Bentley University (Waltham, MA) in Sept 2022", "Interview Descriptions": "very easy to get, very professional but made me comfortable. kind of the same questions over and over again. ended very quickly. Did not end up getting the job but learned from the experience", "Interview Questions": "Tell me about yourself Why do you want this What would you tell transfer students"}, {"date": "28 Nov 2022", "title": "Peer Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bentley University (Waltham, MA) in Sept 2022", "Interview Descriptions": "the interview was held online; quick and sweet; questions were very repetitive; didnt last more than 15 minutes; didnt get the job; overall a positive experience although could be improve but asking more general questions", "Interview Questions": "How would you help students transferring in?"}, {"date": "11 Apr 2022", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Bentley University", "Interview Descriptions": "The process was very through with all interviewers showing respect towards the selection. Involved a group activity where you had to collaborate and an individual process where they asked about skills and qualities", "Interview Questions": "How would you describe yourself to others"}, {"date": "11 Oct 2022", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bentley University in Mar 2022", "Interview Descriptions": "The person doing the phone interviews through HR was easy to talk to and clear and transparent about the interview process. The group I interviewed with on zoom were somewhat rude. I could see them multitasking and doing other work during the call, and they seemed annoyed that they had to meet with me. I got the feeling they already had someone they knew in mind and wanted to rush me off the call.", "Interview Questions": "Typical interview questions on telling about a time you overcame a challenge"}, {"date": "20 Feb 2022", "title": "Language Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Bentley University", "Interview Descriptions": "I was referred by a friend to apply for the position, interviewed with the head of the language lab in person. Heard back a couple of weeks after with an offer.", "Interview Questions": "Purely behavioral questions and no questions on my language proficiency"}, {"date": "14 Feb 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bentley University", "Interview Descriptions": "Three Virtual Interviews, each with multiple staff members. Each interview was well structures and stuck to the time constraints.  had really good questions and follow-up questions. Post-Interview follow-up was as described.", "Interview Questions": "Why do you want to take on this role?"}, {"date": "8 Feb 2022", "title": "Development Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Bentley University", "Interview Descriptions": "Team was unsure of the actual responsibilities of the position, lots of different information from different interviewers. Took many interviews to get full picture of position. Required a test project too. So much time was spent in the interview process and lacked clarity. Unfortunately too many red flags for me.", "Interview Questions": "How would you handle [insert situation here]? Asked to brainstorm innovative ideas on the spot. "}], [{"date": "27 Jan 2022", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bentley University", "Interview Descriptions": "Wonderful! Very thorough, informative, and overall good. It included a number of interviews and helpful sessions. I met with numerous faculty at different levels, and they were all very encouraging.", "Interview Questions": "What is your approach to teaching and how would you teach business students? "}, {"date": "24 Mar 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Bentley University (Boston, MA) in Sept 2021", "Interview Descriptions": "Got the interview invitation very quick. The interviewer is very nice and only ask about my past experiences and technical skills. The whole process is very efficient. No behavioral questions or technical questions.", "Interview Questions": "Past experiences and skills, such as softwares and programming languages. "}, {"date": "24 Mar 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Bentley University (Boston, MA) in Sept 2021", "Interview Descriptions": "Got the interview invitation very quick. The interviewer is very nice and only ask about my past experiences and technical skills. The whole process is very efficient. No behavioral questions or technical questions.", "Interview Questions": "Past experiences and skills, such as softwares and programming languages. "}, {"date": "27 Aug 2021", "title": "HR Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bentley University (Waltham, MA) in Jul 2021", "Interview Descriptions": "I applied online and was contacted for a phone screening with the recruiter a couple weeks later. After discussing general aspects of the position and benefits offered, I had two rounds of interviews with the hiring manager and other members of the team. Overall, everyone was communicative and transparent about the process.", "Interview Questions": "How do you manage multiple projects/deadlines?\nWhere do you see yourself regarding career goals in 5 years?\nDescribe a situation where you had to deal with conflict and how you resolved it."}, {"date": "2 Dec 2021", "title": "Assistant Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bentley University in Jul 2021", "Interview Descriptions": "Inclusive and easy to navigate. I was in communication with many people in the athletic department and I was easy to talk with all of them.  I was able to complete it all online due to covid so it was convenient.", "Interview Questions": "What made me interested in the role at Bentley? "}, {"date": "23 Jun 2021", "title": "Career Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bentley University", "Interview Descriptions": "Started with an HR phone screen and then two rounds of interviews with managers and team members.  All behavioral and resume questions and very conversational.  Great balance between learning about me as a candidate and telling me about Bentley and the role.  Came away with a solid grasp of the role & team by the end of the interview process.", "Interview Questions": "Tell me about yourself?\nHow would you advise a student?"}, {"date": "24 May 2021", "title": "Bentley Person Support Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Bentley University (Waltham, MA)", "Interview Descriptions": "Good process. very kind and aware of the experience. much was learned and acquired with the interviewer. No complaints whatsoever. qualitative and quantitative skills are needed in this rapidly changing environment. I enjoyed the process and collaboration of all parties involved. Very good job. Thorough process and challenged constantly. need a growth mindset. I thought it was very good you need to be aware of your surroundings and work well with others and a team approach is highly encouraged and is essential in this job market. Many times your cycle throughout different spots to interview but it was good for thinking on your feet and adapting to anything that would come your way. Furthermore, it was a stress-free environment and it was very good. They provide support and many benefits as well. You will learn a lot in come out of it as stronger person and more prepared for the business world.", "Interview Questions": "Describe an experience where you took on a leadership role?"}, {"date": "12 Apr 2022", "title": "Trading Room Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Bentley University in Jan 2021", "Interview Descriptions": "Ad hoc Bloomberg and Factset questions about functions and technology. Also, general questions to explore the depth of knowledge in financial markets. Two senior analysts conducted the first round and the hiring manager conducted the second round.", "Interview Questions": "Q: Pitch an AAPL Bond Maturing in 10 years on Bloomberg"}, {"date": "27 Aug 2020", "title": "Client Services Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bentley University", "Interview Descriptions": "* Met contact at higher-ed job fair; applied via web \n* Phone screen interview with supervisor\n* Face to face  interview with supervisor, division peers and employees\n* Face to face  interview with division vice-president", "Interview Questions": "* What will the biggest challenge for this job be?\n* Strengths/weaknesses"}, {"date": "8 Mar 2021", "title": "Atc Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bentley University in Aug 2020", "Interview Descriptions": "the process took 20 mins where i spoke to my supervisor right now and it was very pleasant. i belive it was one round through zoom and  I just talked about my experience and why it is a good fit for me", "Interview Questions": "tell me about your self "}], [{"date": "29 Dec 2019", "title": "Technology Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bentley University", "Interview Descriptions": "Very easy and simple interview, few questions were asked by Molly Gilroy. The recruiter just wanted to know your technology experience and your communication ability. But be careful, Molly is a control freak!!", "Interview Questions": "Do you have any Zoom using experience?"}, {"date": "2 May 2019", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bentley University", "Interview Descriptions": "It wasn't too bad, it was all about your work experience and what you have done. I believe it was straight forward in understanding the work and it felt great.", "Interview Questions": "Tell me about your experiences"}, {"date": "13 Jan 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Bentley University (Waltham, MA) in May 2019", "Interview Descriptions": "The interview was easy going and straight forward. I was asked typical professional and personal questions. The interviewer referred to my resume multiple times during the process. She was very personable!", "Interview Questions": "Describe a time when you overcame a challenge."}, {"date": "4 Apr 2022", "title": "Senior Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Bentley University (Waltham, MA) in Apr 2019", "Interview Descriptions": "The interview process at Bentley University varies throughout different departments, but my interview was fairly casual. I met with my boss that reported to directly, and because they were short on staff I was hired on the spot.", "Interview Questions": "Describe a situation where you had to solve a problem under stressful circumstances"}, {"date": "25 Mar 2021", "title": "International Student Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bentley University (Waltham, MA) in Nov 2018", "Interview Descriptions": "Overall, great experience! Very organized and comprehensive of the role, university, and expectations. Interview process required meeting with internal department members, colleagues from other departments at the university, and students of the university.", "Interview Questions": "How do you see yourself supporting international students in this role?"}, {"date": "28 Jun 2018", "title": "Admissions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Bentley University", "Interview Descriptions": "Completed two phone screens with the same recruiter which covered the same questions and information on both calls. Recruiter was dismissive of professional history because my experience apparently was from an inferior school. I was never followed up with after two phone calls. Needless to say, I wasn’t interested in moving forward anyways.", "Interview Questions": "The questions were incredibly quantitative in nature."}, {"date": "19 Jun 2018", "title": "Teaching Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Bentley University", "Interview Descriptions": "Got an email about an interview for teaching assistant. Emailed back immediately, never hear back. Emailed again within a week. No reply. Later found out they already hired someone. It's kind of funny because here at Bentley they teach you that a good employer will always get back to you.", "Interview Questions": "Please let us know when you are available for an interview."}, {"date": "27 Apr 2018", "title": "Digital Media Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bentley University in Apr 2018", "Interview Descriptions": "Applied on their website and got an email to schedule a phone interview about three weeks later. The phone interview was pretty typical, about twenty minutes or so. I really appreciated that the HR rep I spoke to was fully up-front about the salary range for the position to make sure it was within what I was looking for. He said that I should hear from them either for next steps or otherwise by the end of the following week, and I did. I didn't get called in for an in-person interview, but I felt good about the process.", "Interview Questions": "He pressed a little about where I was in my job search as a whole, how wide I was casting my net, etc."}, {"date": "11 May 2017", "title": "Assistant Director of Admission Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bentley University", "Interview Descriptions": "Applied online in February - two weeks later received an email to set up a phone interview  with HR for the following week. \r\nA few days after the phone interview I received an email from HR with an invitation to campus. I came to campus about two weeks later and met with two senior staff members. \r\nA few days after that I received a invitation to come to campus a second time for the final round. About  two weeks later I had a final interview with the director, then met with the person who would be my supervisor, followed by a student lead tour, and then a final meeting with HR to discuss salary, starting date, benefits, and timeline for hearing back. \r\n\r\nI was told I would hear back within two weeks, at the very latest, either way. The HR rep was very insistent that I would hear from her, personally, with news on what was happening.\r\nAbout two weeks had passed and I had emailed the HR rep to see if there was any update. After about a week of no response,  I called and left a voice message and I sent one last follow up email which was not returned. A few days later I emailed the woman that would have served as my direct supervisor, as she had given me her business card during the interview and told me to reach out with any questions at all. A week later I heard back from her as she was out of the office traveling for work - she insisted that it should not be much longer, and asked if I was able to \"hold on\", as decisions should be finalized by the end of the week, at the latest.  \r\nThe end of the week came and went with no word from anyone. About a week and a half later, I sent an email to the director, who also gave me her contact information, asking if their was any update on final decisions. She responded almost immediately with a very friendly greeting stating \"That position has already been filled by an alumni, I am so sorry that no one ever informed you of that!\".\r\n\r\nOverall, this was the worst interview experience I have ever had. I have never heard of a finalist not hearing back. It was very challenging having to ask other institutions I was receiving offers from at the same time for more time, to only not ever hear back from Bentley. My issue lies with HR, as I was told I would hear directly from them (all offers come from HR at Bentley), and never heard a word from them after 3 contact attempts. As a 1st round candidate, I could understand, but as a finalist who had just spent 6 hours on campus, this is unacceptable and flat out rude and unprofessional.", "Interview Questions": "What I knew about the school."}, {"date": "28 Nov 2016", "title": "Associate Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Bentley University (Waltham, MA)", "Interview Descriptions": "After a 5 minute talk with HR over the phone, had a 3 hour long interview on campus. Met with a few different staff members and discussed experience, goals of department, mutual connections, etc. The interview seemed to go pretty well, in my opinion, but I didn't get my hopes up because I'm sure they had very qualified candidates.\r\n\r\nGlad I wasn't holding my breath. It's been close to five months since I applied and the online portal has changed from \"Finalist\" to \"Hold B\" to \"In Progress\" back and forth about a dozen times now, no rhyme or reason, no closure and no explanation of what each status actually means. Nobody has reached out to me and, worse, all have continued to ignore my requests for any kind of status update.\r\n\r\nI've clearly moved on after this amount of time and have accepted a job elsewhere, but felt the need to express my disappointment and, frankly, my complete shock at how the hiring process at Bentley was handled. It's a pity because I enjoyed the team and could have seen myself working there, but after this whole mess I don't think it would ever be a good fit. I generally expect my teammates and colleagues to be responsive and respectful, even if a clear answer isn't available. Bad first impressions tend to stick.", "Interview Questions": "General questions about my experience and how it applies to their job/mission. Nothing \"out there\" or unexpected, fairly easy/standard interview."}], [{"date": "14 Dec 2016", "title": "DA At UXC Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Bentley University (Waltham, MA) in Nov 2016", "Interview Descriptions": "Very casual atmosphere. The interviewer is really smooth and no stressful at all. Basically you were asked to share your experience in the past and what you expect in the future, especially at UXC.", "Interview Questions": "Why do you want to work here?"}, {"date": "17 May 2016", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Bentley University in Nov 2015", "Interview Descriptions": "Easy interview. They asked 8 questions. The interview lasted 15-30 min. The interviewer are the Resident director and a current Resident assistant. They are really good people, do not be scared. Be on time, dress appropriately, and be confident. First 5 mins is about yourself. For example, where are you from, etc.", "Interview Questions": "Personal experience"}, {"date": "12 Jul 2015", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bentley University (Waltham, MA)", "Interview Descriptions": "There was an initial screening over the phone which was not difficult.  A week later, they invited me on-campus for one-on-one interviews;  I was there for about two hours.  Everything went well and they asked me to return for a second visit to meet with students, have a group interview with potential colleagues, and to offer a formal presentation.  Everyone was very pleasant, very professional.", "Interview Questions": "Questions were all standard interview questions, nothing difficult or out of left field."}, {"date": "12 Apr 2019", "title": "Computer Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Bentley University (Waltham, MA) in May 2015", "Interview Descriptions": "I applied online, they emailed me for an on campus interview. When I arrived I was interviewed by the helpdesk manager and the lead helpdesk technician. They were both very nice, and they mostly asked me questions about my resume.", "Interview Questions": "What my experience was with hardware"}, {"date": "12 Feb 2016", "title": "Financial Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Bentley University (Waltham, MA) in Dec 2014", "Interview Descriptions": "Very fast process. I was introduced to the opportunity by an employment agency recruiter. They wanted somebody available right away. So, I got an offer next morning. Very comfortable atmosphere during interview. Great interviewers. It was before Christmas, the office was all decorated, it gave me a feeling like at home. I could relax, wasn't nervous and talked with my interviewers like with people whom I've know for a long time.", "Interview Questions": "Why do you want to work in Higher Education industry?"}, {"date": "14 Apr 2014", "title": "Help Desk Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Bentley University", "Interview Descriptions": "One Interview", "Interview Questions": "Just talked about the resume"}, {"date": "24 Feb 2014", "title": "Help Desk/Computer Technical Support Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Bentley University (Waltham, MA)", "Interview Descriptions": "Cucchi, Suzanne (Admin. & Technical Coordinator) contacted me to interview with Fred Bachofner, The Manager of the Help Desk and Computing Services. \r\n\r\nI spoke to Fred in the interviewed and he informed he wanted to hire a person who would take a pay cut as the position would only pay about $18 Hourly. He Asked me a few IT related questions, which I answered correctly. ( I have about 10 yrs in the IT industry). After the interview process ended (20 minutes) he mentioned he would notified me the next week of the next step.\r\n\r\nI waited the 1 week and not response back from Fred. I email him the next week and still no response. By this time all the high hopes I had being part of this institution were fading away as I realized that these folks were not going to get back at me.  Weeks later I review their website portal and the position was still available but I could not apply again since I already had been interview. This position was open for weeks/months - until.\r\n\r\n3 months later I received an email notifying me that the position was filled.\r\n\r\nI personally think that i should've been at least notified immediately that I did not qualified for this position if they had determined that my 10yrs strong background did not meed their needs. \r\n\r\nBentley University has poor ethical morals for folks looking for a job. they have no respect for people actively seeking employment opportunities and cannot be trusted as a responsible institution due to the fact that they lack commonsense, common cortesy and and deeply self-centered in making more money and reducing cost by paying the least amount of wages as possible. \r\n\r\nI used to view this institution as credible but now a-days they are a pathetic, commercial dollar store enterprise without common courtesy.", "Interview Questions": "we are paying around 15-18 hourly - how do you feel about taking a pay decrease ??"}, {"date": "12 Nov 2015", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Bentley University (Waltham, MA) in Jan 2013", "Interview Descriptions": "It took about 3 months in total from initial reach out to starting in my new role. I met with a team of people; the final interview day was about 5 hours.", "Interview Questions": "Strengths and Weaknesses\r\nHow do you handle conflict?"}, {"date": "11 Dec 2014", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 6 weeks. I interviewed at Bentley University in Jan 2012", "Interview Descriptions": "I applied online and it was through the university website. All the guidelines were on the Bentley University website. I was put on the waitlist then the year after I was chosen to be a RA.", "Interview Questions": "If you were a superhero, who would you want to be and why?"}, {"date": "7 Jun 2015", "title": "Undergraduate Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Bentley University (Waltham, MA) in Oct 2011", "Interview Descriptions": "The entire hiring process was very quick and easy; I applied online through Bentley's employment website and was contacted by the supervisor within a couple of days for an interview.  During the interview, the supervisor was extremely friendly and kind.  She further explained the position to me, introduced me to the other assistants in the department, and asked me about a few basic qualifications (ex. Microsoft Office).  Since the position was pretty basic as far as qualifications and skills, I believe the interview was more focused on finding a candidate that was friendly and professional.  Within the week, I was hired.  Overall, the position was a hugely positive aspect of my college career and I would recommend it to any student applying for the position!", "Interview Questions": "Would you be free to work primarily on Tuesdays and Thursdays?"}], [{"date": "26 Feb 2012", "title": "Department Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 1 day. I interviewed at Bentley University (Waltham, MA) in Jan 2010", "Interview Descriptions": "They test your knowledge or current events and the effect on the capital markets.", "Interview Questions": "Na"}, {"date": "1 Sept 2010", "title": "Office Aid Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bentley University (Waltham, MA) in Sept 2009", "Interview Descriptions": "Came in at time requested in email. was told about the job.", "Interview Questions": "No Questions asked."}, {"date": "25 May 2010", "title": "Software Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Bentley University (Waltham, MA) in Feb 2008", "Interview Descriptions": "I met with the supervisor and we talked about my qualifications, interests, and hobbies. They seemed to match what she was looking for in being apart of the team.", "Interview Questions": "N/A"}]]