[[{"date": "16 Jan 2023", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Food For The Poor", "Interview Descriptions": "Applied and contacted via email to complete prescreen questionnaire. Took time out of my day to answer all questions thoroughly. Followed up multiple times to determine if they had received my answers and no response. Not a professional organization.", "Interview Questions": "What appeals to you the most about this position?"}, {"date": "12 Feb 2022", "title": "Technician De Maintenance Mécanique Industrielle Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Food For The Poor (Port-au-Prince)", "Interview Descriptions": "Étant actuellement étudiant finissant du centre de formation professionnel d’haiti à la recherche d’un emploi je me permets de vous proposer ma candidature en effet je suis vivement intéressé par votre entreprise qui d’écrit un profil me correspondant parfaitement je saurai mener à bien les différentes missions que vous me confierez veuillez agrée (madame monsieur) l’expression de mes salutations les plus distinguées.", "Interview Questions": "Comment ça marche chez vous"}, {"date": "19 Jan 2022", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Food For The Poor", "Interview Descriptions": "Met a leader of the org at a conference and traveled to do an onsite visit with other members of the organization.  Very positive experience and excellent mission.  Was offered role within a week and then took some time to get contract negotiation completed.", "Interview Questions": "Experience Level in the field\r\nReferences"}, {"date": "9 Jul 2020", "title": "Senior Creative Editor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Food For The Poor (Miami, FL) in Jun 2020", "Interview Descriptions": "Interview went well and I thought I was being seriously considered. I was led to believe I was the top candidate and that the next step was to meet with the executive VP. I was told twice in the interview and then in a follow up email to look out for an email scheduling the meeting. So, I waited two weeks heard nothing, and when I followed up, I find out they’d already hired someone. They weren’t even going to inform me. Very underhanded and tacky management style.", "Interview Questions": "Tell me about your marketing background ?"}, {"date": "19 Feb 2020", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Food For The Poor (Fort Lauderdale, FL) in Feb 2020", "Interview Descriptions": "The phone interview was the first step.  The Director called and was very pleasant, efficient, and kept the interview to 30 minutes.  I walked away with the feeling that they really care about what they do and the communities they serve.", "Interview Questions": "Why do you want to leave your current position?"}, {"date": "6 Jun 2021", "title": "Reporting Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Food For The Poor (Port-au-Prince) in Jan 2017", "Interview Descriptions": "The first part was a talk with the head of the department. There is a little writing test where you're asked to write a short essay to test out your writing skill. But it is an easy process. there might also be a talk with a member of the HR team", "Interview Questions": "What are some of the skills that make you a good candidate for this position?"}, {"date": "20 Feb 2018", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Food For The Poor (Coconut, FL) in Mar 2015", "Interview Descriptions": "Excellent and thorough.  Very competent HR team and people were very welcoming on staff.  Everyone is in a good mood and smiling ...conveys a positive environment.  There is a lengthy application that needs to be done on paper in addition to the online application.  Social Security Cards need to match your legal name on your license.", "Interview Questions": "Asked about revenue goals from previous non profits worked at . "}, {"date": "21 Feb 2015", "title": "Special Events Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Food For The Poor in Feb 2015", "Interview Descriptions": "phone interview.  the VP was very friendly and took the time to really get to know me.   I had some preliminary contact with HR director via email, and then a full 1 hour with a VP.", "Interview Questions": "I liked the relaxed style of interview...not a list of computer generated questions."}], []]