[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "I've never worked anywhere better", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Jun 2022", "job_title": "Service Manager in London, England", "duration": "N/A", "pros": "On paper, the benefits of working at CALM speak for themselves. Unlimited annual leave, a 9 day fortnight, free therapy, Bupa cash plan and health & wellbeing package too. They really look after their staff and practice what they preach.\r\nThe bits that you don't see, however, are the most rewarding. The culture of support, feedback and collaboration make this a really rewarding place to work.", "cons": "Everyone is really ambitious , creative and keen to solve problems so it can be difficult to prioritise all the excellent initiatives. It's a good problem to have."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "An absolute dream organisation!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Apr 2022", "job_title": "People Operations Manager in London, England", "duration": "N/A", "pros": "It's so amazing to work somewhere where they are actually getting things right. Employees have a voice and are listened to (CALM recently implemented a nine-day fortnight permanently into contracts and created a full banding and levelling pay philosophy after survey feedback to create complete transparency around pay). \r\n\r\nCALM already offer other great benefits like unlimited annual leave, therapy through Self Space, an EAP, health assurance, remote working, paid sickness and enhanced parental leave to name a few. \r\n\r\nThe CEO talks regularly and openly to the entire workforce about the strategy, and revenue and there are really no secrets. He also is willing to take part. in conversations about his own mental health too, which really sets the president for everyone else to do the same.\r\n\r\nEveryone who works here can see the positive impact CALM are having, saving lives every day, and so the culture is one where people really come to work just to do a great job and make sure that CALM can continue to save lives. Teams are trusted with autonomy and are encouraged to get creative.\r\n\r\nCALM has recently gone through a massive change process and is taking more time for EDI and the wellbeing of all employees. Our recent surveys show that employees find CALM a great place to work, and a supportive, inclusive, diverse and safe environment to work.", "cons": "The previous Glassdoors are damaging and impact on recruitment. When taking this job, I chose to ignore those reviews and come and see for myself and I absolutely do not regret this decision. I love working for CALM.\r\n\r\nOne true \"con\" is the heating in the office which can be temperamental. Though I believe this is being fixed."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 Dec 2021", "job_title": "Salesforce Administrator in London, England", "duration": "N/A", "pros": "Unlimited Holidays\nFlexible Working\nDiversity\nFriendly Colleagues\nDogs are welcomed\nSupportive Manager\nGreat Benefits\nFriday Bevs", "cons": "Better IT equipment can be provided"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Awful Experience. Avoid.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Jun 2021", "job_title": "Campaign Against Working Miserably in London, England", "duration": "N/A", "pros": "It was near a nice coffee shop.", "cons": "The reviews left previously do good justice to the working environment here. I wish I had the energy to leave an in-depth review, but it would mean dredging up the trauma and sadness of it all. \r\n\r\nJust avoid it. If you care for you career, your happiness and mental well-being just leave this well alone."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Dysfunctional. Damaging. Misleading. A multitude of serious issues that need addressing.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Mar 2021", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "The majority of people working at CALM are highly capable, creative, compassionate, committed to the cause and an absolute joy to work with. Sadly this isn’t consistently the case from the top down, as you will discover when you read about my experiences in the ‘cons’ section of this review. \r\n\r\nThe supporters of CALM are an inspiration, and it's a privilege that they enable such an organisation to thrive.\r\n\r\nThe helpline (funded and promoted by CALM, but managed by a third party) is a literal life line for so many people and is run by an absolutely incredible woman supported by a team that works tirelessly to help others who often have nowhere else to turn at their lowest point. I hold everybody who does and has worked on the CALM helpline in such high regard.\r\n\r\nIf I was asked this question in my first 6 months of working at CALM I would have been waxing lyrical about what an amazing opportunity I was given to grow a department and focus on innovative and impactful projects that would make a real difference to the most vulnerable and unsupported people in society, but sadly these opportunities never realised their potential due to resources and sponsorship being removed and diverted elsewhere in the organisation without proper consultation, consideration, or cause.", "cons": "There are multiple issues with the way the organisation is structured, managed and governed, which when coupled with the personally degrading and professionally incapacitating treatment that I both witnessed others being subjected to and directly experienced myself meant I had no choice but to leave in order to maintain my mental health, sense of dignity and sense of self.\r\n\r\nThe biggest issue for me was the pattern of people abruptly falling out of favour - often due to misalignment in views with, or presenting well-intentioned challenges to the leadership team - and the unfounded ostracisation that would ensue. This was driven by the CEO and certain members of the leadership team in the form of reduction or removal of team members, projects, sponsorship and support, alongside the introduction of exclusionary behaviours coupled with unfounded challenge, criticism and ‘gaslighting’ aimed at the individual who was being unofficially ‘managed out’ of their role, or the wider organisation.\r\n\r\nThese behaviors and the related practices almost felt like a ‘witch hunt’ at times and were incredibly uncomfortable and unsettling to witness, and eventually experience directly.\r\n\r\nSome members of the leadership team played a much more active role in this than others, who, in my view, remain culpable and act as enablers of this behaviour by choosing to stand back and watch these issues unfold time and time again, and doing nothing about it.\r\n\r\nIn fact, multiple members of the leadership team directly expressed their discomfort and disagreement with how I was being treated directly to me, but remained silent when I asked them to support and challenge the related behaviors and decisions.\r\n\r\nThings got to a point where I felt I had no choice but to leave the job I’d once loved in an organisation that I’d genuinely believed I was safe, secure, and supported in; when in fact the opposite was true. This happened amidst the backdrop of a pandemic and looming recession, and heightened my feelings of vulnerability, confusion, isolation and anxiety at what was already an incredibly difficult time.\r\n\r\nMy experience at CALM is something that I am still working through with the support of a therapist to this day. That said, walking away and taking back my dignity, power and sense of worth was the best thing I could have done, and I’m feeling like myself again now that I am free from the physical, mental and emotional tolls of working in such a dysfunctional and destructive environment.\r\n\r\nI’m still not sure if the practices and behaviours that I have described so far are intentional or an unintended consequence of the lack of suitable skills, knowledge, and experience that the current CEO and leadership team possess and their related inability to run the organisation in the right way, and / or the influence of the dysfunctional rose-tinted bubble that they have created for themselves but to be honest it doesn’t really matter; it is wholly unacceptable whatever the cause or intent.\r\n\r\nDon’t get me wrong, some members of the leadership team are great in their individual fields, but they don't collectively possess the knowledge and experience required to run a rapidly growing and ever-evolving organisation addressing such a complex issue.\r\n\r\nMore broadly, the rapid growth of CALM coupled with the lack of suitable leadership, governance and poor and sometimes impulsive decision making meant that there were a number of long-standing issues with the organisational structure, strategies, systems, policies and processes that contributed to an unstable, insecure, stressful and often conflicted working environment.\r\n\r\nThese issues, although acknowledged, were not properly impact assessed or addressed, and the insufficient improvement initiatives relating to these matters landed ineffectively and were often deprioritised in favour of ‘shiny new things’ and quick fixes that masked or dodged the underlying issues.\r\n\r\nWhen projects were repurposed, paused, delayed or discontinued the guise of the cause was often used as a ‘get out of jail’ free card when managing difficult conversations with funders, partners and suppliers.\r\n\r\nAs a result of the insufficient and ineffective strategy and planning, the helpline is struggling to adapt to the rapid and broad expansion of its remit, and whilst they are supportive of the broad concept of helping as many people as possible and would never turn anyone in need away, they are finding it very difficult to maintain the level of service they have become known for due to the poorly thought through yet hastily implemented decisions that have been made to position the helpline as being ‘everything to everyone’, rather than keeping it focused on its core purpose of suicide prevention to those in greatest need.\r\n\r\nAs other reviews have mentioned, proper mental health support for CALM staff and understanding of the related risks and issues is truly lacking, which is a real concern.\r\n\r\nOn multiple occasions I highlighted my concerns that CALM lacked the appropriate risk assessments, supervision and support mechanisms for (a) people at risk of vicarious trauma due to the nature of the work undertaken and the information they are exposed to, and (b) people who have been personally affected by the issue, and my concerns along with similar issues raised by many other colleagues were routinely dismissed by the CEO and leadership team.\r\n\r\nPersonally, I received no proper check in or support during or following a short period of ‘holiday’ which the leadership team & CEO were well aware was actually leave required due to work related stress and burnout compounded by an incident where a very tense, abrupt and dismissive interaction with the CEO had me in tears. I know for sure that being brought to tears by the CEO was not an isolated incident; there had been 2 similar incidents that I was aware of in the weeks surrounding this event alone.\r\n\r\nMy return to work was handled very poorly, and I was publicly and aggressively shut down and told in no uncertain terms that I had no alternative when I flagged a capacity issue affecting my ability to meet a last minute deadline on my 2nd day back in the office post stress-leave. At this point, I was attempting to catch up on my workload as well as cover the duties of a colleague who was also off sick with work-related stress for similar reasons to those that I have described.\r\n\r\nAlongside the other issues I have flagged, there are nepotistic aspects to the membership of the board of trustees, the selection of some partners (including for paid work) and recruitment and reward (pay & benefit) related decisions. \r\n\r\nIt is also common for serious issues including a highly disturbing incident that amounts to unfair dismissal whilst a colleague was very unwell, very poor attrition, D&I issues, staff burnout and other specific issues and grievances raised in exit interviews or via other feedback mechanisms to not be properly acknowledged, investigated or addressed, and ultimately to be ‘swept under the carpet’. It is also worth noting that the handling of these incidents and issues is inconsistent, depending on who is the alleged victim / perpetrator.\r\n\r\nDespite how I was treated towards the end of my time at CALM, I poured my remaining energy into producing a comprehensive handover in a bid to support my department, colleagues and ultimately the people who support and rely on CALM’s services.\r\n\r\nThis process was managed very poorly by the CEO and leadership team, which led to undue stress and anxiety affecting both myself and the colleagues who were due to take over my significant, business critical workload.\r\n\r\nI was very open, honest and as constructive as I could be about my experiences during my exit interview, which was shared with the board of trustees as well as the CEO & COO. As far as I’m aware nothing has materially changed as a result of the feedback I shared in my exit interview, and this is backed up by the accounts of ex-colleagues who remain working at CALM who have got in touch with me to share similar challenges that they are still experiencing at CALM to this day, along with the other experiences that have been shared on this site.\r\n\r\nSadly I have found out that after I left CALM the CEO has made defamatory and wholly untrue claims about me, in what I can only assume is an attempt to discredit the feedback I provided in my exit interview and / or excuse his poor decisions and inappropriate behaviours towards myself and others. I found this deeply upsetting, intrusive and profoundly inappropriate, although sadly not surprising, as I had witnessed other ex-employees being spoken about in a similar fashion."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "A total disappointment.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Mar 2021", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "The team is one of the most hardworking I've ever had the pleasure to work with. Employees are intelligent, creative and always go above and beyond to achieve results. Campaigns and events are fun and there are plenty of opportunities to work with big UK brands. and celebrities.", "cons": "Open communication and feedback from staff were ‘welcomed’ by the senior leaders at CALM, but were never acted on or even dismissed when said feedback seemed like too much of a challenge for those at the top. An example of this is referenced in another glassdoor review on here - some colleagues and I were keen to have more transparency around salary brackets as it is a well known fact that employees at the same level were often paid more or less dependent on their relationship to senior management or who was able to get them in the door for an interview. Giving feedback at CALM never felt like a particularly safe thing to do if you had ambition to progress. Progression seems to be based on personal relationships rather than professional ability or performance. A fruit delivery twice a week and discounts on various health products is not a big enough commitment to your team’s wellbeing when the nature of the work is directly linked to suicide. This is made worse given that a lot of the team, namely the fundraising team, are talking to vulnerable and bereaved families every single day, giving world class support and sometimes life saving signposting at the darkest points of some people’s lives - something that has a huge emotional toll on individuals especially when unsupported by professional supervision or therapy. \r\n\r\nI joined CALM feeling excited to be part of an organisation that was making a real change. I left CALM feeling like my self confidence had been shot to pieces and completely disillusioned wth the organisation's mission. I felt completely let down by senior management after repeatedly reporting manipulative and damaging behaviour I experienced personally with one of my managers (a member of the senior management team). These issues were never tackled by HR or the senior management team due to the nepotistic relationships they have with each other and the trustee board. This is something that holds CALM back from reaching it’s true potential as I am aware that various other members of the team reported the same issues, to no effect. \r\n\r\nThe senior management team likes to think that it’s running a progressive organisation but the internal reality is far from it. Outwardly, the campaign’s messaging is strong, fun and engaging and is put together by a communication and marketing team that works tirelessly (often leading to staff burnout). The internal culture is a world away from the shiny exterior and growing celebrity endorsements - a reluctance to tackle difficult issues is perpetuating issues of inequality in the team. I worked there for more than a year and experienced various sexist remarks, patronising treatment of junior members of staff and an extremely poor ‘tick-box’ handling of a diversity and inclusion exercise spurred on by the BLM protests of 2020."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "25 Nov 2020", "job_title": "Senior Manager in London, England", "duration": "N/A", "pros": "Fun and supportive team, friendly and hard working", "cons": "Emotive content, can be difficult"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "One of the best companies I've worked for. Wonderful people, great brand and cause and the leadership was transparent", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 Aug 2019", "job_title": "Fundraising in London, England", "duration": "N/A", "pros": "One of the best companies I've worked for. Wonderful people, great brand and cause and the leadership was transparent. I really enjoyed my time at CALM - they are all about the people. Those affected by suicide and also their staff. I would work for them again in a heart beat", "cons": "The usual office politics but there was such open communicaitons it wasn't really an issue for me. I loved everyone I worked with who I know are still there - which says a lot as charity turnover is usually huge in London."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Amazing place to work.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 Jul 2019", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "- Being a part of an incredible team of fast-learning, hard-working individuals\r\n- Ability to shape the direction of the organisation as it grows\r\n- Learn from the vast array of skills around you and develop with the charity\r\n- Given the space to think creatively about projects and how they can best make impact", "cons": "Can be difficult to work with a sensitive issue, but you're rewarded by knowing you're making a difference"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Progressive, exciting charity where employees are given the ability to push boundaries around a sensitive issue.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 Apr 2018", "job_title": "Campaigns Director in London, England", "duration": "N/A", "pros": "Progression in staffs hands. Amazing team spirit within team and wider. World class projects and delivery. Focus on effectiveness. Brilliant protection of staff members mental health.", "cons": "Difficulty working with a sensitive issue day to day. Currently reliant on good will from variety of contributing partners, which is potentially difficult to protect in the long run."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Aug 2019", "job_title": "Office Manager in London, England", "duration": "N/A", "pros": "Great opportunity to grow within the business, super mix of people to work with, top-notch staff perks, laid back atmosphere considering the nature of the business and staff socials.", "cons": "None that I can think of"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Excellent place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Jul 2019", "job_title": "Fundraising Officer in London, England", "duration": "N/A", "pros": "- Very supportive colleagues and management\r\n- Lots of opportunities for staff to progress and develop\r\n- The charity is full of ambition and always looking to grow\r\n- Clear vision", "cons": "- Workload can be a bit hectic at times"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good! So far....", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Jul 2019", "job_title": "Fundraising and Volunteering Assistant in London, England", "duration": "N/A", "pros": "Good support from managers, well equipped office, friendly team,  very important work and the team are well briefed about what's happening from the direct services side of things.", "cons": "None that I have yet. Most people seem happy to be here."}]]