[[{"date": "26 Jun 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Connecticut Children's Medical Center", "Interview Descriptions": "First is a self recorded interview with questions given to you , then Zoom interview with the managers & then in person shadow on the floor. Overall, interview process was good & recruiters were helpful", "Interview Questions": "Tell me about yourself, Tell me about your previous experience"}, {"date": "18 May 2023", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Connecticut Children's Medical Center (Westport, CT)", "Interview Descriptions": "online interview process asking 5 questions through video. One question was asking through written. The written question just asked what kind of position i was looking for. Very straightforward. Took about 15 minutes to complete.", "Interview Questions": "why do you want to work at connecticut childrens?"}, {"date": "8 Dec 2022", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Connecticut Children's Medical Center", "Interview Descriptions": "It was short, 30 minutes. Asked scenario/behavioral questions and examples for each. It was with a group of 5 team members over zoom. They asked questions such as \"tell me about yourself. why are you qualified? any challenges you've faced with example. what are your strengths and weaknesses?\"", "Interview Questions": "Give me an example of a time you have multitasked."}, {"date": "16 Nov 2022", "title": "Research Assistant 1 Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Connecticut Children's Medical Center", "Interview Descriptions": "Three short interviews with different individuals. Passed skills examination in a prior interview. First meeting was regarding job responsibilities and others were to determine fit. Ended up receiving contingent offer but decided to decline for other opportunities", "Interview Questions": "Why are you interested in this position?"}, {"date": "25 Jan 2022", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Connecticut Children's Medical Center", "Interview Descriptions": "All on zoom, and within an hour time. Met with both manager and assistant manager on zoom. Only thing was one was a bit late. I applied and was hired within 2 or so days", "Interview Questions": "Why pediatrics and my past."}, {"date": "5 Nov 2021", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Connecticut Children's Medical Center", "Interview Descriptions": "In person or on Zoom. Interview is mostly behavioral questions with some technical questions mixed into the question base. Not too difficult or stressful, mostly looking at fit for the team.", "Interview Questions": "Name a time you broke the law"}, {"date": "2 Nov 2021", "title": "ER Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Connecticut Children's Medical Center", "Interview Descriptions": "It was a very comfortable environment and the interviewers were very friendly. Then they gave me a tour of the emergency department. They also care about your long-term goals and what you are looking for in the job.", "Interview Questions": "Q: Name a time you had to use creativity to solve a problem."}, {"date": "25 Oct 2019", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Connecticut Children's Medical Center (Hartford, CT) in Oct 2019", "Interview Descriptions": "3 interview process. Email, in person and job shadow. They where looking for client interaction and how I interacted with them. I have had direct contact with the recruiter and hr since I started this interview process.", "Interview Questions": "How do you handle conflict in the work place. "}, {"date": "9 Sept 2019", "title": "Executive Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Connecticut Children's Medical Center", "Interview Descriptions": "Interview was concise, went very well.  Interviewed with CFO and other staff to be better aware of job responsibilities and role.  Provided a very good description of what the CFO would require on a daily basis.", "Interview Questions": "calendar management as well as time management"}, {"date": "2 Apr 2019", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Connecticut Children's Medical Center (Hartford, CT) in Feb 2019", "Interview Descriptions": "The phone interview went well. Was asked to come in for a second interview and was told the date would be communicated. I waited 3 weeks before reaching out again and was told the position is filled and that they would be happy to consider me for another position that I may be interested in", "Interview Questions": "Basic background, university, previous experience"}], [{"date": "5 Dec 2018", "title": "Buyer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Connecticut Children's Medical Center (Hartford, CT) in Oct 2018", "Interview Descriptions": "Called in for an interview after I applied. Went in and met the director and the team. Interview went well then nothing. They wouldn’t not even return an email or contact me to let me know. If you go in for an interview at any company they should at least keep you updated and let you know why they went with another candidate.", "Interview Questions": "Why do you want to work here? What’s your background? What could you bring to the position."}, {"date": "10 Aug 2018", "title": "Clinical Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Connecticut Children's Medical Center (Hartford, CT) in Jul 2018", "Interview Descriptions": "I applied online then contacted within one week to establish an interview. I was interviewed by the director of the department. It was easy. I did not hear back from the employer for several weeks. I attempted to contact the director that given me her email information. However, I did not receive a response. I then reviewed my online application indicating that I was no longer a candidate for the clinical research position.", "Interview Questions": "What do you see yourself doing in five years?"}, {"date": "5 Dec 2017", "title": "Allied Health Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Connecticut Children's Medical Center (Hartford, CT) in Oct 2017", "Interview Descriptions": "contacted by hiring manager directly via phone. Invited in for in-person interview a week later. Lasted about an hr and was able to shadow an employee in the department after. Everyone i met was very nice and friendly.", "Interview Questions": "list of behavioral questions: tell me a time when..., why do you want to work here? tell me about this experience (on resume)"}, {"date": "19 Jun 2019", "title": "Temporary Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Connecticut Children's Medical Center (Glastonbury, CT) in Jun 2017", "Interview Descriptions": "I was interviewed by the OT department manager. She was very warm and interested in my experience. She made me feel comfortable and ensured she answered any questions. She also allowed me to shadow a couple treatment sessions after the interview which was great!", "Interview Questions": "What assessment tools are you familiar with?"}, {"date": "28 Jul 2017", "title": "Grants Management Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Connecticut Children's Medical Center (East Hartford, CT) in Jan 2017", "Interview Descriptions": "I received a phone call with some general questions about my interests in the job opportunity. I was then asked to come in to the office for an in person interview. The interview lasted about an hour and asked all relevant questions as well answered many questions; it was very interactive. A week later I received a call from HR regarding my offer in which I had to submit a drug test within 48 hours for.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "12 Oct 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Connecticut Children's Medical Center", "Interview Descriptions": "Received call for interview. Went in and they asked a few questions, and gave me some info on position and location. Left the interview and literally received a call 1 hour after to get an offer on the position.", "Interview Questions": "what are your best qualities?"}, {"date": "29 Feb 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Connecticut Children's Medical Center (Hartford, CT)", "Interview Descriptions": "The interview process took just a couple of weeks from the point of an initial call back. However, it took  about three months for an initial call back.  You must pass a skills exam for an Administrative position at the higher lever.  Unfortunately, lower level Admins do not, which hinders the workflow when people are hired without the appropriate level of experience.", "Interview Questions": "What's your strength and weakness?"}, {"date": "20 Aug 2015", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Connecticut Children's Medical Center (Hartford, CT)", "Interview Descriptions": "I set up an interview over the phone with the hiring manager. When I met with her, she was very nice and easy to talk to. I felt like she was trying to make it a positive experience. I also was able to shadow on the unit for about an hour as part of the unit. Everyone was welcoming!", "Interview Questions": "Are you interested in relocating?\r\nWhat are your three most positive qualities?"}, {"date": "22 Jun 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Connecticut Children's Medical Center (Hartford, CT)", "Interview Descriptions": "It was pretty easy, they ask you what your goals are and what you want to learn from here. They asked what your task would look like, and then they would tailor the internship to what you wanted.", "Interview Questions": "What do you want to learn?"}, {"date": "10 Jul 2016", "title": "Emergency Department Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Connecticut Children's Medical Center (Hartford, CT) in Jun 2015", "Interview Descriptions": "The interview process began with the typical application online. Then I was called and asked some questions over the phone by the department manager. After speaking for about 15 minutes the manager invited me in for an interview. She seemed cold and impersonable which was Intimidating. Also, she didn't tell me ahead of time that I would be shadowing a nurse on the unit for a couple hours. I had no idea I would be spending half the day at the interview vs the topical hour or so. After the initial interview I returned a week later for a final interview with a member of human resources.", "Interview Questions": "What was the most stressful case/call/patient you ever worked on?"}], [{"date": "21 Apr 2015", "title": "Director of Supply Chain Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Connecticut Children's Medical Center (Hartford, CT) in Mar 2015", "Interview Descriptions": "A day long schedule consisting of meetings with multiple stakeholders, managers and one Vice President. Overall, an efficient process for all parties involved, but also a tiring one for the candidate since you must be on your \"A\" game throughout the entire day long session.", "Interview Questions": "Have you ever broken the rules at your current company?"}, {"date": "2 Mar 2015", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Connecticut Children's Medical Center (Hartford, CT) in Jan 2015", "Interview Descriptions": "Brought in for an interview with the lab supervisor then brought back for a second interview with the senior biostatistician.  First interview was mainly questions about me and trying to see if I would be a good fit for their lab.  The second interview was to follow up and sell me the position.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "24 Dec 2014", "title": "Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Connecticut Children's Medical Center", "Interview Descriptions": "May apply on-line. HR will connect with you. Will work with you regarding times and date. Fair and balanced interview process. Focus on clinical aptitude. 2 to 3 interviewing. May be 2-3 steps, depending on department.", "Interview Questions": "What difference will you make to this hospital?"}]]