[[{"date": "10 Jul 2023", "title": "Certified Medical Coder Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Thomas Jefferson University (Philadelphia, PA) in Jul 2023", "Interview Descriptions": "Quick phone interview discuss the job described Zoom interview also discuss more details of what there expectation everyday as well as time management, benefits and more In person interview check out the environment and place as well speaking to other sitting with other to actually see what they do on a daily day basics", "Interview Questions": "Basic question Tell me about your self Past experience Salary"}, {"date": "28 Jun 2023", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Thomas Jefferson University", "Interview Descriptions": "There are interviews with faculty and a student. It is an in person event. There is a tour of the campus. There is also a meet and greet social hour.", "Interview Questions": "Tell me about your research"}, {"date": "19 Jun 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University", "Interview Descriptions": "Applied online, recruiter responded via email within 48 hours. Set up an interview with recruiter, she asked general questions. She also told me about the expectations of position, salary, hours. It was relaxed. Set up interview with floor manager. Asked nurse related questions, made me feel comfortable asking questions.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "15 Jun 2023", "title": "Grants Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Thomas Jefferson University", "Interview Descriptions": "There was a lag in between company expressing interest in candidacy and the interview, but once the interview happened, the offer was extended shortly after. It was one round and a panel interview with management. They all asked questions, mixture of getting to know you and behavioral.", "Interview Questions": "Why are you applying to this position?"}, {"date": "16 Feb 2023", "title": "Research Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Thomas Jefferson University (Philadelphia, PA) in Feb 2023", "Interview Descriptions": "It was a screening interview that allowed me to be screened for every position I applied to at once. I just gave a brief overview of my experience, and they told me the pay, hours expected, and subsequent steps provided I pass the screening.", "Interview Questions": "Please tell me briefly about your experience. Are you willing to work in other departments if there are positions available?"}, {"date": "26 Oct 2022", "title": "Clinical Research Coordinator I Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Thomas Jefferson University in Oct 2022", "Interview Descriptions": "I initially got called by the HR department for a screening phone interview and then proceeded with an interview with the PI. Spoke about my past experiences, and learn more about their project and position. Very easygoing interview process.", "Interview Questions": "Tell me more about your research experience"}, {"date": "3 Nov 2022", "title": "Senior Accountant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Thomas Jefferson University (New York, NY) in Oct 2022", "Interview Descriptions": "I had a phone screening with HR and then proceeded with 2 virtual interviews with the managers. The interviews were pretty easy and straightforward. \n\nThey offered me the job, but I turned it down because HR gave me about $10K less than what the managers told me their salary budget was during the interview. It was very insulting considering they expected me to work 50-60hours per week. I eventually found out that they lowballed me because I'm a minority woman even though I have many years of professional experience.", "Interview Questions": "Tell me about your job experiences and skills"}, {"date": "22 Sept 2022", "title": "Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Thomas Jefferson University", "Interview Descriptions": "Very Laid Back and intellectual conversation. Very personable interviewers who wanted to get to know you on a personal level. Be prepared to share previous research experiences and applications. Difficulty does depend on the interviewer but overall good experience. ", "Interview Questions": "How does your previous experience apply? "}, {"date": "10 Aug 2022", "title": "Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Thomas Jefferson University", "Interview Descriptions": "I had numerous rounds of interviews with different people, answered many of the same questions over and over. There were A lot of casual conversations between formal interview questions. Average difficulty.", "Interview Questions": "Describe a time when you’ve sorted out differences "}, {"date": "25 Dec 2021", "title": "Student Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Thomas Jefferson University", "Interview Descriptions": "The interviewer was clear and to the point. Jefferson's staff was nice and friendly. The interview process was also time-restricted and it did feel uneasy. I like how it was easy to go to the interview and waiting wasn't the issue. The issue of the interview was the question they ask.", "Interview Questions": "what major are you studying?"}], [{"date": "1 Nov 2021", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Thomas Jefferson University", "Interview Descriptions": "I only did the first interview so far my interview just asked how would I handle a situation with a family member describe a time me and my boss got into disagreement and describe a time me and my coworker got into disagreement", "Interview Questions": " how would I handle a situation with a family member describe a time me and my boss got into disagreement and describe a time me and my coworker got into disagreement "}, {"date": "26 Oct 2021", "title": "Janitor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Thomas Jefferson University", "Interview Descriptions": "I wa asked many questions related to how I could benefit the company such as why I wanted to work there and what I could do to help the company", "Interview Questions": "Give a time whereby feel like u struggled"}, {"date": "14 Oct 2021", "title": "Residence Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Thomas Jefferson University", "Interview Descriptions": "Full day of interviewing , with several university departments and students. Questions were mostly situational and soft skills based. Emphasis on time management, leadership and interdepartmental collaboration. The Residence Life structure has since changed and the role is now hybrid of multiple functions and spans a much larger territory since  the organizations merger.", "Interview Questions": "Tell me about a time when you had to address a team member's shortcomings that were negatively affecting the team?"}, {"date": "30 Sept 2021", "title": "Nursing Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University", "Interview Descriptions": "Group interview via zoom - interview questions sent beforehand - was asked one question from questions sent beforehand and one question that was not sent. Heard back within two days. Was accepted into the program", "Interview Questions": "How would you respond if a patient declined medical treatment?"}, {"date": "27 Feb 2021", "title": "Biostatistician Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Thomas Jefferson University", "Interview Descriptions": "The in-person interview was scheduled after application. There were 5 team-members participating in the interview process. Overall the questions were general including the questions about my interests and future goals.", "Interview Questions": "Why did you apply for this position?"}, {"date": "24 Feb 2021", "title": "Nursing Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University", "Interview Descriptions": "It was a little nerve reckoning. It was a group interview. I don't think they were too worried about your answers quite a few people from my group got accepted.", "Interview Questions": "Tell me why you want to be a nurse."}, {"date": "23 Feb 2021", "title": "Student Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Thomas Jefferson University", "Interview Descriptions": "contacted by human resources to set up interview, had Phone interview with nurse manager, 4-6 questions, 5 references filled out survey, very straight forward interview process. Was hired within a week and received the news by phone call.", "Interview Questions": "What are your strengths?\nWhat are your weaknesses? \nWhat challenges are you looking for?"}, {"date": "21 Feb 2021", "title": "Registered Psychiatric Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University (Philadelphia, PA)", "Interview Descriptions": "Very difficult and website did not work well. I would suggest that if people apply on this website, the website should give good directions. Many career websites have similar problems but good directions", "Interview Questions": "Q: What was  the most difficult task you were asked to do"}, {"date": "11 Feb 2021", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University", "Interview Descriptions": "Following HR phone interview, in-person (10-20 minutes) interviews with several members of office staff including attending physician, NPs, and office manager.  Following interview, HR requested references completion and extended offer.", "Interview Questions": "Describe previous experiences in relation to position.\r\nWhy this position?"}, {"date": "11 Jan 2021", "title": "Nursing Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Thomas Jefferson University (Philadelphia, PA) in Dec 2020", "Interview Descriptions": "FACT-1: Group interview, questions are given beforehand. All questions given beforehand were asked in addition to one unique question not given beforehand. Went around the circle to answer. Laidback interview.", "Interview Questions": "What is an accomplishment you are most proud of?"}], [{"date": "22 Dec 2020", "title": "Clinical Research Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University in Nov 2020", "Interview Descriptions": "It was really efficient and straightforward. I had a video interview, then a phone interview, and finally I had an interview with the PI of the department I was set to work with.", "Interview Questions": "Tell me about yourself. Pretty standard."}, {"date": "9 Jun 2021", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Thomas Jefferson University (Phila, PA) in Aug 2020", "Interview Descriptions": "I had a phone interview with the manager first. He described the team and position and gave me time to talk about my experience. Then I did an in-person interview with the manager and the rest of the team. It was a conversational interview with some “what would you do…” type questions.", "Interview Questions": "Have you ever had to tell a doctor to do something differently to follow protocol? How did you tell them? "}, {"date": "27 Aug 2020", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Thomas Jefferson University (Phila, PA) in May 2020", "Interview Descriptions": "Confusing and challenging. I ran out of time during the video interview and the hospital hired way less people than they had planned to, so I had less of an opportunity to get a job.", "Interview Questions": "What is something that is unique that you can bring to the table?"}, {"date": "1 Apr 2020", "title": "Clinical Research Coordinator I Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Thomas Jefferson University", "Interview Descriptions": "I applied for this position online on 1/14/20 and I was contacted via email on 2/16/20 in order to set up a phone interview. The phone interview was very conversational. She explained that this position was entry level for people who had little or no knowledge of clinical research and asked if I was still interested. I was contacted via email again on 2/18/20 asking to set up a face to face interview. I set the interview up for the next day 2/19/20. I interviewed with 2 people separately. The first person asked about 3 or 4 interview questions but mostly went over what the job entails and what she expected from the potential candidate. The next interviewer did not ask any interview questions she went over the job description and where I seen myself in the future. I was offered the job on 3/6.", "Interview Questions": "Why do you want to work in clinical research?"}, {"date": "12 Mar 2020", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Thomas Jefferson University", "Interview Descriptions": "It was super easy, I had interviewed with Hr first then with the nurse manager. They asked a lot of situational questions that revolved around my clinical education. Also asked why I wanted to do nursing", "Interview Questions": "Why nursing?"}, {"date": "19 May 2021", "title": "Dietary Aide Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University (Phila, PA) in Jan 2020", "Interview Descriptions": "The interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates and making a hire", "Interview Questions": "What was the hardest challenge working in fast food ?"}, {"date": "12 Oct 2019", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Thomas Jefferson University", "Interview Descriptions": "Met with Hr than nurse manager on floor \r\nHR person was kind of cold and to the point. Nurse manager just said what job was. Pretty easy overall.  Needed references from past employers which was hard to gather. Had to hound a couple of my bosses to answer a survey", "Interview Questions": "Name a experience you had in class that did not translate to the clinical setting and how you dealt with that"}, {"date": "29 Aug 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Thomas Jefferson University", "Interview Descriptions": "Spoke with Project Manager via phone for screening, then had a second in person interview where I met team and supervisors. Overall, good experience. After interview completed references. Interview was very conversational. Whole team was very nice.", "Interview Questions": "Name a weakness"}, {"date": "28 Oct 2021", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Thomas Jefferson University (Phila, PA) in Jun 2019", "Interview Descriptions": "Interviewed with program director individually. Search committee chair individually. Then group interview. Thorough and professional. Interview spanned a period of about 5 hours. Lunch meeting with full faculty. Lengthy waiting period before feedback regarding offer was received.", "Interview Questions": "5 year career path\r\nWhy TJU\r\nContributions I would bring"}, {"date": "18 Apr 2019", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Thomas Jefferson University", "Interview Descriptions": "Quick, to the point meeting with HR recruiter. Checked in at the front desk, they directed me to the HR offices. Met the recruiter and answered literally every question that’s typically asked when you google interview questions. Nothing crazy. Nothing about techniques.", "Interview Questions": "They asked the usual questions"}], [{"date": "8 Apr 2019", "title": "Nurse Extern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Thomas Jefferson University (Phila, PA)", "Interview Descriptions": "Received a call within 2 weeks of applying for an in-person interview. Friendly and welcoming environment. The interview lasted about 30 minutes & I was contacted within 4 weeks regarding their decision.", "Interview Questions": "Why Jefferson?"}, {"date": "4 Apr 2019", "title": "Work Study Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Thomas Jefferson University", "Interview Descriptions": "easy, came into designated office and showed them my resume and answered some questions, as well as asked some. and now im trying to take up space by continuing to write", "Interview Questions": "What experience do you have"}, {"date": "20 Mar 2019", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Thomas Jefferson University (Philadelphia, PA) in Feb 2019", "Interview Descriptions": "I received a call form a recruiter and was asked to schedule an interview. I went to the interview to meet a 2 colleagues and 2 management level personnel. We spoke causally and I told them about myself, work history, etc.  I got a tour of the facility and they seemed interested. I immediately got a call back from the recruiter saying they wanted to move forward and was sent a link to provide references. Then nothing followed for weeks followed by an auto-mated \"declined\" email.", "Interview Questions": "N/A"}, {"date": "21 Oct 2021", "title": "Masters Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Thomas Jefferson University (Philadelphia, PA) in Jan 2019", "Interview Descriptions": "A day long tour of campus and as well as group and individual interviews. Problem solving scenarios and critical thinking skills were asked to be applied to real life scenarios one may encounter.", "Interview Questions": "Is there anything about your application you would like to describe more in depth? "}, {"date": "6 Sept 2018", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Thomas Jefferson University", "Interview Descriptions": "Jefferson is always hiring adjunct faculty. I met with one of the deans who was very nice. You are hired pretty quickly because they have classes year round. They ask the standard interview questions about your experience and availability. They had numerous options for days you could take students to the clinical setting.", "Interview Questions": "The general questions:\r\n\r\nTell me about yourself, experience? "}, {"date": "7 Aug 2018", "title": "BI Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Thomas Jefferson University", "Interview Descriptions": "7 Interviews in total. Initial screen with the hiring managers and then 6 Skype interviews a month later. Last one with an executive level person. Process was smooth and quick", "Interview Questions": "Why Jefferson!"}, {"date": "21 Jul 2018", "title": "Registered Nurse - Operating Room Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Thomas Jefferson University (Philadelphia, PA) in May 2018", "Interview Descriptions": "Fantastic interview process.  Very understanding of my nervousness about having multiple interviewers.  Easily contacted via phone and pleasant throughout.  Being proactive about contact with the recruiter is encouraged so that you as the interviewee feel in the loop.  They don’t hold your hand.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "14 Feb 2018", "title": "Student Services Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Thomas Jefferson University (Philadelphia, PA) in Jan 2018", "Interview Descriptions": "Contacted via email for interview. Interview was set up for a week later at the main office. I had a Panel Interview with members of leadership in the department.", "Interview Questions": "Describe your Financial Aid background?"}, {"date": "24 Jun 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Thomas Jefferson University", "Interview Descriptions": "Nurse recruiter did not ask any questions during the interview, just explained the benefit and send to unit to meet with nurse managers who conducted a short informal interview. Did not say much. Got a job offer couple weeks later.", "Interview Questions": "did not discuss any work experience?"}, {"date": "18 Jun 2017", "title": "Adjunct Faculty Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Thomas Jefferson University in May 2017", "Interview Descriptions": "was not a bad phone call. they were honest from the beginning and thought i was qualified. They said that my past work experience is great. if i do a good job in the beginning they would offer a full time position.", "Interview Questions": "Story on how i resolved a problem"}], [{"date": "24 Sept 2018", "title": "FACT I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University (Philadelphia, PA) in Mar 2017", "Interview Descriptions": "Applied online and got offered an interview a few weeks later. I interviewed one day  later and it was a group interview with two other candidates, then went off for 1 on 1 conversations.", "Interview Questions": "Tell us about a time you worked as a team"}, {"date": "28 Feb 2017", "title": "Grants Administrator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University (Philadelphia, PA) in Jan 2017", "Interview Descriptions": "HR interview was perfunctory; mostly reviewed benefits and University hiring requirements. Manager interview was very detailed and took quite a while. Job duties could have been clearer. There does not appear to be room for promotion in this position.", "Interview Questions": "How do you deal with challenging people?"}, {"date": "13 Mar 2018", "title": "Nuclear Medicine Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Thomas Jefferson University (Philadelphia, PA) in Jan 2017", "Interview Descriptions": "It was a very quick process. I was very impressed by the hiring manager. Not at all pleased with HR. Very unprofessional and condescending. Woman laughed at me multiple times while on the phone with her.", "Interview Questions": "Why do you want to work here. "}, {"date": "22 Sept 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Thomas Jefferson University (Philadelphia, PA) in Dec 2016", "Interview Descriptions": "The interview process was really good, I was interviewed by two people and I found out i had the job a few days later. I had no complaints. The ladies i interviewed with took their time trying to find me a good fit within the company.", "Interview Questions": "Which department would you feel confident working in?"}, {"date": "18 Sept 2018", "title": "Ultrasound Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Thomas Jefferson University (Phila, PA) in Nov 2016", "Interview Descriptions": "It was surprisingly very easy. The interview was less than an hour long. The person who interviewed me was very nice and was happy to answer all my questions and concerns.", "Interview Questions": "Why ultrasound?"}, {"date": "3 Feb 2017", "title": "Medical Physicist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Thomas Jefferson University (Philadelphia, PA) in Jun 2016", "Interview Descriptions": "Interview was straightforward. People are really nice to talk to. Mostly focused on previous experience in clinical and research. No difficult technical questions. I gave a 30 min presentation.", "Interview Questions": "Research experience. What do you see yourself in 5 years. Why Jefferson."}, {"date": "18 Apr 2016", "title": "Grants Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Thomas Jefferson University (Philadelphia, PA)", "Interview Descriptions": "I applied online and was quickly contacted by an HR representative. They set up an interview date and I met with 3 managers at once. The meeting was conducted in their offices and was professional and seemed pretty standard. It was only a one-step process, and I received an offer letter within the week. The whole process maybe took 2 weeks. I accepted their offer quickly and was very happy with what was offered.", "Interview Questions": "Have you ever assisted in an application for federal funds? Do you know what uniform guidance is and how it could apply to this job?"}, {"date": "28 Mar 2016", "title": "Human Resources Business Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Thomas Jefferson University (Philadelphia, PA)", "Interview Descriptions": "After applying for the position online I received a phone call about the position about a month later. The administrative assistant set up the interview with me and was sweet as a button. Everyone else was not and I'd like to explain.\r\n\r\nI arrived about 10 minutes prior to the interview and was shown to a small conference room full of breast feeding pump boxes. About the time the interview was supposed to start, one of the women I was supposed to be meeting with stopped in to heat up her lunch in the microwave that was in the conference room. So we have a first impression of an organization with the interviewers running late, being placed into an awkward room, and one of them making lunch.\r\n\r\nWhen the interview began, about 10 minutes late, 2 of the 3 women acted like they didn't have a care in the world. One woman was chewing gum and although she tried to mask it it was obvious it was there. Another woman, and the gum chewing woman, were on their phones as well. I doubt it was about business as they were both smiling every time they looked up from their phones. Even if business was urgent you'd think that a 15-20 minute interview that was set up would mean that you just don't look at it for that period of time. I wondered if they were making comments about me or just talking about what was on TV that night? In my eyes it was rude and unprofessional that I took the time to dress and play the part and they didn't seem to care.\r\n\r\nI then met with 2 other women who were a delight but they, along with the other prior 3, didn't seem like they were fit to handle an interview. There really wasn't much behavioral interviewing going on so I doubt they found much out about my background. I had emailed all of the people I had interviewed with a never received a response back. Only tonight, at 5pm on Easter, did the system give me back a reply.\r\n\r\nIt's hard to feel bad about the role as the entire time they stressed that HR was changing once again and it wasn't giving me a good feeling about the role or department.", "Interview Questions": "Do you have any questions about the role?"}, {"date": "13 Jul 2019", "title": "Residence Life Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Thomas Jefferson University (Phila, PA) in Mar 2016", "Interview Descriptions": "The process requires two phone interviews and on campus interview. All of which contain scripted questions based on crisis management, leadership and work life balance. Additionally during the on campus process you are also interviewed by other departments in the university as well as a team of students all over the course of one day", "Interview Questions": "Tell us about a time when you had to address a crisis. "}, {"date": "8 Feb 2016", "title": "Grad Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Thomas Jefferson University", "Interview Descriptions": "Interviewed with 3 professors who mostly talked about their projects and then asked me if I would be interested. Interviewed with dean. Also interviewed with a student. Went to lunch with a group of students at the end to discuss the overall school experience.", "Interview Questions": "What type of research experience have you had?"}], [{"date": "3 Feb 2016", "title": "Medical Assistant- Non Certified Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Thomas Jefferson University (Philadelphia, PA)", "Interview Descriptions": "Explained position and requirements meet and greeted coworkers and doctors and given tour of the company explanation if benefits, shown how operate machines, shown computer techniques and operating process and fill out application and tax forms take patients blood", "Interview Questions": "Position wanted"}, {"date": "17 Apr 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Thomas Jefferson University (Phila, PA) in Feb 2016", "Interview Descriptions": "I was an in-house applicant since I already work at Jefferson in another department. I applied online. Jefferson's online application process is not very good, but I was called for an interview.  I spoke with multiple people about the job. There was an odd handout about them asking for your references that I've never seen in other departments.  It was in the School of Nursing. I was called and a time was arranged. Multiple people interviewed me.", "Interview Questions": "One question stood out as absolutely bizarre. They asked me if I thought the job I was interviewing for was a job that could be done by one person at 40/week. (paraphrased)"}, {"date": "18 Nov 2019", "title": "Patient Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Thomas Jefferson University (Phila, PA) in Jan 2016", "Interview Descriptions": "I applied online and was able to get an interview fairly quick. I had the contact information of the manager and communicated after I applied. Once I applied the manager told me to come in and interview. After the interview i was hired on the spot.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "9 Nov 2015", "title": "Admissions Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Thomas Jefferson University (Philadelphia, PA)", "Interview Descriptions": "After a brief phone interview, I was invited in for an in person interview. First I spoke with a representative from Human Resources. Our conversation was a typical \"behavioral interview\" that focused on the core competencies that the university as a whole is looking for. Then I had a longer, more specific interview with the admissions hiring team. I was also required to make an informational presentation about the University, and complete a writing sample. Overall the experience, while long and involved, was very friendly and relatively laid back.", "Interview Questions": "What is your ideal work environment?"}, {"date": "15 Apr 2015", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Thomas Jefferson University (Philadelphia, PA) in Mar 2015", "Interview Descriptions": "I submitted an online application the day the job was posted. HR contacted me about 2 weeks later to schedule an interview with the PI of the lab. HR did not interview me at all. The representative simply read the job description to me, asked for my salary requirements and scheduled the interview. My interview took place 2 days later. I spoke to the PI for about an hour. We had a very laid back conversation; he explained his lab's current research projects and we chatted about life in general. He then gave me a brief tour of his lab and I got to informally chat with two of his lab members. A few days after the interview HR contacted me again for reference and employment verification information.", "Interview Questions": "I'd say my experience was more like a graduate school interview than a job interview. We had a casual conversation as opposed to an actual interview."}, {"date": "22 Dec 2015", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Thomas Jefferson University (Phila, PA) in Jan 2015", "Interview Descriptions": "The interview process started with a phone screening. I then was  scheduled with a face to face interview three days later. I was ask a series of question and later was given a tour of the facilities. I was told I would be called when a interviewee was chosen.", "Interview Questions": "I was asked about my experience."}, {"date": "2 Sept 2014", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Thomas Jefferson University", "Interview Descriptions": "I submitted an online application and had 2 rounds of interview. The first one was with HR and the second was with the PI and the lab members. The interviews were followed by an offer via telephone and confirmed via email.", "Interview Questions": "have you read my publications?"}, {"date": "21 Jun 2016", "title": "Accounting/Finance Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Thomas Jefferson University (Philadelphia, PA) in Mar 2014", "Interview Descriptions": "The interview process what very easy. The HR rep did not ask much information and the department interview was pretty basic. It started with a phone screen then I was called in to meet with management and the team.", "Interview Questions": "They asked why did I want to work for Thomas Jefferson."}, {"date": "2 Jan 2017", "title": "Janitor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Thomas Jefferson University (New York, NY) in Feb 2014", "Interview Descriptions": "I had a phone interview then I went to the university to have a one on one interview. Very easy and I passed the interview and went home and waited for an offer.", "Interview Questions": "What makes you a good candidate "}, {"date": "6 Feb 2018", "title": "Registered Nurse, Critical Care Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Thomas Jefferson University (Phila, PA) in Feb 2014", "Interview Descriptions": "It was like the usual nursing interviews: A short generic interview with an HR representative then a longer interview with a  run down/tour of the unit by the nursing manager.", "Interview Questions": "How do would you handle conflict with another employee"}], [{"date": "3 Nov 2013", "title": "Clinical Research Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Thomas Jefferson University", "Interview Descriptions": "I was referred by a current employee. Therefore, I was able to have an inside track on the hiring process and I went directly to the contact I would be working for.  I still had to go through a basic interview with HR, but I was able to speak with the people I would be working with without a rigorous HR interview.  I had a few phone interviews as well an in person interview.", "Interview Questions": "What skills can you bring to the table?"}, {"date": "30 May 2017", "title": "Hospitalist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Thomas Jefferson University (Philadelphia, PA) in Jun 2013", "Interview Descriptions": "Got interviewed by 2 people. Both were very professional. Interviews were conducted in a relaxed environment. Asked basic questions. Then had lunch with the other hospitalists. They all seemed happy about the job. Everyone gave an honest review of the program. All my questions were answered in detail and honestly. Met some other faculty members. They also gave me a tour of the place. Overall it was a very good experience.", "Interview Questions": "Tell me whats one advice you give to your residents about patient interaction?"}, {"date": "13 Sept 2013", "title": "Lab Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Thomas Jefferson University (Philadelphia, PA) in May 2013", "Interview Descriptions": "An interview process was not hard for me, because I already hold this position, and this is the contract position for a month at the department I was graduating from.", "Interview Questions": "No unexpected questions"}, {"date": "2 Apr 2013", "title": "Development Officer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Thomas Jefferson University", "Interview Descriptions": "Applied in early December took over 3 weeks to hear back, then phone interview.. They said I had to wait about three weeks. A month passed and they sent a letter with rejection.", "Interview Questions": "They badmouthed the sexism and old politics of the office and asked my take on it..whether I was up for a challenge. "}, {"date": "16 Jun 2014", "title": "Research Assistant II Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Thomas Jefferson University (Philadelphia, PA) in Mar 2013", "Interview Descriptions": "I was first called for a phone interview that lasted roughly 10-15 minutes. Then early the next week, I visited the offices for my interview which was straight forward. I met with one of the research assistants first, then talked with one of my supervisors which was very informative.  The final interview that day was with my direct supervisor which I thought was a very uninteresting interview and just bland all around.", "Interview Questions": "There wasn't anything unexpected. Questions were asked about my publications and the previous experience with Breast Cancer and Heart Disease. "}, {"date": "19 Oct 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Thomas Jefferson University (Philadelphia, PA) in Feb 2013", "Interview Descriptions": "Not that much need to be talk about. It is just another interview. But one thing I need to say is that they value your passion on the job so much. Everyone were talking about how amazing and how great their works are...", "Interview Questions": "What you are working on now in your current job?"}, {"date": "26 Jun 2012", "title": "Information Technology Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Thomas Jefferson University (Philadelphia, PA) in Nov 2010", "Interview Descriptions": "Initially interviewed by phone by one of the engineers on staff. \r\nA week later was an in person interview with a number of members on staff at one time. They ask you general interview questions at first. After that, they give a quick test on various technologies that they use there. If you pass the test, you get to meet with the hiring director to discuss salary requirements, etc.\r\n\r\nThe area they work in doesn't seem all that great, very small cubes, kind of old and run down. The employees seemed happy though, and everyone was upbeat.", "Interview Questions": "Describe a difficult problem / incident from your current job and what you did to overcome it."}, {"date": "1 Jun 2013", "title": "Research Assistant C Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Thomas Jefferson University (Philadelphia, PA) in May 2010", "Interview Descriptions": "I was a student intern at my job first and my boss liked my work so much that she extended an offer to be a paid employee upon my graduation. I never had a real formal interview. However, I had to meet with HR so they could review my credentials to make sure that I truly was qualified for the position.", "Interview Questions": "I was just asked if I was conscious of my decisions and also a conscientious person."}]]