[[{"date": "14 Sept 2021", "title": "Manager, Sponsorships Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at WE Charity (Toronto, ON)", "Interview Descriptions": "The interview felt like a box-checking exercise for them. as I suspect they already had a candidate in mind. They asked some boiler plate questions while looking distracted with other things and ended the interview 30 mins in. I am pretty sure I am a great candidate and I was not the reason the interview ended early.", "Interview Questions": "Basic boilerplate questions, no indication that they were curious about me. "}, {"date": "30 Aug 2021", "title": "Development Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at WE Charity", "Interview Descriptions": "Applied for the position online. Received an initial email to set up a 20-minute phone interview. The interview was simply to further understand my experiences and the way in which they would apply to the role.", "Interview Questions": "In what way to you think your experiences will transition into this role?"}, {"date": "4 May 2020", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at WE Charity (Toronto, ON) in Feb 2020", "Interview Descriptions": "Phone screening with talent acquisition specialist, followed by an in person interview at their office with hiring manager and manager once removed. Good communication and follow-up throughout the process. Questions were very straightforward, mainly about previous accomplishments and experience.", "Interview Questions": "Standard interview questions\r\n- Tell me about yourself\r\n- How do you build trust in your relationships\r\n- What do you think this role entails\r\n- What do you know about the organization\r\n"}, {"date": "8 Oct 2019", "title": "Associate Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at WE Charity", "Interview Descriptions": "I was called for an initial HR interview and was told that HR would be in touch by the end of the week to let me know about next round. I never heard back. I emailed to find out an update and requested some feedback and never received a response. I think it was extremely unprofessional on the part of HR. I completely understand if they do not reach out to all candidates if they do not make next round but then they should clarify that during the interview process. The fact that I was told specifically that I would be given a call at the end of the week and then given no response after I emailed and requested an update,  is unprofessional. I have worked in Training and HR before and I have never come across such an unprofessional experience.", "Interview Questions": "what kinds of clients have you worked with?"}, {"date": "17 Jul 2019", "title": "Software Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at WE Charity", "Interview Descriptions": "Webcam interview, ask technical trivia. Ask about some projects on my resume. Interviewed by two people and took around 20 minutes. Most questions where centred around technical knowledge about certain languages and their functionality.", "Interview Questions": "What is the pros and cons of Javascript?"}, {"date": "19 Oct 2021", "title": "Strategist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at WE Charity (Toronto, ON) in Oct 2018", "Interview Descriptions": "A short intro call with a recruiter followed by a general interview with the associate director, a short take-home assignment (building a sample deck) and then a final interview with the associate director and director. All fairly standard, no memorable hardball questions.", "Interview Questions": "Could you speak to your related experience? How well can you manage multiple projects? "}, {"date": "15 May 2019", "title": "Talent Acquisition Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at WE Charity (Toronto, ON) in Mar 2018", "Interview Descriptions": "First an email, then a phone call, then in person. Each of them about a week apart. The questions were fairly simple and were what you would expect. Soft skills based questions+past experience etc.", "Interview Questions": "Describe how you work in a team environment? Are you a people person? "}, {"date": "30 Nov 2022", "title": "Educator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at WE Charity (Vancouver, BC) in Jan 2018", "Interview Descriptions": "One in-person interview with a supervisor and HR representative . Very straightforward questions regarding the role. I believe expected people to have a lot more experience than needed especially when the salary was very low for what work they were asking for.", "Interview Questions": "What is your experience working as a liaison between a school and an outside organization"}, {"date": "20 Dec 2016", "title": "Business Development Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at WE Charity", "Interview Descriptions": "Multiple stages in the interview process. \r\n1. High-level phone call conversation on your reason for applyting to work at the organization.\r\n2. Meeting with team members to assess fit.\r\n3. Meeting with your direct report assess your fit with the role.", "Interview Questions": "\"Can you pitch [your idea]?\""}, {"date": "27 Feb 2017", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at WE Charity in Dec 2016", "Interview Descriptions": "They first contacted me for a 15 min phone interview, which was smooth and straight to the point. They said they would message me once they'd reviewed all the candidates and let me know if I made it to a in-person interview. Made it to the sencond interview, they had a very welcoming atmosphere.", "Interview Questions": "Why do you think you are an ideal candidate for this position"}], [{"date": "24 Nov 2016", "title": "Trips Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at WE Charity (Toronto, ON)", "Interview Descriptions": "Positive. I attended their open house where I had an on-the-spot interview with someone from HR for that lasted about 7 minutes. About a week later I was called to a group interview with about 20 other people.", "Interview Questions": "What is an accomplishment you are most proud of?"}, {"date": "9 Mar 2018", "title": "Director, WE Schools Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at WE Charity (Vancouver, BC) in Sept 2016", "Interview Descriptions": "The interview was moved up by a week because of a conflict, I was flexible and rescheduled. When I arrived the day of the interview I was informed we only had 30 minutes because the WE Schools Director had a phone conference scheduled. For a Director position, that's an incredibly short time frame to assess candidates. The current director was the main person asking questions and she had clearly not even glanced at my resume and only asked generic questions. I kept waiting for her to get to something more more substantial. Knowing our time was limited, I didn't elaborate much at the beginning, thinking we'd get to my qualifications and my fit eventually. Before I knew it, the interview was over in 15 minutes, after more or less yes or no questions. Although the person who is in the current role may know best the skill set required, if it's a temporary fill, like a mat leave, this person may be too subjective and possibly even threatened to hire a candidate more qualified than themselves.", "Interview Questions": "Why did you apply for WE Charity?"}, {"date": "7 Oct 2016", "title": "Speaker and Facilitator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at WE Charity (Toronto, ON) in Sept 2016", "Interview Descriptions": "The interview process was fairly easy. I started off with a cell phone call roughly three weeks after I had applied for the job. The person on the other end of the line was kind and very pleasant to speak with. I was informed that the job would require a multi-stage interview process (at least 3 rounds)", "Interview Questions": "Why do you want to at WE?\r\n\r\nWhat experience do you have as a speaker?\r\n\r\nAre you comfortable speaking to large audiences?\r\n\r\nSimple questions like that."}, {"date": "3 Dec 2018", "title": "Talent Hospitality Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at WE Charity in Jul 2016", "Interview Descriptions": "one phone interview, one in person interview. The offer was made a couple days later. And started the position one week later. It was an over all easy experience when it came to the interview process.", "Interview Questions": "How do you balance work and personal life."}, {"date": "4 Apr 2016", "title": "Partner Relations Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at WE Charity", "Interview Descriptions": "Phone interview\r\nIn-person interview with HR and hiring managers\r\n\r\nInterview took 25 minutes. Felt that I was a bit rushed as there was a time limit. Learned a lot about Free the Children during the process. I also prepared some questions which unfortunately I could not get through because of the time constraint. A neutral experience overall.", "Interview Questions": "What are your long-term career aspirations?\r\nWhat are your best skills related to this position?\r\nWhy Free the Children?\r\nScenario questions."}, {"date": "11 May 2016", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at WE Charity (Toronto, ON) in Apr 2016", "Interview Descriptions": "HR and Hiring Managers were all friendly through the interview process. \r\n\r\nTheir newly designed interview space looks really great, but makes for weird interviews because they are sitting so far away from you and in different spots of the room. \r\n\r\nSuggestion to Hiring team is to incorporate some sort of task or assignment to get a better feel for skill sets.", "Interview Questions": "Questions could have been tailored better to the role I applied for; they were quite general and could be answered with a cookie cutter responses."}, {"date": "29 Mar 2016", "title": "Graphic Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at WE Charity (Toronto, PE)", "Interview Descriptions": "had phone interview, did a skills test and was called in for a second interview where I answered some pretty basic questions like why do you want to work for Free the Children? After those, I had to answer some technical questions about the graphic design role to try and see if I know my stuff", "Interview Questions": "what do you look like when you're stressed"}, {"date": "18 Dec 2015", "title": "Coordinator, Youth Programming Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at WE Charity", "Interview Descriptions": "I was contacted about one month after submitting an application online through their career page. I received an e-mail requesting a Skype interview that lasted approximately 15-20 minutes. I felt very rushed throughout the entire interview and the interviewer seemed to be on a rather short schedule and impatient when I had further questions at the end.", "Interview Questions": "Straight forward questions like why are you interested in working for Free the Children? Why would children or youth find you approachable? Why would youth engage with you? How do you balance or schedule yourself in a fast paced environment?"}, {"date": "2 Feb 2016", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at WE Charity in Dec 2015", "Interview Descriptions": "I am applied online, sent both a resume and cover letter. A couple days later I received an email asking me for an phone interview the next day. The interviewer was a very friendly but rather tired-sounding lady, who asked typical questions regarding my background, why I would like to work with Free the Children, why me, etc.. At the end she informed me that she would contact me within a week. I sent a thank yo email and waited but she never emailed me, nor responded to my email.", "Interview Questions": "1. why I would like to work with Free the Children, \r\n2. why me, \r\n3. give me an example working under tight time constrains \r\n4. what do you seek in terms of career growth "}, {"date": "30 Nov 2015", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at WE Charity", "Interview Descriptions": "Had a phone interview. very friendly person interviewing. Asked great questions - detailed to the role. \r\nDuring the course of the interview I could out some more specifics about the job that was not outlined in the description - I felt that they should have been mentioned because it changes the role. \r\nAlso - did not like that you would only be contacted if you were successful in the interview to move on to the next step. I feel like all employers should contact the candidate either way", "Interview Questions": "Explain how your previous work experiences would enable you to do this role."}], [{"date": "28 Jul 2016", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at WE Charity (Toronto, ON) in May 2015", "Interview Descriptions": "There were three interview in the process. The HR person clarified up front that there will be one phone interview, and two in-person interview. All interviews were not out of ordinary. There were some repeated questions during the three interviews. I met with a lot of different employees, managers, and directors. \r\nThere were some last-minute changes in the appointment time so I would suggest to check your email until the last minute.", "Interview Questions": "What are the strengths that you will bring to this role?"}, {"date": "12 Jun 2015", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at WE Charity (Toronto, ON) in May 2015", "Interview Descriptions": "Applied online, got phone interview three days later, then got in-person interview. I only took phone interview but not went to the second one after reading the reviews on this website. They called on time and greeted me. The HR spoke fast and went just as normal interviews. I asked about the negative reviews online regarding the org but she did not address that too much, just saying she cannot speak for others and of course not everybody would feel the same satisfaction.", "Interview Questions": "Why did you apply for this position?\r\nHow did you handle stress?\r\nHow did you develop business relationship?\r\nHow did you manage meet deadlines?"}, {"date": "5 May 2015", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at WE Charity in Apr 2015", "Interview Descriptions": "Applied online, received an email requesting a meeting to discuss the position. Meeting was cut short due to over-run meeting and clashing room bookings. Panel were highly apologetic for the rushed meeting. Received an email the following week advising I was no longer being considered for the position. Followed up with a request for constructive criticism and received informative response.", "Interview Questions": "Tell us a situation where a client or donor was unhappy and how you remedied the situation"}, {"date": "2 Jun 2014", "title": "Management - started as coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at WE Charity", "Interview Descriptions": "Was called for initial screening interview the day after submitting my application. \r\n\r\nInvited to one interview (very disorganised) where I was asked behavioural and skills based questions. You could tell that neither of the people interviewing me had much experience in recruiting or hiring. Interview questions held 3 questions within one so it got confusing trying to answer each part. \r\n\r\nweeks later, invited to a second interview with two different people they asked me about time, mostly. How did I feel about working over time with no pay, what my work ethic is like and how do I get work done when in a time crunch.\r\n\r\nThe next day, I was offered the job. I accepted.... Wish I hadn't.", "Interview Questions": "N/A"}, {"date": "11 Jun 2014", "title": "Fellowship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at WE Charity (Toronto, ON) in May 2014", "Interview Descriptions": "Connected initially through an informational interview with an ex-employee who had very honest insights to share about the company, had the HR member reach out subsequently and arrange a phone interview for a full time position before deciding that a fellowship would be better suited to my skills, experience and availability. Had a panel conduct the interview for the fellowship role, where although the team was very professional and quite honest about the role and its limitations, the subsequent response was to deem me overqualified for the fellowship role. After exchanging multiple emails, had an informational interview arranged for which I was asked to outline roles of my interest, however the interview turned out to be mostly about a different role entirely. Gaps in communication between the various people throughout the process before, during and after the many interviews, nonetheless the honesty of some team members was worth appreciating.", "Interview Questions": "How do you like change, describe a situation where you had to deal with it and how?"}, {"date": "7 May 2015", "title": "Senior Manager In Fundraising Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at WE Charity (Toronto, ON) in Apr 2014", "Interview Descriptions": "Had two interviews, skipped phone interview because was referred by a friend, overall very good interview, they ask the important questions and obvious ones like why do you want to work here, what do you have that is different from other candidates we are interviewing, what would be your strategy in approaching this job if hired etc", "Interview Questions": "Which value on our value infographic do you best affiliate with and why"}, {"date": "25 Feb 2014", "title": "Educational Programming Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at WE Charity", "Interview Descriptions": "Applied for the position in a variety of ways, through mail and email. Don't bother going into the office it's a waste of their time and won't get you anywhere. They're looking for positive, hard working, naive, idealistic candidates. Don't come across as arrogant, too confident, opinionated, etc. A little humour can help, depending on who is interviewing you. I got a call letting me know they wanted to interview me. We did a phone interview first, then an in person interview. They then called back after the weekend and offered me a position. I believe I started the next week. Some questions would be, \"why are do you think you'd be good at this job\", \"how do you handle stress\", \"What type of role do you take on in a group\",,,,,  if you're applying for a sales type position get ready to be put on the spot. Typical type job interview questions from what I remember.", "Interview Questions": "How would you explain international development to a 12 year old"}, {"date": "6 Nov 2013", "title": "Human Resources Administrator Co-op Position Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at WE Charity", "Interview Descriptions": "Went through resume and asked personality questions.", "Interview Questions": "Basic interview questions. "}, {"date": "18 May 2016", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at WE Charity (Toronto, ON) in Oct 2013", "Interview Descriptions": "Pretty comprehensive. There was initial phone screen with HR which was pleasant, then an in person with HR and the person who would be my boss. The third interview was with the HR Director, the person who would be my boss, and two other senior staff. Overall they were professionally run and all the tough and relevant questions were asked.", "Interview Questions": "How do you manage stressful situations?"}, {"date": "20 Nov 2013", "title": "Graphic Designer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at WE Charity (Toronto, ON) in Aug 2013", "Interview Descriptions": "As a recent graduate of OCAD University, I was very excited to receive a call from Free The Children in regards to a full-time graphic design position. Yes, the salary was low, but what can you expect from a human rights charity, right? I place value in other things, and I wanted to make a difference. \r\n\r\nI did some research on Free The Children before interviewing, and my first stop was at GlassDoor. I was quite surprised to see such mixed reviews. It's very obvious there are winners and losers within this organization. However, I took it with a grain of salt, and didn't let it discourage me. \r\n\r\nI arrived on time for the interview, and met with the lady interviewing me, she seemed very friendly. We sat down, and she expressed that the team was looking for a designer asap. She noted the team was impressed by my resume, and liked my work. I was very candid during the interview, expressing both my enthusiasm for the position as well as some of the concerns I had. I wanted to make sure I was going to be getting just as much out of the job as I was willing to put into it. She was aware of the GlassDoor reviews, and she suggested we move upstairs to an office. \r\n\r\nWe went upstairs and soon another gentleman (who I believe was director of marketing) entered the room. She prefaced him by explaining we were having a very candid conversation about the position and my concerns. I explained the nature of my concerns, while reassuring him of my interest in the position, my desires to make a change, and willingness to put in long hours. All of this however, I believe, only works within an environment that promotes mutual respect, empathy, collaboration, and learning from mistakes. \r\n\r\nHe immediately became defensive, and questioned by motivations for being there. He asked me, \"are you here for an interview, or are you here to criticize?\" I explained that I would not have biked across the city of Toronto to maliciously attack Free the Children. Again, I reassured him of my motivations, explaining that I was very enthusiastic about the possibilities that the position entailed, but that I was hoping that they'd be able to address the concerns I was having.\r\n\r\nThat was basically as far as the interview went. The way they handled my concerns was very unprofessional. He was very defensive and evasive. The upstairs interview lasted about 5-7 minutes. The woman suggested that I \"give it some more thought to decide whether or not I wanted to continue with the interview process,\" and to give her a phone call the next day.\r\n\r\nIt was a very weird and uncomfortable experience for me. I understand they experience a lot of turnover. I was very disappointed with the apparently lack of awareness or conflict resolution within the organization, as well as their inability to face adversity and use the large amount of negative feedback that exists to make improvements. The interview experience seemed to confirm what many past and current employees are saying. \r\n\r\nIn conclusion, my experience with Free the Children was very disappointing, and not just on a micro level. There are many inconsistencies and hypocrisies within the organization that is supposed to be built on awareness, empathy, compassion, and equality. What I experienced was more along the lines of naivety, pride, entitlement, inefficiency, power, and corruption. \r\n\r\nI genuinely hope Free the Children can resolve these internal problems so that they can more effectively focus on the real problem.", "Interview Questions": "Are you here for an interview, or are you here to criticize?"}], [{"date": "3 Jan 2017", "title": "Educator Outreach Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at WE Charity (Toronto, ON) in Aug 2013", "Interview Descriptions": "I received a phone screen initially, but I was leaving for a month-long trip to Mexico in three days. The recruiter was gracious, gave no guarantees of future employment, but asked me to contact her when i returned to the country. A day before I was scheduled to return, she reached out again to see if I was still available. We scheduled the first interview for the following week.\r\n\r\nFour interviews in total, but only because I originally applied for a different position (otherwise it would have been three). The recruiter identified that I was overqualified for the role I initially applied for, but asked if I would be willing to apply for a different role that aligned perfectly with my skills and experience. I had two more interviews after that, one that was very comfortable and enjoyable, and one that was surprisingly difficult. The CEO was in the final interview and was extremely intimidating, but very clearly on purpose, to see if I could stay strong under pressure. I left fearing that I didn't get the job, but got a phone call with an offer before I even reached home.", "Interview Questions": "I had prepared a five-minute presentation that I executed in my third interview. In my final interview, they asked me to do the same presentation, but in three minutes instead of five."}, {"date": "26 Feb 2014", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at WE Charity (Toronto, ON) in May 2013", "Interview Descriptions": "My interview experience was pretty good but looking back I know I ignored my gut instincts because I was so eager at the opportunity to work at Free The Children. These were the steps I went through:\r\n1. phone interview\r\n2. group interview\r\n3. phone interview w/ individual who had to step out of the group interview\r\n4. 3-person interview to include individual who did not attend the group interview\r\nThen I was offered the job. I did not find the questions or interview challenging, although it was distracting when most of the individuals at the group interviews were on their cell phones checking emails and texting. I felt this was unprofessional. Also, looking back, I knew the salary I was offered was too low but I made a sacrifice believing that the work I would be doing was worthwhile - it wasn't. They led me to believe my position was different than it really was, which means I was excited for a job that I wasn't going to be doing.", "Interview Questions": "N/A"}, {"date": "1 Apr 2014", "title": "Educational Programming Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at WE Charity (Toronto, ON) in Dec 2012", "Interview Descriptions": "Interview process involved 2 interviews. Mine were done on the same day, though I don't believe this is typical.", "Interview Questions": "Why do you want to work here?"}, {"date": "18 Feb 2016", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at WE Charity (Toronto, ON) in Jan 2012", "Interview Descriptions": "3 Interviews in 1 week. I received an email about it on Monday, interviewed on Tuesday, then did two more interviews on Friday, got the offer the following Monday. It was very efficient and I heard back right away. That being said, I have had friends who have had applied and said that they it was \"radio - silence\" half - way through the interview process...so they have 2 interviews and were told they were going to have a 3rd but never heard back. Having worked there, I know that this is an issue with the HR team being inefficient. If you know someone on a specific team (i.e. the We Day team) who needs someone for their team they will get it done.....but if you have to exclusively go through FTC HR team...well, god luck...", "Interview Questions": "Honestly, just the basic behavioral questions.. \"tell me about a challenge\"..\"when you exemplified leadership\"..\"what would you do if ..\" etc."}]]