[[{"date": "12 May 2023", "title": "Assistant Course Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Full Sail University (Winter Park, FL) in Mar 2023", "Interview Descriptions": "Phone screen, zoom interview with the head of the department, and last interview was a teaching interview via zoom with other course directors. Overall, everyone was very kind. I felt very relaxed and enjoyed meeting everyone.", "Interview Questions": "What would you say to a student if they asked you why they needed to take this course?"}, {"date": "18 Feb 2023", "title": "Department Chair Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Full Sail University", "Interview Descriptions": "It was remote with several colleagues and it was a comfortable enough event. The questions were reasonably rigorous but not scary. I did have to research and prepare, but overall, it was an upbeat and welcoming interview.", "Interview Questions": "What would you do if a student told you their instructor was cancelling classes?"}, {"date": "11 Feb 2023", "title": "Admissions Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Full Sail University", "Interview Descriptions": "They hired me on the spot. I interviewed on Zoom with a team lead and a senior admissions guide in the department or a hiring manager. (The interview took less than 30 minutes. )", "Interview Questions": "Did you have an admissions guide for college? How was your experience?"}, {"date": "21 Nov 2022", "title": "Online Admissions Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Full Sail University", "Interview Descriptions": "Online interview and very casual. I was interviewed by two people , both asked me questions about hobbies or why I would be a good fit. Lasted around 40 minutes.", "Interview Questions": "What would you do to stay motivated working from home ?"}, {"date": "27 Mar 2023", "title": "Campus Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Full Sail University in Nov 2022", "Interview Descriptions": "The interview is very relaxed and fun, it is easy as well. Just introduce yourself and answer a couple of questions and you're good, it's very easy to get in.", "Interview Questions": "Introduce yourself and tell us about your experience"}, {"date": "12 Jun 2023", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Full Sail University (Orlando, FL) in Aug 2022", "Interview Descriptions": "The interview was ok - the first interview was a brief over the phone interview. The interviewer was just unorganized and unreachable throughout the process, they did not communicate well or in the timeline given. No other comments to add.", "Interview Questions": "What do you think about Full Sail's approach to admissions/getting a degree?"}, {"date": "10 Aug 2022", "title": "Document Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Full Sail University (Orlando, FL) in Jul 2022", "Interview Descriptions": "I felt comfortable answering the questions asked with open, honest responses. Every question I had was answered in one interview. Very professional, quick, and precise. I did land a second interview to meet with team leaders and managers. I look forward to the opportunities ahead with fullsail.", "Interview Questions": "They asked the basic interview questions. "}, {"date": "11 May 2022", "title": "Account Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Full Sail University", "Interview Descriptions": "Standard interview process with a couple of employees within department. Interview was informative and directly related to the position I applied for. Hiring manager asked me relevant questions about my experience and told me information about the role.", "Interview Questions": "What is your relevant experience?"}, {"date": "29 Jul 2022", "title": "Support Team Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Full Sail University in May 2022", "Interview Descriptions": "There's nothing worse than circumstances yay can't control your interview, and that's exactly what happened when I was interviewed. My settings wouldn't allow zoom camera access. I had been trying for several minutes until the zoom meeting was canceled and I was kicked out. My chances on getting the job even after I rescheduled were very slim. Long story short, always be prepared and have a backup plan incase zoom isn't being friendly when you need it the most!", "Interview Questions": "If you had to be a kitchen utensil, which would you choose to be and why?"}, {"date": "11 Feb 2022", "title": "Regional Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Full Sail University", "Interview Descriptions": "Phone interview and group panel interview on skype.  Each panelist asked questions related to job description and experience.  After panel interview offer for position was made.  Entire panel joined to make offer.", "Interview Questions": "Why do you feel you are qualified for the position? "}], [{"date": "3 Oct 2021", "title": "Outreach Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Full Sail University", "Interview Descriptions": "It was an easy process! It was about 3 interviews until I was offered the position. One was a mock presentation to show presentation skills. Overall a smooth and easy process.", "Interview Questions": "What are some of your strengths and weaknesses"}, {"date": "11 Nov 2021", "title": "Tier I Technical Support Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Full Sail University in Oct 2021", "Interview Descriptions": "I applied online and they gave me a call back about a week later. Gave a brief overview of the position and asked a little about myself. Scheduled a zoom interview a week in advance and got more in-depth and learned more about the position and me as well. We scheduled a mock call/chat to be done over zoom a couple of days after, and I also had to fill out a Google Form of different info that included things like my typing speed and reviewing sample phone calls. About 2 weeks later they informed me via email that I didn't get the job.", "Interview Questions": "What is your customer support/technical experience?"}, {"date": "9 Jul 2021", "title": "Financial Aid Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Full Sail University", "Interview Descriptions": "Interview was a quick process.  The managers asked their questions and were efficient about letting you know if you received the job.  Once you confirmation HR set up training and you knew your start date.", "Interview Questions": "They asked about your willingness to work with a team."}, {"date": "17 Aug 2021", "title": "Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Full Sail University (Orlando, FL) in Jun 2021", "Interview Descriptions": "Interview took place via zoom. The questions were straight forward and to the point. There were about 6 people on the panel and they wanted to know extensive information about previous work experience and how it pertained to the job.", "Interview Questions": "They wanted to know my experience with student services."}, {"date": "28 May 2021", "title": "Feels Like Family Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Full Sail University", "Interview Descriptions": "Did a zoom meeting about 30 mins long. Asked the standard questions and told me about the position. It’s a easy process and they are willing to work around my schedule to make sure I’m comfortable and available.", "Interview Questions": "Are you okay with working late nights and holidays?"}, {"date": "4 May 2021", "title": "Email Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at Full Sail University", "Interview Descriptions": "I started our contract to hire. It was a 3 month initial trial. I had one in person interview with my manager and a week after I got the role and 5 months later it turned to permanent", "Interview Questions": "Are you comfortable to work with Oracle Eloqua"}, {"date": "13 Oct 2020", "title": "Photo Lab Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Full Sail University", "Interview Descriptions": "the interview process went great - it was mostly about past experiences to speak of and goals about the future - and good methods of teachings -\r\n\r\nthe interview process went great - it was mostly about past experiences to speak of and goals about the future - and good methods of teachings -\r\nthe interview process went great - it was mostly about past experiences to speak of and goals about the future - and good methods of teachings -", "Interview Questions": "goal for the future - "}, {"date": "13 Feb 2021", "title": "Seasonal Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Full Sail University (Gulf Breeze, FL) in Sept 2020", "Interview Descriptions": "Quiet easy, maybe 20 minute interview asking about experience and normal questions. Talked about dress code, what the job includes and what “seasonal” means. Super easy interview, out of all of the interviews I’ve been in.", "Interview Questions": "Around When can you start ?"}, {"date": "15 Sept 2021", "title": "Associate Course Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Full Sail University (Winter Park, FL) in Aug 2020", "Interview Descriptions": "It was really nice, on a paced conversation.\nPeople were very polite and all the questions made were pertinent and related to the position I was enrolling.\nI had to talk about my background and present my work, usually it's how we do in the Industry.", "Interview Questions": "It was mainly about my background and achievements on the professional fiel.  "}, {"date": "28 Mar 2020", "title": "Associate Course Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Full Sail University", "Interview Descriptions": "Full Sail advertises that they are a nontraditional institution with flexible, nontraditional schedules (i.e. some faculty have to teach face to face courses at 1am).  When I began to ask about the unusual schedule, one of the interviewers seemed to be displeased.  The job was also advertised as being \"flexible\" but I was told at the interview that I'd have to work on site M-F from 9-5pm for a full month before I'd be *considered* for flexibility outside normal business hours.  After trying to get some clarification, the interviewer became agitated and said to me, \"It sounds like you don't really want to work here!\"  Look, I'm just trying to understand what type of schedule will be expected of me.    I have just as much a right to interview you as you do me.  Needless to say, I was not hired.   Thank you for doing me a favor.  I don't apply to jobs that offer flexibility so I can be micromanaged.", "Interview Questions": "What kind of environment would you absolutely not want to work in?"}], [{"date": "5 Mar 2021", "title": "Staff Accountant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Full Sail University (Winter Park, FL) in Feb 2020", "Interview Descriptions": "This interview was very straightforward. They promptly sit you down with about two to three other managers or supervisors. You get a brief overview and a few questions that revolve around your daily responsibilities.", "Interview Questions": "Describe how you would handle a situation with outstanding balances with no paper trail?"}, {"date": "17 Jul 2019", "title": "UX Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Full Sail University", "Interview Descriptions": "They let you work around a few days before the interview to see if you fit the environment, after that the interview is scheduled with a few people at the same time and completes in one round", "Interview Questions": "Tell us about a time you faced conflict at the workplace?"}, {"date": "20 Jun 2019", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Full Sail University (Orlando, FL)", "Interview Descriptions": "Interview was easy going. Panel based interview. Whole process took about 3 months before I got the offer.  Got a call back for another interview which was 1-1 based. Few weeks later I got the position.", "Interview Questions": "How did you hear about this position "}, {"date": "9 Aug 2020", "title": "Admissions Advisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Full Sail University (Orlando, FL) in Jan 2019", "Interview Descriptions": "Weird, they had a list of questions. Did not stray from pre made questions. Very stuffy and quick. People were nice though. It was a panel of five or six people, each person read one or two of the questions then moved along. No follow ups", "Interview Questions": "Tell us about yourself"}, {"date": "20 Jul 2021", "title": "Inbound Support Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Full Sail University (Orlando, FL) in Jan 2019", "Interview Descriptions": "I had a phone interview first that was around 30 minutes. The hiring manager introduced themselves and the company. We discussed the job responsibilities and descriptions as well as starting salary and opportunities for growth in the company. They asked about my employment background and just general information about myself - education, interests, hobbies, etc. Then there was another interview with different managers. The interview itself was laid back and conversational. It was a pleasant experience and they made me feel comfortable and it was not the generic interview questions which made it fun.", "Interview Questions": "What are your short and long term career goals."}, {"date": "12 Aug 2020", "title": "Help Desk Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Full Sail University (Winter Park, FL) in Jan 2018", "Interview Descriptions": "Zoom meeting with three people. Friendly yet not so clear at first about the position. It’s not much IT related , more like a hostess/receptionist. Was nervous but liked the outcome, very friendly.", "Interview Questions": "Tell me about yourself. What would you do when it’s very busy? Conflict resolution."}, {"date": "8 Nov 2017", "title": "Internet Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Full Sail University", "Interview Descriptions": "Had three different interviews with different individuals from the marketing department.  It was valuable to meet with different people but the process was long and stretched over a four month period.", "Interview Questions": "What type of budgets have you managed before?"}, {"date": "27 Oct 2017", "title": "Online Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Full Sail University (Winter Park, FL) in Sept 2017", "Interview Descriptions": "You will need to submit resume and cover letter. There will be a brief phone interview where the person will set up a school tour and interview. After the tour there will be a person interview with two or more people. Then a follow up call phone interview with an offer.", "Interview Questions": "Tell me something fun about yourself."}, {"date": "11 Aug 2017", "title": "Online Admissions Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Full Sail University (Winter Park, FL)", "Interview Descriptions": "I came in for an interview and they had me take a tour of the school first. My interview had all 5 of the managers, and the director came in mid-way. It was very informal and was conversational. They want to make sure you're outgoing and you can have conversations since that's the job. I was offered the position on the spot and was told they had never done that before.", "Interview Questions": "If you could pick a degree program to take, which one and why?"}, {"date": "10 Sept 2018", "title": "Student Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Full Sail University (Winter Park, FL) in Mar 2017", "Interview Descriptions": "Interviewer I met, Travis, is really friendly. The whole interview process is smooth and it doesn't feel like a interview at all. Very general and reasonable questions. One thing I know after getting employed is that they look for protential positive and happy candidate to fit the positions.", "Interview Questions": "What will you reply to the guests in the situation of they asking a question that you are not sure with the answer?"}], [{"date": "13 Jul 2016", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Full Sail University (Winter Park, FL)", "Interview Descriptions": "super easy. Just sell that you want to stay there long term and that you love being on the phone for hours making students pay for an education they can't afford, whoops I meant \"serving the student.\"\r\n\r\nThe department has crazy high turnover so they want to ensure that you will stay forever. \r\n\r\nThe culture is upbeat and positive. Be as outgoing and positive as possible. If you're negative in the interview, managers will know that there's no way your spirit will be able to handle the job so they probably won't hire you.\r\n\r\nAlso, being a \"yes\" person is great. The department is basically a day care with lots of early 20 somethings who are not confident and easy to boss around.", "Interview Questions": "How did you handle a customer who had a problem and/or was upset?"}, {"date": "28 Jun 2016", "title": "Security Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Full Sail University (Winter Park, FL)", "Interview Descriptions": "Applied on line. Was called by director of security and a meeting was set up.. At the meeting i was interviewed by director of security and hard form application was filled out.. A few weeks later i was called and offered the job. I accepted the postion and orientation date was set up..", "Interview Questions": "Asked if i was reliable.. And had my own transportation as well as a valid drivers license. also asked me if i had the proper state license for the job i was applying for.."}, {"date": "15 Apr 2016", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Full Sail University (Winter Park, FL) in Apr 2016", "Interview Descriptions": "I came in facing a panel of 5 employers and you think that would be intimidating. However, it was the complete opposite. They were happy to talk to me and made me feel welcome and comfortable. It felt more like an open conversation in which I shared with them and also heard each of them.", "Interview Questions": "Have you ever been in this kind of setting where you are talking on the phone a lot and engaging another person in conversation?\r\nWhat skills do you have that would make you be a good fit for this job?\r\nWhat attracted you to Full Sail and what made you want to apply for this position?"}, {"date": "20 May 2016", "title": "Lap Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Full Sail University in Apr 2016", "Interview Descriptions": "I met with 2 employers and had an open discussion with them. They made me feel comfortable and welcomed, and made the entire interview great. We discussed my previous work as well as what they were looking for in their ideal candidate for the new class. We talked about the objectives of the new class and what to look forward to on my end.", "Interview Questions": "How was my experience doing freelance work and how would it influence my work?"}, {"date": "13 Feb 2016", "title": "Associate Course Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Full Sail University (Winter Park, FL) in Jan 2016", "Interview Descriptions": "Positive experience with in-person interview on campus with 4 other faculty. Faculty was supportive and friendly and asked good questions. Second interview a week later by providing a presentation to 7 more faculty. Approximately one hour each interview. After one month, still waiting for an offer. Employee verificaton and background check has occurred.", "Interview Questions": "Why do you want this position?"}, {"date": "21 Jan 2016", "title": "Lab Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Full Sail University (Winter Park, FL) in Jan 2016", "Interview Descriptions": "I had a phone interview. Over all I didn't think it went well because it was 3 on the far end and people seemed to be speak on top of each other. I am disappointed in the pay that was offered. I was told it could be 2 weeks till I heard back.", "Interview Questions": "Asked me how my experiences relate to the course"}, {"date": "5 Jan 2015", "title": "Admission Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Full Sail University", "Interview Descriptions": "two week process. Met with director..spoke with vice president,and other employees.. had to also submit resume day of interview..They do have you do assignments in order to be promoted to the level.", "Interview Questions": "didn't have any"}, {"date": "6 May 2015", "title": "Admissions Connection Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Full Sail University (Orlando, FL) in Jan 2015", "Interview Descriptions": "I was surprised when they didn't treat me like I was being interviewed. It was more like a casual conversation between two hiring managers and myself. Surprising and awesome. I also asked for more pay and they gladly obliged.", "Interview Questions": "What's your dream job?"}, {"date": "6 Sept 2017", "title": "Course Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Full Sail University (Winter Park, FL) in Aug 2014", "Interview Descriptions": "Several phone calls and one final face-to-face interview with six team members. The face-to-face interview was at your own expense, non-reimbursed. The group I interviewed with was very laid back, easy going, and they really didn't ask tough questions.", "Interview Questions": "Conflict management with students, how I dealt with it!"}, {"date": "14 Jul 2014", "title": "Data Marketing Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Full Sail University (Orlando, FL) in Jun 2014", "Interview Descriptions": "The environment of Full sail was really good. The interview was very short, it lasted no more than 15 minutes. The interviewer was very nice. The job was related to use SQL, Tableau, Excel tools and launch the personal interview and focus group to identify the opportunities for Full Sail University.", "Interview Questions": "N/A"}], [{"date": "5 Nov 2015", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Full Sail University (Orlando, FL) in May 2014", "Interview Descriptions": "I went in for a group interview, there were at leas 15 others interviewing. The interviewer was condescending and judgmental. She knew some of tbe interviewees and clearly gave special treatment to them.", "Interview Questions": "Why do you want this job?"}, {"date": "20 Sept 2015", "title": "Student Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at Full Sail University (Winter Park, FL) in Apr 2014", "Interview Descriptions": "It was very relaxed in presentation, yet very formal in quality. The interviewers were the potential bosses, so they knew the position intimately and were knowledgeable about what specifically to look for. Interviews were held on a fairly regular interval but the actual hiring process was very selective.", "Interview Questions": "Would you rather have one horse sized duck or ten duck sized horses?"}, {"date": "26 Jul 2018", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Full Sail University (Winter Park, FL) in Mar 2014", "Interview Descriptions": "Sat at a large table with all of the managers from the department managers. Kind of intimidating. Had a phone interview first. They really drilled me with questions and fallow up questions.", "Interview Questions": "Basic interview questions. "}, {"date": "20 Jun 2018", "title": "Lab Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Full Sail University (Orlando, FL) in Mar 2014", "Interview Descriptions": "If you know someone in the school and a position opens, consider it yours. Even without much experience. You just need a BA degree. The interview was semi formal, but it didn't require you to answer any difficult questions.", "Interview Questions": "What will you bring to the job and/or help improve it?"}, {"date": "21 Sept 2017", "title": "Enrollment Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Full Sail University (Winter Park, FL) in Sept 2013", "Interview Descriptions": "I knew someone already employed at the university. Referrals are big there. The interview was about an hour long in front of a panel of people who took turns asking questions.", "Interview Questions": "Describe yourself in five key words."}, {"date": "2 Aug 2013", "title": "Full Sail Online Support Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Full Sail University", "Interview Descriptions": "Team Leads review resumé's and select who they feel are the best candidates. Initial phone interview is conducted and the transcripts are shared with the manager and Team Leads. From here it is decided who will get a face to face interview. \r\n\r\n Face-to-Face interviews are done panel style with all four Team Leads and the department manager. If the Face-to-Face goes well then you are tasked with the creation of a video telling the team a bit about yourself. In the video you are to use some of the tools you will be asked to support as a team member, i.e. Mac, iMovie, Garageband, CS6, Keynote, etc. You will also be asked to right a summary explaining why you feel you are good fit for the team.", "Interview Questions": "Level of empathy and patience needs to be high. "}, {"date": "15 Oct 2013", "title": "Library Technical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Full Sail University (Winter Park, FL) in Aug 2013", "Interview Descriptions": "For this entry-level position, I was contacted within 2-3 weeks of applying for the position, and was asked to participate in a preliminary round of phone interviews. I was immediately emailed a list of potential interview times, and asked to choose two slots that would work with my schedule. The phone interviews were Monday-Thursday morning, and each interview lasted less than 30 minutes. That Friday-Saturday I was emailed an invitation to interview again, in person, the following Monday-Wednesday. I was asked to again choose between two time slots and emailed another confirmation. Everything moved very quickly initially. When I arrived for the interview I spoke with the head librarian and the head of the department. They asked very few questions that were related to the position, and instead, tried to ask me questions about myself and my hobbies. It felt a little unprofessional, and I was a little uncomfortable. After the 30-45 minute interview I was given a tour of the (insanely small) library. I was told that if I was contacted in the next week I would return for a third interview, & if I didn't hear from them, then they had gone in \"another direction\". A week passed, and I heard nothing, so I started applying for other jobs. After more than 3-4 weeks I was contacted by phone, asking if I was still interested in the position. The head librarian said they never hired anyone. I was emailed a \"real\" application, & told that I had to drop off a physical copy of an application, and then I would be contacted for the 3rd interview. When I dropped off my application I had hoped to speak to the head librarian, but I wasn't allowed inside the building, which was very odd. I sent a follow-up email to the head librarian the next day, asking if she had received my application, but she never responded. A week went by & I sent another email asking if there was any additional information they needed from me, which was again met with no reply. After 2 more weeks, never having had that 3rd interview, I was sent an email that thanked me for my time and said that they had hired another candidate. All in all, I had a very poor experience interviewing with the \"university\".", "Interview Questions": "The head of the department asked me what types of after-school activities & extra-curricular classes I participated in during high school. As a recent college graduate, that had completed multiple collegiate internships, I wasn't really sure how that was relevant. Full Sail is a liberal arts \"university\", & I have always been active in fine art and drama, so I thought that would have sufficed, but the man seemed upset that I didn't participate in band or play any instruments. It was very odd.  "}, {"date": "20 May 2016", "title": "Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Full Sail University (Winter Park, FL) in Jun 2013", "Interview Descriptions": "The hiring manager asks a series of questions pertaining to your life, education, and short & long term goals, to basically get to know you. From there, the hiring manager asks hypothetical questions like \"What would you do if?\"or \"How would you handle?\" to determine your reasoning and customer service skills. The interview is pretty light hearted and is formed as more of a conversation than an interview, which make it very comfortable.", "Interview Questions": "If you had to go into battle, would you choose to fight with 10 horse-size ducks or 10 duck-size horses?"}, {"date": "27 Apr 2015", "title": "Lab Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Full Sail University (Boston, MA) in Apr 2013", "Interview Descriptions": "I was interviewed over the phone and through email.  I never really had to interview for the position as I was more than qualified for it.  I know the program director for the department I was applying for so it was very easy to get the process going.", "Interview Questions": "Are you a legal resident of the United States?"}, {"date": "30 Jan 2013", "title": "Online Enrollment Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Full Sail University", "Interview Descriptions": "1) I was contacted a few months after submitting an application online.\r\n2) I was contacted by phone and had an informal phone interview for about 20 min\r\n3) I was asked to come into the office for a formal interview with three managers\r\n4) Interview took about an hour", "Interview Questions": "Very straight foward. "}], [{"date": "25 Apr 2017", "title": "Quality Assurance Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Full Sail University (Winter Park, FL) in Jan 2013", "Interview Descriptions": "The interview process was well done.  I felt they asked some good questions especially to someone who has never been in a call center environment.  I was use to being outside on my own and never was inside.", "Interview Questions": "Can you see yourself sitting for 8 hours when you are use to being outside. "}, {"date": "4 Nov 2012", "title": "Financial Aid Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Full Sail University (Winter Park, FL) in Jun 2012", "Interview Descriptions": "Called in for an Interview, Basic interview questions and explaining the job details. A couple weeks later got called in for work. They did not contact my references, no Drug test and they did do a personality test that I needed to complete before I went in for my interview. Some of my co-workers had two interviews and some where interviewed by two managers at the same time. Interviews were nothing to be stressed about, just look professional and understand basic Financial Aid stuff and you should do fine.", "Interview Questions": "If the Salary was okay for me, the pay is a lot lower than the pay for this position in other companies, but they hire people with no experience and give you up to a month of training."}, {"date": "19 Oct 2015", "title": "Course Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Full Sail University (Winter Park, FL) in Feb 2012", "Interview Descriptions": "I was interviewed by the program coordinator and the program director. It was a typical instructor interview with your typical teaching questions.  I was asked to present reaching materials that I have created. I presented materials that I made and used in previous teaching contexts. It was an overall enjoyable interview.  \r\nThe hiring process took longer than I expected.  It seemed that they could not inform me that I was hired until months later.  I was holding my breath for months waiting to hear about my application process.", "Interview Questions": "I was asked a situational question. "}, {"date": "9 Apr 2016", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Full Sail University (Orlando, FL) in Jan 2012", "Interview Descriptions": "I interviewed twice and with different people before I got an offer. I also had to fill out a personality test so the hiring manager would know a little bit more about me before our final interview. The department was starting to grow fast and they needed people with specific skills and knowledge.", "Interview Questions": "What is your main goal?"}, {"date": "9 Aug 2016", "title": "Lab Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Full Sail University (Winter Park, FL) in Jan 2012", "Interview Descriptions": "Met with team leader and discussed my goals and how I saw myself working within their system. We spoke about common projects that we both appreciated and how we would work on them and complete them if they were our own Productions.", "Interview Questions": "What were some of the projects that I worked on"}, {"date": "9 Dec 2012", "title": "Course Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Full Sail University (Winter Park, FL) in Oct 2011", "Interview Descriptions": "Interviews with staff member, and guest lecture.", "Interview Questions": "Why do you want to teach?"}, {"date": "28 Aug 2015", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Full Sail University (Winter Park, FL) in Sept 2011", "Interview Descriptions": "A basic interview covering resume and skills. The staff is concerned about people fitting the University's culture. I think this helps produce an interesting and enjoyable work environment. It is also important that people work closely, as their is limited training and you will learn many basic job functions from your coworkers.", "Interview Questions": "Why do you want to work for Full Sail University?"}, {"date": "27 Jul 2013", "title": "Admissions Connection Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Full Sail University (Winter Park, FL) in Sept 2011", "Interview Descriptions": "The initial contact was from a recruiter that saw my resume on my college's resume board. I started conversing with them and eventually he forwarded my information to the actual staff. They asked basic questions like what I expected of the position, was I ok with pay and schedule, what are my career aspirations, etc. At that point, I was brought in for an in-person interview with the department director and assistant directors. A few days later, I got the initial verbal offer from the company to which I accepted. I was then given details on the first day/training, etc.", "Interview Questions": "The most off the wall/difficult question was \"What have other people pointed out as your biggest weakness?\""}, {"date": "26 Oct 2015", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Full Sail University (Winter Park, FL) in Aug 2011", "Interview Descriptions": "Easy Interview. They explained the University and what my job role would be. Explained the rate of pay and benefits package that was offered. Also explained that over time was readily available.", "Interview Questions": "What is your previous security experience?"}, {"date": "13 Jun 2014", "title": "Course Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Full Sail University (Winter Park, FL) in Jul 2011", "Interview Descriptions": "The interview process was a Skype interview. I applied for numerous positions for almost 2 years before I got my first interview. The on-boarding process after receiving an offer was slow: 2 months.", "Interview Questions": "I did not have any questions that tripped me up or were unexpected."}], [{"date": "9 Jun 2011", "title": "Financial Aid Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Full Sail University (Winter Park, FL) in May 2011", "Interview Descriptions": "The questions asked are very standard. Nothing out of the ordinary--what are your strengths/weakness, what will you bring to the company ect. The people seem very nice and the staff  is a blend of other financial aid employees from other schools such as Kaplan, Devry, ITT ect. The benefits are ok, after 6 months you get 1 wk vacation and after a year 2 wks and 5 sick days. The offer flex time and 1st shift schedules.", "Interview Questions": "N/A"}, {"date": "8 Jul 2013", "title": "Course Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Full Sail University (Winter Park, FL) in Mar 2011", "Interview Descriptions": "Very very simple!  Went on basic interview and got a callback a few days later.", "Interview Questions": "N/A"}, {"date": "8 Sept 2015", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Full Sail University (Winter Park, FL) in Feb 2011", "Interview Descriptions": "Unorganized, didn't even know exactly where to go and people didn't answer phone. Waited outside for someone to talk to me. I didn't meet with the person I was supposed to meet with, was interviewed by someone else. Wasn't hired for the job because I didn't interview for the right person.", "Interview Questions": "How do you handle stress"}, {"date": "8 Sept 2011", "title": "Web Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Full Sail University (Winter Park, FL) in Jun 2010", "Interview Descriptions": "Interviewed by Project Manager along with 2 staff - Web Designer and Web Developer - Was asked random skill questions from several tests regarding CSS, HTML and MySQL", "Interview Questions": "What was the best job you had and why?"}, {"date": "23 Nov 2014", "title": "Lab Specialist In Audio Post Production, In the Film Program Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Full Sail University (Winter Park, FL) in Mar 2010", "Interview Descriptions": "Hiring was basically on the spot, by the Course Director, within mins I had that job based on my reputation and quality of my work. \r\nThe interview was more of a conversation among peers. \r\nBut you need to understand that I did not start working for them or collecting a paycheck for 3 months. The executives had to approve my being hired and the never do anything quickly. Ever.", "Interview Questions": "If you had an angry upset or emotional student how would you handle it?"}, {"date": "20 Nov 2012", "title": "Digital Art & Design Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Full Sail University (Winter Park, FL) in Feb 2010", "Interview Descriptions": "Very smoothly with great respect.", "Interview Questions": "None."}, {"date": "17 Dec 2013", "title": "Associate Course Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Full Sail University in Aug 2009", "Interview Descriptions": "I applied by directly emailing the hiring manager, who I found via a current employee. I was called by a program coordinator who arranged my interview. My interview was fairly laid back, but now that I've worked there for four years, I believe the interviews will vary wildly depending on the department manager. The manager mostly wanted to know about my professional work experience, rather than my education and teaching experience, even though I was interviewing for a teaching position for a Gen Ed class. I later found out that it was because she was interested in me teaching another class that required professional management experience, rather than the Gen Ed class I was applying for. After the verbal interview I had to take a short, very easy grammar test, which I don't think they do anymore. I only had one interview, then about four weeks passed and the department manager called me and told me she wanted to offer me the job, but had to wait for HR approval; she was just checking to see if I was still available. Another two weeks passed, then I got a call from the department manager (on my birthday!) offering me the job. I started two weeks after that.", "Interview Questions": "I was most surprised to be asked about my professional management experience, rather than about my teaching experience and education. "}, {"date": "17 Mar 2010", "title": "Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Full Sail University (Orlando, FL) in Aug 2009", "Interview Descriptions": "The only way to apply to teach at Full Sail is on line.  It seems that some of their postings were ongoing - they were posted for months!  No indication as to a closing date for the posting or a tentative hire date.   I was called in for an interview almost 3 months after I applied.  \r\n\r\nThe person that interviewed me was an instructor - and recently promoted to a project manager. I was told I was being interviewed to be an \"online instructor\" - 40 hrs a week sitting at a computer with a headset on.  Not my idea of teaching!  And not what I was interested in doing. \r\n\r\nThe person who interviewed me had weak interview skills. Rather than asking appropriate questions, she did most of the talking about herself and her background.  Maybe they already had someone in mind to hire so the interview was prefunctory.  Not surprised I didn't get an offer.", "Interview Questions": "Why are you interested in teaching at Full Sail? "}]]