[[{"date": "28 Mar 2023", "title": "Communications Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Nebraska Omaha (Omaha, NE) in Dec 2022", "Interview Descriptions": "Phone screening via Zoom with invite to campus interview as second step. Interview was pretty standard - be prepared to tell them about yourself, to get into examples of your work that are reflected in the job requirements.", "Interview Questions": "Why do you want to work here? (What do you know about UNO -- it's character as a university in a city.)"}, {"date": "20 Sept 2022", "title": "Economics Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Nebraska Omaha", "Interview Descriptions": "Received emai,  set a time,  zoom interview, sample teaching for about 20 minutes on selected economic related au jects and then talking about the institution,  why did you choose here,  how would you solve problems in class room, how do you approach retention rate and questions like that. ", "Interview Questions": "Interview mostly on non educational issues. \nAnd father that I Never got any feedback or update. "}, {"date": "21 Apr 2022", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Nebraska Omaha", "Interview Descriptions": "Zoom, short and to the point. Asked questions relevant to the job that was being advertised. Did not take long to schedule interview, did not take long to Gove feedback on the job offer.", "Interview Questions": "\"why do you want this position?\""}, {"date": "25 Jan 2023", "title": "Financial Services Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Nebraska Omaha in Apr 2022", "Interview Descriptions": "Completed on zoom, met with one supervisor and one current employee. Both were friendly and enthusiastic when interacting pre-interview and after. They were professional and fast to respond with an offer after the interview. Very responsive.", "Interview Questions": "Describe previous experience, answer situational \"what would you do if...\" questions, share examples of previous achievements or work ethic"}, {"date": "18 Dec 2022", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Nebraska Omaha in Sept 2020", "Interview Descriptions": "Good interview and great staff. Was a good position while I was in school. Would recommend. Was flexible with school schedule which was nice. Interview was easy but asked good questions.", "Interview Questions": "What do you feel you can contribute to this role?"}, {"date": "20 Jan 2023", "title": "Guest Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of Nebraska Omaha (Omaha, NE) in Sept 2019", "Interview Descriptions": "Pretty laid back interview, ask about your background and other simple things. Will ask about school schedule and any leadership experience. That was about it with the interview process. Need a few more words to finish this box.", "Interview Questions": "What was a situation where I was a leader"}, {"date": "25 Apr 2018", "title": "Event Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Nebraska Omaha (Omaha, NE) in Mar 2018", "Interview Descriptions": "Applied on line on Thursday night. Received email the very next day requesting availability for a phone interview. Phone interview scheduled within the week. 3 weeks later I received an email from HR saying I had not been selected. Two days after that, my recommendation letters where requested (I do not understand why they bothered my boss, my former boss and my colleague if they had already made a decision). All 3 letters were sent but I did not heard anything else from them.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "26 Mar 2018", "title": "Graphic Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Nebraska Omaha (Omaha, NE) in Oct 2017", "Interview Descriptions": "At the places I worked for at UNO I had to interview with two people at once. They each took turns asking me questions and then I just answered the best I could.", "Interview Questions": "How did you hear about [our organization/the job]?"}, {"date": "19 Aug 2020", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Nebraska Omaha (Omaha, NE) in Apr 2016", "Interview Descriptions": "Panel interview, all female, one student intern. I had a conflict of interest being an advisor for the student in another capacity and did not know she would be there. The interview overall went well. I became uninterested in the department after the interviewer commented on my extensive community service background and presented it as a negative in me as a candidate. I of course know that taking a full-time position in academics would mean altering my outside commitments.", "Interview Questions": "They use the STAR model. Strengths and weaknesses. Tell me about a time when.."}, {"date": "14 Jul 2015", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Nebraska Omaha (Omaha, NE)", "Interview Descriptions": "I submitted my application online, which was a straight forward process. I met with the Dean prior to the formal interview being scheduled. The interview was one full day, including a teaching demo/presentation, meetings with various groups and dinner with the search committee at an incredibly noisy restaurant.  In hindsight there were red flags throughout the interview--contentious faculty (at the time I thought they were playing devil's advocate), tension between the Dean and some faculty, support staff who had to be coaxed into engaging (I thought they were introverted), a hostility towards discussion of incorporating technology into delivery/access by a majority of the department faculty and an overall lack of engagement/interest in engaging beyond the local area.", "Interview Questions": "Where do you see yourself in 10 years?\r\nWhat attracted you to this position?"}], [{"date": "29 May 2015", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at University of Nebraska Omaha (Omaha, NE)", "Interview Descriptions": "The interview was short and just about my resume. I was asked to write a bit of code too. Towards the end of the interview it was informal and discussions about technology and common interests with the interviewer.", "Interview Questions": "Q) Do you have any prior work experience in Web Development?"}, {"date": "18 Sept 2014", "title": "Full-Time Faculty Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Nebraska Omaha", "Interview Descriptions": "The automated process to submit a CV and other supporting documentation was smooth and worked quite well. I especially appreciated being able to provide my CV by having the system pull it  from LinkedIn. I wish everyone did it this way now as it's so much easier than messing about with document formats and hoping that your file isn't 5KB over some arbitrarily tiny file size limit.\r\n\r\nThe interview itself seemed like it was cobbled together at the last minute and the interviewers, a cadre of current faculty from the department, seemed hurried and rushed. Overall, there was good communication with me up to a point until after the interview was over. After the interview, it would have been nice to receive some (read \"any\") communication about the verdict. I went through the process and it would have been the polite thing to at least thank me for my time. Emails aren't hard to send and that one would have taken two minutes instead of letting me hang on for two months with only my hunch to guide me.", "Interview Questions": "What specific goals do you want to meet at the end of your first year?"}, {"date": "22 Apr 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Nebraska Omaha (Omaha, NE) in Jul 2014", "Interview Descriptions": "It was a very informal process. Was asked about research experience, areas of interest, skills acquired and availability. No tests required. Was evaluated by a professor who was able to assess cultural fit on the spot.", "Interview Questions": "Tell me about your research experience. "}, {"date": "17 Jun 2014", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Nebraska Omaha in Apr 2014", "Interview Descriptions": "They interview what courses you have taught before and how you would teach a particular class. Some situational questions: what would you do if students struggle with your problem sets, etc.", "Interview Questions": "N/A"}, {"date": "15 Nov 2013", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Nebraska Omaha", "Interview Descriptions": "There was a phone interview followed up by an interview on campus. On campus interview consisted of meeting with department, campus-wide forum, supervisor, and other constituents. The people I met were friendly and professional. Office culture seemed to be very open, relaxing, and a value for working together as a team.", "Interview Questions": "What is one thing your former supervisor said you had to improve on? How have you worked on making improvements?"}, {"date": "25 Jul 2015", "title": "Graduate Assistant Literacy Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Nebraska Omaha (Omaha, NE) in Jul 2013", "Interview Descriptions": "I was contacted by one professor with intentions of setting up a date for an interview. Within a few days I was interviewed and the interview lasted approximately one hour. I was interviewed by a panel of four professors/instructors. The interview went relatively well, except that I thought it would be longer and I wasn't asked the typical questions of \"What is your greatest strength/weakness?\" I was told at the end of the interview that I would be contacted by the end of the week with their decision. I was contacted the next day with the job offer! Yea!", "Interview Questions": "As a classroom teacher, what method did you use to teach Reading?"}, {"date": "16 Apr 2012", "title": "Information Systems Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Nebraska Omaha (Omaha, NE) in Mar 2012", "Interview Descriptions": "The in person interview was done with a panel of people and was very intimidating.  It could have been broken up by areas.  Hard to make sure that everyone got the information they were asking for.", "Interview Questions": "N/A"}, {"date": "25 Aug 2015", "title": "Staff Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Nebraska Omaha (Omaha, NE) in Aug 2011", "Interview Descriptions": "I had two interviews with a single person each time. Very straightforward and traditional interviewing process. Most of the waiting before the offer was waiting on approval from the Dean of the college. Several of the interview topics centered around dealing with interpersonal conflicts in the work place because half of the employees are faculty and half are staff and they wanted to know how I would handle friction within these groups.", "Interview Questions": "How do you handle conflicts particularly when they involve more interpersonal aspects of the job?"}, {"date": "23 Nov 2013", "title": "Bar Runner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at University of Nebraska Omaha (Omaha, NE) in Aug 2011", "Interview Descriptions": "Resume aside, you are asked a few questions about food. Such as:\r\nWhy are you interested in this job?\r\nHave you made anything yourself before?\r\nIf you could make anything, what would you make?", "Interview Questions": "If you could make anything, what food would you make?"}]]