[[{"date": "5 Jul 2023", "title": "Environmental Services Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Royal Victoria Regional Health Centre (Barrie, ON) in Jul 2023", "Interview Descriptions": "Questions were mostly scenario based. At the beginning the interviewer asked me to walk him through my resume and introduce myself, like most job interviews. The rest of the interview contained scenario based questions where you must provide an example from your past jobs and explain how they related to the scenario provided. I would highly suggest reading up on RVH's website in the \"About\" section. Their \"My Care\" section was emphasized during the interview and all of the questions were around those values which are, \"Care, Think Big, Respect, Work Together and Own\" Be prepared to provide 3 valid references, Covid-19 proof of vaccination and background checks upon hire. They will do a phone screening and filter you out if you can not provide 2 Covid-19 Vaccinations.", "Interview Questions": "\"Tell me about a time where you had to be flexible with your past job\" \"Tell me about a time where you had to think outside the box and go above and beyond\" \"Tell me about a time where you worked as a team\""}, {"date": "4 May 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Royal Victoria Regional Health Centre", "Interview Descriptions": "Good, really care about the values, and mission  etc.  Use those when answering questions. After the initial interview you have to do a unit specific peer interview", "Interview Questions": "How do our values and missions align with your own?"}, {"date": "9 Apr 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Royal Victoria Regional Health Centre", "Interview Descriptions": "Met with a recruiter asked a series of general questions, then management of unit and asked more specific questions. Entire process was easy if you prepare for commonly asked questions and are confident answering scenario based questions.", "Interview Questions": "How do you handle mistakes?"}, {"date": "8 Dec 2019", "title": "Quality Lead Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Royal Victoria Regional Health Centre", "Interview Descriptions": "2 interviews. One interview was with management team and was about 1 hour long. The next interview was a peer interview panel. Many of the same types of questions in the peer interview as in the management interview.", "Interview Questions": "Tell us about a time you had a disagreement with a colleague"}, {"date": "31 Jul 2019", "title": "RPN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Royal Victoria Regional Health Centre (Barrie, ON) in Jul 2019", "Interview Descriptions": "Key to doing well: Knowing RVH My Cafe values. Be able to apply My Care values to real past work experiences. If you can do this you will do well during the interview. Be prepared to also have a peer interview with two current RVH employees- same types of questions will be asked relating to the My care values. Make sure you have two good answers for each value.", "Interview Questions": "Work together: Describe a time you had to work together as a team. Event & outcome"}, {"date": "19 Nov 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Royal Victoria Regional Health Centre (Barrie, ON) in Jan 2019", "Interview Descriptions": "Professional and well organized company that has a good standards of working practice, staff we’re well prepared helping to set a standard of excellence throughout the interview process. Questions were straightforward and clearly related to experience needed to be a fit for the hospital.", "Interview Questions": "What is largest ethical dilemma you face while practicing job"}, {"date": "9 Sept 2017", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Royal Victoria Regional Health Centre", "Interview Descriptions": "2 Interviews. Manager level and Peer level both of them 40-50 minutes long.  Once you get to peer level it's not that difficult. But make sure to be fully prepared.", "Interview Questions": "Mostly situation based questions"}, {"date": "7 Mar 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Royal Victoria Regional Health Centre (Barrie, ON) in Apr 2017", "Interview Descriptions": "Called on my phone by the manager asking to come in for the interview. I asked the manager how I should prepare, and she outright told me to remember the hospitals values. \r\nSingle face to face interview with the department manager, brief and quite comfortable.", "Interview Questions": "Why do you think you're suitable for the job in this department?"}, {"date": "1 Feb 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Royal Victoria Regional Health Centre", "Interview Descriptions": "Three parts: screening over telephone, interview with two managers,  peer panel interview. Sometimes takes 3 weeks or more to hear back after applying online. They tend to choose resumes that use the key words from their mission and goals statements. They prefer to interview people who were referred by a current employee.", "Interview Questions": "They base their questions on their values statement "}, {"date": "6 Mar 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Royal Victoria Regional Health Centre", "Interview Descriptions": "Professor got in touch after sending him an email telling him that I was interested in his research. Went through his assistant and had to provide an unofficial transcript. After passing that, he asked me what areas I was interested in and why I was interested in his research and what my plans were after graduation.", "Interview Questions": "Asked about his research and why I was interested in it."}]]