[[{"date": "25 Jan 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Civic Nation", "Interview Descriptions": "Really great interview! They ask very good, value-based questions. Kind and welcoming as well. They give the space for you to express yourself and they want to hear about who you are.", "Interview Questions": "Why do you want to work with Civic Nation?"}, {"date": "30 Jun 2022", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Civic Nation (Detroit, MI) in Dec 2021", "Interview Descriptions": "Very explicit in the expectations of the role and extremely receptive to questions throughout the interview process. A very communicative experience that was respectful of my time and accommodated for me as needed given that this all took place remotely.", "Interview Questions": "How comfortable are you working with students?"}, {"date": "14 Jan 2019", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Civic Nation", "Interview Descriptions": "The interview process involved a phone interview a second phone interview with a lobbyist in Boston, and a lengthy 3rd-round interview in person with three elements: a presentation, a team discussion, and a final CEO private interview.", "Interview Questions": "The questions were standard. What was not standard was the fact that both the CEO and the lobbyist invested a lot of time in undermining and bad-mouthing the director, the person that became my direct supervisor. I was privately told that my director: a) couldn't fundraise b) told funders information she shouldn't b) rubbed funders the wrong way c) had embarrassed the organization in front of funders on several occasions d) I was told stories about my director that detailed some of those embarrassing incidents."}], []]