[[{"date": "4 May 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Deborah Heart and Lung Center", "Interview Descriptions": "The interview began with meeting with a staff member from Human Resources to review my resume and fill out paperwork. Then I was brought to the hospital building with the hiring manager. The interview was  thorough and included a tour of the facility followed by an in person interview. The staff was pleasant and welcoming.", "Interview Questions": "Describe a situation where you and a coworker had an issue with each other and how did you handle the situation. "}, {"date": "22 Apr 2022", "title": "Clinical Informatics Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Deborah Heart and Lung Center (Browns Mills, NJ) in Apr 2022", "Interview Descriptions": "Meet with HR hiring manager first, then VP of patient care services (along with an informatics staff member) in the HR building. You will also sign a background check form with HR.", "Interview Questions": "Do you have experience with staff onboarding training?"}, {"date": "7 Dec 2022", "title": "Environmental Services Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Deborah Heart and Lung Center in Jun 2021", "Interview Descriptions": "The process is not long or hard but they will sweet talk you to the end of time. They make promises they will never keep and make you feel guilty if you question anything.", "Interview Questions": "Are you more of a self starter or a team player?"}, {"date": "6 Sept 2020", "title": "Grant Writer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Deborah Heart and Lung Center (Browns Mills, NJ) in Jul 2020", "Interview Descriptions": "Sent in cover letter and resume.  Received an email for screening phone call with person.  It was more of a lecture about the organization.  Obviously I researched it thoroughly before applying. Next step was HR meeting then another meeting with the other two people again in person.", "Interview Questions": "Most questions were about \" who do you know?\" They weren't about the grant writing process at all."}, {"date": "27 Oct 2017", "title": "Anonymous Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Deborah Heart and Lung Center (Browns Mills, NJ)", "Interview Descriptions": "Got a call for an interview.  Met with HR and then supervisor of the department.  Interview went well. Followed up a week later on status of my application/interview, left a message and never received a return call or email.  Never received anything.", "Interview Questions": "When can you start?"}, {"date": "3 Nov 2017", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Deborah Heart and Lung Center (Browns Mills, NJ) in Oct 2017", "Interview Descriptions": "I applied online and received a phone call 1 week later requesting an interview and completion of online assessment. The interview was 3 days after the phone call.  I interviewed with 3 people (2 Charge nurses and HR representative). Interview was short, more of getting to know my personality and what I was looking for in a career. 2 weeks after interview I received an offer", "Interview Questions": "What is your professional goal?"}, {"date": "11 Feb 2017", "title": "Department Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Deborah Heart and Lung Center", "Interview Descriptions": "The person conducting the interview was direct and straight to the point.  She was confident and knew exactly what questions to ask.  The atmosphere was friendly and comfortable.", "Interview Questions": "Where do you see yourself in 10 years?"}, {"date": "29 Dec 2017", "title": "Administrative/Clerical Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Deborah Heart and Lung Center (Browns Mills, NJ) in Jan 2017", "Interview Descriptions": "The initial interview was via phone and the hiring manager was professional and thorough of what was required and followed with an onsite group interview in a timely manager. The group interview was  less stressful than expected and the environment was positive.", "Interview Questions": "How would you describe yourself?"}, {"date": "3 Dec 2017", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Deborah Heart and Lung Center (Browns Mills, NJ) in Aug 2016", "Interview Descriptions": "I met with HR first took an assessment exam and handed in my credentials. They briefly questioned me on basic things. Then I was interviewed by the Nurse Manager. Everybody was very nice & pleasant. Working there was a pleasure.", "Interview Questions": "Getting ready to board a flight for vacation what magazine would you choose?"}, {"date": "3 Jun 2014", "title": "Sterile Processing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Deborah Heart and Lung Center", "Interview Descriptions": "Many times openings occur on difficult to fill shifts/hours. Highlight how that particular shift/hours would be optimal for you. There are a lot of employees who have been there for many, many, years and hold on to the better shifts so take whatever shift you can get and you will eventually get the one you want.", "Interview Questions": "Did not encounter and difficult or unexpected questions."}], [{"date": "10 Apr 2014", "title": "Patient Care Tech PCT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Deborah Heart and Lung Center", "Interview Descriptions": "Interview process was simple. Recieved a call with an interview date. Arrived, filled out some paperwork, was interviewed by department charge nurse and an offer was given with in the week.", "Interview Questions": "The questions were all direct job and experiance related. No unexpected questions. "}, {"date": "20 Dec 2013", "title": "Lead Service Attendant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Deborah Heart and Lung Center", "Interview Descriptions": "I was a current employee at the time so it went easier than normal. You basically from the start would submit an application online, then meet with HR if you meet requirements or expectations. From there you would meet with the Director of EVS. If all goes well, you'll hear back by phone. If not you'll receive an email stating you weren't chosen.", "Interview Questions": "There weren't any really difficult questions, all standard."}]]