[[{"date": "14 Feb 2022", "title": "Pct Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Baptist Health (Arkansas)", "Interview Descriptions": "It was amazing and the person doibg my interview made me feel very comfortable and made sure I was not nervous during the interview. They made sure it was a casual conversation rather than an actual interview. I was emailed questions before hand to look up and prepare for it", "Interview Questions": "Why do I want this job? "}, {"date": "23 Apr 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Baptist Health (Arkansas)", "Interview Descriptions": "Phone call and in person with clinic manager.  I don’t think they actually cared if I was skilled for that job. It seemed that most of the nurses there were not knowledgeable of that field.", "Interview Questions": "I don’t want to answer these questions "}, {"date": "20 Jul 2021", "title": "Housekeeper Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Baptist Health (Arkansas) (Fort Smith, AR) in Apr 2021", "Interview Descriptions": "Very easy going I didn’t have much work experience . So we mostly talked about school and giving me an opportunity to extend my list of experience. And what shift I was interested in.", "Interview Questions": "What shift was I interested in ."}, {"date": "30 Dec 2020", "title": "Clinical Pharmacist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Baptist Health (Arkansas)", "Interview Descriptions": "It was a round table interview with 3 or 4 interviewers. They each ask questions and may build another question from your responses.  They ask what skills you have and what you could offer in this role.", "Interview Questions": "What do you think the role of a Clinical Pharmacist is?"}, {"date": "13 Apr 2021", "title": "PCT/CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Health (Arkansas) (Little Rock, AR) in Dec 2020", "Interview Descriptions": "Face-to-face interview, phone call, and required essay that is about conflict between nurses and patient care techs and your personal opinion on how to fix these problems. The interview was dependent on what was said in your essay. Super relaxed but professional.  The staff is very friendly and helpful.", "Interview Questions": "Essay over your job role and responsibilities"}, {"date": "21 Oct 2020", "title": "Benefit Representative I/Admissions Support Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Health (Arkansas) (Little Rock, AR) in Oct 2020", "Interview Descriptions": "The position was explained in detail and the benefits offered and a few questions for me and that was it. I was told I will be contacted by HR to know if I was selected to move forward.", "Interview Questions": "Take me through your work day at your previous job.\nWhat is one thing that disliked about your previous job?\nWhat motivates you?\nWhy do you want to work here?\nDo you have any questions for me?"}, {"date": "2 Sept 2020", "title": "Patient Guest Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health (Arkansas) (Little Rock, AR) in Sept 2020", "Interview Descriptions": "Personal, professional and a tiny bit relaxed. I was shown around the work area and introduced to several people. I interviewed with Andrea and she met me in the front lobby of the hospital so finding her was easy.", "Interview Questions": "They didn't ask me anything that I felt was difficult."}, {"date": "24 Sept 2020", "title": "Applications Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health (Arkansas) (Little Rock, AR) in Sept 2020", "Interview Descriptions": "It took weeks.  I applied for 7 Application Analyst jobs.  I had an interview for one of them and after sending the incompetent manager both an e-mail and voicemail and after contacting the CEO about it, he finally sent me an e-mail letting me know I wasn't hired.  This happened after he, on more than one occasion, hinted that I possibly had the job.  I was lied to on more than one occasion from this incompetent manger.", "Interview Questions": "N/A"}], [{"date": "7 Aug 2020", "title": "Information Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Baptist Health (Arkansas)", "Interview Descriptions": "Applied online and heard back fairly quickly. The interview was easy and about 30 mins. Asked questions such as tell me about yourself and why did I apply? Discussed pay and what days would I be able to work.", "Interview Questions": "Tell me about yourself"}, {"date": "16 Jul 2020", "title": "Office Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health (Arkansas) in Jun 2020", "Interview Descriptions": "Very relaxed and friendly. They asked plenty of questions. Medical office experience not necessarily needed, but general office experience is. It took them almost two weeks to get back to me.", "Interview Questions": "What makes me qualified for the job. \r\nJob history. \r\nWhat I like most/least about my last job. \r\nStrengths/ weaknesses "}, {"date": "29 Oct 2019", "title": "OTA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Baptist Health (Arkansas) (Stuttgart, AR) in Oct 2019", "Interview Descriptions": "The interview process was brief and easy. It was not as nerve-racking as some interviews can be. They were open to hearing my opinions, wants, and needs. I was pleased with the overall experience.", "Interview Questions": "What is your desired salary?"}, {"date": "5 Apr 2019", "title": "Housekeeper Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health (Arkansas) (Conway, AR)", "Interview Descriptions": "Guy was somewhat professional, polite but I found out quick why they can't keep anyone. Had \"this is what you get and you'll like it\" mentality. Making us fight for scraps.\n\nEven had the nerve to say I won't be able to pay my bills working here and wants to start me off working 20 hours a week for months. May have to say something to his boss about that. I've never heard that in an interview and I applied to a full time position so they lied about that.", "Interview Questions": "are you comfortable with being paid less than you're worth?"}, {"date": "17 Apr 2019", "title": "Call Center Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Baptist Health (Arkansas) (Little Rock, AR) in Apr 2019", "Interview Descriptions": "I did an over the phone interview. I was asked questions about my previous jobs and at end I was asked to come in for a face to face interview.", "Interview Questions": "If I had a problem working weekends and 2nd shift."}, {"date": "23 Nov 2018", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Health (Arkansas)", "Interview Descriptions": "A bunch of questions about medical experience and they introduced me to all the doctors that work at the clinic. You take a drug test and they go over your vaccines", "Interview Questions": "Tell me a time you had to deal with a difficult person"}, {"date": "10 Sept 2018", "title": "Information Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Baptist Health (Arkansas) (Little Rock, AR) in Sept 2018", "Interview Descriptions": "I applied online and received a call the next day to schedule an interview. We scheduled the interview for 2 days later. The interview consisted of me, the person I will be reporting to, and another woman in the department. It was more of describing the job duties, hours, and pay. Asked 3 questions at the most and asked if I had any questions. I was told 2 other applicants would be interviewed the next week. I received a call about 5 to 6 hours later with a job offer.", "Interview Questions": "Describe a time when you were late\r\nTell me about a time you dealt with an angry person and what did you do\r\nIf you made a mistake here in office, what would you do"}, {"date": "4 Oct 2021", "title": "Sonographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Baptist Health (Arkansas) in Jul 2018", "Interview Descriptions": "It was friendly and professional. The director and supervisor asked me about my work experience and hobbies. They were trying to know me as a person. They also answered all the questions I asked.", "Interview Questions": "Why did you apply for this position?"}, {"date": "28 Jan 2020", "title": "Secretary III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baptist Health (Arkansas) (Conway, AR) in Jun 2018", "Interview Descriptions": "Group Interview by department heads and the Executive Secretary, followed by an interview the next day by the CNO one-on-one. I was to support all the department heads at the time, so they wanted all of them to be able to ask questions and get a feel for whether I could handle the pressure of working for so many (13) directors. They were also wanting someone who could be the back-up for the Executive Secretary. I ended up taking over that role when she left for a teaching position.", "Interview Questions": "How do you handle difficult situations"}, {"date": "4 Aug 2019", "title": "Rehab Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Baptist Health (Arkansas) (Little Rock, AR) in Jan 2018", "Interview Descriptions": "Meet at the hospital. She was very kind. It was laid back and I did not feel Ike I was being grilled at all during the short interview. I enjoyed the experience of being interviewed at this hospital", "Interview Questions": "My experience with working with others"}], [{"date": "18 Jul 2017", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Health (Arkansas) (North Little Rock, AR) in Jun 2017", "Interview Descriptions": "The interview process was quite easy it took three weeks in all from the date I applied  it was the basic scenario questions, and it took about 30 minutes.", "Interview Questions": "How do you deal with a co workers different perspective or opinion?"}, {"date": "28 Jun 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Health (Arkansas) (Little Rock, AR) in Oct 2016", "Interview Descriptions": "For me it was very detailed and consisted of going thur multiple parties, and started with a temp agency type of hiring in the beginning then later turned into this date and that date of hire with a lot of drag around that even got me out of an  raise because of how so much time was wasted", "Interview Questions": "They did not ask proper interview questions only wanted to know the types of places of work I did in the past along with the reason I was applying to this job."}, {"date": "15 Jun 2016", "title": "Human Resources Associate II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Baptist Health (Arkansas) (Little Rock, AR) in Jun 2016", "Interview Descriptions": "I applied online and within a week, I was contacted to schedule an interview for the following week. I met with Joni, HR Manager in Little Rock. I reported to the HR Department, in Little Rock, about 20 minutes early. I was greeted by a receptionist and Joni came out shortly thereafter to take me back for the interview. The interview questions were pretty standard. Interview lasted about 30 minutes.", "Interview Questions": "Standard behavioral and situational questions, What do you do when assigned a job that does not fall under your job description? Tell of a time when you had too much work to do in a small time frame. \r\nOther than those questions, everything else was pretty standard. There were no questions out of the ordinary."}, {"date": "11 May 2017", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Baptist Health (Arkansas) (Little Rock, AR) in Mar 2016", "Interview Descriptions": "Very informal and low stress. Job was offered just a few minutes into the interview process, and remainder of time was spent explaining position further to make sure that I felt job would be a appropriate fit for me. Explanation of the position and its environment was accurate.", "Interview Questions": "Name a time when you had a disagreement with a coworker and how you handled the situation."}, {"date": "1 Sept 2019", "title": "Personal Caregiver Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Baptist Health (Arkansas) (Fort Smith, AR) in Jul 2015", "Interview Descriptions": "I knew a lady that her mom needed some care and companionship, errand running, medication reminding, assisting with bathing and help around the house as in bathing, cooking, cleaning, etc.", "Interview Questions": "What are some of your best qualities?"}, {"date": "21 May 2015", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 days. I interviewed at Baptist Health (Arkansas)", "Interview Descriptions": "I applied numerous times for many positions. I was constantly told it's very hard to get hired with Baptist. On their HR site, I saw they were having a career fair Omar the NLR location. I attended the fair on a Thursday. There was someone at the door asking about your experience and what you were looking for. She was able to introduce me to the appropriate supervisor based on what I was looking for. After speaking with the supervisor, I provided my resume and letter of recommendation and she said she would contact me the next day. She did and said she was waiting for HR to set up an interview. I was contacted Monday for an interview on Tuesday. Interview went well and was really more like telling me what to expect. Have any questions prepared. Or any dates you already know you have things planned. I wasn't directly notified that id be hired but some from HR contacted me to set up placement testing, drug/nicotine/tobacco/tb skin testing. She confirmed I was a new hire. Start in 1.5 weeks!", "Interview Questions": "Most questions are about previous experience. All were opened ended."}, {"date": "29 May 2014", "title": "Program Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 5 weeks. I interviewed at Baptist Health (Arkansas)", "Interview Descriptions": "I moved through the ranks with multiple jobs over the course of about seventeen years prior to being considered for this position.  I had obtained the necessary credentials and degrees for the position and the hiring manager knew that I had chosen my educational pathway to prepare for the role.", "Interview Questions": "The only interview was for my current role and it was more of an informal discussion.  "}, {"date": "13 May 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Baptist Health (Arkansas)", "Interview Descriptions": "Email confirmation of application received with follow up phone call and request to set up interview. In person interview in a private comfortable setting. Answered all questions concerning my potential employment with ease.", "Interview Questions": "What would make you leave this company?"}, {"date": "28 Jul 2012", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baptist Health (Arkansas) (Little Rock, AR) in Nov 2011", "Interview Descriptions": "After placing online application recieved call within 1 week to schedule interview,  had 1 on 1 interview with  department supervisor.  Went over resume and job history, was told what the job entailed and the standard interview questions. Why pick this company, why this department, why pick you over another applicant.\r\n\r\nNot a long interview took about 20 minutes.", "Interview Questions": "Did not really ask anything hard or unexpected. "}, {"date": "10 Oct 2013", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Baptist Health (Arkansas) (Little Rock, AR) in Apr 2011", "Interview Descriptions": "The interview process was interesting in the fact that it was held at night. The position was third shift, so the interview was held in the evening. The supervisor seemed interested in my past experience and was very forthcoming on the details of the job. She also discussed the process of yearly evaluations including the career ladder and advancing into a leadership position after a year of employment with the organization.", "Interview Questions": "The most difficult or unexpected question would have to be the questions about my family. I didn't understand how that information pertained to me becoming an employee of the company."}]]