[[{"date": "24 Apr 2023", "title": "Telephone Interviewer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Siena College", "Interview Descriptions": "Interview process was simple! Discussed role and responsibilities and why you’d be a good fit. The interview is neither long nor hard. After the interview if hired, a training session is scheduled so you can start.", "Interview Questions": "Need to have the ability to speak on the phone, properly communicate survey questions, and use a computer to input information."}, {"date": "10 Jan 2023", "title": "Contract Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Siena College", "Interview Descriptions": "Interviewed with previous contract administrator to discuss previous experience and job duties and then the head of procurement, Treasurer and VP. Was given a sample contract and asked to spot issues, recommend revisions.", "Interview Questions": "Mainly discussed previous experience working in various legal settings."}, {"date": "7 Feb 2023", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Siena College in Jan 2022", "Interview Descriptions": "There is no interview, just asked at the desk if they had any openings for next year and was approved. It the very simple and straightforward process would recommend it to any student to collect some cash while studying.", "Interview Questions": "Q: What is your availability next year?"}, {"date": "27 Jan 2022", "title": "Janitor/Cleaner Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Siena College (Colonie, NY) in Oct 2021", "Interview Descriptions": "The interview process was pretty standard they went over what was to be expected were and the reviewed carefully what college was able to offer in term of employee benefit", "Interview Questions": "What is your experience level?"}, {"date": "11 Nov 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Siena College", "Interview Descriptions": "30 minute meeting with a couple of the bosses where they go through your resume to see what experience you have and if you are a good fit.  After that they describe the type of work you will be doing which is not at all realistic to the type of work you will actually be doing.  They oversell themselves as being more interesting and important than they actually are.", "Interview Questions": "What are your strengths and weaknesses?\r\nWhat are your longterm goals?"}, {"date": "23 Mar 2018", "title": "Financial Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Siena College (Albany, NY) in Feb 2018", "Interview Descriptions": "Applied for position and was interviewed a few weeks later. I was highly qualified for the position, but looking back I realize it probably wouldn't be a good fit. During the interview I realized I had more experience in the field than one of the managers. Siena seems like a good place to work, but they need to improve their hiring process. When asked to come for an interview, I wasn't informed that I was going to meet with the whole office team (as a group interview). I felt comfortable meeting with them, even though it was a bit surprising. I wish Siena the best as they compete in the higher-education marketplace!", "Interview Questions": "General questions about my experience, skills, and goals."}, {"date": "25 Oct 2017", "title": "Health Educator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Siena College", "Interview Descriptions": "I had a skype interview with a few interviewers. They were very nice and professional, but also easy to talk to. I genuinely enjoyed our conversations and even though I did not get through to the next stage, I think very highly of the interviewers and school and would not hesitate to apply for other positions in the future that I may be qualified for.", "Interview Questions": "They asked about my experience in the field and asked how I would handle more specific health situations at their school. "}, {"date": "1 Jul 2016", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Siena College (Loudonville, NY)", "Interview Descriptions": "The interview was a group interview with three individuals.  After that I had a one on one with the VP.   I was informed by telephone that I got the job a week or so after the interview.", "Interview Questions": "I was asked if I'd get bored with the job over time."}, {"date": "28 Jun 2015", "title": "Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Siena College", "Interview Descriptions": "I had a professor for an organic chemistry lab.  I was looking to do undergraduate research in the following year so I asked the professor if she would be doing research.  She said yes and I spoke with her about the project and was admitted to the research group.", "Interview Questions": "Explain how genetic information is stored in the human genome"}, {"date": "5 Aug 2012", "title": "Solidarity Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Siena College (Loudonville, NY) in May 2011", "Interview Descriptions": "Great! Demonstrate that they want individuals who are committed to social justice.", "Interview Questions": "What is social justice to you?"}]]