[[{"date": "13 Jun 2022", "title": "Intramural Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Troy University", "Interview Descriptions": "Questioned about what experience I have in sports, my grades in school, and my ability to control situations that could get out of hand. The interview was very relaxed and was informal just like the job itself.", "Interview Questions": "What sports are you most familiar with?"}, {"date": "5 Apr 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Troy University (Troy, AL) in Jan 2022", "Interview Descriptions": "Asked to interview with search committee members.  The interview was normal but then I was never contacted again. No follow up to let me know one way or the other. It was a bit unprofessional.", "Interview Questions": "Standard interview questions for faculty position. "}, {"date": "23 Sept 2020", "title": "Campus Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Troy University", "Interview Descriptions": "Panel interview with a group for the first round. Then a one on one interview with the Admission tour director.  Usually, a group of four go in at a time and people are eliminated after that stage.", "Interview Questions": "Why do you want to do this?"}, {"date": "9 Mar 2020", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Troy University", "Interview Descriptions": "The interview was casual and easy. Typical interview questions were asked and it was more of a conversation than an interview. It was only one interview, and I heard back very quickly.", "Interview Questions": "I don't remember any specific questions, it was more of a conversation that flowed naturally."}, {"date": "11 Mar 2019", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Troy University (Troy, AL)", "Interview Descriptions": "The whole employment process for this particular position consisted of one interview. The interview consisted of basic questions related to the particular position.  The whole process was formal as any other job interview.", "Interview Questions": "Tell us about yourself. Why do you want to work here? What are your strengths and weaknesses? "}, {"date": "2 Dec 2018", "title": "Department Chair Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Troy University (Troy, AL)", "Interview Descriptions": "lengthy.  It involved meeting with some but not all faculty members.  It involved talking to people who had been chair.  It involved talking to deans, eating with colleagues, and a tour of the university.   It takes a day and could take more to really talk to everyone.  In the end, everyone was not talked to but those who had an ear to the dean were present.", "Interview Questions": "presentation"}, {"date": "24 Jan 2019", "title": "Recruiter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Troy University (Fayetteville, NC) in Dec 2018", "Interview Descriptions": "I was interviewed by the director for the region as well as the two employees at that local office. Everyone was very nice and it had a friendly at-ease atmosphere with an emphasis on getting to know each other as well as job specific questions.", "Interview Questions": "The asked for three actions I would take to start recruiting in the local community. "}, {"date": "20 May 2018", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Troy University (Troy, AL) in Jan 2018", "Interview Descriptions": "No Interview  required. the process was short and to the point with little conversation needed. I am writing the rest of this to meet the minimum word requirement. I don't know what else to say to you.", "Interview Questions": "N/A"}, {"date": "18 Oct 2017", "title": "Area Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Troy University (Augusta, GA)", "Interview Descriptions": "Interviewed by current director and two other coworkers.  I was asked the common questions such as \"Where do you see yourself in 5 years and what do you bring to the table for Troy University.\"   Overall a good experience.", "Interview Questions": "Why should we hire you over your competitors?\r\n"}, {"date": "7 Jun 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Troy University (Troy, AL)", "Interview Descriptions": "Should apply online for the position. They will finalize 4 students with good resume and good cover letter. Interview will be done for 4 finalists and choose the best among them.", "Interview Questions": "Asks questions more about the position you apply for like\r\n1> Why are you a good fit for this position?\r\n2> and some technical questions"}], [{"date": "22 May 2017", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Troy University", "Interview Descriptions": "The overall interview experience was generally positive. The camaraderie amongst the faculty was very apparent and the campus was beautiful. However, I was asked several person questions like whether or not I have kids and if I am religious or not. I was told that I would have been offered the position, but due to \"budget constraints\" the position was rescinded. What a let down.", "Interview Questions": "Teaching scenarios, background"}, {"date": "1 May 2017", "title": "Departmental Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Troy University (Troy, AL) in Mar 2017", "Interview Descriptions": "Interview with 4 person panel from the department for which the position was open.  Three interviewers were instructors and one was a secretary for the dean of the department.  They each asked their prepared questions and allowed me to freely answer and ask questions.", "Interview Questions": "Why do you want this job?"}, {"date": "19 Oct 2018", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Troy University (Troy, AL) in Feb 2017", "Interview Descriptions": "Kinda awkward, the process took around 30 minutes and I heard back after 2 weeks. People were really kind and the whole experience was positive. They offer different positions", "Interview Questions": "How are you going to leave an impact here?"}, {"date": "21 Jun 2016", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Troy University", "Interview Descriptions": "Initial brief phone interview (more of a screening) with position's immediate supervisor. Then a group/panel interview with immediate supervisor, her counterpart at another site, and the district manager. I was informally offered the position a week later. I say informally because main campus administration has final approval on all satellite location hiring. It took about 2.5 to 3 weeks for main campus to send their approval of me back to the satellite location.", "Interview Questions": "Explain how you think your previous work experience relates to this position."}, {"date": "6 Jun 2016", "title": "Site Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Troy University (Troy, AL)", "Interview Descriptions": "Interviewed with Area Director and faculty.  Applied for the position, had interview within 4 weeks, job offer within 2 weeks following interview.  They never mentioned or negotiated the salary; I found out what I was being paid after I started.  There was no written offer and the area coordinator stated she did not know; however, I was satisfied so I did not complain when I found out my salary.", "Interview Questions": "All basic questions.  How do you plan to run the office?  How do you plan to recruit? etc."}, {"date": "21 Jan 2016", "title": "Enrollment Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Troy University", "Interview Descriptions": "I came in for an interview with two senior staff members in person and one person (who currently held a similar role) attended via skype. It was a long interview and there were a LOT of questions but they were all pretty standard. The people interviewing me were very pleasant and the interview went well. I received a call with a job offer the next day.", "Interview Questions": "describe a time where you faced a challenge in the workplace...etc"}, {"date": "4 Nov 2015", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Troy University (Troy, AL)", "Interview Descriptions": "The application process was a little tedious.  I had submitted 20+ applications over a 5 year period and was never selected for an interview. Finally at the job I was hired for I saw the position around September. I applied for the job, several months later (November) I was called to schedule an interview for a few weeks later. I interviewed and a week later offered the job.", "Interview Questions": "Why would you be the best hire for the position?"}, {"date": "16 Mar 2017", "title": "Records Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Troy University (Troy, AL) in Oct 2015", "Interview Descriptions": "The interview process was rather cliche. You will be interviewed by 2-3 people at once being questioned by each. Questions range from, \"Why did you apply for this job?\" to \"Where will you see yourself in 5 years?\".", "Interview Questions": "What do you know about our department?"}, {"date": "4 Apr 2016", "title": "CS Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Troy University (Troy, AL) in Aug 2015", "Interview Descriptions": "Applied online. I was called in the office and got selected. This is an on-campus job so doesn't have much requirements. It's an easy job; you have to stay in the lab and occasionally help the students. This opportunity provides plenty of time to study my own materials and get paid at the same time. It helps to get closer to the department as well. This is a wonderful job for students.", "Interview Questions": "Have you taken CS classes?"}, {"date": "22 Jul 2015", "title": "Recruter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Troy University (Clarksville, TN) in Feb 2015", "Interview Descriptions": "I meet with two lovely ladies that interviewed me on the position, told me about the job, asked me questions of my experience. Always gave me great feeling, and allowed me to ask questions.", "Interview Questions": "What is your background and experience level?"}], [{"date": "9 Jan 2015", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Troy University", "Interview Descriptions": "I applied May. I was contacted in late June to come for an interview. I had almost forgot about the job. It was a laid-back interview. Then my second interview was a presentation (Powerpoint and sales pitch) I made to the manager. I started in October. When I was hired, I thought it would be in the marketing field; but it became cut throat sales (with NO commission).", "Interview Questions": "Without the use of social media, do you think we can attract a younger market?"}, {"date": "13 Feb 2015", "title": "Recruiter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Troy University (Pensacola, FL) in Jan 2015", "Interview Descriptions": "It was a bizarre experience. I applied online and heard back about 3 weeks later. I was invited in for an interview with the head of recruiting and two other employees within the department. The only problem is -it wasn't a \"true\" interview. I was not asked anything. The \"interviewers\" talked about the their personal experiences in the role I was applying for. Most of the conversation was based off any questions that I had for them. \r\n\r\nI was interviewed in January and told the position would not start until March; I would be told whether I was offered the job sometime in mid-February.", "Interview Questions": "Not asked even ONE question about myself or my experience. Be prepared with your own questions and find creative ways to relate your experience to the position. "}, {"date": "6 Nov 2014", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I interviewed at Troy University", "Interview Descriptions": "I applied online and was contacted within 72 hours. Process took 4+ weeks due to applicant website transition. Official offer took an additional 3 weeks due to background checks and approval by upper administration.", "Interview Questions": "General questions about previous work experiences and willingness to travel."}, {"date": "26 Mar 2018", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Troy University in Sept 2014", "Interview Descriptions": "I had a panel interview with 2 executives and one admin. This covered behavioral and situational questions.  All three interviewers asked me questions and then gave me a tore around the facility.", "Interview Questions": "How sufficient are you with Excel"}, {"date": "1 Sept 2015", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Troy University (Orlando, FL) in Sept 2012", "Interview Descriptions": "Easy but slow, long process. but that was with old management. Now they want cheap employees. I Awful place to work , after the new management took over. New management made the production worse and would not coach or help you  grow in your role", "Interview Questions": "Tell me about yourself- Easy but slow, long process. but that was with old management. Now they want cheap employees. I Awful place to work , after the new management took over. New management made the production worse and would not coach or help you  grow in your role"}, {"date": "16 Feb 2016", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at Troy University (Troy, AL) in Jul 2012", "Interview Descriptions": "I applied and finally heard back 6+ months after my application was submitted. Phone interviewed with search committee composed of current faculty. That was great. I could tell they were going to be a great team of colleagues. Was invited to campus interview. Met with department chair (clueless), associate dean (nice), vice chancellor (condescending), chancellor (nice), and interim dean (rushed). Offer was made pretty quickly after the campus interview (turns out that if you are brought in you pretty much have the job unless one of the above doesn't like you for some reason). The quick offer at that point was probably because the fall semester was starting very soon so they needed to fill the position immediately.", "Interview Questions": "What kind of resources would you need to conduct research?"}, {"date": "12 Jan 2016", "title": "Area Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Troy University (Savannah, GA) in Apr 2012", "Interview Descriptions": "I met for one hour with the District Director and Area Coordinator from another location for a sit down Q & A.  I was one of two additional persons being interviewed at the Savannah Site on the same day.  The interview was very relaxed and semi-informal.  The interviews held or had held similar positions to the one for which I was applying, therefore, they were very knowledgeable about the position, the area and the general expectations.  Salary was not negotiable although a salary range had been advertised.", "Interview Questions": "Questions were very standard."}, {"date": "4 Apr 2012", "title": "Cannot Disclose Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Troy University (Troy, AL) in Aug 2011", "Interview Descriptions": "I was contacted to interview for a position that I had applied for about 3 weeks prior.  The interview was a three- person panel interview.  Typical interview questions (describe yourself, strengths, weaknesses).  The only negative from the interview was that there were several times that we had to pause so others could explain answers to one of the panel members (now my supervisor).  The panel member has worked for the University for 5+ years, but was so unfamiliar with the University that they did not understand the conversations/follow up questions that resulted from my answers.", "Interview Questions": "Tell us about yourself."}, {"date": "14 Jan 2014", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Troy University (Troy, AL) in Mar 2011", "Interview Descriptions": "You go through a pannel for the first interview, then you are interviewed by all of the supervisors at once.", "Interview Questions": "How would you handle residents who are homosexual? Would you let their significant others stay the night?"}, {"date": "11 Nov 2010", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Troy University (Dothan, AL) in Jun 2009", "Interview Descriptions": "To transfer from one division to another, the interview process was simple, involving a panel by phone. All movement across divisional boundaries requires a background check as well these days. When I had first interviewed, as an outsider, I first submitted my CV and college transcripts, then gave a presentation to the faculty (conference-styled). I gave another presentation to administrative leadership in Troy, and then I waited for the acceptance letter. There is a lot of informality to the process with TROY, and most people in the decision-making chain like to talk casually about various topics. Building trust this way is therefore very important. If you come across too serious (ivory-tower), that can turn them off.", "Interview Questions": "What is your teaching philosophy?"}]]