[[{"date": "22 Jun 2023", "title": "Dietetic Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Yale New Haven Hospital (New Haven, CT)", "Interview Descriptions": "A phone screen shortly after I applied followed by a formal virtual interview with one or two managers a week or so after. The questions are a mix of scenario questions and clinical questions.", "Interview Questions": "What are the theres nutrients that need to be monitored on a renal diet?"}, {"date": "24 May 2023", "title": "Senior Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale New Haven Hospital (New Haven, CT)", "Interview Descriptions": "Simple application process. Fast results. Great technology. Very nice and professional team and staff. Would definitely work here in the future. Happy to receive an interview so fast. Thank you", "Interview Questions": "N/A"}, {"date": "21 Apr 2023", "title": "Recruiter Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 5 weeks. I interviewed at Yale New Haven Hospital (New Haven, CT)", "Interview Descriptions": "Recruiter reach out for phone screen. They then took 2 weeks to reach back out to ask for a follow up interview. On the second round of the interview they were very rude. I got and offer after waiting for another 2 weeks. Even if they say the role is primarily remote they are lying. After talking to one of the recruiters they told me what they advertise is not true.", "Interview Questions": "Why do you want to work for us?"}, {"date": "19 Mar 2023", "title": "Registered Nurse, CVICU Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Yale New Haven Hospital in Feb 2023", "Interview Descriptions": "Management asked me to shadow MICU and CICU/CTICU and to set that up MICU shadow with HR. HR did not reply to emails concerning shadowing until after brought it up. They said they can't set up shadow and that management knows that. Management thought I was uninterested in the job because I was trying to get MICU shadow out of the way. Unfortunate that the inconsistencies between Human resources and Management contributed to my not being offered the job,", "Interview Questions": "What do you want to work at this hospital?"}, {"date": "20 Feb 2023", "title": "New Grad RN Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale New Haven Hospital (New Haven, CT) in Feb 2023", "Interview Descriptions": "straight forward, told me the process about what will be discussed. Ask questions that demonstrated critical thinking, and also asked about myself. Asked about pay. Location wise, what to hope will be the end goal of the residency, etc.", "Interview Questions": "What core value stood out to you the most among the 5?"}, {"date": "11 Jun 2023", "title": "Chaplain Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale New Haven Hospital (New Haven, CT) in Nov 2022", "Interview Descriptions": "Initial interview is with HR- pay quoted was for a medical professional, not the spiritual care department . Second interview was also with HR who also overpromised on pay and benefits. The final interview was with department manager.", "Interview Questions": "What is your theological perspective?"}, {"date": "3 Nov 2022", "title": "MyChart Support Agent Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Yale New Haven Hospital (Norwalk, CT) in Oct 2022", "Interview Descriptions": "The interview process was quick and interesting. There was 2 rounds of interview. The first one being with the hiring manager and the second one being with the Manager of the MyChart Team", "Interview Questions": "Tell me about yourself? Define customer service. How to you deal with an irate customer/user."}, {"date": "20 Sept 2022", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale New Haven Hospital", "Interview Descriptions": "They will ask you about various assessments and ability to complete biopsychosocials. They had me present a case and different interventions used. They also have you explain what a mental status is and the key components of it. They’ll see how comfortable you’d be with working with the various populations depending on position/unit you’re applying for", "Interview Questions": "Can you explain what a mental status exam is"}, {"date": "15 Sept 2022", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Yale New Haven Hospital (New London, CT) in Sept 2022", "Interview Descriptions": "I met the hospital pharmacy team, toured the department, I met the pharmacist.  Toured some of the hospital, discussed all manner of tasks irequired for the job, shifts, and scheduling. ", "Interview Questions": "Why are you interested in pharmacy? "}, {"date": "23 Aug 2022", "title": "Business Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale New Haven Hospital (Bridgeport, CT)", "Interview Descriptions": "I applied and received a message the following day to schedule an interview. The interview was the day after they reach out to me. I feel that the interview went very well. They asked me to come in 2 weeks to shadow for the position I was applying for. The person who I was shadowing was very nice and thorough. About 4 business days after I shadow, I got an email for a background check. I am now waiting to see if they offer me the position.", "Interview Questions": "One of the questions they asked me why do I want to work there?"}], [{"date": "13 Aug 2022", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Yale New Haven Hospital (New Haven, CT) in Aug 2022", "Interview Descriptions": "Apply online, no employee referral, phone screen interview if pass then move on to the next level to  be schedule to meet with the hiring manager it’s  second interview either in person or virtual. ( Conducting virtual interviewing because of Covid) interview last for 30minutes.", "Interview Questions": "What’s your weaknesses and strengths? \n\nWhat’s your goal in 3 years? \n\nHow would you handle a difficult patient ?\n\nWhy do you want to work for Yale? \n\nWhat can you contribute and your accomplishments\n"}, {"date": "8 May 2022", "title": "Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale New Haven Hospital", "Interview Descriptions": "Great and clear interview process. I felt respected at all times and the communication was efficient. Phone screening followed by 1-2 follow up interviews with managers. All interviews were conducted remotely by phone or Zoom.", "Interview Questions": "Questions about character\r\nTechnical Interview "}, {"date": "2 May 2022", "title": "Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Yale New Haven Hospital (New Haven, CT) in Mar 2022", "Interview Descriptions": "Hectic 2-week process consisted of:\n- 1 hour interview with director and hiring manager \n- 90 min panel interview with team, director, and hiring manager \n- skills assessment \n- 2 hour Q&A session with team, director, and hiring manager \n- Reference check via SkillSurvey pre-offer\n- Background check pre-offer\n\nObservations about process:\n- steps were stacked one on top of the other and not very much notice was given before each interview \n- hiring parties seemed a little over zealous to fill the role\n- the assessment was too long and detailed for the timeframe \n- they didn’t seem to like that I had questions about the role and kept abruptly cutting me off before I could ask very many \n- culture seemed like a tattle tale/throw you under the bus type of environment \n- picked up on some impatient vibes from the hiring parties\n- suspect that I was interviewed as a “diversity candidate” with no serious intent to hire me (they were acting weird/careless with process so this tipped me off)\n- didn’t appreciate the reference/background check being done with no offer as they wasted my reference’s time and mine.\n- SkillSurvey is too intrusive and tracks each participant’s IP address. That shouldn’t be legal. As a side note, I wouldn’t apply to a company that uses this platform again. \n- I was sent the coldest most impersonal and stern email I’ve ever read from their talent acquisition with a blanket “you don’t fit” rejection despite years of related healthcare experience and being a finalist. \n- Their talent acquisition didn’t reply to my request for feedback. Nice company. \n\nAll of this tells me that I need not reapply. Thankfully, there are other (presuming better) places to work. Good luck to the person they hired with no healthcare background at all and also, as you might’ve guessed, not a diversity candidate.", "Interview Questions": "Why did you apply for this position?"}, {"date": "2 Mar 2022", "title": "Business Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale New Haven Hospital", "Interview Descriptions": "Long and drawn out . The waiting period between interview and any feed back takes about two weeks . Some interviews are with multiple managers kind of intimidating . ....", "Interview Questions": "Tell me about yourself ."}, {"date": "6 Jan 2022", "title": "Supply Chain Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Yale New Haven Hospital (New Haven, CT)", "Interview Descriptions": "Overall I had a very solid experience with the Yale New Haven Health Interview team. To sum up the talk to was friendly, informative, and very conversational. Had 3 rounds of interviews 2 calls and 1 zoom experience.", "Interview Questions": "Past history working in healthcare ?\r\nPursuing graduates degree?"}, {"date": "16 Feb 2022", "title": "Nursing Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Yale New Haven Hospital in Jan 2022", "Interview Descriptions": "Asked about experience, schooling, availability, where I see myself in the future, opportunities for growth, described what the job entailed, explained onboarding and orientation process, asked about interests in certain units", "Interview Questions": "What experience do you have?"}, {"date": "3 Dec 2021", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale New Haven Hospital", "Interview Descriptions": "Applied in October. Got a call at the end of November. Did reference check first and then zoom interview followed by an hour of shadowing on the unit . Overall it was a good experience.", "Interview Questions": "How would you handle a difficult coworker? "}, {"date": "24 Aug 2021", "title": "Resident Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale New Haven Hospital", "Interview Descriptions": "Different interviewers, one interview day. Everyone was welcoming and nice. It was part of resident  physician applications for jobs across the country. You ubmit rank list and find out where you match.", "Interview Questions": "What was your past work experience"}, {"date": "30 Aug 2021", "title": "Senior Accountant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale New Haven Hospital (New Haven, CT) in Aug 2021", "Interview Descriptions": "The interviewer over the phone never got back to me as she promised and as I tried to follow up no response.  Also, no follow up and no email to address.  I tried to contact HR Dept and no one picks up and no direct line to address my concerns.", "Interview Questions": "which country was I born in since my name sounded French  ?   Really isn't that illegal ??"}, {"date": "23 Sept 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale New Haven Hospital in Aug 2021", "Interview Descriptions": "Interview  was very relaxed. They make it a calm,  straightforward process with less clinical questions and more “get to know you” type of questions. In comparison to other interviews, this one was on the easier end.", "Interview Questions": "Why do you want to work for this hospital/unit?"}], [{"date": "15 Jun 2021", "title": "Physician Assistant, PA-C Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale New Haven Hospital", "Interview Descriptions": "The interview process was long but thorough. Typically starts with the hiring manager and then when you move forward you meet with other people in the department. All questions were answered by each interveiwer. Everyone was very kind and very eager to train new grads!", "Interview Questions": "Why did you apply to this job?"}, {"date": "2 May 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale New Haven Hospital (New Haven, CT) in Apr 2021", "Interview Descriptions": "Had one interview - heard back a few weeks later. HR is very very slow with the process, but it wasn’t the departments fault. I had a pretty rough time with HR but my team is amazing.", "Interview Questions": "What are your strengths and weaknesses"}, {"date": "16 Apr 2021", "title": "Certified Recreation Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale New Haven Hospital in Apr 2021", "Interview Descriptions": "The interview was a great conversation. Did not feel I was being grilled. I felt the interviewer was truly interested in what I was saying. We talked about my job experience as a Recreation aide in college.", "Interview Questions": "What I would bring to the table should I get hired. "}, {"date": "16 Mar 2021", "title": "Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale New Haven Hospital", "Interview Descriptions": "didnt receive follow-up  decision after 4 rounds if interviews until months later, didnt respond to follow-up\r\ntypical behavioral  questions (How would you describe yourself? Why Yale New Haven? ) \r\n + unstructured  market segment case \r\n+ basic excel test (vlookup, organize data, etc)", "Interview Questions": "N/A"}, {"date": "6 Mar 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale New Haven Hospital", "Interview Descriptions": "It was smooth. First day I had  phone interview with  the talent acquisition group. The second interview, which was the second day,  I had Zoom  interview with unit manager and assistant manager.", "Interview Questions": "What's your strengths and weaknesses?\n"}, {"date": "1 May 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Yale New Haven Hospital in Mar 2021", "Interview Descriptions": "Recruiter reaches out to schedule an interview with management. Your application could be under review for awhile depending on how many applicants but I would definitely reach out to the recruiters for an update to show you are truly interested in the position.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "13 Feb 2021", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale New Haven Hospital", "Interview Descriptions": "I had a recruiter at first and then the 2nd review included 3 folks: manager, director and clinical director. Overall stuck to the job description and asked if I  could perform or had experience performing the items on it. They are very aware of how difficult it is to enter their folds and will mention that subtly.", "Interview Questions": "Do you have experience with playbooks?"}, {"date": "27 Jan 2021", "title": "Patient Access Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale New Haven Hospital", "Interview Descriptions": "Quick interview with HR followed by an interview with the hiring managers. HR asked basic questions about my background and future career plans. The hiring asked more questions specific to the job and it’s responsibilities as well as questions particular to my resume.", "Interview Questions": "Q: are you comfortable working in difficult situations?\r\nQ: how would you handle a coworker who is not performing the way they should be? \r\nQ: What kind of environment to thrive in?"}, {"date": "14 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale New Haven Hospital", "Interview Descriptions": "Fairly easy. Was contacted via phone with a talent coordinator and was asked a few basic questions. He set up a zoom interview due to pandemic. The interview was 1:1 with hiring manager and wasn't too intimidating. Hiring Manager was friendly and asked basic behavioral questions.", "Interview Questions": "Tell me about a time you went above and beyond for a patient"}, {"date": "10 May 2022", "title": "APRN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale New Haven Hospital in Nov 2020", "Interview Descriptions": "Multiple interviews with individuals and group interviews. Several with human resources plus clinicians. \r\nGroup plus met with each individual on the team.  Onboarding was way too long. Delayed my start date.", "Interview Questions": "Why I wanted the job"}], [{"date": "31 Aug 2020", "title": "Reseach Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale New Haven Hospital", "Interview Descriptions": "The interview process took close to a couple months. There were great interviews questions and very knowledgeable interviewers. After interviews, a writing sample submission, and interviews of my references, I was not offered a position.", "Interview Questions": "How do your values fit in with the Yale values?"}, {"date": "23 Sept 2020", "title": "Business Office Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale New Haven Hospital (New Haven, CT) in Aug 2020", "Interview Descriptions": "Due to the pandemic, the interview was done via zoom. The interviewers asked your stereotypical interview questions (relevant skills, name a time you solved a complicated issue at your workplace, etc). The interview itself was around 30 minutes. It took 7 weeks for me to receive an offer letter. Apparently the hiring process for big hospitals is a lengthy one. They have to get many pre-approvals before being able to make a formal offer.", "Interview Questions": "Name a time you turned a negative situation into a positive outcome."}, {"date": "11 Apr 2020", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Yale New Haven Hospital (New Haven, CT) in Mar 2020", "Interview Descriptions": "Post 19 Clinical Nurse 1 interview. Was told that this is typically done in person but because of current restrictions, all interviewing was done on the phone. Spoke with unit manager & assistant unit manager and the next day with the HR rep. Overall an excellent experience and I can't be more excited to be joining the team there. I should be moving up there in the next month. I am not sure if there is relocation pay or not.", "Interview Questions": "Name one error you made and what did you learn from it."}, {"date": "10 Jun 2020", "title": "Registered Nurse, BSN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Yale New Haven Hospital (New Haven, CT) in Mar 2020", "Interview Descriptions": "Fairly easy process. Recruiter got in touch in March, set up interview with hiring managers and a shadow (pre-COVID). They were all very nice & accommodating. After interview they asked for references but I chose not to opt-in", "Interview Questions": "What lead you to nursing?"}, {"date": "12 Dec 2019", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale New Haven Hospital", "Interview Descriptions": "Interview process starts online. It takes some time to go through all the motions, up to several weeks, sometimes HR is behind so your waiting for their call, all in all average for health care.", "Interview Questions": "Why did you apply, where do you see yourself in 5 years"}, {"date": "17 Dec 2019", "title": "Patient Care Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Yale New Haven Hospital (New Haven, CT) in Dec 2019", "Interview Descriptions": "I applied online, received texts from hiring manager, finally got ahold of one another after playing phone tag, we set up a time for interview and shadow, and within the week I was there.", "Interview Questions": "Why do you want to work in a hospital setting?"}, {"date": "7 Oct 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Yale New Haven Hospital in Oct 2019", "Interview Descriptions": "Very informative, staff was well versed on history of the company and there were a lot of senior staff amongst the team. Emphasized patient safety, accountability and flexibility. Met with HR representative initially and pending how well that went, I met with the manager of the unit. In addition, I shadowed the unit and met some of the team members.", "Interview Questions": "Why should we hire you, questions about the organization, flexibility "}, {"date": "11 Feb 2020", "title": "Human Resources Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Yale New Haven Hospital (New Haven, CT) in Oct 2019", "Interview Descriptions": "Applied online and received a call from a Talent Acquisition Specialist (Kristie) and she provided concise information about the position.  Although I did not receive an offer, interview with the New Haven team was a very positive experience.", "Interview Questions": "What don't you like about working in X industry?"}, {"date": "30 Aug 2020", "title": "Patient Transport Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Yale New Haven Hospital (New Haven, CT) in Jul 2019", "Interview Descriptions": "Many steps to the interview process, like, phone interview with HR, personal interview with supervisor, tasks to complete online with your paperwork, submitting 5 different peoples recommendations and they need to do submit an online survey about you as well.", "Interview Questions": "Tell me about a time you had to handle a difficult situation."}, {"date": "14 Jun 2019", "title": "Research Assistant II Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Yale New Haven Hospital", "Interview Descriptions": "A long, drawn out process that took nearly three months. However, the people were great and easy to chat with. Spent a four hour session answering similar questions amongst 1:1 interviews with the team.", "Interview Questions": "What research software are you familiar with?"}], [{"date": "10 May 2019", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale New Haven Hospital", "Interview Descriptions": "I attended a group hiring event. We briefly met with HR manager, then each went to different units and an had interview with unit manager and shadowed a nurse on a unit", "Interview Questions": "talk about a time you were misunderstood"}, {"date": "25 Jul 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale New Haven Hospital (New Haven, CT) in May 2019", "Interview Descriptions": "The interview went well. A recruiter from Yale called me and set up an interview with the hiring manager. A few days later I met with the hiring manager and was asked a few questions and was asked to shadow.", "Interview Questions": "Describe a time where you had to solve a problem as a team."}, {"date": "28 Mar 2019", "title": "Clinical Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Yale New Haven Hospital (New Haven, CT)", "Interview Descriptions": "The process started with a Brief HR interview followed by a one on one interview a few days later with the director of clinical nutrition.  I did not interview with the staff or additional managers, but I know colleagues who have.", "Interview Questions": "Why are you leaving your current position?"}, {"date": "16 Aug 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Yale New Haven Hospital in Jan 2019", "Interview Descriptions": "The interview process was professional but not intimidating, very welcoming. Interviewer was not overly formal, asked questions that were easy to expand upon, allowed me to shadow in the ED and see how i liked it.", "Interview Questions": "What I could bring to the work environment at all. "}, {"date": "18 Oct 2019", "title": "Coordinator for Transplant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Yale New Haven Hospital (New Haven, CT) in Nov 2018", "Interview Descriptions": "Quick couple questions , asking how would you be a good fit for this position , what are you skills and how would you be a great asset for this company and department", "Interview Questions": "What makes you reliable in this position"}, {"date": "22 Sept 2018", "title": "Clinical Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Yale New Haven Hospital (East Haven, CT) in Sept 2018", "Interview Descriptions": "Had an interview a little over a week ago. I feel like it went pretty well. I shadowed for an hour as well. The woman who interviewed me was very nice and made me feel very comfortable from the start. She gave me her business card and told me to give her call if I had any questions. She went pretty in-depth about a lot of things like (parking, training and uniform) I have yet to hear from anyone with a decision on me being hired or not. I’ve heard it’s a pretty long process sometimes so I’m trying to stay positive. Will be giving her s call on Monday!", "Interview Questions": "Tell me about a time you went above and beyond for your job?"}, {"date": "6 Mar 2019", "title": "Cardiac Sonographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Yale New Haven Hospital (New Haven, CT) in Aug 2018", "Interview Descriptions": "I met with the HR recruiter, the manager of the department, & the lead Sonographer, all on the same day. Everyone was very friendly and welcoming.  The process started and 9am in the morning and ended around 12:30pm", "Interview Questions": "How do you feel about hard work?"}, {"date": "14 Jul 2018", "title": "Clinical Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale New Haven Hospital", "Interview Descriptions": "I applied for the job about a week before getting a call for an interview... I met with HR and hiring manager/ supervisor everything was nice and easy but I haven’t heard back from anyone yet It’s been about 3 days so I’m assuming I wasn’t a match.", "Interview Questions": "Tell me about a conflict you had with another co worker and how did you handle it."}, {"date": "2 Aug 2022", "title": "Pharmacy Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Yale New Haven Hospital (New Haven, CT) in May 2018", "Interview Descriptions": "It was a group interview. It was also a few year ago (pre COVID) in person.  There was 1 applicant in the room and a group of faculty and staff from the department", "Interview Questions": "What pharmacy experience do you have (if any)?"}, {"date": "11 Sept 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale New Haven Hospital in Apr 2018", "Interview Descriptions": "I interviewed for the RN General Medicine Cohort. It started with a group session with HR and then individual interviews with nurse managers. It felt very rushed since they were timing it and it was in an auditorium with everyone else interviewing at the same time in the same room. I personally felt that some of the questions were either super similar or a bit challenging to answer for new nurses who really have not been working yet. After the interviews we shadowed in small groups on a floor.", "Interview Questions": "Tell me about a time you were misunderstood and how you handled that."}], [{"date": "12 Jul 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Yale New Haven Hospital (New Haven, CT) in Apr 2018", "Interview Descriptions": "I applied and got into the residency program. First, there was a presentation about the program and people came into speak with us. Then we were put into two groups: One group had interviews and the other group had a meeting with HR. The interview process is simple, you are either set up with one or two managers for 30 mins then you switch and HR tells you all about benefits. The third part is a job shadowing for about an hour, where you follow a RN around and ask questions. Pretty great and organized process!", "Interview Questions": "Tell me about a time where you went above and beyond for someone."}, {"date": "11 Mar 2018", "title": "CNA/HHA Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Yale New Haven Hospital (New Haven, CT) in Mar 2018", "Interview Descriptions": "Tell me about your self, My Strenghts and my weak strength What I bring my challenges she was short I don’t know if my answer she didn’t like it but it took like 10 minutes or less", "Interview Questions": "Why should we hired you ?\r\n"}, {"date": "17 Mar 2018", "title": "Applications Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale New Haven Hospital (New Haven, CT) in Mar 2018", "Interview Descriptions": "Applied for Application Analyst position, under the pretense that it was Epic based. In the job description, there was nothing about programming or utilization of languages (SQL, JAVA, Etc.). Went in, and was immediately notified that the position, in it's entirety, was based on utilization of programming languages, and very little use of Epic. Contacted HR to notify them, and they were incredibly rude about it.", "Interview Questions": "What level of understanding do you have of SQL."}, {"date": "29 Dec 2021", "title": "Medical Billing Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Yale New Haven Hospital (New Haven, CT) in Feb 2018", "Interview Descriptions": "Typical interview process.   Met with two ladies whom were very cordial.  They seemed nice to work with.  The only downfall was the job was located in the basement of the building and you had to take a shuttle from the parking lot.", "Interview Questions": "How long have you been at your current job?"}, {"date": "15 Mar 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Yale New Haven Hospital (New Haven, CT) in Jan 2018", "Interview Descriptions": "Met with HR, then interviewed with two floor managers. After that I had a job shadow on the floor I was applying to. Beware, the job shadow seems to matter more than the actual interviews with HR and floor managers.", "Interview Questions": "Why did you choose nursing?"}, {"date": "29 Apr 2021", "title": "Legal Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale New Haven Hospital (New Haven, CT) in Jul 2017", "Interview Descriptions": "Fairly easy, typical questions. I had an interview over the phone , then HR sent me to head of the department, then supervisor. I had a totally of 3 interview, but the last 2 was mostly a conversational about my experiences", "Interview Questions": "How do you deal with conflict?"}, {"date": "17 Jul 2017", "title": "Biomedical IT Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Yale New Haven Hospital (New Haven, CT) in Jun 2017", "Interview Descriptions": "Friendly, laid back. The interviewers were well prepared, yet the interview was not overwhelmingly stressful. I knew rather immediately that I had been given an offer, and then accepted", "Interview Questions": "What drove you to healthcare field? "}, {"date": "26 Mar 2018", "title": "Patient Care Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Yale New Haven Hospital in May 2017", "Interview Descriptions": "I was called by the nurse manager on the floor I applied to and brought in for an interview. It went very smoothly and I was asked questions and then shadowed on the floor.  I did not get the job, but it was a positive experience.", "Interview Questions": "How did you deal with a difficult patient in the past?"}, {"date": "7 Mar 2017", "title": "Patient Escort Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale New Haven Hospital (New Haven, CT)", "Interview Descriptions": "The managers are very friendly ND welcoming. I felt comfortable , not a bit nervous at all. The interview was about 3 hours long. I met with hr, then the dept. Manager, along with shadowing for about 2 hours. It was about great experience.", "Interview Questions": "What do you know about the facility"}, {"date": "12 Feb 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Yale New Haven Hospital", "Interview Descriptions": "Lengthy approximately 12 weeks from filling out online application to hire date.  Several interviews human resource representative followed by patient care manager and several subsequent interviews with pcm and staff members to narrow candidates.", "Interview Questions": "Why do you think you are a good match for this position?"}], [{"date": "12 Feb 2017", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Yale New Haven Hospital (New Haven, CT) in Jan 2017", "Interview Descriptions": "Phone call with HR followed by in person interview with nurse mgr a week later.  HR CALL was less than 10 mins.  In person interview about 30 mins, followed by shadowing on the floor for 2 hrs.  HR called the same day to request refs.  Offer received 10 days post interview", "Interview Questions": "Why do you want to work at YNNH?"}, {"date": "29 Jul 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale New Haven Hospital", "Interview Descriptions": "Applied online. Got a call from HR to schedule for an in-person interview. Met with HR for about 15 to 30 mins. Then met with unit manager. Was able to shadow on unit with nurse for about 2 hours. Returned to manager's suite to wrap up. Got a call from HR shortly after leaving to discuss references. Everything took about a month from the time of application to job offer.", "Interview Questions": "Why do you want to work here?"}, {"date": "23 May 2016", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Yale New Haven Hospital (Middletown, CT) in May 2016", "Interview Descriptions": "I was called by HR who gave me instructions on the phone. I had to go to an HR office first and get some general information then head up to the floor for the interview with two people. It was hinted that I would get an offer after the shadow experience.", "Interview Questions": "How have you handled an unhappy patient?"}, {"date": "25 Nov 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Yale New Haven Hospital (New Haven, CT) in Feb 2016", "Interview Descriptions": "I met with the manager in the main office after my shift on another unit and we talked about the schedule on the unit and how I could make that work with my school schedule", "Interview Questions": "What has your experience been and how would that help you here?"}, {"date": "14 Oct 2015", "title": "Patient Care Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Yale New Haven Hospital", "Interview Descriptions": "Hiring and interview process was very easy and proceeded very quickly. I was able to go in my scrubs since I shadowed right afterwards. First, you read and fill out a form with the HR department. Then, you meet with the floor managers. Managers were a pleasure to interview with but I can't say much about HR since they did not end up scheduling a phone interview with me.", "Interview Questions": "Tell me about a time you've had a conflict with a co-worker"}, {"date": "8 Dec 2016", "title": "Clinical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Yale New Haven Hospital (New Haven, CT) in Sept 2015", "Interview Descriptions": "The interview process was quick and to the point, you also have an additional interview with the managers of the unit you are applying for. The initial interview was to the point, you need not sugar coat your answers, just be straight forward. In the interview with the unit manager, however, you are allowed to be friendly and let them get to know you", "Interview Questions": "How do you manage conflict with co workers, and have you ever had a conflict with a coworker before? "}, {"date": "14 Aug 2015", "title": "Human Resources Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Yale New Haven Hospital", "Interview Descriptions": "It was a very pleasant experience. I was asked mostly behavioral style questions. It took over a month to get an interview. I applied online and received a call to schedule interview with recruiter. I haven't received any follow up yet but was told that it was a long process.", "Interview Questions": "Why should we hire you?"}, {"date": "28 Oct 2015", "title": "Business Associate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Yale New Haven Hospital (New Haven, CT) in Aug 2015", "Interview Descriptions": "I applied on the hospitals website. Received a call from HR a week later for an interview.  Met with recruiter for 10 minutes.  Went to unit to be interviewed by managers. They didn't ask me any questions.  I shadowed for an hour then spoke with managers again.  Heard back from HR to start the reference and background check.  It took over a week to complete.  I didn't hear back for 2 months at which time I was told the position would now be per diem.  After waiting 2 months for a decision, I was not expecting that.  Total waste of time, very unprofessional.", "Interview Questions": "N/A"}, {"date": "27 Sept 2015", "title": "Pct Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Yale New Haven Hospital (New Haven, CT) in Aug 2015", "Interview Descriptions": "Online application, called within a week, came in on time but the human resources person was in a \"meeting.\" I had to hang around for an hour. Then I go to the unit to meet managers, who were also in a \"meeting.\" When they finally arrived interview went ok, standard questions. Then HR schedules time for phone interview and never called. Then called at random time when I was busy. Called back & no return call. Not sure I want to work here. Think I will stick with a smaller place. I am going to say I didn't get the job, but since I am not calling this lady back again, I really have no idea", "Interview Questions": "Many questions about conflict resolution and lazy coworkers. So, are they telling me there is a lot of conflict and laziness?"}, {"date": "12 May 2015", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Yale New Haven Hospital (New Haven, CT)", "Interview Descriptions": "First met with HR on the main campus and spent about 45 minutes speaking with her.  Straight-forward questions that you should be able to prepare for. Following that I went and met the program manager and Medical Director for the specialty at the clinic. Everyone was extremely nice and the process was very positive.\r\n\r\nOn my second interview/shadowing I met with the Medical Director again and spend 4 hours shadowing and working with the team.\r\n\r\nOn the third visit, I met with the Directors of the clinic who basically wanted to see that I was a likable and useful person.  Each experience was very positive.", "Interview Questions": "Tell me about yourself.\r\nWhat would your current or former boss say about you?\r\nWhy do you want to work here?\r\nHow do you perform under pressure?\r\nRecall a difficult situation and tell how you handled it.\r\nStrengths and weaknesses.\r\nWhere do you see yourself in 5 years?\r\nHow do you handle intra office conflict?"}], [{"date": "8 Dec 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Yale New Haven Hospital (New Haven, CT) in Feb 2015", "Interview Descriptions": "The interview was an overall mix of had qualitative and quantitative questions. It involved the nurse manager on the unit and the HR rep. They had a bunch of questions on personality and challenging situations. Overall it was quite easy since I had good references and had extensive RN experience", "Interview Questions": "How do you handle challenging situations?"}, {"date": "8 Sept 2014", "title": "Staff Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Yale New Haven Hospital", "Interview Descriptions": "Looking for an ED assignment. Advertised job seemed challenging. They were willing to train me for procedures I wasn't familiar with. Only 12 hour shifts available, which was disappointing.", "Interview Questions": "How much experience do you have with blood draws and starting IVs?"}, {"date": "19 Aug 2014", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Yale New Haven Hospital", "Interview Descriptions": "Easy  -   moderate difficulty, but nothing  surprising. Questions are rather standard. Prepare and you    will  do   well.    It all went  smoothly.  Thankfully  no group interviews. Ask to  shadow   for a    day.", "Interview Questions": "where do you see yourself   in   5 years"}, {"date": "22 Jul 2014", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale New Haven Hospital", "Interview Descriptions": "About a week after submitting an online application, I was contacted by YNHH HR and they conducted an initial interview over the phone about my clinical experiences, career plans, etc. I was scheduled for an interview for the critical care internship for new graduate nurses. I got to the hospital with about ten minutes to spare before my scheduled time, but it didn't matter because the manager who was scheduled to meet with me was over a half hour late. He began the interview by asking, \"so what do you know about us?\" and proceeded to lecture me on the metrics in place to make sure patients are cared for appropriately in as little time as possible. He seemed to know nothing about me as an applicant and did not ask any questions about my experiences, but mostly just talked about their emergency department and explained how it works (I did my capstone in an ED and already knew 90% of what he was telling me about it). I also got the impression that he was trying to intimidate or scare me away by the way he spoke about the metrics and how YNHH is very selective with who they choose as employees, etc. Overall, I was put off by the way the interview was conducted and felt like I was expected to brown nose my way into the position instead of speaking objectively about my own qualities and why I want the position.", "Interview Questions": "What do you know about us?"}, {"date": "29 Nov 2014", "title": "Surgical Tech Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale New Haven Hospital (New Haven, CT) in Aug 2014", "Interview Descriptions": "I first met with the women I spoke with over the phone to come in.  She was very nice, I believe her name was Sara.  She asked me the basic questions regarding my experience and general information as to why I wanted to be a surgical tech.  I then met with the perioperative nurses.  It was first one nurse and then more started comming in (4).  I should have been really intimidated but they were so welcoming it was great.  They just wanted to get a feel as to what speciality I enjoyed the most. And they asked me about my previous jobs.", "Interview Questions": "What type of speciality is you least favorite. "}, {"date": "26 Jun 2014", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale New Haven Hospital", "Interview Descriptions": "The interview was fair. I interviewed with HR and then the managers on the floor. There were some questions I was prepared for and some I wasn't. Overall, it was a professional and well conducted interview.", "Interview Questions": "N/A"}, {"date": "19 Feb 2016", "title": "Referral Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Yale New Haven Hospital in May 2014", "Interview Descriptions": "the interview process was lengthly, met with the supervisor and it seem to be a breeze, there after met with the director had a really good chat, met with office manager and physician in the office both seem really welcoming and was very comfortable with everyone i met with, met with the front desk staff which was okay.", "Interview Questions": "What are you're long term goals?"}, {"date": "17 May 2014", "title": "Referral Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale New Haven Hospital (New Haven, CT) in Apr 2014", "Interview Descriptions": "Applied online and one month later I received a phone call for an interview.  On interview day I was given a personality test that took about a half hour.  The HR rep that was to interview me was nowhere to be found as I was told but I remember seeing her when I was taking the test so my guess was that she didn't want to speak to me.  So I was taken to the department where I applied to interview.  Had a nice long interview with the supervisor who then had me briefly meet the manager.  Later that day I was called for a second interview that was scheduled for 2 weeks later.  Went to my second interview and met with the Director, nice meeting then they had me meet with the manager of the location that I would work at but she was not a person that I would report too, her problem with me was that I was in still in school and that I would not be able to work the shift that they were hiring about.  I assured her that classes were almost over and that I am sure that by the time I was hire and trained that classes would have been completed and ready to work the assigned shift.  Two weeks later I received an email stating that they hired someone that meets departmental needs.  I was floored, I had 10 years experience that everyone I met liked and I had the education.", "Interview Questions": "Can you tell me what the difference between Physical therapy and Occupational therapy?"}, {"date": "18 Oct 2015", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Yale New Haven Hospital (New Haven, CT) in Mar 2014", "Interview Descriptions": "The interview process was relatively straightforward and consisted of behavioral questions (tell me about yourself; describe your strengths and weaknesses; tell me about a time when you had to give someone critical feedback, etc.) and questions about my research experience and interests. Salaries are commensurate with experience and are usually non-negotiable.", "Interview Questions": "Tell me about yourself. "}, {"date": "20 Jun 2017", "title": "Administrative Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale New Haven Hospital (New Haven, CT) in Nov 2013", "Interview Descriptions": "I had a great conversation with the hiring manager and the human resource rep. It was five years ago so I don't remember much, I just know I have to write 30 words and this is really ridiculous that I have to do this because I just want to search for a job on here and it will not allow me to go ahead without doing this. I hope this is 30 words because I am done!!", "Interview Questions": "N/A"}], [{"date": "11 Aug 2015", "title": "Clinical Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Yale New Haven Hospital (New Haven, CT) in Oct 2013", "Interview Descriptions": "I applied online, and knew someone who worked in the hospital who talked to the PSM (patient services manager) and got an interview.  Questions included how would you work with coworkers who didn't do their job, what do you think about team work, what are your aspirations.  do you want to be a nurse.   Then they showed me around the unit.  I thought it was very outdated but that people seemed to be friendly.", "Interview Questions": "what was an bad experience you had with a patient or coworker or manager that you had and how did you handle it?"}, {"date": "31 Jul 2013", "title": "Business Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Yale New Haven Hospital", "Interview Descriptions": "Very professional Human Resources Department.  Friendly and informative.", "Interview Questions": "What is your weakest quality, the thing you like least about the way you work?  "}, {"date": "8 Dec 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Yale New Haven Hospital (New Haven, CT) in Feb 2013", "Interview Descriptions": "I spent time in the area i would potentially work at in order to see a day in the life to ensure that I truly understood and wanted to do the job. Later met with management and educators for official interview. Later spoke with human resources for another interview during the same day. Long day but the employees were really supportive and helpful.", "Interview Questions": "Why do you want to work in this position"}, {"date": "4 Dec 2016", "title": "Clinicl Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Yale New Haven Hospital (New Haven, CT) in Apr 2012", "Interview Descriptions": "Multiple one on one interviews with managers/directors in the service area applying for as well as HR, some were conversational others posed situational questions, total interview time was from 8-3", "Interview Questions": "When implementing a new protocol or policy, describe your gap analysis"}, {"date": "14 Oct 2015", "title": "Registered Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Yale New Haven Hospital in Aug 2011", "Interview Descriptions": "CNM, outpatient and inpatient; systematic interview, very friendly some clinical questions asked. Business professional attire; be familiar with culture, objectives, mission of facility; current interest goals and needs. Obtain feedback from current dietitians if possible and other health care practitioners on the unit of interest if possible.", "Interview Questions": "Why are you applying for the clinical dietitian position?"}, {"date": "29 Oct 2014", "title": "Social Work Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale New Haven Hospital (New Haven, CT) in Dec 2010", "Interview Descriptions": "It was good. It took about 4 weeks and it was ok with me. I met the supervisor, managers, other workers before I started working there. I was a good experience overall.", "Interview Questions": "none"}, {"date": "14 Apr 2011", "title": "Science Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Yale New Haven Hospital (New Haven, CT) in Dec 2010", "Interview Descriptions": "It took couple of emails to get a reply but once the communication was established everything happened rapidly and I was able to decide if I wanna join the place right away. The people were friendly, the office staff were efficient and they were very welcoming to all.", "Interview Questions": "What do you want to get out of this job?"}, {"date": "15 May 2012", "title": "Health Care Tech Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Yale New Haven Hospital (New Haven, CT) in Jun 2010", "Interview Descriptions": "Took a long time for human resources to set up interview and then call with positive feedback and job offer once the decision was made.  But overall, very  informative, had a packet of information available to me with all that was offered - union information helped, also.", "Interview Questions": "N/A"}]]