[[{"date": "15 Nov 2021", "title": "Housekeeping Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at United Regional Health Care System (Wichita Falls, TX) in Nov 2021", "Interview Descriptions": "I met at the hospital and was met outside and taken in to an interview with the hiring manager of guest services. He was super nice and communicative. The interview was roughly 30 minutes.", "Interview Questions": "What is a time where you feel you had resolved conflict within  your coworker relationships? "}, {"date": "6 Sept 2021", "title": "Graduate Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at United Regional Health Care System (Wichita Falls, TX)", "Interview Descriptions": "Had a zoom interview with HR, initially. He basically promised me a second in-person interview the following week. The following week came and went with no contact. I logged into the United Regional portal to view my current applications and saw that the position I applied for was closed and that I was not selected for the position. I emailed HR regarding this, and never received a response. It took months to get a response to get info about the internship in the first place. Their lack of communication and delayed response is extremely unprofessional. If you eventually get them to respond to you about a position, don’t get your hopes up.", "Interview Questions": "What is your previous work experience?"}, {"date": "16 Apr 2022", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at United Regional Health Care System (Wichita Falls, TX) in Feb 2021", "Interview Descriptions": "Great questions, kind recruiters, fun, easy, great experience, employee health physical, labs and drug screen, peer interview, manager interview, took about a month to get through the process, professional, positive, great place to work", "Interview Questions": "How much experience do you have in the current role?"}, {"date": "8 Jul 2022", "title": "Human Resources Generalist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at United Regional Health Care System in Jan 2021", "Interview Descriptions": "Very easy going and personable. Several rounds but interviews were held over Teams video chat. Did not take long. Standard questions. Several team members on the interviews. Very flexible with timing. Everyone seemed excited.", "Interview Questions": "Problem solving questions that included antecdotes. "}, {"date": "5 Aug 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at United Regional Health Care System", "Interview Descriptions": "The hiring process takes place in three stages. First you interview with the recruitment manager, then the nurse manager, and last you do a peer interview.  The recruiting manager was awesome and was diligent to pair me with the units I was most interested working on.  The peer interview and nurse manager interviews were very similar.", "Interview Questions": "Tell me about yourself \n\nWhy do you want to work here\n\nTell me about a time where you experienced customer dissatisfaction "}, {"date": "1 Oct 2019", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at United Regional Health Care System (Wichita Falls, TX) in Jul 2019", "Interview Descriptions": "3 interview process, first being with HR, then with the department head, and then with a peer review. They all explained the job duties and requirements very well and gave plenty of time to ask questions", "Interview Questions": "How do I handle confrontation?"}, {"date": "21 Feb 2019", "title": "Operations Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Regional Health Care System", "Interview Descriptions": "Normal interview with HR- talk about background, education, experience, past problems with management, then interview with dept mngr- this was the easiest- he basically just said it's up to you to pass the peer interview; I know you are qualified, then peer interview with three employees (1 tech analyst, 1 clinical analyst & 1 operations support tech, then drug test.", "Interview Questions": "What kinds of problems have people recently called on you to solve? What kinds of project planning or administration did you do in your last job? Tell me about some of these projects.\r\nHave you suggested any new ideas to your boss in the last 6 months? Were they accepted? \r\nCan you think of a situation you handled in which old solutions didn’t work? What did you do to handle it? Why did you handle it that way?\r\n2.\tWe all have had times when we just couldn’t get everything done on time. When and how had this happened to you?"}, {"date": "3 Dec 2017", "title": "Sterile Processing Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at United Regional Health Care System (Wichita Falls, TX) in Nov 2017", "Interview Descriptions": "It’s three part and very thorough. You have to call and bug them sometimes but they’re all very very nice. I enjoyed being able to meet not only with HR but with the floor manager themselves and some of the people I would be working with. It gave me a more comprehensive view of my job role and who I would be working with.", "Interview Questions": "What my strengths and weaknesses were "}, {"date": "10 Oct 2017", "title": "Endoscopy Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Regional Health Care System", "Interview Descriptions": "It's a three part interview.  My first interview was in person. Then i meet with the manager in the department. Last interview is through the people your going to work with.", "Interview Questions": "N/A"}, {"date": "14 Sept 2017", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at United Regional Health Care System", "Interview Descriptions": "I applied online and was called after two days for phone interview. The interview was about 20 minutes long. It was mostly about behavioral questions. It took about a week to find out the result.", "Interview Questions": "Why do you want to work here?"}], [{"date": "29 Sept 2017", "title": "Nursing Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at United Regional Health Care System (Wichita Falls, TX) in Mar 2017", "Interview Descriptions": "First there is a phone interview, a manager interview, then a peer interview. I didn't receive an offer, but I also wish they didn't string me along for weeks before saying they were not interested from the beginning. The questions are fairly complicated, but the people are friendly.", "Interview Questions": "How would you prioritize care between patients?"}, {"date": "28 Feb 2018", "title": "R N Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at United Regional Health Care System in Jan 2017", "Interview Descriptions": "Takes a few weeks to get through everything. A lot of questions asked between the hiring stages but just stay positive throughout the experience. If you don’t get the position, they will work will you to help find another spot.", "Interview Questions": "Why should we hire you? "}, {"date": "3 Sept 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at United Regional Health Care System (Wichita Falls, TX)", "Interview Descriptions": "Takes over a month to get hired. At the first interview you are in front of a firing squad of.anywhere from 3 to.15 people all.asking you a million crazy questions.", "Interview Questions": "Do I like taco salad"}, {"date": "12 Jan 2016", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at United Regional Health Care System", "Interview Descriptions": "I interviewed with 3 ppl and got a tour they went into deep detail about the position and asked your average interview questions such as your strengths weaknesses where do you see yourself in 3 years my availability. I was also asked how soon I would be able to start and if they would be able to contact my references.", "Interview Questions": "What's your greatest weakness"}, {"date": "11 Sept 2019", "title": "Clinical Nurse Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Regional Health Care System (Wichita Falls, TX) in Jul 2015", "Interview Descriptions": "Had 3 interviews first was with the HR department, then the management team, and then by peer.  The Peer panel makes the decision of who they want to bring on to their team. its a great process", "Interview Questions": "Tell me about a time that you had to adjust your language or terminology to fit the needs of your audience? "}, {"date": "13 Jul 2015", "title": "Coordinator/Resolution Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at United Regional Health Care System (Danbury, CT) in May 2015", "Interview Descriptions": "Very Helpful and manageable into helping me further my career. Made me a better person and made me know what I need to do and learn about myself to further evaluate myself.", "Interview Questions": "How can this company make you a better overall person"}, {"date": "20 Mar 2019", "title": "Technical Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Regional Health Care System in Apr 2015", "Interview Descriptions": "Intensive. Normal.  Nothing out of the ordinary. It was same. Nothing scary. The group peer interview was a little scary, but they were all wonderful people.  They made you feel very comfortable, and at ease.", "Interview Questions": "The normal questions. Nothing out of the ordinary. The same typical questions about why you applied, what I know, and all that."}, {"date": "21 Jul 2015", "title": "Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Regional Health Care System (Fort Worth, TX) in Jan 2014", "Interview Descriptions": "Had 3 different interviews. All went good. The last interview is a peer interview it is the hardest out if the three and the most important as they decide Wethersfield or not they luke you enough to hire you as a co worker. So other than that it was not all that bad to me", "Interview Questions": "N/A"}, {"date": "28 Aug 2015", "title": "Enrollment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at United Regional Health Care System (Eau Claire, WI) in Nov 2011", "Interview Descriptions": "Sat in a small conference room with the supervisor and had a twenty minute conversation. They asked a few questions about previous job experience and told me some about the requirements of the position I was applying for.", "Interview Questions": "One question was - \"Describe a time you had to deal with a difficult situation.\""}, {"date": "14 Nov 2011", "title": "Customer Service Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 days. I interviewed at United Regional Health Care System (Tampa, FL) in Apr 2011", "Interview Descriptions": "Telephone interview was sloppy and confusing.  Very disappointed.", "Interview Questions": "Multi-questions asked with litte time to reply.  Interviewer was new and seemed like she didn't know what she was doing.  She had little confidence"}], [{"date": "15 Oct 2013", "title": "CNA Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at United Regional Health Care System (Wichita Falls, TX) in Jan 2009", "Interview Descriptions": "Was interviewed by the DON and and was asked a series of questions. None of which were difficult.", "Interview Questions": "Why do I feel that I should be offered the position?"}]]