[[{"date": "6 Jan 2018", "title": "Addiction COunselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at Arapahoe House (Denver, CO) in Aug 2017", "Interview Descriptions": "Brought in, offered coffee, Donald and Jamie picked my brain, then Donald ask me to get written promotion from my teacher and Michael Burson to finish my internship and come on board at the Denver clinic.", "Interview Questions": "What are you passionate about. "}, {"date": "3 May 2017", "title": "Clinical Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Arapahoe House (Wheat Ridge, CO) in May 2017", "Interview Descriptions": "Group interview.  Applicants were not asked to interact with each other directly; questions were asked generally and applicants had the opportunity to respond clockwise or popcorn-style.  Representatives from different programs within Arapahoe House attended and gave a little blurb on what their unique facilities offered to clients, and applicants were asked to email their contact person if interested in pursuing an internship after the interviews (rather than being offered a position as is done traditionally).", "Interview Questions": "Talk about a time you handled something poorly in session, and what did you do to resolve this mistake?"}, {"date": "31 Oct 2016", "title": "Primary Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Arapahoe House (Denver, CO) in Oct 2016", "Interview Descriptions": "recruiter will interview on the phone for about 15 minutes then hiring manager will call. They ask general interview questions however they will catch you off guard by asking what is your salary requirement as the first question.", "Interview Questions": "What salary would you like."}, {"date": "7 Sept 2016", "title": "Addiction COunselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Arapahoe House (Thornton, CO)", "Interview Descriptions": "Interview to hire was relatively quick, which was nice. It was a relaxed atmosphere, and I just interviewed with my supervisor. Supervisor was friendly and showed me around the building. Supervisor also introduced me to my future coworkers, who asked me a couple of informal questions about myself. After I was hired, I don't believe there was enough training for the position.", "Interview Questions": "There was a question about how I handled workplace gossip"}, {"date": "11 Sept 2016", "title": "Primary Therapist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Arapahoe House (Denver, CO) in Dec 2015", "Interview Descriptions": "Positive, quick at first, group interview, good follow up when I had questions. Not completely organized during the group interview. They seemed to be looking for people who will stay a long time, as they have historically had higher turnover.  I was able to follow up with questions regarding caseload, benefits, start date, etc.  They want a balance of people with clinical heart and skill.  There is a little bit of the \"tough it out\" feel of substance use (they want to know if you can handle the environment so pose some intense questions- though these scenarios do happen-they are rare).", "Interview Questions": "How long do you plan on staying?"}, {"date": "20 Sept 2019", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Arapahoe House (Wheat Ridge, CO) in Dec 2015", "Interview Descriptions": "One person asks questions, application, phone interview, drug test, training.  The usually stuff. Nothing else to add. 30 words is a lot. Mist people know how interviews go. Not sure what you want people to add here", "Interview Questions": "What is MI"}, {"date": "8 Jun 2016", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Arapahoe House (Denver, CO) in Sept 2015", "Interview Descriptions": "Easy, simple phone interview. Make documentation and client care top priorities and your golden. The questions are typical interview questions. They will ask if you are or were ever an addict. Be honest. Addicts are hired all the time you just have to have a certain amount of sobriety. Staff who are addicts, tell clients all the time and the clients connect with them. Non-Addicts need to be prepared what they are going to say because the clients will ask if you are or were an addict.", "Interview Questions": "What risk are we taking by hiring you"}, {"date": "24 Apr 2015", "title": "Primary Therapist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Arapahoe House (Denver, CO) in Feb 2015", "Interview Descriptions": "Interviewed with two supervisors, answered a few questions and heard back very quickly. They were flexible about the start date and have recently added quite a bit more training for newcomers.", "Interview Questions": "How do you think change occurs?"}, {"date": "16 Oct 2013", "title": "Counselor I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Arapahoe House (Aurora, CO)", "Interview Descriptions": "I submitted my resume with application to a supervisor at a local facility.  About a week later I received a call for an interview.  The interview was straight forward and professional.", "Interview Questions": "N/A"}, {"date": "17 Jun 2017", "title": "Drug and Alcohol Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Arapahoe House (Aurora, CO) in May 2013", "Interview Descriptions": "The interview process was easy and went very well. I was asked to come in and have a seat. They ask me to take my time answering each questions. They made me fill very comfortable and at ease.", "Interview Questions": "What are your short and long term goals?"}]]