[[{"date": "25 Dec 2022", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Maryland Institute College of Art", "Interview Descriptions": "I interviewed for a position in the Humanities division of the college. It consisted of a standard 1.5-day interview process, with a lecture followed by Q&A, individual meetings with staff members on campus (deans, faculty), and a lunch/interview where they used a standardized, 10-question template to ask about teaching and research.", "Interview Questions": "How to accommodate diversity in the classroom."}, {"date": "26 May 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Maryland Institute College of Art", "Interview Descriptions": "there were multiple interviewers which felt nerve-wracking but they made you feel very welcome the whole time. They described the position well with what duties would be required. They made me feel comfortable and not as nervous going into it.", "Interview Questions": "Please tell us about yourself.\r\n\r\n"}, {"date": "9 Mar 2021", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Maryland Institute College of Art", "Interview Descriptions": "Great time everyone in the process was very nice. Just be calm and it’s basically a breeze. Remembering your resume is very much key to the process and stating your words clearly.", "Interview Questions": "Asked about your qualifications mostly "}, {"date": "4 Sept 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 2 months. I interviewed at Maryland Institute College of Art", "Interview Descriptions": "This process took much longer than was necessary. I was called by a Human Resources representative at the end of August after applying for the job several times over the last year (I graduated from art college and figured MICA would be a good fit for me since I also worked in several departments at my art college). I called back twice the day I was contacted and reached the person's voicemail. I left two messages and received no calls back that day. I then called twice the next day, leaving messages again. None of my calls were returned. \r\n\r\nA week later I received an email from the representative that seemed as if they didn't receive any of my calls at all. She told me she was hoping to schedule a quick 30-minute call. We did the call the following day. She asked pretty generic questions and when I asked about the job she couldn't tell me much about what it entailed (having worked in HR, I understand you won't know every detail about every job description, but you at least have a decent idea). \r\n\r\nOverall, the entire process seemed a bit disorganized. My phone interview was July 24th and I didn't receive anything back about the job until today, September 4th. I know a lot of jobs will either never get back to you or send a generic response if you didn't make the cut, but I didn't feel that this interview could even be considered as such.", "Interview Questions": "How did you hear about this job?"}, {"date": "2 Jun 2018", "title": "Department of Exhibitions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at Maryland Institute College of Art", "Interview Descriptions": "I work there as a work study during the school year. I submitted my resume and cover letter.\r\nSince it was a work study you didnt have to go in for a actual interview, as long as you are a good student who needs help.", "Interview Questions": "N/A"}, {"date": "22 May 2018", "title": "International Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Maryland Institute College of Art (Baltimore, MD) in Jan 2018", "Interview Descriptions": "I was called out of the blue by their HR Specialist due to a current employee resigning - had applied for another position that was completely different, months prior. The person calling was abrupt, unprofessional, and impatient during the entirety of the call. I was told I would be called back the following day to schedule an in-person interview and never was. When I emailed to follow up, this same HR Specialist was cold and unhelpful. Not happy with this kind of treatment.", "Interview Questions": "Tell me about your work experience."}, {"date": "17 Aug 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Maryland Institute College of Art in Dec 2015", "Interview Descriptions": "It was a very easy process. The initial phone screening interview was not difficult. At the in-person interview, the directors and recruiter seemed genuinely interested in my skills and experiences as opposed to just asking questions back to back.", "Interview Questions": "Why did you choose to apply to this specific department?"}, {"date": "24 Mar 2016", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Maryland Institute College of Art (Baltimore, MD) in Sept 2015", "Interview Descriptions": "It was great. The director is very personable. I come in, she greeted me, we sat down, we chat, I talk about my work, she explains about the office. It was good.", "Interview Questions": "Why here?"}, {"date": "26 May 2015", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Maryland Institute College of Art (Baltimore, MD) in Mar 2014", "Interview Descriptions": "The interview was quite thorough.  The questions inquired about leadership, programming ability, scheduling ability, health and wellness knowledge (including mental health, and physical health), exercise knowledge, nutritional knowledge, and ability to read a calendar.  The interview was in a white room, with about 8 chairs.  There were only two people in the room though, so that was interesting.\r\n\r\nAnyway, the staff was fairly nice to me during the interview, they were quite open about what they wanted in a candidate, and didn't waste any time.  They asked pointed questions and you could tell when you said an answer they liked.", "Interview Questions": "What kind of programs would you create for our less socially inclined community members?"}, {"date": "24 Jul 2013", "title": "Assistant Director of Student Activities Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Maryland Institute College of Art", "Interview Descriptions": "Initial communication via telephone to set up skype interview.\r\nSkype interview consisted of 4 of the office members, including the director and other assistant directors.  All members were very friendly during interview and very attentive.  It was very clear that some of the questions were based off information provided on resume and cover letter.", "Interview Questions": "Questions were asked in a \"popcorn\" style way, each person would ask a question after the other, an unexpected question was, Is there anything else about you that you can share, that is not listed on your resume. "}], [{"date": "12 Sept 2015", "title": "Administrative Assistant Position In Graphic Design and Video Department Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Maryland Institute College of Art (Baltimore, MD) in Jul 2013", "Interview Descriptions": "To me, it seemed like they already have someone internally like the most recent graduate student. Our interview was just a screening purposes. They weren't exactly looking into hire anyone.  After the interview session,  I knew, I wasn't going to get this job.", "Interview Questions": "How did you describe yourself in 5 years?"}]]