[[{"date": "15 Mar 2023", "title": "Patient Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Arkansas Children's in Feb 2023", "Interview Descriptions": "It was such a positive experience interviewing. Both interviewers helped throughout the process to better understand questions and were very personable. They were very thorough when explaining salary and benefits", "Interview Questions": "Tell me about a time a policy change has affected you."}, {"date": "3 Nov 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Arkansas Children's", "Interview Descriptions": "The interview was with two members of the floor I was interviewing for. They asked me questions from a paper they had, 12 in total. There were a lot of scenario type questions and how you responded to that situation.", "Interview Questions": "Why do you want this job, why did you choose here? How do you handle stress? Why should we hire you? Tell me about yourself?"}, {"date": "25 Mar 2023", "title": "Grant Writer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Arkansas Children's in Jul 2022", "Interview Descriptions": "The interview process was very smooth. I had one phone interview followed by one in person interview. They were very prompt on getting back to me. The whole process took under one month.", "Interview Questions": "Why do you want to work for Children's?"}, {"date": "10 Jun 2022", "title": "Financial Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Arkansas Children's", "Interview Descriptions": "Interview via skype. Went really well asks strengths and weaknesses. If I collected money and what what I knew about Medicaid.  Informed me that job is primarily evaluating and taking Medicaid applications and then processing them as well.", "Interview Questions": "Do you have any knowledge of Arkansas Medicaid?"}, {"date": "4 Mar 2021", "title": "Accounting Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Arkansas Children's (Little Rock, AR) in Dec 2020", "Interview Descriptions": "Human Resources contacted me and set up interview process.  The process was a remote video interview with relevant members of the team.  The interview platform used was Microsoft Teams.   Arrive early to the Teams meeting.", "Interview Questions": "Do you have any experience in the Payroll function of accounting?"}, {"date": "28 Aug 2020", "title": "Research Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Arkansas Children's", "Interview Descriptions": "A rough timeline of the process:\n\nDay 1 - Applied online\nDay 10 - Zoom interview with hiring manager and department lead\nDay 20 - Second Zoom interview \nDay 30- HR reached out with an offer", "Interview Questions": "Tell us about yourself.\n\nWhy are you interested in working at our hospital? "}, {"date": "28 Aug 2020", "title": "Access Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Arkansas Children's (Little Rock, AR) in Aug 2020", "Interview Descriptions": "The interview was setup via text messaging which made the process much quicker than other companies. The interview was conducted via Microsoft Teams (I do not recommend using a Macbook for this). There were five people interviewing me and it was a good representation of the team you would be working with.", "Interview Questions": "Describe a time where the situation changed a project you had been working on?\r\nWhat would you want to accomplish upon starting?"}, {"date": "1 May 2021", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Arkansas Children's (Little Rock, AR) in Apr 2020", "Interview Descriptions": "You are contacted by a HR Recruiter and they set up the interview. Interview is done via Teams due to Covid. The hiring manager will ask you to tell them about yourself and then ask you some questions.", "Interview Questions": "Tell me about a time where you got some negative feedback about your job performance and how you corrected it"}, {"date": "30 Jan 2023", "title": "Clinical Laboratory Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Arkansas Children's (Springdale, AR) in Jul 2019", "Interview Descriptions": "The interview is in person with the team lead and the manager. They ask a few questions about your experience and then they go over the work flow. It’s not very difficult.", "Interview Questions": "Do you have experience working with children?"}, {"date": "16 Sept 2018", "title": "Public Health Program Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Arkansas Children's (Little Rock, AR) in Jul 2018", "Interview Descriptions": "3 part process. 1. phone interview with hiring manager 2. in-person with only the hiring manager.  3. interview with the team.  round 2 we went over about 12 scenarios that could happen on the job to determine the best way I would solve the issue.", "Interview Questions": "interview 1 what are pressing childhood issues that you're passionate about and how does ACH fit into the picture?"}], [{"date": "18 Nov 2015", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Arkansas Children's (Little Rock, AR)", "Interview Descriptions": "Interview was time consuming. You have to make it through HR before meeting with director. Once you meet with director or hiring personnel, then you have to wait for back ground and drug test to come back. Takes a little bit", "Interview Questions": "Pretty much goes over resume in detail "}, {"date": "9 Sept 2015", "title": "Patience Information Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Arkansas Children's (Little Rock, AR) in Sept 2015", "Interview Descriptions": "I was tested in data entry and costumer services as first step, really short test in a small room, just me and a computer, nothing to be worry, then I have a a personal interview with all the involve people in the department, five people around me asking questions. They was really relax, no stress, laid back,  they make you feeling really comfortable. Great professionals.", "Interview Questions": "Why I wan to work there? How i will solve a situation with a upset costumer, etc"}, {"date": "20 Oct 2014", "title": "Patient Information Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Arkansas Children's in Dec 2013", "Interview Descriptions": "After applying I got called in for a interview, but before you can go to the interview you have to pass a typing test its just filling information in such as name, address, etc. After you complete that you have a short customer service section. It's all pretty easy just practice typing before going in. After my interview it took about a week or maybe two to hear back and then after that I had to do some stuff through employee health such TB skin test, drug test, and flu shot. Then I started the following monday.", "Interview Questions": "The interview is really easy and laid back. She'll ask questions that are really easy like why you wanna work for childrens."}, {"date": "3 Oct 2013", "title": "Child Care Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Arkansas Children's (Little Rock, AR)", "Interview Descriptions": "One interview with supervisor. Asked to plan a lesson, teach a group of students, and was offered job in about a week. starting date was 2 weeks later.", "Interview Questions": "Asked something like: How do you know you can handle a group of challenging toddlers or babies?"}, {"date": "26 Oct 2012", "title": "Development Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Arkansas Children's (Little Rock, AR)", "Interview Descriptions": "Quite lengthy, at least 3 interviews, sharing a personal connection will always make a difference, they want to see that you are smart, driven, goal-oriented, have fundraising experience, and are a team-player. Dress as professionally as possible. If offered the position, you will have to pass a tb test and drug screen.", "Interview Questions": "How will I make things better for the team?"}, {"date": "12 Sept 2012", "title": "Area Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Arkansas Children's (Little Rock, AR) in Aug 2012", "Interview Descriptions": "The interview was very nice and relaxed. Even though several people were in the room interviewing the applicant; they provided an environment that was comfortable for the task at hand. Everyone was laid back, down to earth, and professional. They explained specifically what they were looking for in the potential employee and asked thought-provoking questions to assist them in their decision. I enjoyed the interview and would like to participate in another opportunity to interview.", "Interview Questions": "What do I see myself doing professionally in the next 10 years of my life?"}, {"date": "4 May 2014", "title": "Patient Information Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Arkansas Children's (Little Rock, AR) in Sept 2011", "Interview Descriptions": "Submit your application online, take data entry test, then interview for position with department leadership team. If you meet requirements you will be offered the job. This is a customer service based position so be sure that you are people friendly and can handle stressful situations. Most positions are call center based so be fast paced, on the phones all the time, and communication is key.", "Interview Questions": "In one year you will be celebrating your one year anniversary, what accomplishments would you be celebrating as well?"}, {"date": "17 Jul 2011", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Arkansas Children's (Little Rock, AR) in Jul 2011", "Interview Descriptions": "It was in front of a group of people; very friendly and pleasant; focused on patient care, continuity of care and helping families of the patients. It was by far the most uplifting and informative interview I have ever been in.  Truly an amazing group of people!", "Interview Questions": "Why did you apply for this specific unit in this hospital?"}, {"date": "27 Feb 2011", "title": "CVICU RN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Arkansas Children's (Little Rock, AR) in Jun 2010", "Interview Descriptions": "1 on 1 interview", "Interview Questions": "If I could work for the wage they offered."}, {"date": "17 Feb 2011", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Arkansas Children's (Little Rock, AR) in Feb 2010", "Interview Descriptions": "I live out of town. I was interviewed by two people in one day. The offer was made approximately two days later. Great experience!", "Interview Questions": "We take care of patients for lengthy stays, and it is difficult to not get attached to them. How do you think you would handle losing a patient? "}]]