[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Love this place!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "24 Aug 2021", "job_title": "Customer Service Representative in Bozeman, MT", "duration": "N/A", "pros": "Flexible scheduling, great coworkers, fun environment, something new every day.", "cons": "Rush when school year begins, lines can VERY long and store is filled."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Drama, Gaslighting, Chaotic  management, lies", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 May 2022", "job_title": "Graphic Artist in Bozeman, MT", "duration": "N/A", "pros": "Ok, benefits. Students are helpful.", "cons": "If you are looking for a supportive environment where you are not treated like scum this is not the place for you. Management runs the place like a high school with the special people and the ones who get bullied. Everyone is gossiping about each other, especially management about other employees. They told customers my dad had passed away over email. HIPPA? \r\n\r\n They SAY they follow the Leaders Eat Last book but that is just to disguise how they bully people out of jobs so they don’t have to fire them and make work flow impossible. \r\n\r\nI would constantly show up early and work through my lunch to meet a deadline and then get abraded for being 10min late. \r\nThey don’t give you tools, a desk, training, or the software to do your job, then treat you like you are a child for asking for things that any real company knows to provide their employees. They even lie about equipment being set up when it’s not.\r\n\r\nI developed an ulcer from constantly being treated as though I couldn’t do anything right, being run around in circles and management using me as a scapegoat for their failures. When I couldn’t get out of bet from the stress of it all I was let go. \r\n\r\nA day after being let go, still sick they called the police because I had an iPad I was wiping because it had my Apple ID on it and no one else could do it. They also made every excuse not to give me my vacation pay and cheeped me out of the medical stipend when I still had to pay for medical even though it would end. \r\n\r\nThese people claim to be Godly but I don’t know how they can sleep at night with all the things they’ve done to other employees as well."}]]