[[{"date": "8 Jun 2023", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Belmont University", "Interview Descriptions": "Very thorough and well thought out process to ensure the best option for the job is chosen. Made clear both in who my RAs were as well as when I went through the process myself", "Interview Questions": "Why do you want to be a resident assistant?"}, {"date": "1 Apr 2023", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Belmont University", "Interview Descriptions": "The process is discriminatory. They ask you to write a 400 word essay about how Christianity informs and guides your personal and professional life and how this relates to how you’ll live their values. I realize this is a Christian institution, but this is a clear sign that they will not consider you for a position, if you are not Christian. We have anti-discrimination employment laws for this reason, there is no reason why a Jewish or Muslim person couldn’t perform well in a role in their corporate offices or even as a professor, janitor or other role and there is no indication that one’s faith will make them a good performer. This is literally just a way to be discriminatory.", "Interview Questions": "Please write 400 word essay about how Christianity guides your life and how you will live Christian values in this role.."}, {"date": "3 Jan 2023", "title": "Medical Affairs Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Belmont University", "Interview Descriptions": "Very clear and organized. Had lots of questions from lots of people. Long day of tours. Food provided, and itinerary given. Prepare by making sure you know why you are a good fit. Faith based, very heavy.", "Interview Questions": "Challenges you have faced, favorite food, weakness, achievements, silly fun questions, questions you have for them"}, {"date": "28 Nov 2022", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Belmont University", "Interview Descriptions": "it was a conversation style interview consisted of typical questions this interview was focused on student engagement how can you make the campus a better place for students like yourself", "Interview Questions": "plan an event for campus"}, {"date": "8 Mar 2022", "title": "Librarian Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Belmont University", "Interview Descriptions": "Not forthcoming about all the steps involved and took many months. It required HR interview, an more lengthened Zoom interview, and the next interview was to go on campus and meet others.", "Interview Questions": "What is your experience managing students? "}, {"date": "7 Feb 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Belmont University (Nashville, TN) in Jul 2021", "Interview Descriptions": "I had a detailed and lengthy conversation with the employer. In the end my qualifications did not match but the interview was through and I felt valued as a potential candidate.", "Interview Questions": "What is your related experience?"}, {"date": "13 Aug 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Belmont University (Nashville, TN) in Jul 2021", "Interview Descriptions": "The first round was a Zoom interview with the hiring manager and the second round was an on-campus interview with the Dean and Associate Dean of the college the position was in.", "Interview Questions": "Where did I see myself 20 years from now. "}, {"date": "12 Apr 2021", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Belmont University", "Interview Descriptions": "Very simple and direct process; the interviewers were very friendly and very clear about expectations and the next steps would be after the interview; hiring decision was released very quickly", "Interview Questions": "What are my strengths and weaknesses"}, {"date": "16 Aug 2020", "title": "Residence Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Belmont University", "Interview Descriptions": "Very thorough process with multiple stages involved. Began with a phone, followed by an additional phone conversation, and then concluded with an on-campus interview. The offer came very quickly and was provided with a short turn around time window to accept or deny.", "Interview Questions": "What do you like to do for fun?"}, {"date": "14 May 2019", "title": "Urban Residency Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Belmont University (Nashville, TN) in Mar 2019", "Interview Descriptions": "It appeared organized. However, it wasn't.  I was notified about a dinner meeting the day before.  The faculty members were not interested in a minority.  Many of the faculty members were not present.", "Interview Questions": "The questions were not scripted or identified.  Faculty members were randomly asking questions. How can you measure when there is no order?"}], [{"date": "20 Sept 2018", "title": "Web Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Belmont University (Nashville, TN) in Jul 2018", "Interview Descriptions": "They called to set up an on-site interview. The on-site was just with the immediate director and other employees in the department. It went about an hour or so. Then I was emailed to set up a second interview and asked to create a demo web page.", "Interview Questions": "Why do you want to work at Belmont University?"}, {"date": "9 Jul 2018", "title": "Career Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Belmont University in May 2017", "Interview Descriptions": "The interview process was quite simple. After meeting in person at a career fair, I was given one interview over the phone that consisted more of casual conversation than simply answering questions.", "Interview Questions": "What do you plan to get out of this internship? "}, {"date": "13 Jul 2016", "title": "Event Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Belmont University (Nashville, TN) in May 2016", "Interview Descriptions": "This interview process was a little different than the average process because I had already worked at the University for a year and a half at a different position.  There was a phone interview with 4 people on the other end.  The next round was in person with a panel of 9 people.  I knew just about everyone I was interviewing with, which made things a little more comfortable, but also put the pressure on to be able to prove why I would be good for the position.", "Interview Questions": "Event planners have one of the most stressful jobs in the country, how do you handle stress and how can you handle it in this environment?"}, {"date": "4 Jun 2015", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Belmont University", "Interview Descriptions": "I had a phone interview and then was asked to come in for an in-person interview. The phone interview was with the hiring committee, and then then live interview was more like a tour of the campus and 1:1 or 2-3:1 mini interviews with the various people on the hiring committee.", "Interview Questions": "Very standard - \"When was a time that you performed excellent customer service?\" \"What are your top 3 strengths.\" etc."}, {"date": "5 Oct 2014", "title": "Residence Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Belmont University (Nashville, TN)", "Interview Descriptions": "Three rounds of hiring take place for each candidate. Reviewing submitted applications, phone interview, and then an on campus interview. On campus interview you will have a long day of interviews with multiple groups, but it's helps you understand the culture of Belmont by spending time with so many people. In general, people are very nice.", "Interview Questions": "Not exactly difficult, but you will be asked about your faith because Belmont is a Christian institution."}, {"date": "31 Aug 2015", "title": "Library Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Belmont University (Nashville, TN) in Aug 2013", "Interview Descriptions": "Very casual -- I was called in for an interview, and I met with the Library director one on one. He asked me basic questions about my interest in the job, but I could tell it was more to see what my character and personality would be on the job. Once the boss was satisfied, he scheduled a training for the following week.", "Interview Questions": "Basic questions -- What are your interests? Are you flexible with your hours? How long are you looking to be employed?"}]]