[[{"date": "15 May 2023", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UN Women (Istanbul)", "Interview Descriptions": "A member from the team will reach out to you to confirm interview time and then you will have a panel interview with 4 people in the team. They might ask for additional materials", "Interview Questions": "What keeps you motivated to do the work"}, {"date": "31 Jan 2023", "title": "Program Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UN Women", "Interview Descriptions": "This is a competency-based interview looking specifically at the skills highlighted in the TOR. You will be expected to recount situations where these skills have been demonstrated. Depending on the Office, it is worth researching their priorities and weave this into your motivation where appropriate.", "Interview Questions": "Describe a time when you led a team in a challenging situation. What did *you* do to achieve the desired result?"}, {"date": "18 Mar 2023", "title": "Knowledge Management Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UN Women in Feb 2023", "Interview Descriptions": "Initial contact was great: good communication and fast responses (heard back only 4 days after submitting my application). Process consisted of a writing assessment (writing 2 pages on three questions, 2 hours to complete) and a panel interview. The interview was quite bad: it was a pure box-ticking exercise with basic questions (only basic behavioral interview questions, zero questions about technical expertise or the complex project they were hiring for). The interviewers gave no responses, no space for dialogue, and did not follow up on any of my answers - it felt unsettling and infantilising. The interview lasted less than 30 minutes.", "Interview Questions": "ASSESSMENT QUESTIONS: 1) How do you define Knowledge Management? 2) In the context of [Project] how can knowledge be harnessed to strengthen the implementation of GBF programmes? 3) Can you recommend any approaches? INTERVIEW QUESTIONS: 1) Tell us why this role is interesting for you. 2) Tell us about a time when you moderated an online community. 3) Tell us about a time you did not achieve a goal and what you learned from it. 4) Tell us about how you organized a project and met deadlines."}, {"date": "22 Dec 2022", "title": "Communication Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UN Women", "Interview Descriptions": "First apply online submit the Resume, then thirty mins interview with your surpervisor, and the offer letter and you proceed to onboarding. Very simple. approximately 1 month for all the procudures.", "Interview Questions": "what is your reason for the application? what do you think the most critical issue of gender inequality?"}, {"date": "5 Dec 2022", "title": "Undersecretary Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UN Women", "Interview Descriptions": "Very simply straightforward Very professional 1hr to 2hr work enjoyed the interview Very easy Very good A lot of conversations A lot of vibes of absences Will also be assisting with the administration of various benefit programs, such as group insurance, medical and dental, accident and disability, and health maintenance programs Preparing and maintaining team member benefit files, assuring accuracy, compliance and confidentially. Organizing and taking part in meetings designed to help team members obtain information and understand company benefits and other related wellness programs. Generating COBRA notices and other", "Interview Questions": "What brought you here? How would you improve your skills?"}, {"date": "21 Dec 2022", "title": "Head of Sub Office Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UN Women (Kabul) in Dec 2022", "Interview Descriptions": "My interview appointment was scheduled in more than a week's time. The interview was scheduled for only 30 minutes. As a former UN staff member, I believed the interview could be in a short duration because it was a temporary appointment position. During the time of the interview, I login to the zoom link which was shared by the HR focal point. To my disappointment, none of the panel members was available and no body informed me about the potential delay. I wrote a line via email to the HR Specialist inquiring if the interview timing has changed but she responded that I should wait. 30 minutes later, a panel of 4 members showed up and the interview ended well. They gave me an opportunity to ask them at the end of the interview. Questions weren't hard but the frustration of waiting for 30 minutes is a marker of whether I will do well or not. The focus I had for this interview was worn out while waiting for the interview panel. My other observation during this encounter was that the interview panel wasn't well selected as it was not gender balanced. An entity that focuses on gender equality and empowerment should be cautious of gender considerations in every activity they do and I was expecting a gender balanced interview panel.", "Interview Questions": "They asked about my motivation to work for UN Women; they also asked about my team coordination experience, and asked finally about technically know-how on gender mainstreaming"}, {"date": "3 Sept 2022", "title": "Data Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UN Women", "Interview Descriptions": "Why interested in this position, what expectations do you have about this job, past experience in data visualization and reporting, introduce what an intern can do, and how many hours per week", "Interview Questions": "past experience in data visualization "}, {"date": "6 Jun 2022", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UN Women", "Interview Descriptions": "Very informative and friendly whilst also being suitably challenging and engaging. Warm approach with relevant and guided questions. Need to have substantial knowledge of the job and previous projects and need a large amount of experience.", "Interview Questions": "How would you maintain a work ethic for mundane tasks? "}, {"date": "13 Jul 2022", "title": "Programme Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UN Women in May 2022", "Interview Descriptions": "UN Women MCO Caribbean Interview for role of Programme Assistant\r\n\r\nIt was a competency based  interview with 5 questions\r\n\r\nThere was three interviewers on panel. Interview lasted about 20mins, and interview was recorded. Very easy and pleasant interview", "Interview Questions": "Questions they asked (roughly):\r\n\r\nQ1) Why do you want to work for UN Women Caribbean/ UN Women in general, and what you like most about the work we do. \r\n\r\nQ2) “In this role you would be expected to communicate with government officials, tell us what is important to consider and take into account when dealing and communicating with individuals like this, and how would you ensure effective communication. You can give an example of how you have done so in the past also if you wish”\r\n\r\nQ3) Tell us about a time where you dealt with conflict in a team\r\n\r\nQ4) Tell them about how to deal and what to consider when working in a diverse workplace .\r\n\r\nQ5) Tell us about the importance of programme monitoring for effective implementation."}, {"date": "20 Feb 2022", "title": "Advisor In Coordination Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UN Women", "Interview Descriptions": "The interview was face-to-face with four members of the national office team.\r\nDuration: 45 minutes\r\nThey had 5 questions prepared and they were asking in turns. In the end they gave me a space for me to ask.", "Interview Questions": "1.- Examples in which you have done 1) program management and 2) evaluation and your main achievements.\r\n\r\n2.- How would you manage to incorporate the gender perspective in the inter-agency strategic planning\r\n\r\n3.- How would you achieve the incorporation of the gender approach in the \"Gender Group\" in which several agencies participate\r\n\r\n4.- Have you ever been in the implementation of a project financed by the UN, your position and your achievements\r\n\r\n5.- Tell us about a time when you have been in charge of an intercultural team, any problem there was and how you solved it."}], [{"date": "6 Apr 2022", "title": "Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UN Women in Feb 2022", "Interview Descriptions": "I was invited for a written test in mid-February 2022 after applying online in mid January 2022. The war began in my country so they might review their program priorities. However, I haven't received any feedback since than.", "Interview Questions": "The written test included questions about challenges to gender equality, principles of meaningful women's participation in decision-making, importance of building civil society partnerships, etc."}, {"date": "23 Mar 2023", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UN Women (Manila, Manila) in Feb 2022", "Interview Descriptions": "First stage of the process is a written exam. The written exam is a mix of technical knowledge questions on gender and women's rights and on program management (specifically results-based management). You only have around 2 - 3 hours to complete as it is a timed exam. If you pass the written exam and are shortlisted, you will be interviewed by 3 - 4 panel members. They will also send you interview prep videos to give guidance on how to answer questions.", "Interview Questions": "Describe a situation when you had challenges implementing a program. What were the challenges and how did you respond?"}, {"date": "16 Dec 2021", "title": "National Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UN Women (Ciudad de Mexico) in Nov 2021", "Interview Descriptions": "Apliqué a la vacante a través del portal del PNUD, donde la encontré. Tuve que llenar la P11 (es la parte más tediosa) y enviarles unas muestras escritas relacionadas a mi experiencia previa con la consultoría a la que estaba aplicando. En los términos de referencia venía muy bien explicado qué querían en la aplicación y cómo sería el proceso de selección. Dos semanas más tarde, me contactaron por correo electrónico para invitarme a una entrevista. Fue por zoom, con un panel de 5 personas. Cada una me hizo una pregunta; duró a lo mucho 30 minutos. Diez días después de eso me enviaron otro correo para avisarme que había sido seleccionada.", "Interview Questions": "¿Por qué aplicaste a esta vacante? \n¿Piensas que el sector privado debe tener un rol más activo en el desarrollo de un país? ¿Por qué?\n¿Qué acciones pueden implementar las empresas para garantizar igualdad de género?"}, {"date": "12 Apr 2023", "title": "Communications Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 9 months. I interviewed at UN Women (Istanbul) in Nov 2021", "Interview Descriptions": "It was a managerial role. I was invited to the interview after passing the written test. The test was semi difficult and including questions such as: writing a press release regarding some campaign launch info they provided, creating a communications campaign, social media assets, advice to country office regarding media relations etc. The whole process took 9 months in total which was long.", "Interview Questions": "-Explain how did you represent vulnerable (refugee etc.) women's rights from a gender perspective? -How do you draft a communication material if you need to give gender perspective."}, {"date": "27 Oct 2021", "title": "Asistente Administrativo Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UN Women", "Interview Descriptions": "Tienes que llenar el famoso P11, si eres de las personas elegidas te contactan para hacer una prueba técnica y si pasas la prueba técnica te invitan a entrevista por competencias, dónde más que preguntarte sobre tu experiencia te preguntan sobre la manera en la que solucionaste problemas o alcanzaste resultados para tus antiguos proyectos.", "Interview Questions": "¿Cuál fue el reto más grande que has tenido en alguno de tus trabajos y cómo lo solucionaste?"}, {"date": "14 Apr 2023", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UN Women in Oct 2021", "Interview Descriptions": "competence-based questions with 3-4 people from different programmes, mostly programme managers and one programme assistant took around 35-40 minutes very kind people provided information on practicalities such as notice time, salary, office environment etc.", "Interview Questions": "can you tell me about yourself? can you describe a moment when you worked in a team and succeed? can you provide an example on your time management skills?"}, {"date": "20 Sept 2021", "title": "Operations Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UN Women", "Interview Descriptions": "They only sent a test which you have to complete within 90 minutes, which in my opinion are not really enough. Two weeks after the test, ther is still no answer from them.", "Interview Questions": "They ask questions related to job activites."}, {"date": "25 Oct 2021", "title": "Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UN Women (Ciudad de Mexico) in Sept 2021", "Interview Descriptions": "Esta posición fue para ONU Mujeres México. Apliqué online, y tuve una entrevista por zoom con un panel de 5 mujeres. Sentí que me fue muy bien en la entrevista y me dijeron que me contactarían de 3 a 5 días hábiles, pasó una semana y mandé un mail, no me contestaron, a la siguiente semana volví a mandar otro mail y tampoco me contestaron.\nMe parece terrible que una organización que trata de empoderar y darle voz a las mujeres, no tenga ni el detalle de seguir la comunicación prometida. \nMe quedé con un muy amargo sabor de boca.", "Interview Questions": "Por que quieres aplicar a este puesto\nCual es tu experiencia con investigacion sobre temas de mujeres."}, {"date": "23 Aug 2021", "title": "Policy Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UN Women", "Interview Descriptions": "Competency based interview. C (challenge) A(action) R(response) format. Three questions and trhee interviewers. Just one interview over internet. Pretty comprehensive questionnare on the online application. This were the principal comoponents of the process.", "Interview Questions": "Explain a challenging team work experience"}, {"date": "22 Aug 2021", "title": "Data Analyst Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 5 weeks. I interviewed at UN Women in Jul 2021", "Interview Descriptions": "I was shortlisted and contacted for a video interview. The interviewers were very flexible in scheduling an  interview date. They made the interview comfortable  and were easy to talk to", "Interview Questions": "What is your experience with NVIVO for qualitative analysis"}], [{"date": "14 Mar 2021", "title": "Social Media Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UN Women (Ḩawwārah, Amman Governorate)", "Interview Descriptions": "First a written test and then after passing it you had to take a 20 minutes competency based interview.  4 ladies interviewed me asking about my experience, i used the STAR approach to answer.", "Interview Questions": "1. describe a time when you managed a team "}, {"date": "2 Nov 2021", "title": "Programmer Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UN Women in Mar 2021", "Interview Descriptions": "The interview process usually takes approx. 3 months (depending on the HR capacity of the agency). \nTwo phases:\n1) Invitation to a written test - technical questions\n2) Invitation to a panel interview - competency based", "Interview Questions": "Q: Tell us about a time when you have taken an innovative approach at the office to solve an issue. \nQ: Tell us about the connection between gender stereotypes and gender inequalities."}, {"date": "7 Feb 2021", "title": "Programme Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at UN Women", "Interview Descriptions": "45 minute competency-based interview with 5 staff members after having passed a written exam.  First question is always about why you are best fit for position. Then interview goes into competency based questions that are generally mentioned in ToRs - conflict resolution, team-building, innovation, etc.", "Interview Questions": "First question is always about why you are best fit for position. Then interview goes into competency based questions that are generally mentioned in ToRs - conflict resolution, team-building, innovation, etc."}, {"date": "9 Jan 2021", "title": "Communications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UN Women", "Interview Descriptions": "Interview was competency based with a few questions on experience and skills. They had three persons in the panel plus a human resources person leading the process. The interview lasted for about 25 minutes.", "Interview Questions": "Why do you think you are the best candidate for this position? "}, {"date": "4 Feb 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UN Women in Jan 2021", "Interview Descriptions": "On the phone hire, quick and easy hire. I was in contact with them by e-mail first to inquire of coming internship opportunities, and they got back to me. A 15 min discussion on the phone and I was invited to join the team for 3 months.", "Interview Questions": "No questions asked, only informal chat. \n"}, {"date": "7 Dec 2020", "title": "Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UN Women", "Interview Descriptions": "technical test first then an oral interview that lasted for about 30 minutes. the questions were generic ones including: why are you interested in the internship, how are you gonna benefit the organization", "Interview Questions": "why are you interested in the internship"}, {"date": "13 Oct 2020", "title": "Communications Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UN Women", "Interview Descriptions": "Overall it was a pretty standard interview, make sure you do research the competencies of the job and prepare a lot of examples. I got very anxious and couldn’t remember examples.", "Interview Questions": "Tell me about one time you had to use creativity?"}, {"date": "1 Sept 2020", "title": "Project Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UN Women", "Interview Descriptions": "There were some technical questions and some general development questions. The feeling was that the interviewers were trying to get to know me and gauge whether I would be able to work with the team.", "Interview Questions": "What is your experience in promoting women and girls in STEM?"}, {"date": "2 Sept 2020", "title": "Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UN Women in Aug 2020", "Interview Descriptions": "I applied for the role and a few days later received an email asking me to take a written test. After I submitted the written test, I received another email saying I'd passed and was invited to schedule an online interview. The interview went well and I was told I'd hear back by the end of the week. I did not receive any update. A few days after I was supposed to hear back, I reached out to the woman who scheduled the interview and had emailed me throughout the process. I asked if another candidate had been selected or the process was still underway. I mentioned I had a few project requests from other clients and I was hesitant to accept them because I would want to devote my time to the UN. She never responded. Two weeks later I called and left a message and kindly requested she either call or email me so I knew what direction to take with my career. No response. I also emailed the project manager who interviewed me with the same question and did not receive a response. Overall, this ghosting was incredibly disheartening. I spent hours on the written project because this is the UN!!! I was over-the-moon excited about the opportunity and wanted to submit my very best. I cleared my entire weekend and spent hours doing practice interviews with friends. To go this far and never receive a response feels unprofessional and disrespectful of my time. Especially because I was clear I had incoming work I was willing to put on hold. I just needed to know! UN Women is about empowering and uplifting women. This process felt very un-empowering and devaluing.", "Interview Questions": "Basic questions about my experience. "}, {"date": "7 Nov 2021", "title": "project assisstant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UN Women in Apr 2020", "Interview Descriptions": "It was an online interview, following the written test, and conducted on Skype. There were four panelists, Head of Office, Project Manager, representative of the HR and additional Project Officer from other UN agency. It was a bit strange to look on the black screen since all of the panelists turned their camera off while I was presenting.", "Interview Questions": "Why have you applied for this post and what makes you the best candidate for the position? \n\nGive us an example of when you have experienced a setback, a problem? Describe what\nhappened, and what did you do?\n\nTell me about a time when you made the wrong decision when solving a major problem.\nWhat will you do differently next time?"}], [{"date": "12 Mar 2020", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UN Women (Port Moresby)", "Interview Descriptions": "Interview was scheduled to be done in person but then the panel decided in the last minute to conduct it by telephone.  Took 30 minutes only with 5 questions asked mainly on competency based.", "Interview Questions": "Give an example of an initiative that you undertook?"}, {"date": "11 Feb 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at UN Women", "Interview Descriptions": "Was contacted through email after several months of completing my online application (CV and cover letter on the UN platform). Phone interview of approximately 45 minutes with 3 members of the team.", "Interview Questions": "Why UN Women and that position? What is your interest in gender issues and what background do you have?\r\nThey asked me questions in English, French and Spanish"}, {"date": "9 May 2022", "title": "Programme Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UN Women (Sudan) in Jan 2020", "Interview Descriptions": "It was good experience and was picked for the position. it is important to ensure that the preparations are thorough and that one is ready to attend the interview. I always make sure that i have something already written so that i cut on time.", "Interview Questions": "Tell us about yourself and why you think you are suited for the job."}, {"date": "12 Dec 2019", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at UN Women (Ankara)", "Interview Descriptions": "The whole process took about one month. I applied online and they offered an internship invitation 15 days later.  It was a 15 minutes Skype interview and there were 4 people in the interview. 2 weeks later, they sent an approval e-mail.", "Interview Questions": "Are you able to use Photoshop, Indesign and other Adobe tools?"}, {"date": "11 Jan 2020", "title": "Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at UN Women (Ankara) in Dec 2019", "Interview Descriptions": "I got interviewed after having applied online and waited for about 6 months. It was a Skype call, with two interviewers who did not sound very passionate about the interview throughout the whole process.", "Interview Questions": "- Tell me about yourself.\r\n- What are your strengths and weaknesses? List 3 for each.\r\n- Why are you a good fit?\r\n"}, {"date": "13 Aug 2020", "title": "Monitoring and Evaluation Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at UN Women in Sept 2019", "Interview Descriptions": "A written test was sent over email on monitoring and evaluation, which included the development of evaluation criteria/questions and an example of methodology development. The panel interview included a competency-based interview.", "Interview Questions": "Involving different stakeholders in evaluations, dealing with budget shortages"}, {"date": "14 Aug 2021", "title": "Consultancy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UN Women (Belgrade, MT) in Jul 2019", "Interview Descriptions": "First, they ask for a CV and reference check and later we did an online interview and that was it. They just explain what type of analysis they want and I agree to do this job.", "Interview Questions": "Just a list of questions regarding my previous experionce."}, {"date": "8 Jan 2020", "title": "Programmer, Humanitarian Action and Crisis Response Office, UN Women Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at UN Women (Geneva) in May 2019", "Interview Descriptions": "The interview was supposed to be for 25-30 minutes but went on for almost 45. The interviewer was very nice, made me very comfortable and laid out the agenda before we began.", "Interview Questions": "Q: Regarding awareness of humanitarian work done in general."}, {"date": "31 Mar 2019", "title": "Reporting Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UN Women", "Interview Descriptions": "Written test and Skype Interview with a panel consisting of 4 - 5 members.  The whole process from application to Interview and eventual offer was long. The first step was to complete a written test online.", "Interview Questions": "Focus on technical questions using a competency based interview structure. Some questions were were detailed and require to given concrete examples from previous work experiences. Time for questions after the interview. 4-5 persons on the interview panel. In total 4 to 5 questions were asked."}, {"date": "28 Feb 2022", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at UN Women (Hanoi) in Apr 2019", "Interview Descriptions": "2 tests on technical skills and English ( for UNWOMEN office based in Vietnam)\r\nThe examiner was nice and give detailed instructions. The future supervisor was also there to search for potential candidates.", "Interview Questions": "Introduce your self; Analyse the report"}], [{"date": "5 Aug 2020", "title": "Program Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UN Women in Apr 2019", "Interview Descriptions": "The process was quick and very easy. I was asked four questions by two interviewers, very rote (in fact one of them left the room during the interview). These two were my immediate supervisors. I was contacted about a month and a half after I applied online, and heard back about the position a week later.", "Interview Questions": "What are your motivations for this position?\n\nHow do you work in a team?"}, {"date": "5 Mar 2019", "title": "Budget Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UN Women", "Interview Descriptions": "I applied online and got interview four month later. It was a phone interview and I met two manager from the department. They were very nice. The interview started with going through my resume.", "Interview Questions": "Do you have any financial report experience?"}, {"date": "16 Mar 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UN Women (New York, NY) in Mar 2019", "Interview Descriptions": "Submitted application online and was asked to interview via teleconference within 2 weeks. The interview took no more than 20 minutes, interviewers were very friendly and asked a few standard behavioral questions. Got an offer within a week. Pretty efficient!", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "5 Apr 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UN Women in Jan 2019", "Interview Descriptions": "Short interview to the point. Phone interview of five question. It was an average interview to check your interest in the position, your skills for that, what you could offer the organization and why you would like to do that.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "24 Dec 2018", "title": "Social Media Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at UN Women", "Interview Descriptions": "I had two different interviews: one was more related to my personality and the other to my skills and previous work experience. They were both conducted through Skype and lasted about half an hour.", "Interview Questions": "How would you increase journalists attendance at an event?"}, {"date": "16 Jun 2019", "title": "Programmer Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UN Women (Mukono, Mukono) in Dec 2018", "Interview Descriptions": "I first applied on line, then i got got shortlisted and invited for a written test interview after which i got an invitation for an oral interview to face the panel.", "Interview Questions": "Tell us about yourself"}, {"date": "23 Oct 2018", "title": ", Migration Unit Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UN Women (New York, NY)", "Interview Descriptions": "Online application process; invitation for phone interview 5 weeks later; confirmation 3 weeks later. 2/3 competency based (classic UN), 1/3 policy/content;  actual hiring was pushed back by one month due to internal UN sluggishness.", "Interview Questions": "Competencies included questions on team work, conflict management, deadlines, project management;"}, {"date": "26 Jul 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at UN Women (New York, NY)", "Interview Descriptions": "Applied online and received an email for a phone interview. The interview took no more than 20 minutes, 3-4 skills review focused questions. The process was very straightforward. Received the result the next day.", "Interview Questions": "Tell me about a time when you had to deal with conflict; how did you handle it and what did you learn."}, {"date": "5 Oct 2018", "title": "Resource Mobilization Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at UN Women in Jul 2018", "Interview Descriptions": "Quick, nice. 1 interview on WhatsApp call and they made the offer 4 days later. The panel included the whole team, 2 analysts, 1 manager and 2 interns. They were nice but serious. They asked me to introduce myself and then they asked \"competency-based\" questions, asking me to explain how I have dealt with a situation in the past.", "Interview Questions": "Give me an example of a time when you had several major assignments or projects going at one time. How did you allocate your and your time?"}, {"date": "3 Jul 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UN Women (Cairo, Cairo Governorate)", "Interview Descriptions": "It was somehow short, via skype. Was easier than I thought.  Interviewer seemed already impressed with my application. We were 3 selected so I believe this made it somehow easier.", "Interview Questions": "Your background, experience"}], [{"date": "13 Jun 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UN Women", "Interview Descriptions": "I applied online. The process took 2 months. I interviewed at UN Women for an internship position. I went through 2 rounds of interviews and I submitted two writing samples.", "Interview Questions": "How would you handle the situation if multiple managers asked you to do different tasks at the same time?  "}, {"date": "5 Jun 2018", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UN Women (Tokyo)", "Interview Descriptions": "A Skype interview for a 6 months internship. The interview is conducted in both English and Japanese, with a confirmation of the working conditions, 4 basic questions and  \"do you have any questions for us?\". Interviewers are rather friendly and asked for more details when they have difficulties on the answer.", "Interview Questions": "self introduction"}, {"date": "24 Oct 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UN Women (New York, NY) in Jun 2018", "Interview Descriptions": "The phone interview took about 20 minutes. Very straight-forward. There were 4 questions; 2 about my experience and interest, and 2 about my skills/personality.  Received offer in two weeks.", "Interview Questions": "Tell me about a time when you had to deal with a conflict. What was your role, and what did you learn. "}, {"date": "8 Mar 2019", "title": "Budget Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UN Women in May 2018", "Interview Descriptions": "I have applied online. The process took 2 months. I was interviewed through Skype. Interviewers are nice, usually at least one of them will be your supervisor. I got a response within 3 days.", "Interview Questions": "Most questions are based on experience on the resume. Interviewers are willing to answer questions. I got the offer within a week after the interview. "}, {"date": "11 Apr 2018", "title": "Program Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UN Women", "Interview Descriptions": "Applied online, then was contacted for a skype interview. It was with three staff members of the regional office. Skype interview lasted about 30 minutes and at the end they requested I send writing and editing samples.", "Interview Questions": "How would you handle the situation if multiple managers asked you to do different tasks at the same time? "}, {"date": "15 Mar 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UN Women", "Interview Descriptions": "I came through an informal route. It was relatively easy in that I spoke directly with my future team, however I know that may not be the most common experience.", "Interview Questions": "What previous work have you done with women's rights?"}, {"date": "14 Feb 2018", "title": "International Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at UN Women", "Interview Descriptions": "I applied on November and was contaced one month later to make a test assessment. The test wasn't very complicated (but neither eassy). After that, they took more than 3 weeks to answer to tell me that I passed the test and I had an interview. The interview was via skype with 2 experts, it took more than 45 minutes. They made a lot of questions related to my experience and knowledge about the issue. They were very nice and they answered all my questions. However, they told me that I would know something 1 week later and it was a month ago but still don't know anything.", "Interview Questions": "Several questions about your experience and kwnoledge, competency based interview, you can check their webpage to know a bit more about the interviews."}, {"date": "18 Feb 2020", "title": "Programmer Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UN Women (Beijing, Beijing) in Feb 2018", "Interview Descriptions": "It was an interview through Skype with 3 interviewers including one office directer, one HR and one program manager. Questions are quite normal and basic including your motivation, strength and weakness, what can you contribute.", "Interview Questions": "Tell us three major gender issues in your country."}, {"date": "15 Oct 2019", "title": "Youth Task Force Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UN Women (Cairo, Cairo Governorate) in Nov 2017", "Interview Descriptions": "The interview process took four weeks. I applied online then received an email stating I got shortlisted for the position. I had enough time to decide on my interview schedule. The first stage happened online through a Skype call. It was smooth, competency-based and straight forward.", "Interview Questions": "Why do you think should women be involved in peace-making processes? "}, {"date": "1 Dec 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at UN Women (New York, NY) in May 2017", "Interview Descriptions": "Submitted my CV initially and was contacted for an interview. Also provided two letters of recommendation and a couple documents for HR. Interview was more conversational and discussed interest in UN Women's mandate.", "Interview Questions": "How has gender equality come up in your academic and/or work experience?"}], [{"date": "7 Nov 2017", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at UN Women (Istanbul) in Apr 2017", "Interview Descriptions": "nothing different from what they have in their career websites. candidates should have a look at the sample questions and get prepared for the interview. it was a competency based interview and there was a panel of 5 people asking 2 questions each and it took roughly 45 minutes", "Interview Questions": "Tell about a stressful situation in your previous job? How did you handle it?"}, {"date": "13 Jan 2017", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at UN Women (New York, NY) in Oct 2016", "Interview Descriptions": "I got the interview from a internal referral. The interview was easy, casual and friendly, asked general questions. Be confident about what you did before and know what you expect from them.", "Interview Questions": "What do you expect from UN Women?"}, {"date": "9 Apr 2017", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at UN Women (New York, NY) in Oct 2016", "Interview Descriptions": "I got the interview from a referral, the process took more than one month. On site interview with one finance specialist and one associate. They were all professional and friendly.", "Interview Questions": "Why UN Women."}, {"date": "18 Aug 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UN Women", "Interview Descriptions": "It was a phone interview. It was quite brief - not more than 20 minutes. Very cordial and relaxed. Questions ranged from personality related ones to those more specific to the organization; what do they do? why is the work important? and so on. \r\nI heard back within a week and accepted the offer!", "Interview Questions": "What kind of work is carried out at UN Women?"}, {"date": "28 Jul 2016", "title": "Human Resources Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UN Women (New York, NY)", "Interview Descriptions": "interview types vary by contract type; if any of the candidates or panelists are in different duty stations, then the interview is online (skype)\r\nsince there are many applicants and the recruitment is manual, only some get invited for test and the top scorers get invited for interview; not all posts have technical test\r\nstaff interviews are by panle and are structured as competency-based with questions based on job description and you need to provide examples of how you have done the work in the past\r\nfor interns and consultants, the interview is lighter version and may vary by unit or hiring manager", "Interview Questions": "What is your motivation / knowledge of the agency's mandate\r\nGive us an example of how you have done xyz in the past\r\nProvide an example of how you have managed conflict / under-performance in the past\r\nDo you have any questions for us"}, {"date": "27 Jul 2016", "title": "JPO Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UN Women", "Interview Descriptions": "Unusual and not well structured: the interview process was not set and they did not know whether a written test was foreseen or not. It was more of a get-to-know-each other interview; they just knew that the only a batch of selected candidates within the first shortlist were going to arrive to a second stage.  They said they were going to let us know about the first interview result and they did not. Therefore I had to wait for the final communication at the end of the whole process to acknowledge that I did not get the job.", "Interview Questions": "An example of a situation where I had to work in a team, which role I had, what were the problems and the consequent solutions I adopted."}, {"date": "11 Jan 2017", "title": "Inter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UN Women (New York, NY) in Jul 2016", "Interview Descriptions": "Two interviewers, lasts for about 30 minutes. Most questions are based on experience on resume. Interviewers are nice, usually at least one of them will be your supervisor. Interviewers are willing to answer questions. I got the offer within a week after the interview. Pretty efficient I would say, though I have waited for about a month before I got the interview notice.", "Interview Questions": "According to your resume, you did.... What did you do in detail?"}, {"date": "14 Jan 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UN Women in Jul 2016", "Interview Descriptions": "Applied online and was called for an interview in 2-3 weeks. Interview was fairly standard - it was crucial that I was well-prepared to answer questions about the organization and the unit that I was being interviewed for. I was also asked to submit a writing sample following the interview. The process went by smoothly and fairly quickly.", "Interview Questions": "Why do you think you are a good fit for this position?"}, {"date": "17 Aug 2016", "title": "Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UN Women (London, England) in Jul 2016", "Interview Descriptions": "Email confirmation of my application soon after submission. E-mail request for interview. Very brief interview. Explanation about role, constraints, objectives, expected start date, expected travel. A few questions about some issues concerned with the post. Questions about partnership. Discussion about suitability for post and what can contribute. Advised of expected date for decision. Decision communicated after expected date.", "Interview Questions": "N/A"}, {"date": "11 Jun 2019", "title": "Volunteer - Accounting Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at UN Women (Singapore) in Jun 2016", "Interview Descriptions": "Upon sending my resume i was asked for a meeting 1:1. The manager was extremely nice and took me through the JD, inquired about my experience and ability to perform the given tasks.\r\nShe also informed me about the training that would be made available.", "Interview Questions": "The asked me about my former experience and commitment period "}], [{"date": "17 Jun 2016", "title": "Project Leader Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 5 months. I interviewed at UN Women (Bonn) in May 2016", "Interview Descriptions": "My counterpart gaves me a confused impression. It was not possible for me to find out what they exact want for this position. The interview was not on a functional level, only on my side.", "Interview Questions": "No typical interview question - very confuse \"interview\""}, {"date": "22 Apr 2016", "title": "Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UN Women (New York, NY)", "Interview Descriptions": "About two weeks after applying online, I was emailed by a staff member on the team with a fairly terse email letting me know I had been selected to interview. I arranged a phone interview several days later. The interviewer seemed quite bored and spent the first five minutes of our call talking about how selective the process had been this year (basically implying that I was lucky to have gotten an interview). She said she would let me know if I was selected within two weeks. I followed up shortly after the interview with some documents the interviewer had requested and a thank you. After two weeks had passed, I sent a quick polite follow up and never got a response. For an organization that is committed to women, it certainly doesn't seem committed to potential female employees.", "Interview Questions": "What interests you about working with UNWomen?"}, {"date": "13 Sept 2020", "title": "Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UN Women (Tbilisi) in Feb 2016", "Interview Descriptions": "The NGO is not interested in hiring foreigners living in Georgia and especially those who do not speak Georgian language, It took me 3 months and several phone calls and e-mails to receive an answer. They didn't even bother to answer e-mails.", "Interview Questions": "Why are you interested in UN Women?"}, {"date": "11 Jun 2018", "title": "Civil Society Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UN Women (New York, NY) in Sept 2015", "Interview Descriptions": "Pretty easy. Phone call that led to internship. Nothing outside of my resume was discussed. Pretty much wanted to know about my background and why I wanted to intern with UN Women. Some description of the position was provided.", "Interview Questions": "Why do you want to intern with UN Women?"}, {"date": "24 Nov 2015", "title": "Events and Fundraising Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UN Women (Singapore) in Jul 2015", "Interview Descriptions": "Phone interviews, one with the hiring manager and one with the general manager. Friendly conversations, mostly about my work experience, why I wanted to work for the UN, what I did in my previous job, what qualities can I bring to UN Women. It was generally a good experience and they got back to me fairly quickly. Everything was done over the phone as I was in another country, but Google Hangouts and Whatsapp calling made it free.", "Interview Questions": "Can you tell me more about your work at (so and so company)?"}, {"date": "20 Dec 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at UN Women (New York, NY) in Apr 2015", "Interview Descriptions": "I applied through a referral, and scheduled an interview 2-3 weeks later. The interview was disorganized and terrible: My interviewer forgot he scheduled the interview and kept me waiting at reception for over an hour. When he finally met me, the meeting lasted about 20-30m, and he assigned me work on the spot. During the interview, he also promised to fundraise to assist with my expenses (UN internships are unpaid)—not only did he not do this, he also later accused me of lying about this conversation when I asked him about it a month later. The haphazardness of the interview was the first warning sign about the job itself.", "Interview Questions": "Basic questions about my resume and my interest in women's rights. "}, {"date": "4 Jun 2014", "title": "Communication and Informations Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UN Women (New Delhi) in Feb 2014", "Interview Descriptions": "Skype call with the communications officer and HR. It was quick and smooth. Both the HR and the department were very prompt with their responses. They made me feel comfortable during the interview process. after joining, the environment and learning process has been very fruitful.", "Interview Questions": "1. What drives you to work for women's rights?\r\n2. How do you plan to contribute to this internship?\r\n3. We are looking for a proactive participation, examples."}, {"date": "8 Sept 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UN Women (New York, NY) in Sept 2013", "Interview Descriptions": "I heard that at UN Women, once you've been called for an interview you've basically got the internship. For me this was definitely true. I met two people from the Arab States team for coffee to talk a little about the internship, they didn't ask me any grilling questions, and after about 15-20 minutes said they'd like to have me on board and took me up to meet the head of the team. So basically the application has to convince them that a candidate is qualified, and the interview is to make sure s/he's a good personal fit. \r\n\r\nAlso, I didn't even apply for an internship with the Arab States team; my application was to the Africa team. They had already chosen someone but liked my application, so they sent it over to the Arab States team because they saw I had done a school project on Palestine. So in some ways the interview was about asking if I would be interested in working for their team instead. I was contacted for an interview about 2 months after sending in my application.", "Interview Questions": "Are you familiar with the structure of UN Women? Let us tell you more about it."}, {"date": "14 Sept 2017", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at UN Women (Panamá) in Jun 2013", "Interview Descriptions": "Very easy interview. It was mainly general questions about my academic background, my knowledge about gender issues (very general). They were interested in my views over gender issues and my expectations on the position.", "Interview Questions": "In your opinion, why gender issues matter?"}, {"date": "8 Mar 2014", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UN Women (New York, NY) in Sept 2012", "Interview Descriptions": "Flawed. Took two years of applying to get interview", "Interview Questions": "None. It wsa general interview"}]]