[[{"date": "22 May 2022", "title": "Asst. director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Knox College", "Interview Descriptions": "Interviews are done by teams at the college.  Using by people in the department and a manager. Initial interviews are by zoom with follow-up in person interviews and then a review of your references.", "Interview Questions": "What is something in your professional career that you are proud of."}, {"date": "2 Apr 2022", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Knox College", "Interview Descriptions": "A process that requires experience in mathematics and professionalism. Having a good understanding of mathematics as well as the capability of tutoring several individuals. There will be tutoring education courses and it is required to learn how to help students succeed in the courses they are taking.  A success guide should also be made or a course work related guide that will benefit the students.", "Interview Questions": "They don't ask questions as such but is a course that needs to be taken."}, {"date": "22 Mar 2022", "title": "English Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Knox College in Jun 2021", "Interview Descriptions": "Reasons for applying, how your teaching style is. There is an advanced teaching writing class that has to be taken. This class requires a lot of writing and can be difficult. Once receiving an a, you can become eligible to apply to be a writing tutor.", "Interview Questions": "Why do you want to apply. "}, {"date": "8 May 2019", "title": "Assistant Director of Admissions Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Knox College (Galesburg, IL) in Jan 2019", "Interview Descriptions": "Great campus with friendly individuals that care for Knox and their young minds. I enjoyed lunch with the staff and felt the home feeling that they promote. Also learning more of their historic background was quite interesting.", "Interview Questions": "What do you feel is great about our campus tour? "}, {"date": "10 May 2018", "title": "TeleAmbassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Knox College", "Interview Descriptions": "The interview process was not too difficult. The interviewer asked general questions about life at the college involving majors/minors, volunteering, and any outside activities such as clubs. You only have to be on campus for one term to apply.", "Interview Questions": "What is there to do within the community?"}, {"date": "1 Dec 2017", "title": "Help Desk Support Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Knox College (Galesburg, IL) in Feb 2016", "Interview Descriptions": "I had to sent an application online then do an in person interview. The interview was about 15 minutes and there were 2 people alternated asking me questions. They did a mock Help Desk phone call with a hard problem and asked me what would I do in this situation", "Interview Questions": "They asked me to solve some basic computer problems"}, {"date": "19 Mar 2015", "title": "Admission Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Knox College (Galesburg, IL)", "Interview Descriptions": "I had a brief phone interview with two members of the hiring committee followed by a half-day on-site interview, which consisted of a 10-minute presentation on Knox, a meeting with the Dean of Admission, a meeting with the admission counseling staff, a meeting with the Office of Financial Aid, and lunch at a local restaurant.", "Interview Questions": "How does this job fit into your future goals? What makes you qualified for this position?"}, {"date": "27 Jan 2014", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Knox College", "Interview Descriptions": "Phone interview, two-day campus interview with teaching demo and research talk to faculty and students, met with dean, lunch with students, tour of campus, lunch and dinner with the search committee, interview with committee, tour of campus, friendly environment, great experience, tour of library, meeting with human resources, lots of interactions but all laid back.", "Interview Questions": "Nothing difficult. A lot of questions about diversity."}, {"date": "19 May 2015", "title": "Lab Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Knox College in May 2012", "Interview Descriptions": "There was no interview since the position is filled by graduating students. Other interviews, have consisted of day long meetings with the dean and faculty. Interviewers are expected to give a presentation where students and faculty can attend.", "Interview Questions": "How expensive is your project?"}, {"date": "30 Mar 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Knox College (Galesburg, IL) in Apr 2010", "Interview Descriptions": "Went there for an onsite interview. Met with and interviewed by members of the department and key administrative staff (dean of students, dean of academic affairs).", "Interview Questions": "What is the most challenging student issue you have dealt with and how?"}]]