[[{"date": "18 May 2023", "title": "Fundraising Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (New Delhi) in Apr 2023", "Interview Descriptions": "The interview process was good. It was taken in a nice environment. Taken by three faculties. Good questions were asked. Conceptual interview. 1 hour long. 2 days time given for result.+", "Interview Questions": "How can we protect nature?"}, {"date": "1 Mar 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Wildlife Fund", "Interview Descriptions": "30-minute interview questions regarding interest in the position and why I would be a good candidate. First they asked to know a bit more about myself and interests, followed by a set of icebreakers and questions regarding the position.", "Interview Questions": "What I bring to the position"}, {"date": "13 Feb 2023", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at World Wildlife Fund (Singapore)", "Interview Descriptions": "The interview was conducted by the HR and the line manager. Both are friendly and nice during the whole process. So firstly it was self introduction, then the interviewers asked more details about the resume, after that came to the QA session. But seems they prefer a candidate that can work full-time for at least six months and whose first language is English.", "Interview Questions": "Which animal best represents your personality?"}, {"date": "2 Feb 2023", "title": "Sustainability Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund", "Interview Descriptions": "Took a while but the interview was enjoyable. Informal chat followed by preprepared questions. There was also a task to prepare for. There was a tour of the facility followed by a chat with HR.", "Interview Questions": "what challenges have you overcome"}, {"date": "16 Jan 2023", "title": "Projektmanager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at World Wildlife Fund (Berlin)", "Interview Descriptions": "Sehr anspruchsvolle Aufgabe als Grundlage des Gespräches, unfreundliches Verhältnis, kein Feedback nach der Ablehnung. Für die Zeit, die ich in der Aufgabe investieren musste, fand ich das Verhältnis nicht fair.", "Interview Questions": "Herausfordernde inhaltliche Fragen über das Thema"}, {"date": "25 Mar 2023", "title": "Assistant Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (Harare) in Jan 2023", "Interview Descriptions": "The interview process for this Assistant Accountant Role was a 30-minute interview process with a panel of about five people drawn from various departments with WWF. the meeting was a bit disorganised they wanted to change my time at the last minute", "Interview Questions": "1. Why did you apply for this role and how does it fit with your career goals? 2. Name and explain 3 Principles of accounting."}, {"date": "8 Jan 2023", "title": "Stage Marketing Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (Rome) in Dec 2022", "Interview Descriptions": "Responsabile selezione davvero disponibile, colloquio amichevole e sereno, è stato davvero un piacere conoscerle. Mi hanno spiegato nel dettaglio la posizione, e si sono rese disponibili per eventuali chiarimenti. Molto tempestiva la responsabile nelle risposte, grande educazione.", "Interview Questions": "Quale sarebbe il tuo contributo per il WWF Raccontaci chi sei Se avessi domande"}, {"date": "16 Nov 2022", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "There was first a written assignment, online mode. Based on that you will be short listed for three rounds of interview. All conducted online and about ten to fifteen minutes", "Interview Questions": "Introduction and background to yourself"}, {"date": "14 Jan 2023", "title": "Supporter Experience Manager (UK) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Wildlife Fund (Woking, England) in Nov 2022", "Interview Descriptions": "Applied online, 3 weeks later I got an invitation to their Woking office (no recruiter/HR called before that). I was offered a few time slots to choose from, all on the same day. There was a task in the email: make a presentation about the ideal future strategy of supporter experience and how to have a strong voice within WWF. I did the presentation in person for a panel of 3 managers/dept.heads (no HR), in a relaxed atmosphere, although it felt they were not very experienced interviewers (read all questions word by word from a paper). They seemingly liked my ideas and recommendations, took a lot of notes and then they moved to competency-based questions, but many of those could not really be expected from what was included in the job description. After almost 2 hours I was let go and I have never heard from them again (this was 2 months ago). Their only email came from a no-reply address, so I could not even follow-up. I think it is very unprofessional to ghost candidates who prepared for their presentations for days, took a day off work and travelled to the WWF office.", "Interview Questions": "Tell me about a time when you had to solve a problem by using science."}, {"date": "10 Oct 2022", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (Hong Kong)", "Interview Descriptions": "It is a group interview. First, you will have self-intro session. The interviewee will ask you some questions. For example, what do you know about WWF, your expectations, etc.  In the end, you will have around 45 mins written test.", "Interview Questions": "translation tasks. \r\nself-intro\r\nwhat do you know about wwf\r\nprevious experience   "}], [{"date": "27 Dec 2022", "title": "Programmer Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund in Oct 2022", "Interview Descriptions": "The hiring process was going to be a two stage interview process and this was made clear at the start of the first interview (following successful shortlisting via applications). The first interview went reasonable well with the panel attentive and friendly. I the received an email to say I had not been successful at this stage. This was then followed by an email later on the week that I was invited to a second stage interview. I clarified this with the recruitment team and then arranged a time for the 2nd interview. My task was to prepare a presentation for the panel. The panel at the second stage were uninterested and generally the experience was cold compared to the panel at the first stage. I did not hear anything following the interview. After a couple of weeks I chased up with the recruitment team- and I got no response. After over a month I finally received an automated message to inform me that I had been unsuccessful and not shortlisted for the next stage. I was not aware of a third stage! I was really disappointed that after the time devoted to preparing for the interviews and task I was completely blanked and not given an opportunity to even ask for feedback. Very negative experience and I will not be applying to future roles at WWF due to this.", "Interview Questions": "Experience of managing stakeholders and projects"}, {"date": "31 Aug 2022", "title": "Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Wildlife Fund", "Interview Descriptions": "I applied online. I was contacted by a recruiter for a phone screening two days after submitting the online application. I participated in a phone screen with a recruiter and three panel interviews with the hiring manager and several members of relevant teams during the following six weeks. I received a call notifying me that I was not selected three weeks after the final interview. The entire process took about two months. \n\nI enjoyed the interviews very much. Every single person who participated was genuinely interested in getting to know me and seemed like wonderful colleagues.", "Interview Questions": "-Why do you want to work for WWF\n-Why do you want this job/how does your experience fit with this job\n-How do you manage tight deadlines\n-How do you balance perfection with the need to get things done\n-Discuss how you dealt with a disagreement in the workplace"}, {"date": "20 Aug 2022", "title": "Graduate IT Role Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund", "Interview Descriptions": "Great interview process -  shared about work experience in resume and elaborated on the experience. Had follow-up questions on the work experience. There were behavioural questions asked too.  Overall, the interview process was manageable as long as you had the work experience lined up and could elaborate well.", "Interview Questions": "Some questions asked were related to my work experience. Some other questions were more on the behavioural side - eg. \"If you had to face this issue, what would you do?\""}, {"date": "15 Aug 2022", "title": "Artists and Influencers Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "Disorganised planning of interview with broken systems. No one responding when I asked for help or clarification. Interviewer seemed disinterested and like she was barely listening to my responses. The questions were basic and it seemed like they wanted to cut it short from the minute I hopped on the video call. No feedback was given.", "Interview Questions": "Why do you want to work for WWF?"}, {"date": "26 Jul 2022", "title": "Finance and Procurement Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund", "Interview Descriptions": "Very long interviews, but I can't say that they were useless. I liked the meeting with the stuff during the interview process, which can give one an opportunity to meet the people you'll be working with.", "Interview Questions": "First it was a test, and then the interview with CEO"}, {"date": "19 Jul 2022", "title": "Sales Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "very good interview really liked the staff i dont know why i i have to write bullshit to read reviews on your website, really stupid , plus this stupid word limit", "Interview Questions": "why do you have this stupid policy to write before reading? "}, {"date": "10 Aug 2022", "title": "Analista Administrativo Jr Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (Brasília, Federal District) in Jul 2022", "Interview Descriptions": "Candidatura online, por meio de preenchimento do currículo, realização de teste de perfil e questionário específico para a vaga. Além disso, envio de três vídeos respondendo a três perguntas: Motivação para trabalhar no WWF, experiência administrativa e descrição de situação em experiência anterior.", "Interview Questions": "Motivação para trabalhar no WWF, experiência administrativa e descrição de situação em experiência anterior."}, {"date": "8 Jun 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at World Wildlife Fund (Manila, Manila)", "Interview Descriptions": "Was given an initial interview 10 days after I emailed them. The interview itself was laid back and very conversational. The 2 panelists were really friendly and took the time to get to know me better. I received an offer letter the day after.", "Interview Questions": "What is your best project or work?"}, {"date": "30 May 2022", "title": "Partnerships Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "Interview process was too impersonal, maybe being online deterred the human element and personality from showing. Thus, couldn't feel connection with the interview panel, which made me feel the job will be too cold and I might not enjoy going to it everyday.", "Interview Questions": "Hypothetical scenarios and technical questions"}, {"date": "27 Jul 2022", "title": "Outreach Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (New Delhi) in Jun 2022", "Interview Descriptions": "3 rounds with manager giving final command and hr with salary negotiation.\r\nManager will give the verdict if good or bad. The interview is very easy please relax and give calmly.", "Interview Questions": "Q. Salary is so low in this role why do u want to join?\r\n"}], [{"date": "1 Aug 2022", "title": "Environmental social safeguards intern  Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Wildlife Fund (Raleigh, NC) in May 2022", "Interview Descriptions": "The interview process went well. I was asked basic questions like how I got to know about the organization, I was asked to speak about myself and about my understanding of the role. I was also asked about my career plan after the internship. ", "Interview Questions": "Kindly Tell us about yourself "}, {"date": "13 Apr 2022", "title": "Programme Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "Very open and conversational. I enjoyed and it was a two-way process.The panelists were friendly and had done a good job of receiving my CV. Very open and conversational. I enjoyed and it was a two-way process.", "Interview Questions": "Why do you think you are fit for this position? "}, {"date": "4 Mar 2022", "title": "Senior Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "It was easy and very relevant to the position. It was a conducted by a panel of 3 who asked questions con currently. Interviewers we’re pleasant and very knowledgeable of the field.  It involved two interviews and a written evaluation . How ever the interview process was far spread and took up to five months before the organization got back to me.", "Interview Questions": "How does your experience make you relevant to this position?"}, {"date": "4 May 2022", "title": "Manager, Private Sector Engagement Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (San Francisco, CA) in Mar 2022", "Interview Descriptions": "I had a total of 4 interviews with 7 people: A brief screening interview, a 1:1 interview with the PSE Director, and 2 panel interviews (one with 3 people and one with 2).  I followed up with each interviewer with a personalized note after each interview and did not receive a single response. They did not inform me that I was not selected for the position; I had to follow up with them to get that information.", "Interview Questions": "Give an example of how you've handled difficult clients. "}, {"date": "2 Feb 2022", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "Submission of CV and motivational letter. A few weeks later I received a phone call notifying me that I have been selected for an interview for the following day. The interview was with company with which I applied to be placed.", "Interview Questions": "Why are you interested in this role?"}, {"date": "18 Nov 2022", "title": "Social Media Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (Woking, England) in Feb 2022", "Interview Descriptions": "Applied via the WWF website on their online job application form and made it through to the first interview. The interview was held over Zoom with two members of the team.", "Interview Questions": "How would I extent WWF's reach on Tik Tok."}, {"date": "16 Mar 2022", "title": "Associate Specialist, Integrated Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at World Wildlife Fund (Washington, DC) in Feb 2022", "Interview Descriptions": "I applied through the company website. It took them 2-3 weeks to schedule an interview. The interviewer was super cold and very straightforward. I followed up with her to express my enthusiasm. She ghosted me even after I sent a second follow-up.", "Interview Questions": "Tell me about yourself. Salary expectations. Work authorization etc etc."}, {"date": "29 Jan 2022", "title": "Advogada Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Wildlife Fund", "Interview Descriptions": "Pessoas cordiais e entrevista bem conduzida.\r\nEntrevista começou no horário.\r\nHouve entrevista após análise de currículo submetido em plataforma de vagas..\r\nVídeos de apresentação necessário, respondendo perguntas gerais sobre a causa.\r\nEntrevista com equipe e entrevista com gestor.\r\nCritérios afirmativos aplicados para seleção e triagem.", "Interview Questions": "Experiência prévia com temas específicos.\r\nPreferência por contencioso ou consultivo.\r\nPerguntas situacionais (desafios, como lidei com frustrações)\r\n"}, {"date": "13 Feb 2022", "title": "Project Administrative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (Zagreb) in Jan 2022", "Interview Descriptions": "Comfortable, casual and friendly. I like it, the environment was professional, but still relaxing. I was questioned by 3 ladies, and they had generally easy questions. The demanding part was only the 30 minutes excel task that I was not properly prepared. But overall logical and easy.", "Interview Questions": "Generally about project budgeting and tracking of the project costs"}, {"date": "8 Dec 2021", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at World Wildlife Fund (New Delhi)", "Interview Descriptions": "It was a good experience.  Got a call from human resources after applying for a vacancy online. \nThere were initial delays in setting up an interview. The entire process took about 4 months. There were two interviews. The interview questions tested subject matter knowledge", "Interview Questions": "Past work experience and questions relates to that"}], [{"date": "8 Dec 2021", "title": "Senior Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "Very organized interviewer. She explained everything very clearly about the process and I was very impressed. The interview questions felt genuine and relevant to the role. No big surprises. The organization is so well known and of course they draw in top interviewees.", "Interview Questions": "When was the first time that I heard of WWF?"}, {"date": "17 Aug 2022", "title": "Fundraising Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (New Delhi) in Dec 2021", "Interview Descriptions": "3 round of interviews. In first round they will ask you basic questions face to face. second round is observation round where you have to perform on field. Third is final discussion round.", "Interview Questions": "Why you wants to work for our organisation? "}, {"date": "6 May 2022", "title": "Social Scientist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at World Wildlife Fund (Washington, DC) in Dec 2021", "Interview Descriptions": "It was a long, 5-month process, with over a month of waiting to hear that I did not get the job after a final panel interview. However, everyone  I interacted with was very kind.", "Interview Questions": "Tell us about your experience working across diverse teams.\r\n\r\nTell us about a time when you experienced a challenge at work and how you dealt with it. "}, {"date": "15 Apr 2022", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at World Wildlife Fund (Washington, DC) in Nov 2021", "Interview Descriptions": "Their whole recruitment process leaves nothing to be desired. They do not get back to you even after a phone screening. What stops them from sending a canned response that informs you that you were unsuccessful?? I will not be applying to anymore jobs here. They also repost the same job without alerting those that applied that the requirements have changed", "Interview Questions": "What your salary expectation is when they didn't supply the range"}, {"date": "31 Oct 2021", "title": "Climate and Business Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "It was a casual interview, with multiple members of WWF's Climate and Business Team. There was a focus on technical skills required for the position, as well as experience in areas related to the position.", "Interview Questions": "On a scale of 1-5, how would you rate your excel skills?\n"}, {"date": "28 Mar 2022", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at World Wildlife Fund (Washington, DC) in Oct 2021", "Interview Descriptions": "Interview process was extremely long and drawn out. Applied in July, heard from the HR rep in October. Interviewed with the hiring manager in November and interviewed with a panel in December. All of the interviews were comfortable and felt like great conversation and not like a typical interview. I was given feedback from the hiring manager/panel about next steps and when I would hear back. My account in their portal still states \"pending review\". With modern HR/recruiting tools there is no reason to no provide candidates with at least an automated email that they filled the position. Follow-up afterwards with HR/multiple points of contact fell on deaf ears. Extremely disappointing experience.", "Interview Questions": "Can you tell us a time that you had to overcome adversity?"}, {"date": "17 Sept 2021", "title": "Stagiaire Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "A chat for about half an hour about past experiences and how the person can contribute to the project they will be working on. People are nice, friendly, open minded and respectful.", "Interview Questions": "Why do you want to work with us ?"}, {"date": "11 Feb 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at World Wildlife Fund (Sofia, Sofia (city)) in Sept 2021", "Interview Descriptions": "I applied online and was invited to a video interview with 5 managers, which lasted about an hour and a half. The process was relatively easy but at the end I was asked to share my salary expectations, which I believe were reasonable as a professional with over 6 years experience in the desired field. It turned out my expectations were almost double their budget unfortunately.", "Interview Questions": "What do you know about WWF's activity in this region?\r\nTell us about your work experience?\r\nCompetency based questions."}, {"date": "12 Aug 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at World Wildlife Fund", "Interview Descriptions": "3 rounds of interview. First, an initial screening to get to know each other.  Second round was more specific and knowledge-based questions. Last round was with more people from the team and was given scenario based questions.", "Interview Questions": "They gave me a scenario and asked which analytical models could be applied to make a better decision on how to solve it. "}, {"date": "30 Jul 2021", "title": "SPO Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "Very positive. Team of 4 interviewed me across various levels on the team, and was asked a series of hypothetical situations (e.g., engagements with companies etc) to imagine and answer for.", "Interview Questions": "What is your favorite animal"}], [{"date": "29 Jul 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund", "Interview Descriptions": "smooth, confortable, interesting discussion of all the aspects related to the internship and the different objectives, requirements, working environment. You get some questions about your interest in the job, your expectations, motivations. And clarifications about the requirements and aims.", "Interview Questions": "Why are you Interested in an internship with us\n"}, {"date": "7 Feb 2022", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (London, England) in Jul 2021", "Interview Descriptions": "Open Questions that offer space to start a dialogue for the first round. Second round you are asked to prepare something specifically tailored to your role to showcase your experience.", "Interview Questions": "How would you engage with Stakeholders? \r\nHow would you manage tight deadlines? \r\n"}, {"date": "30 Jun 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "First, i submitted an application  via their portal online, then i had a 30 min phone call with on of the team members, then about a 30 min phone call with the manager of the team, then, shortly after i received an offer with noted details", "Interview Questions": "Background about myself, why WWF/the position, my interests/future career goals"}, {"date": "19 Jun 2021", "title": "Intern - Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund", "Interview Descriptions": "Face-to-face interview\nQuestions on personal motivation \nJudge work ethic\nQuestions on knowledge of accounting entries and budgeting\nQuestions on knowledge of the company and its operations\nFace-to-face interview\nQuestions on personal motivation \nJudge work ethic\nQuestions on knowledge of accounting entries and budgeting\nQuestions on knowledge of the company and its operations", "Interview Questions": "Why are you interested in this position?"}, {"date": "6 Jun 2021", "title": "Support Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Wildlife Fund", "Interview Descriptions": "Online via zoom with two people interviewing. Was friendly and was more like a chatty conversation. Applied online and then heard the outcome with a telephone interview. Was a quick process.", "Interview Questions": "Why do you want to work here"}, {"date": "18 May 2021", "title": "Programmes Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "I thought the interview process was wonderful. My interviewers were  a panel of five individuals. The entire interview took about thirty minutes. They asked relevant questions and I did not feel that they were biased or discriminating. I would highly recommend.", "Interview Questions": "Tell Me About Yourself. ...\nWhy Do You Want This Job? ...\nWhy Should We Hire You? ...\nWhat Is Your Greatest Strength? ...\nWhat Is Your Greatest Weakness?"}, {"date": "29 Apr 2021", "title": "Partnership Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "1. HR - Head of Department\r\n*motivation to work with and for the company\r\n* skills\r\n*biggest professional achievement\r\n*professional failure and lessons learnt\r\n*salary\r\n\r\n2. HR - Head of Area - Head of Department - Colleagues\r\n*online assessment (prepared before-hand) and presentation\r\n*conflict management", "Interview Questions": "Es werden direkte, höfliche Fragen gestellt"}, {"date": "21 Apr 2021", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "Got a phone call interview, answering simple and basic questions on my previous experiences and the level of my knowledge on environmental issues. Providing references and got hired after three weeks.", "Interview Questions": "Tell us about your past relevant experinces?"}, {"date": "2 Apr 2021", "title": "Lead Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund", "Interview Descriptions": "An extremely long-drawn interview process. After my application, I was asked to send my written responses to 10 questions, followed by HR 'chat' or filtering interview, then an interview with a panel and a separate interview by a unit's senior employee. And then....silence.\n\nInterviews were cordial, not extremely grilling, but the panel asked technical and behavioral questions. Yet, it was absolutely unprofessional of HR to drop the communication at this stage. My follow-up emails never got a response.\n\nIt ended with the company/HR ghosting at the end of the process.", "Interview Questions": "Which of your past research work are you most proud of and why?"}, {"date": "25 Oct 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (Wellington, Wellington) in Apr 2021", "Interview Descriptions": "They called to confirm the interview and explained there would be a Panel. Interview took place at their head quarters in Wellington. One was via a screen, 2 were in the room with me.", "Interview Questions": "Why do you want to work here Time you made a mistake and what you learnt Time you analysed a project /proudest project Time you disagreed with a boss, what kind of boss brings out the best in you?"}], [{"date": "18 Mar 2021", "title": "Summer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "interview via skype and asked mostly about my past experiences and skills \nit was about 30 minutes, pretty easy going, got back to me after a week in applying\nit was a positive experience", "Interview Questions": "tell me about yourself and your past experiences"}, {"date": "18 Mar 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "Very professional interview process; multiple interviewers from different levels in the organization, providing 360 degrees perspective on the department, topical areas, priorities; very collaborative atmosphere; apparently many applicants; so process took a while; good on-boarding process", "Interview Questions": "Technical expertise about climate change mitigation"}, {"date": "16 Mar 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund", "Interview Descriptions": "The first round of interview was with the team. Second round of interview was tgt with HR with other team members. The interview process was swift and professional. The HR informed me of the results within 3 days of the interview.", "Interview Questions": "Why do you want to work for an NGO?"}, {"date": "12 Mar 2021", "title": "Conservation Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "They were very friendly and would require prior knowledge of what they have been doing in Hong Kong. They asked for a self introduction and why I would be interested in applying, specifically what i would be interested in working on.", "Interview Questions": "Plan an ecotour at shui hau for families"}, {"date": "26 May 2021", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Wildlife Fund (Paris) in Mar 2021", "Interview Descriptions": "Un premier appel pour présenter le poste en détails et revenir sur mes envies et attentes puis un entretien avec le n+1. Deux échanges très humains et bienveillants, basés sur la discussion. Un appel tout aussi aussi bienveillant pour me faire un retour (négatif) sur ma candidature.", "Interview Questions": "Quel aspect du poste serait vous mettrait le plus en difficulté et pourquoi ?"}, {"date": "22 Feb 2021", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "The long-form interview process was straightforward and easy to navigate. The first interview was held with an HR manager and the second interview was held with several of the program managers. It took much longer than stated to receive an update after the second interview, but overall, the process was respectful and manageable.", "Interview Questions": "Name three weaknesses and three strengths. "}, {"date": "17 Feb 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Wildlife Fund (London, England)", "Interview Descriptions": "Unfortunately this is one of the worst hiring experiences I have had. They took over a month to send an automated email inviting me for an interview. The message had several errors stating it was my 2nd interview when it was my first, saying I would get a zoom link 48 hours before and asking me to prepare a presentation with a very vague one line title. I'm lucky I checked the platform an noted this presentation request as the email had no mention of it. They should really make it more clear.\r\n\r\nI didn't receive any zoom link up until the day of my interview and rang, emailed recruitment several times. They did not respond all morning nor to the email I had sent a week before and only phoned me up 5 minutes into my supposed interview to say they couldn't find the link. 15 minutes and another phone call later they found it and got it to me. So I ofcourse entered my interview late. If I had not rang them so many times, I would have missed out on my interview. The interviewer apologised and said they were switching HR systems which was why that happened. I was only asked 6 very basic questions. There were two interviewers (despite my email saying I was speaking to one). This other individual had an angry face the entire interview and was fairly short in her communication. There seemed to be tension in the air.\r\n\r\nI gave my presentation to which they had no feedback apart from saying they liked it and highlighting an idea they liked in particular and thought would be good to implement. When I asked about the timeline of when I should expect to hear back (as I was ofcourse job searching and was expecting another offer but I let them know this role at WWF was my preferred role) they were quite guarded about it and said likely 2 weeks but if I wanted to withdraw I should email them. I told them I had no intention to withdraw as I loved the sound of the job, I just wondered if they had a timeline. I found this quite defeatist and any other interviewer I have asked for a timeline has always been more forthcoming, often even saying to let them know if I needed an answer sooner and they'd try if possible. The interview was then ended. I never heard back from them despite and saw they marked me as unsuccessful on the recruitment platform without giving me any notification or feedback. After following up they told me this was again due to their HR system.\r\n\r\nThe process was a complete mess and I came out feeling short changed by them making me late to the interview which ofcourse threw me off a little. For a charity, I really did not get a good vibe or that they care very much about staff. It is really sad to treat potential employees this way particularly when the job market is harder than usual during the pandemic. From other Glassdoor reviews it seems clear ghosting is common for them and they're not particularly good with potential hires. So I hope if this happens to you, atleast know not to take it personally. Part of making the planet a better place is being pleasant to others and efficient - two things they fell very short on.", "Interview Questions": "Name a time you dealt with conflict.\r\nWhat is a strength and a weakness of yours?\r\nWhat do you think the biggest challenge of the role will be?"}, {"date": "11 Feb 2021", "title": "Fund Raising Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "I had applied for walk in interview. They gave proper time and attention to me. It was a two tier round that day itself. I really liked the culture and atmosphere of the company.", "Interview Questions": "They asked about past experience, motivation to join and what makes me a good fit. "}, {"date": "22 Mar 2021", "title": "Head of Department Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund in Feb 2021", "Interview Descriptions": "5 stages-app form, letter, phone screen, panel, 1-2-1\r\nIncluded a presentation on what I could bring to the role and how I would be successful in role. \r\nPresentation was formal with excellent questioning and engaging interaction", "Interview Questions": "How could they help me to be successful in role "}, {"date": "1 Feb 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "First-round interview, 45 minute zoom call with 3 members of specific team, each person asked a few questions about my experience , asked about what I knew specifically about their project, etc.", "Interview Questions": "Rate your experience with Excel on a scale of 1-5"}], [{"date": "24 Jan 2021", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund", "Interview Descriptions": "Very standard questions, screening over the phone with HR followed up with a panel interview with the team. A second interview if selected and an offer came a couple of days later.", "Interview Questions": "A lot of \"tell me about a time you...\""}, {"date": "19 Jan 2021", "title": "Werkstudent Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund", "Interview Descriptions": "Vorstellung des Ablaufes, zu welchem Zeitpunkt was besprochen wird. Dann Vorstellung vom WWF und der Werkstudentenstelle. Danach Vorstellung meinerseits, und Fragen des WWFs zu meinem Lebenslauf, sowie inhaltliche Fragen zur bezogenen Werkstudentenstelle.", "Interview Questions": "Erklären Sie bitte Ihre bisherige Laufbahn. "}, {"date": "4 Jan 2021", "title": "Summer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund", "Interview Descriptions": "A phone interview with the team head and future supervisor. It  was a  relaxing interview with  questions mainly related to self-introduction and previous work experience written on the CV.", "Interview Questions": "Why do want to work at WWF?\r\nWhat is your expectation?"}, {"date": "26 Apr 2021", "title": "Visual Media Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (Manila, Manila) in Jan 2021", "Interview Descriptions": "The interview was very casual. It lasted about 45 minutes if I can recall correctly. It was actually a very pleasant experience; my employers were not at all intimidating and were very enjoyable to talk to.", "Interview Questions": "They asked personal questions such as which pieces from my portfolio were my favorite, why I wanted to work there, if I was applying for the experience or for a school requirement, etc."}, {"date": "5 Dec 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "I interviewed at one of their regional offices after completing my undergraduate degree. I was asked about my experiences based off my CV, my interests and asked technical questions on how I would approach certain conservation projects.", "Interview Questions": "What is the first step you would take in determining whether a certain lake is pollution?"}, {"date": "14 Aug 2021", "title": "Finance Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at World Wildlife Fund (Hanoi) in Dec 2020", "Interview Descriptions": "2 Rounds\n-1st: Individual information filled and declarations\n-2nd: Direct interview with supervisors and HR manager\nThere are 2 senior finance officers and one HR manager joining the interview. They are very friendly and nice, the questions are very close to your previous works", "Interview Questions": "What is your Mistakes from your previous organization that you got and how could you solve this?"}, {"date": "20 Nov 2020", "title": "Product Design Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund", "Interview Descriptions": "The interview process has 3 Rounds.  \r\nFirst: Portfolio Shortlisting round\r\nSecond: 1:1 interaction with the design lead.\r\nThird: Undertake an assignment and submit it within 2-3 days. \r\nOn successful completion you have to describe your design thinking.", "Interview Questions": "Design a sustainable product for WWF"}, {"date": "29 Oct 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund", "Interview Descriptions": "The job application was completed online by registering via WWF job portal. After submitting my application, I received an email response within a reasonable time frame, with further instructions about the interview process.", "Interview Questions": "Behavioural-based questions, e.g. Give me an example of a time you faced a conflict while working on a team. How did you handle that?"}, {"date": "7 Jan 2022", "title": "Estagiário Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Wildlife Fund (Brasília, Federal District) in Sept 2020", "Interview Descriptions": "Enviei meu currículo, e em torno de um mês o pessoal do superestágios entrou em contato para marcarmos a entrevista, que funcionou como uma conversa, foi tudo muito tranquilo e as entrevistadoras foram muito gentis e simpáticas.", "Interview Questions": "Se eu ficaria comfortável a respeito da pandacracia e auto gestão de trabalho."}, {"date": "5 Oct 2021", "title": "Praktikant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at World Wildlife Fund in Aug 2020", "Interview Descriptions": "Interview erfolgte per Zoom. Beide Interviewerinnen waren freundlich und die Fragen waren fair. Leider habe ich kein Angebot erhalten, da ich nicht für den gesamten gewünschten Zeitraum zur Verfügung stand, Ich würde mich aber auch in Zukunft nochmal beim WWF bewerben", "Interview Questions": "Wieso passen Sie besonders gut zum WWF?"}], [{"date": "7 Sept 2021", "title": "Sustainable Finance Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund in Jun 2020", "Interview Descriptions": "Some very specific questions were asked on the sustainable finance scene and ESG scene. It was quite challenging to navigate through these questions but was overall a good experience. Interview was with 2 staff from the team.", "Interview Questions": "Tell us what you know about the sector. "}, {"date": "5 Mar 2021", "title": "Chargé de Projet Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund in Jun 2020", "Interview Descriptions": "Un entretien téléphonique de 30minutes avec RH et un entretien presentiel d'1heure. Cependant aucun retour reçu suite au deuxième entretien, tres déçu par ce \"ghosting\" de leur part.", "Interview Questions": "Pourquoi souhaitez vous travailler chez WWF France?"}, {"date": "29 Aug 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at World Wildlife Fund (New Delhi) in Apr 2020", "Interview Descriptions": "The interview was taken in two rounds in two different weeks, It was a virtual interview.  each one for 45 to 60 minutes. they made me comfortable and listen carefully.", "Interview Questions": "Team management and conservation-related questions "}, {"date": "17 Feb 2022", "title": "PO, Climate Risk Management & Resilience Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (Washington, DC) in Mar 2020", "Interview Descriptions": "I first had a 30-min introductory interview with the  recruiter. Questions were framed to ensure that I understood and was qualified at a basic level for the position.  The second interview was with the person that would manage the position and the director. They asked mostly specifics about my experience rather than the typical interview questions.", "Interview Questions": "They asked specific questions about my past research and my specific roles in conducting that research. "}, {"date": "17 Feb 2020", "title": "Assistant Communications Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund", "Interview Descriptions": "two round of interviews\r\n1st round by HR+ Assistant Manager of Communications, with written test\r\n2nd round by Head of Communications\r\nWritten test: draft press release for raising the awareness of a conservation project", "Interview Questions": "Draft Press release and FB post"}, {"date": "26 Jan 2020", "title": "Assistant Vice President Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at World Wildlife Fund (New York, NY)", "Interview Descriptions": "Initially it was communicated that there would be a 2-3 step interview process. After the first interview, there was no feedback even when follow up emails were sent. The entire hiring team (Head , Vice Presidents) just ghosted. Not a company I would want to work with.", "Interview Questions": "What do you know about engagement"}, {"date": "22 Aug 2021", "title": "Policy Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund in Feb 2020", "Interview Descriptions": "One of the best interviews I've ever had was with WWF-Singapore. From the first call I had with the HR until the interview with the hiring manager - every step of the hiring process was filled with respect. The questions asked by the two interviewees I had were relevant and carefully thought of. The interview felt more of a conversation because I was at my best self and there was no intimidation. I wish all other interviews were like that! I didn't get the job but I didn't feel bad at all because I was treated in a way that made me feel I mattered and my opinion counted. I was also given constructive feedback (through email) a few days after the interview. I didn't expect it because other companies would just ghost you if they didn't like you, right?\n\nSo, thank you WWF for the wonderful interview experience!", "Interview Questions": "What environmental policies in Singapore that you would want WWF to address?"}, {"date": "16 Aug 2022", "title": "Junior Social Media Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at World Wildlife Fund (Fort Worth, TX) in Feb 2020", "Interview Descriptions": "It was a phone interview. The interview was quick and lasted only around 15 minutes. The questions were on the topic of social media and how to increase engagement. They also asked questions around what the nonprofit's missions and goals were.", "Interview Questions": "How do you track engagement?"}, {"date": "23 Dec 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "First i applied online, then was contacted by the team i applied to to set up an online interview. Skype interview lasted 45 mins, then received word of my final offer.", "Interview Questions": "Why WWF?"}, {"date": "4 Jun 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Wildlife Fund in Dec 2019", "Interview Descriptions": "I was directly interviewed by the team head. The interview was a face to face format and it took around 30 minutes. He first asked me to do a self-introduction and he asked me some questions about my studies at university. He did not really ask in-depth information about my CV but he asked many questions on environmental issues. It would be good if you prepare more on environmental issues and policies before you interview. There was a written test before the interview.", "Interview Questions": "What was the recent news you heard about the environment?"}], [{"date": "15 Nov 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at World Wildlife Fund", "Interview Descriptions": "Saw the announcement, applied, coordinated an interview with the hiring manager. Te interview was via Skype and it was short and conversational. Then the hiring manager offered me the job. There was no room to negotiate compensation. Then I was directed to HR for the paperwork.", "Interview Questions": "What is your experience with the subject of the internship."}, {"date": "12 Nov 2019", "title": "Nature Connected Communities Professional Inernship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Wildlife Fund (Toronto, ON) in Nov 2019", "Interview Descriptions": "Applied through a professional internship program.\r\nWas contacted by a volunteer who provided information regarding start date, end date and  hourly rate. \r\nInterview was set up\r\nGroup interview with 3 people\r\nReferences were provided.\r\nWas contacted either way.", "Interview Questions": "Why do you want to work at WWF?"}, {"date": "23 Dec 2019", "title": "Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Wildlife Fund (Washington, DC) in Nov 2019", "Interview Descriptions": "Average interview. The first part was a chat with the hiring manager and two senior employees. The second part was a chat with the same hiring manager and the department head. Questions were very precise, but not too hard if you've had some sort of practice. The people were very nice, there was a comfortable atmosphere and they made me feel relaxed.", "Interview Questions": "Do you have previous knowledge on the WWF?"}, {"date": "21 Oct 2019", "title": "Controladoria Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at World Wildlife Fund (Brasília, Federal District)", "Interview Descriptions": "Desde a indicação até a ultima etapa levaram semanas. Foram etapas de vídeo conferencia e presencial. Perguntas sobre experiencia e em que poderia contribuir. Foram alguns meses ate o processo ser concluído.", "Interview Questions": "O que você faz exatamente?"}, {"date": "4 Oct 2019", "title": "Recruitment Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 months. I interviewed at World Wildlife Fund", "Interview Descriptions": "Phone interview followed by a face to face interview (panel). \r\nThe interviewers were not prepared (no overview of the company given), not welcoming and less than friendly. To this day I have not received any feedback after the meeting that has taken place over a year ago!", "Interview Questions": "Tell us about yourself"}, {"date": "5 Jul 2021", "title": "Monitoring & Evaluation Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (Bangkok) in Oct 2019", "Interview Descriptions": "It was a one-round in-person interview with three interviewers. The interviewers really made you think and reflect on yourself, and they were genuinely interested in the interview process. Very professional.", "Interview Questions": "Describe yourself in five words."}, {"date": "30 Aug 2020", "title": "Water Risk Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (Berlin) in Oct 2019", "Interview Descriptions": "First interview with project manager. This interview as about getting to know me and for me to know the project.\n\nSecond step consisted of a technical assignment related to propose an improvement to the platform and showcase skills. This was followed by a second interview with the project manager as well as the Global manager.", "Interview Questions": "Tell us about your self.\n\nHow do you see your previous experience fit to the tasks of this new job?\n\nHow are your technical skills valuable to this position?"}, {"date": "1 Nov 2019", "title": "Project Manager Sustainable Economy Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Wildlife Fund (Berlin) in Oct 2019", "Interview Descriptions": "Insgesagtm drei Gespräche: 1. Kennenlerngespräch per Skype, ca. 30 Minuten, 2. Bearbeitung einer Aufgabe zu Hause und Darstellung der Ergebnisse in einer 20-minütigen Präsentation, Vorstellung der Präsentation vor Ort im Büro von WWF und danach 40-minütiges Gespräch, 3. Informelles Treffen mit der Projekt Leiterin", "Interview Questions": "Was ist Ihnen am Arbeitsplatz wichtig? "}, {"date": "28 Aug 2020", "title": "Senior Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at World Wildlife Fund (Kinshasa) in Oct 2019", "Interview Descriptions": "It was done by internal committee with three members for the first round. The best was to use an external experimented cabinet. A feeling of non objectivity of the selection is always there as there was no objective rating or evaluation. It will depend on the judgement of the committee members", "Interview Questions": "Open and based on your experiences related to the position"}, {"date": "2 Dec 2019", "title": "Social Media Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Wildlife Fund (Toronto, ON) in Oct 2019", "Interview Descriptions": "I applied online and a few weeks later I was contacted for a phone screening interview which was done by a volunteer. Following the phone screening an HR manager reached out to invite me to an interview with them and the direct supervisor for the role. The final interview was a panel interview with the department director, the supervisor and a member of the conservation team where you had to present a writing assignment that was given when I was invited for a final interview.", "Interview Questions": "Tell me how you handle negative social media posts."}], [{"date": "5 Sept 2019", "title": "Analista Pleno Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund", "Interview Descriptions": "Entrevista bastante completa, abordando experiência profissional de maneira detalhada, histórico e formação acadêmica. Desafios profissionais. Lições aprendidas. Experiências exitosas, experiências que não gostaria de praticar novamente. E entrevista em inglês para avaliação de proficiência com empresa especializada.", "Interview Questions": "Você poderia nos contar porque deseja trabalhar aqui?"}, {"date": "6 May 2022", "title": "Government Relations Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at World Wildlife Fund (Washington, DC) in Aug 2019", "Interview Descriptions": "It was a standard interview for an internship in the government relations field. I think the questions were fair and all relevant to future job performance. There were three rounds of interviews.", "Interview Questions": "Tell me how you would manage multiple priorities with a close deadline."}, {"date": "10 Jul 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "Everything went smoothly, kind and attentive HR personnel.  They were responsive to my desires in career development and asked appropriate questions.  I received another offer I had to accept so I did not continue with the process, but I can only say nice things from my impressions.", "Interview Questions": "What is you personal drive to apply with us?"}, {"date": "12 May 2019", "title": "Consultant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "Casual and straightforward interview process at the local field office (to which I was applying). Local Head of Office sat down with me and discussed relevant skills, ongoing projects (did NOT speak about potential renumeration, which I found unusual??)", "Interview Questions": "What can you contribute to the WWF team?"}, {"date": "30 Apr 2019", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund", "Interview Descriptions": "Was contacted by HR about 1 month after applying for the job. I was asked to fill out a form with some basic questions. The last step was an interview with the hiring manager and another team member.", "Interview Questions": "Why do you want to work for WWF? "}, {"date": "19 May 2020", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at World Wildlife Fund (Beijing, Beijing) in Mar 2019", "Interview Descriptions": "after been selected there was an online interview, and then went the officer for the second one group interview with a written text. online one was just basic questions like why I want this job, what kind of previous experience, and then the technical part happened during the group interview. Half mother language and half English.", "Interview Questions": "Why this job and how much do you understand about WWF? A written text includes a few technical questions about deforestation and project management skills. "}, {"date": "29 Oct 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at World Wildlife Fund (London, England) in Mar 2019", "Interview Descriptions": "You will submit an online Application on WWF's website, Shortlisting, Interview, Panel Interview, Final Interview.\r\n\r\nThere is no need to go through a recruiter.  WWF has a very good system, which allows anyone to be part of the organization if you have an environmental degree that is plus.", "Interview Questions": "What do you can tell us about WWF"}, {"date": "21 Feb 2019", "title": "Green Skills Research Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Wildlife Fund (Cape Town) in Feb 2019", "Interview Descriptions": "The application is online and proceeded smoothly. The HR and interview panel were prompt and professional with allowances for online interviews. Following-up after the interview was also timely and HR and the team leader were both generous with feedback and encouragement for the next-steps.", "Interview Questions": "WWF asked more than just the typical 10 most common interview questions. They asked about my understanding of integrity (As one of the core values of WWF), but also to solve a case, and to find out how I see my strengths playing in each one of the key performance indicator areas."}, {"date": "3 May 2021", "title": "Analista De Conservação Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (São Paulo, São Paulo) in Feb 2019", "Interview Descriptions": "Entrevista feita à distancia com a coordenadora da vaga em trânsito. Tempo de espera grande ate ser recebido. Gestora de rh foi educada, e deu explicacoes sobre a empresa e a vaga.", "Interview Questions": "Qual asua experiência com gestao de resíduos "}, {"date": "3 Feb 2021", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at World Wildlife Fund (Singapore) in Jan 2019", "Interview Descriptions": "The interviewer is engaging and introduces the history of WWF well. Encourage those who would like sales experience to give this job a try as the interview is not demanding or scary, but rather, reflected the firm warm hospitality", "Interview Questions": "What did you know  about WWF? \r\nWhy did you want to work here?"}], [{"date": "16 Jun 2022", "title": "Volunteer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (New Delhi) in Jan 2019", "Interview Descriptions": "It's telephonic. they basically ask you about your experience and judges your communication skill...\r\nthey also might take a zoom interview in some cases.\r\n\r\nBe prepared for question like \r\nwhy you want to volunteer \r\nwhere did you got to know about it etc", "Interview Questions": "your day schedule...\r\nnothing is majorly focused on your academic background. \r\nthey will take you anyway irrespective of how you perform.\r\n"}, {"date": "23 Mar 2019", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Wildlife Fund in Jan 2019", "Interview Descriptions": "Two competency based interviews. First round was great, more conversational I left feeling I could work with them. Second was less positive, the panel were 20 mins late and the interview was much more aggressive not a conversation I didn’t leave wanting to work with them or think I would be offered, so it felt like they had wasted my time to fill up the short list.", "Interview Questions": "What is the difference between leading and managing."}, {"date": "22 Dec 2018", "title": "Program Officer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Wildlife Fund", "Interview Descriptions": "I applied online, and was contacted by an internal recruiter several weeks later for a phone interview. Two weeks after that, I was contacted for a second, group interview with the program team via Skype. I had a final in person interview several weeks later with the program team. It took nearly a month after the in person interview process to receive an offer. The interview process was difficult, but fair, and included numerous rounds and a writing sample submission.\r\n\r\nI enjoyed getting to know the program team, who were friendly and accommodating in the interview process. However, I was disappointed by my interactions with the HR recruiter. I didn't feel HR represented the organization at its best - the recruiter overlooked small but important details (spelling my name incorrectly multiple times) and spoke condescendingly to questions I had about the process. The program team also did not speak highly of HR. Overall, my experience with HR soured my perception of the organization.", "Interview Questions": "Why are you looking to leave your current position? "}, {"date": "7 Dec 2018", "title": "Programmer Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at World Wildlife Fund (Bhopal) in Dec 2018", "Interview Descriptions": "We had a written round at the campus recruitment process to start with. We wrote about our experiences and learnings, mostly categorized into strengths, learnings, setbacks, etc., in 5 questions to be completed in an hour.\n\nThe next level was a role play with a case situation, where a protected forest area was being intervened with two infrastructure projects- a dam and a national highway. Fourteen finalists, seven characters to play. Local people representatives, judiciary, politicians, an environmental advisory board, etc.\n\nThe interview round started with a 15min phone call interview with the concerned department head, while the interviewers observed. A trail of a variety of questions followed for about half an hour or more.\n\nThe ability to conceptualize, organize, articulate and deliver hold key in the process.\n\nThe whole experience was long, exciting & tiring but at the same time, quite a well spent time.", "Interview Questions": "How would you grade yourself on the ability to articulate?"}, {"date": "24 Nov 2018", "title": "Assistant Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Wildlife Fund (New York, NY)", "Interview Descriptions": "The interview was great. We shared stories pertaining to the position and everyone was very welcoming. We interviewed for about forty-five minutes and discussed different aspects of hospitality, the Bronx Zoo and the Worldwildlife Federation. It was very educational and an overall plesant experience.", "Interview Questions": "How will your background help you be successful in this position?"}, {"date": "13 Sept 2018", "title": "Programmes Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (Singapore)", "Interview Descriptions": "the interview was with the manager of the specific program I applied for. It was more like a conversation -- the manager told me more about the internship scope, then asked me to introduce myself and about my previous experiences. overall, it was more like a chat compared to an interview.", "Interview Questions": "Why do you want to apply to WWF? & Why this programme especially?"}, {"date": "10 Oct 2018", "title": "Project Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Wildlife Fund (Washington, DC) in Sept 2018", "Interview Descriptions": "Had a phone screen and then two in-person interviews. During the phone screen I connected with the recruiter about salary expectations. Everything went really well but when they extended an offer, the salary was $10-15k lower than expected based on my conversations with the recruiter. I felt like I had wasted a lot of time and emotional investment. Wish WWF had been more transparent about the salary range.", "Interview Questions": "How many projects do you typically manage at once, etc."}, {"date": "12 Nov 2018", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at World Wildlife Fund in Sept 2018", "Interview Descriptions": "Had an initial phone screening then was scheduled for an in-person interview the following week.\n\nMet with two people From the department the position would be in. Interview lasted about an hour. Not hard, just mostly standard interviews questions.", "Interview Questions": "What experience do you have with grants?"}, {"date": "14 Jul 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Wildlife Fund in Aug 2018", "Interview Descriptions": "Simple and friendly \r\nEasy stages \r\nResponded to quickly \r\nInviting atmosphere \r\nFriendly panel \r\nGood questions \r\nNice to visit the office \r\nStages were clear cut \r\nPhone call offer nice and personal \r\nThey knew a lot about me before I went\r\nClear and concise questions", "Interview Questions": "Why I am suited to the role "}, {"date": "23 Jul 2018", "title": "FUND RAISING EXECUTIVE Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at World Wildlife Fund (New Delhi) in Jul 2018", "Interview Descriptions": "Four round interview process. three days on the field and two rounds of interviews. longer than required. Did not understand why.  It was on field for 2 days and two rounds of 1-1 interviews", "Interview Questions": "analysed communication and confidence "}], [{"date": "28 Jun 2018", "title": "Project Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund", "Interview Descriptions": "I have had a bad experience with the pre and post-interview process of WWF Tanzania for project comms position. \r\n\r\n1. It took 4 months since application to be called for an interview. Perhaps not a big DEAL. \r\n\r\n2. HR Officer misled me about the location of the position which made me answer a question incorrectly i.e. managing project comms from the HQ instead of project location in a different region. I only learned the truth during my questions at the end of the interview.\u2028NB: HR Manager was in the interview panel instead of the Officer. \r\n\r\n3. They told me I would get the answer after 2 weeks. \r\n\r\n4. After interview, I made a phone call to HR Officer to thank him for selecting me for the interview (regardless of the location gaffe) and I tried to use the opportunity to find out how I did. He told me that I did very well. \r\n\r\n5. Two weeks passed without being contacted so I called the HR Officer only to find out the he was on leave without any prior notifications to us. \r\n\r\n6. Again, when I asked the HR Officer whether I should be hopeful or prepare for the worst - as I had another job waiting for my answer -, he said I should be hopeful which made me turn down the job cause I felt I would get the job & I wanted to work for WWF. \r\n\r\n7. After returning from leave there was no correspondence until I rang him after a week had passed. He said he would call me back in 20 minutes which turned into an hour and I was forced to send him a message to remind him & I got a reply “we are moving buildings” That was on Friday. \r\n\r\n8. The following Wednesday I couldn’t wait anymore. I called and asked him point black if I got it or not and he acted as if he didn’t know and said he would need to check the “file”. Then he text messaged me “Sorry you were not successful” and he defended himself when I told him they should have told me way before so I could make other plans, by  saying he was on leave and didn’t know. \r\n\r\n9. He was not sending an email and so I had to ask him to write me a formal rejection email and he wrote one saying “we have gone with other CANDIDATES” although the position was only for one candidate. \r\n\r\nThe bottom line is, HR Team of WWF Tanzania is extremely unprofessional and I am unhappy with the way they have handled my case especially after turning another good job that I could have taken. Even if I were not good for them they should have just been professional and tell me after 2 weeks instead of leaving me hanging in the air.", "Interview Questions": "How to use social media for project communication"}, {"date": "30 Jan 2021", "title": "Internal Communications Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Wildlife Fund (Singapore) in May 2018", "Interview Descriptions": "Call with Swiss counterpart first. Then assignment, and second interview with Singapore head of comms and line manager.\n\nCronyism is strongly at play here - the Singapore head and manager are both of Indian nationality. Was told to come in and interview, but got asked inane questions and my assignment wasn’t even reviewed.\n\nDidn’t get turned down, but checked on LinkedIn to see another person of Indian nationality got the job. Was I the token Singaporean to fill the interview quota?", "Interview Questions": "What did you do in xxx? (The interviewer asked about every single of my 6 jobs. No creativity maybe?)"}, {"date": "18 Oct 2019", "title": "Mentee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at World Wildlife Fund (Hong Kong) in May 2018", "Interview Descriptions": "The hiring process starts with a personality test and a task to write a short essay about the possible solution for a selected environmental issue. Later, the one-to-one interview was done via Zoom.", "Interview Questions": "Could you briefly introduce yourself?"}, {"date": "22 Jun 2018", "title": "Development Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at World Wildlife Fund (Washington, DC) in Apr 2018", "Interview Descriptions": "Introductory call with HR, then meeting with the manager, followed by a third round of meetings.  I did not get to the third round. The position would suit someone who has been raising 7 figure awards as that is their primary focus.", "Interview Questions": "How do you do your current job?"}, {"date": "6 Mar 2018", "title": "Full-time Employee Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund", "Interview Descriptions": "Don't bother applying here -- my interview experience was one of management/HR treating employees like disposable garbage.\r\nAfter applying, I got an email from HR. HR was generally unprofessional in tone and behavior.  HR emailed me in the evening to set up an interview for the following morning (seriously who does that?). Interviewer was late and, on top of that, rude. Interview was pretty standard and overall went well -- HR said they liked me and would recommend me for the next round. But HR ended the interview with a 3 minute critical rant (again, who does that?), and explained that they 'pay it forward' by being critical. \r\nA couple weeks passed after radio silence. I emailed for an update and no response. Very rude and unprofessional -- HR and interview process indicative of how they treat employees, like garbage.", "Interview Questions": "Standard behavioral questions read from a list"}, {"date": "27 Oct 2018", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at World Wildlife Fund (Kumasi, Ashanti) in Mar 2018", "Interview Descriptions": "Communication is quite cool, I have only attended one interview in which I learnt how to talk to a panel . The people which I mate they have good communication skills very polite", "Interview Questions": "Explain your self with one word"}, {"date": "15 May 2018", "title": "Senior Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Wildlife Fund (Washington, DC) in Mar 2018", "Interview Descriptions": "The process took about two months from when I submitted my resume. I went on the face to face interview and was told I would hear back. I heard back about a week or two later saying they had chosen another candidate. About a month after that I received a phone call  asking me if I was still interested and they wanted me to have a phone conversation with the potential manager.  I agreed and did the phone interview. Two days later I received a email asking me to come in for a panel interview.  Two days after that I received another email saying they were moving forward with another candidate. If the interview process is anything like the company I would NOT want to work here.", "Interview Questions": "How do you multitask?"}, {"date": "17 Mar 2021", "title": "Sales Executive Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (New Delhi) in Mar 2018", "Interview Descriptions": "It was a very informal interview and they probably selected everyone who came. The first round was a 1 on 1 round and then they had asked me to meet the HR .", "Interview Questions": "About Wwf\r\nAbout sales and marketing "}, {"date": "30 Dec 2019", "title": "Global Science Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (Washington, DC) in Mar 2018", "Interview Descriptions": "After submitting my application, I got a phone interview a few weeks later. This phone interview was with the supervisor of global science communications and it was a 30 minute conversation, with a few questions about WWF in general (what I knew about the company), my experiences and why I was interested in conservation.", "Interview Questions": "Why are you interested in conservation?"}, {"date": "20 Mar 2018", "title": "Accountant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at World Wildlife Fund (Los Angeles, CA) in Mar 2018", "Interview Descriptions": "I had phone interview with a recruiting manager and a division director and they went through my work history, my skills sets and my strengths and weaknesses. They have some attitude questions about my personalities, my soft skills and how I overcome my weakness.", "Interview Questions": "Why I would be a good fit for the job"}], [{"date": "23 Mar 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at World Wildlife Fund (Lahore) in Feb 2018", "Interview Descriptions": "I was just asked about my past educational background because it was a basic level&nbsp;internship. They may also ask about any prior experience, but it will be straightforward. Lastly they will always ask about the expectations you have.", "Interview Questions": "What are your expectations from this internship?"}, {"date": "15 Oct 2022", "title": "Digital Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (Woking, England) in Jan 2018", "Interview Descriptions": "4 Rounds: First with hiring manager Second, task based presentation on what your aspirations with the role are Third, informal coffee meet with the head of brand Fourth, final interview with the director of the communications department", "Interview Questions": "Why are you the right candidate for the role?"}, {"date": "28 Oct 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Wildlife Fund (Washington, DC) in Nov 2017", "Interview Descriptions": "Very straight forward. Contacted by HR, 20 min screening call. Interview set up for a week later with a person in the department (Director level), then another a week later with my would be boss VP level and a Senior Program Officer.  All virtual. Finally a few weeks later an in person with my VP /Boss to be, the Director that interviewed me and the Senior Program Officer. Got the job two weeks later.", "Interview Questions": "Tell us about your project management experience? Have you managed staff?"}, {"date": "30 Jan 2018", "title": "Assistant Campaign Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at World Wildlife Fund (Singapore) in Oct 2017", "Interview Descriptions": "Fairly standard 1 hour long interview. Interviewer asked questions to survey work experience and tested me on the spot to pick my brain for ideas. The inexperienced HR executive who was part of the 2 person interview panel asked only 2 really basic questions throughout. They're impressed and told me they would get in touch with me but sad to say, neither of them bothered to reply. In the end, this job position closed and I found out that they took my ideas and launched them into a new content marketing direction. HORRIBLE BRAIN PICKERS.", "Interview Questions": "Give us ideas on how to market an existing campaign."}, {"date": "6 May 2019", "title": "Entry Level Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at World Wildlife Fund (Washington, DC) in Oct 2017", "Interview Descriptions": "I was initially contacted for a phone screen and a week or so later was contacted for an in-person interview. The first interview I met with my would-be manager, and a member of HR. That same day, I also interviewed with my would-be manager's supervisor and another member of the marketing team who has a similar role to the position I applied for.  A couple of weeks later I came in for a final interview with my direct colleague and another head of the department. During that final interview, I took a coding test and after that had a conversation with 5 or 6 members of the team.", "Interview Questions": "Describe a situation where you have to solve a problem in a short amount of time."}, {"date": "12 Oct 2017", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Wildlife Fund (Woking, England) in Sept 2017", "Interview Descriptions": "Short presentation with follow up questions and broader questions regarding myself and WWF missions. Specific questions on my opinion on issues relating to the role. \r\n\r\nI appreciated the opportunity for an interview but the process was incredibly time consuming - one to keep on the back burner.", "Interview Questions": "Give us a presentation to convince two climate change denialists (interviewers) that climate change is real and why it matters.\r\n\r\nThink of something funny that has happened to you"}, {"date": "23 Jan 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Wildlife Fund (Washington, DC) in Aug 2017", "Interview Descriptions": "Three people interviewing you at a large table. The wait can be a bit long because everyone is very busy. The scheduling process was quite easy, but the interview itself was more specific and skills-oriented than I was ready for. It only lasted 30 minutes at most and, even though I actually thought I didn't interview well enough for such a prestigious organization, I still received an offer and worked there", "Interview Questions": "Why do you want to work at the World Wildlife Fund? Relevant experience in  Congress and policy analysis?"}, {"date": "18 Oct 2021", "title": "Communications Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (Zürich) in Aug 2017", "Interview Descriptions": "Two-tiered, first with WWF Switzerland followed by the WWF regional office. Interviews were conducted in panels and focused on what the individual can bring to the table and why they are interested in the position.", "Interview Questions": "What assets can you contribute if you join our team? \nTell me why you are interested in this position."}, {"date": "22 Dec 2017", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at World Wildlife Fund (New Delhi) in Aug 2017", "Interview Descriptions": "Applied through careers website, got a call for interview after 3 month, and selected after 4 rounds of interview. I was stuck in flooded area so It was not possible for me for face to face interview but they took care of it and considered telephonic interview. first and last round was with HR then with Manager and director", "Interview Questions": "Are you interested in Bird watching."}, {"date": "4 Sept 2017", "title": "Media Advocacy Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (Woking, England) in Aug 2017", "Interview Descriptions": "The interview lasted around 45-60 minutes. The interviewers were really lovely and responsive and said they'd get back to me within a week. Two weeks went by and I received no emails. I messaged HR and got a template email which they didn't even insert my name or the job position into. I was really disappointed that they failed to even reject me kindly despite everyone at the building being extremely welcoming and kind. The email has really left a bad taste in my mouth.", "Interview Questions": "What attributed would team members within the communications department need to have aside from team skills?"}], [{"date": "14 Jul 2017", "title": "Analista De Comunicação Pleno Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at World Wildlife Fund (Brasília, Federal District)", "Interview Descriptions": "Processo seletivo lento e com diferentes etapas e entrevistas. Na ocasião e ainda atualmente é um reflexo de um RH ineficiente com equipe de gestores incapacitados para selecionar profissionais.", "Interview Questions": "O que te motiva para entrar no WWF?"}, {"date": "13 Aug 2019", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at World Wildlife Fund (Woking, England) in Jul 2017", "Interview Descriptions": "I heard back from my application within 2 weeks (though this was a particularly quick recruitment) and attended an interview in person. I was asked to prepare a technical presentation and was asked mainly competency based questions. Three interviewers, two from the team and one as objective interviewer. I also met a team member before the interview for a tour and informal chat which was also part of the interview (though not explicitly so). Received a decision within a couple of days. Salary wasn't negotiable.", "Interview Questions": "Tell me about a time you had to manage competing assignments"}, {"date": "11 Jun 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at World Wildlife Fund", "Interview Descriptions": "The interview was an Informal process, although my position was different than many positions as WWF.  We did a phone interview and 2 skype interviews with the hiring manager", "Interview Questions": "Situational"}, {"date": "20 Mar 2017", "title": "Market Intelligence Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Wildlife Fund", "Interview Descriptions": "I applied online on their website and got an email from HR the same day. After the HR interview, which lasted 45 minutes, I was selected a week later for a technical interview with an executive in WWF. I am not certain where it went wrong, but they did not select me for the following round(s) and I was rejected. The technical interview lasted exactly 30 minutes. Hopefully this review will be of help to others who apply for this position since I was not sure about it and Glassdoor wasn't of much use in preparation.", "Interview Questions": "(HR) \r\n\r\n1. Why do you want to work for us?  \r\n2. Why do you think you'll be good at this role?  \r\n3. What did you do at [resume job]?  \r\n4. Do you have any regrets from your previous role - think you could have done anything better?  \r\n5. What do you expect from your bosses?  \r\n6. What are your weaknesses?  \r\n7. Are you open to relocation?  \r\n8. Do you have a salary in mind?    \r\n  \r\n(Technical)  \r\n  \r\n1. Why do you want to be in this role?  \r\n2. What do you think of the global economy?  \r\n3. What did you do in your most recent role?  \r\n"}, {"date": "24 May 2017", "title": "Marketing And Communications Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at World Wildlife Fund (Rome) in Mar 2017", "Interview Descriptions": "4 different steps, the first interview happened with the HR director and the Project Director, the goal was to have a first contact and check out on your experiences and background, the second interview was with the same panel plus the Marketing director Italy, i had to do a presentation to explain my vision of a marketing strategy my ideas for the project etc... and had to write an essaie. The last skype interview was with WWF CEO of different countries and was very informal with random questions. Finally i have met the team in Rome physically as a last step", "Interview Questions": "If you were giver a sailing boat for 15 days, which event would you organize on it and for which purpose?"}, {"date": "13 Jun 2017", "title": "Proposal Development Manager - Oceans Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund in Feb 2017", "Interview Descriptions": "On January 31, I applied for WWF's Proposal Development Manager - Oceans position, which would support WWF's International Secretariat. On February 23, I received an email from a WWF - Australia representative stating that my application had been forwarded to WWF - Australia (where I am assuming this position would be based) from WWF International to organize the next steps in the recruitment process. The representative stated that WWF - Australia was very busy filling a number of positions within the team, however, and that they would not continue the recruitment process for this role until potentially April. I responded to her email immediately and thanked her for the opportunity and said that I looked forward to hearing from her again in April. Approximately six weeks later, on April 3, I emailed her to ask if WWF - Australia anticipated continuing with the recruitment process in April or if she had any update. She responded the same day, thanking me for being in touch, stating that she did not have much of an update but hoped to start contacting the shortlisted candidates the following week. I responded with a short thank you note. I never heard from her the following week. On May 2, I wrote to her again requesting an update on the recruitment process for the position. She never responded. It is now June 13, and no one has contacted me regarding the recruitment process. I can only assume that WWF - Australia moved forward with the recruitment process but never contacted me for an interview. They strung me along for three and a half months, and in the end, I was never offered the opportunity to interview for the position. In each of the WWF - Australia representative's emails, she stated \"If your situation changes, please let me know,\" yet she did not provide me with the same courtesy. WWF - Australia's lack of respect and communication with me was incredibly unprofessional and disappointing.", "Interview Questions": "Are you available to interview in April?"}, {"date": "17 May 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (Hong Kong) in Jan 2017", "Interview Descriptions": "a staff member of the HR team phoned me and made an appointment for the interview, then I was directly interviewed by the team manager in the following weeks. Three to four candidate would be interviewed at the same timeslot.", "Interview Questions": "Briefly introduce yourself and how was your past experience help you to fit in the job"}, {"date": "4 Jul 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (Washington, DC) in Jan 2017", "Interview Descriptions": "Initially sent a CV and a cover letter, heard back after two weeks and had an initial phone interview with the HR team, then a follow-up phone interview with the project team before the last interview, in person with the project team. Each step was a little more specific and related to the project and the work to be done. Professional and straightforward throughout.", "Interview Questions": "Why do you want to work here?"}, {"date": "20 Feb 2017", "title": "Conservation Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Wildlife Fund (Singapore) in Jan 2017", "Interview Descriptions": "Mainly questions on my experiences and how I could apply those experiences for the job scope. After which, the interviewer explained the the work that they have done and what would be the contribution of the intern to their work.", "Interview Questions": "What do you know about the work of WWF?\r\n"}, {"date": "22 May 2017", "title": "Knowledge Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at World Wildlife Fund (Utrecht) in Nov 2016", "Interview Descriptions": "step 1: send a motivation letter \r\nstep 2: a 30 mins Skype interview with the HR recruiting manager and the director of the unit \r\nstep 3: 1hr panel interview with the HR recruiting manager, the director and 3 additional managers from different units", "Interview Questions": "First interview: focused on why did I apply and what do I see in the position and the organisation. How did my career unfolded. Who are my clients and am I open to relocate. \r\nSecond interview (panel): Again - what did I apply etc. What do I expect to be the biggest challenges in the position, what will be my first steps, how do I self-evaluate and what are my expectations from my manager"}], [{"date": "9 Feb 2017", "title": "Media Advocacy Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at World Wildlife Fund (Woking, England) in Oct 2016", "Interview Descriptions": "The interview process was very thorough 2 step interview. The first consisted of an introductory set of questions about my background, which were then followed competency based questions about how I would react to certain situations. My answers were based on my previous work experience and what I knew about the communications industry. \r\n\r\nI then had to do an hour long written test, where I read a detailed report on an environmental project before producing a press release. \r\n\r\nI was then invited back for the second and final round of interviews shortly afterwards. For the second round I had to prepare a presentation, which looked at an environmental situation and how I would go about trying to influence the key players via the media. The presentation was 5 minutes long and was followed by the same sort of competency questioning that happened during the first interview. \r\n\r\nThe whole process was very positive, although I found my prospective boss (who was there during the second round of interviewing) to be dismissive and quite rude (an interview tactic no doubt)", "Interview Questions": "How would you react if you were on call and a journalist was asking about financial mismanagement at the WWF. They were going to release a story the following day and were looking for someone to comment from your organisation. There is no one senior available and you can't get hold of any of your team. What do you do?"}, {"date": "7 Jan 2018", "title": "Conservation Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at World Wildlife Fund (Brasília, Federal District) in Sept 2016", "Interview Descriptions": "First i had an interview with a HR person, than i was redirected for thecichal people. After this i had a english test, and a final call to discuss payment and benefits.", "Interview Questions": "About my habits, things i like to do, and my view of some conservation issues."}, {"date": "13 Sept 2016", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at World Wildlife Fund (Washington, DC) in Aug 2016", "Interview Descriptions": "First, I was interviewed by HR with a simple 30 minute phone screen. Then I was brought in a few days later for an in-person interview, where I met with three members of the team. All people were nice and friendly. The interview was fairly straight forward, but in depth about 1 hour and 20 minutes long. Went into depth on what the position was like, what the team was like, and cared a lot about what I researched about the work the team was working on.", "Interview Questions": "Why WWF? What do you know about the organization? Tell us about yourself. Why this position?"}, {"date": "10 Sept 2016", "title": "Assistant Education Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Wildlife Fund (Hong Kong) in Jun 2016", "Interview Descriptions": "It was a group interview(around 5-7ppl), started with self-introduction by each candidates. Later, we worked as a group on a case study in designing an event promoting environmental message for a group of primary school students and presented it to a panel of 3 interviewers.", "Interview Questions": "Self introduction"}, {"date": "4 Jul 2016", "title": "Legal Counsel Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Wildlife Fund (Woking, England) in Jun 2016", "Interview Descriptions": "The initial online application is incredibly comprehensive. They provided a timescale as to when they'd make a decision and when the interviews would take place, which they honoured. I was called to a face to face interview within a few weeks of my application. I've always wanted to work for the WWF and was really excited. I put a lot of thought in to my application and spent a long time preparing for the face to face interview.\r\n\r\nThe interviewers had scripted interview questions which they did not deviate from, presumably to ensure all candidates experience the same interview. All the interviewers seemed incredibly bored throughout the entire process. At the end of the interview I was informed a decision would be made and I would be notified within one week.\r\n\r\nMy interview ran from 9am - 10 am. When I left the interview, I checked my phone and noted receipt of an automatically generated email at 9.32am confirming my unsuitability for the role. The email also confirmed that due to the large volume of applicants, they couldn't provide specific feedback. \r\n\r\nI'm really not sure why they wasted my time and theirs by interviewing me. I'd have been less offended with a straight out rejection. My interview felt like a box-ticking exercise to demonstrate their own compliance with their recruitment process but have left me feeling they have showed a lack of professional courtesy.", "Interview Questions": "The questions were all scripted - tell us why you want to work for the WWF, how do you manage competing demands on your time."}, {"date": "18 May 2016", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Wildlife Fund (Woking, England)", "Interview Descriptions": "The window for job applications was short - only 2 weeks.  I submitted my application with a week to spare and was then emailed the day after the applications closed to ask me to come along to an interview.  The interviews were the following week and you could use the online system to choose a time of day that suited you for the interview.\r\nI was told ahead of time that I needed to give a 5-minute presentation on a topical and controversial wildlife conservation issue that they had specified.\r\nThe interview itself went well.  There were three members of staff interviewing me, including the direct line manager, her manager, and a manager that works closely with them in a different department.  They were all very friendly and nice and put me at ease from the beginning.\r\nWe started off with my 5-min presentation and I then had to answer some technical questions about the topic of the presentation afterwards.\r\nFollowing that, I was asked some more in-depth questions about my specific skills and experience related to the job, and how I would fit into the role and use this experience to benefit the organisation.\r\nThe interview lasted approximately 1 hour, including a few questions that I asked at the end.\r\nThe line manager then called me up a few hours later and offered me the job!", "Interview Questions": "Specific questions related to the presentation\r\nWhy I applied for the role\r\nWhy I think I'd be good at the role\r\nProject management experience\r\nMedia experience\r\nDealing with stakeholder conflict"}, {"date": "23 Jan 2018", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Wildlife Fund in May 2016", "Interview Descriptions": "The interview process was very quick because they got back to me within the week that I applied. I went through 4 interviews which were fairly easy and took one creative test before an offer was made.", "Interview Questions": "Why choose WWF?"}, {"date": "12 May 2016", "title": "Programmer Officer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at World Wildlife Fund (New Delhi) in May 2016", "Interview Descriptions": "I applied online and shortlisted for the interview which was held at New Delhi Office. It consisted of written test and  face to face interview with HR and Reporting manager", "Interview Questions": "Why you want to work with WWF"}, {"date": "18 May 2017", "title": "GIS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (Washington, DC) in May 2016", "Interview Descriptions": "I found the job posting through the university's career services website and applied through WWF's online application system. Got an email about a week after and set up a time for phone call. The phone interview was held over a conference call with three people on the panel, two of them later turned out to be my direct supervisors. They asked about my prior experiences related with GIS, some simple GIS questions, and described the main tasks of the internship and asked if I would be interested in those types of work. You could feel that they really cared about your personal growth and wanted to make sure you gain something from the experience.", "Interview Questions": "What's your career goal and how does the internship fit in your career plan?\r\nWhat would you do if someone on your team doesn't do his/her job?\r\nTell me about one of your GIS projects."}, {"date": "16 Mar 2016", "title": "Technical Adviser Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at World Wildlife Fund (Woking, England) in Mar 2016", "Interview Descriptions": "This job was based in the U.K. The application process had positives and negatives.\r\nI'll start with the negatives: The application process took a really long time - I didn't hear that I had been offered an interview until three weeks after the application deadline had passed.  I was notified of the interview two weeks before the interview date, but wasn't told the outcome of the interview until a week after the interview had taken place. From the initial application deadline to being told I was not  being taken to the second round of interviews took around 42 days. The other downside was that recruitment never answered any of my emails when I had requested information on one or two occasions. For example, before applying I had requested more information about the job role, but nobody got back to me.\r\n\r\nThe positives were that everyone I met at WWF- UK on the day of the interview were very friendly, from the reception staff to everyone on the interview panel. The three interviewers seemed very nice, and did their best to make me feel at ease. \r\n\r\nThe interview itself was different to how I had expected, there were no waffley questions such as 'tell me about yourself' or 'describe yourself in three words' or 'why would you be the best person for this job' or 'what animal would you be' - none of that. All the questions were very specific and wanted to get straight to the heart of my experience, and exactly what relevant experience I had, and how I had gone about it. They wanted clear examples of relevant experience, and wanted to find out my understanding of how things (i.e. project management or stakeholder negotiation) should be done. There didn't seem to be much room for talking about other skills and experience, or trying to elaborate on why I could be best for the job. This is the part I found difficult - I was quizzed in some detail about very specific experience, but there was little room to 'show off' in other areas or tell them about other things I had done or achieved, or additional skills I had. I also had to do a 5 minute (pre-prepared) presentation. The topic, set by WWF, was the impacts of trophy hunting on wildlife conservation. As this was a Technical Adviser role (which would involve giving expert wildlife conservation advice) , candidates were expected to have a strong knowledge of conservation science, hence the technical nature of the presentation.\r\n\r\nMy experience may not be typical of WWF interviews for other job roles - I suppose different interview panels ask different questions, so an interview for an HR or Communications position would likely be completely different.", "Interview Questions": "What made you interested in this job and working for WWF?\r\n\r\nDescribe a project you have managed, and detail how you managed the budget and planned/ implemented the project.\r\n\r\nDescribe a situation where you have solved a problem.\r\n\r\nDescribe your experience of engaging with the media.\r\n\r\nIf you were approached to give comment on something you are unfamiliar with, how would you respond?\r\n\r\nDescribe how you have worked through issues with stakeholders. How did you achieve this?\r\n\r\nDescribe your experience of advising other projects, and departing information to them when they have requested it.\r\n\r\nThere were also a number of questions following those above, to find out more with regards to my answers (e.g. how I had gone about achieving certain things, what steps I had taken, measures of success). \r\n\r\n(Also - five minute presentation on the impacts of trophy hunting on wildlife conservation)"}], [{"date": "11 Mar 2016", "title": "Human Resources Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at World Wildlife Fund (Woking, England) in Mar 2016", "Interview Descriptions": "The interview was very relaxed and more of like a conversation.I was briefed about the software's and the Hr systems in use. \r\nNothing intense very generic questions about my previous work experience and how I would handle situations and scenarios.\r\n\r\nOverall a very relaxed interview. :)", "Interview Questions": "What do you think is good customer service ?"}, {"date": "26 Feb 2016", "title": "GIS Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at World Wildlife Fund (Washington, DC)", "Interview Descriptions": "Two phone interviews were conducted; the first one with the HR representative and the second with the project manager. The process went a long very quickly and within a week of the first interview the background check had commenced.", "Interview Questions": "Interview questions pertained to previous work experience, technical background, why I think this job is the right fit, etc..."}, {"date": "10 Feb 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "fast process and friendly interview, questions more related to my resume experiences and past work experiences. I'm very enjoyed the interview cause we talk about a lot of conservation issues.", "Interview Questions": "Introduce yourself"}, {"date": "24 Jan 2016", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at World Wildlife Fund (Washington, DC)", "Interview Descriptions": "Team that interviewed me were great and made me feel comfortable. I had the hardest time with their HR department... they seemed dishonest and unwillinging to listen when I tried to speak about salary and future growth opportunities.", "Interview Questions": "What do I like about WWF's mission and core values?"}, {"date": "8 Jan 2016", "title": "Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund", "Interview Descriptions": "After submitting an online application, I scheduled an online (skype) interview. The interview lasted about 45 minutes most of which involved the interviewer describing the position and the other candidates that had already been hired, then stating that the position I applied for doesn't really exist anymore. I felt that speaking about other candidates during the interview was a bit unprofessional and   didn't really leave an opening for me to talk about my skills or experience.", "Interview Questions": "Please describe your experience doing (XX) type of research."}, {"date": "19 Dec 2015", "title": "Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Wildlife Fund", "Interview Descriptions": "1 hour long, with \"typical questions\" (weakness, strengths, describe how you solve a difficult situation, describe how you showed leadership, etc), very friendly atmosphere, helpful interviewers. Present there were experts (members of the organisation) and HR staff. In some moments it was more of a conversation (which is always good in an interview, I think - although it was not successful finally). Overall a positive experience.", "Interview Questions": "Give us examples of XYZ (e.g. when you showed leadership, when you solved a conflict, when you exceeded what was expected from you...). Be prepared with some stories from your experience."}, {"date": "10 Sept 2016", "title": "Private Sector Engagement Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Wildlife Fund in Oct 2015", "Interview Descriptions": "Typical 30 minute phone interview. Be prepared to discuss how your previous experience qualifies you for the specific requirements of the job description. The phone interview was less stressful than I anticipated.", "Interview Questions": "How would your best friend describe you?"}, {"date": "2 Sept 2016", "title": "Department Head- Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Wildlife Fund (Nairobi) in Oct 2015", "Interview Descriptions": "The interview process involved a telephone screening interview then a oral interview with the Director for Africa, CEO of WWF kenya and Regional head of HR with questions dwelling on aspects of IT management, Procurement & supply chain management. \r\nI had to prepare a presentation 10 minutes before the interview that i was to present to the panel and defend my presentation", "Interview Questions": "How would you institute a change in procurement"}, {"date": "28 Aug 2015", "title": "Program Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 3 weeks. I interviewed at World Wildlife Fund", "Interview Descriptions": "Received email from HR a few days after applying. Scheduled an interview/ screening with HR one week later. Received word that I'd been further considered that following Monday. Panel Interview with HR manager, Sr Director, and Sr Program Officer a week after the HR screening. Follow up phone call the day afterwards.", "Interview Questions": "Explain relevant experience, discuss your preferred work environment, specific technical questions, and examined technical knowledge"}, {"date": "10 Jan 2016", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Wildlife Fund (Washington, DC) in Jun 2015", "Interview Descriptions": "apply online, take two weeks to process my application. First phone interview, then followed by two one-to-one person interview at the Washington, D.C office. The person who interviewed me is nice and told me a lot of the position and their work. It was a helpful experience.", "Interview Questions": "what do you see yourself in the future?"}], [{"date": "5 Jul 2015", "title": "Referent/in Strategische Unternehmenskooperationen Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at World Wildlife Fund (Berlin) in May 2015", "Interview Descriptions": "Es handelte sich um ein erstes Gespräch mit der potentiellen Vorgesetzten und einer Personalmitarbeiterin. Die Atmosphäre war locker, freundlich und angenehme. Es entwickelte sich ein richtiges Gespräch mit der potentiellen Vorgesetzten, in den es dann auch hauptsächlich um die Stelle und Fachfragen ging, z.B. zum Thema was sind mögliche Kooperationspartner, warum und wie würden Sie sie angehen. Leider habe ich nach mehr als 2 Monaten trotz Nachfrage immer noch nichts gehört.", "Interview Questions": "Sind Sie ein Teamplayer?"}, {"date": "17 Jun 2015", "title": "Communications Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2+ months. I interviewed at World Wildlife Fund in Apr 2015", "Interview Descriptions": "The process seemed abnormally long given the type/nature of the position. It was broke into a phone, panel, and six-hour round robin with the staff in the office, field, and headquarters.There was also a timed writing test, timed strategy scenario, and filling out their online application. I was selected as one of two finalists but ultimately wasn't offered.", "Interview Questions": "How to adhere to WWF's mission and national stakeholders without creating messages that disengage local audiences. "}, {"date": "5 Jun 2015", "title": "Programmer Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at World Wildlife Fund (Washington, DC) in Feb 2015", "Interview Descriptions": "The process consisted for this position consisted of an initial intake interview with both program and HR staff via Skype involving a presentation.  Two follow up interviews were scheduled over a series of several weeks with progressively more senior program staff.  Lots of opportunity to ask questions and learn about program and culture but some delays in hearing from the HR staff which may have been a result of their process.", "Interview Questions": "How would I approach management of existing staff members?"}, {"date": "31 Dec 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at World Wildlife Fund (Seoul) in Dec 2014", "Interview Descriptions": "1. Fit interview with the team manager in Korean, mostly about background check. Asked about personal experiences, motivations, and future expectations about the internship. 2. Fit interview with the Chief Representative in English which was conducted via Skype since the representative was on the overseas business trip. Also for background check as well as examine English proficiency, as it was one of working language of the organization.", "Interview Questions": "Why do you want to work with us; How proficient are you with MS office programs; What would you do if you should promote a new campaign for environmental preservation near at the city you are living in"}, {"date": "15 Sept 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Wildlife Fund (Washington, DC)", "Interview Descriptions": "Applied online directly to a program officer, was contacted about 1 week later indicating that they would like to set up an interview. I was unable to interview in person, so we had a skype interview. Initial questions were standard- walk me through your education and experience, why are you a good fit for this role, why do you want to work for WWF, how can you be an asset in this role, etc. Many technical questions about familiarity with programming languages, GIS, coding skills, data analysis skills.", "Interview Questions": "How do you think you can handle the challenges of facing corporate partners to WWF and trying to get them to adopt environmental practices that are not necessarily profitable for their businesses?"}, {"date": "13 Oct 2015", "title": "Marine Science Capacity Building Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Wildlife Fund (New Canaan, CT) in May 2014", "Interview Descriptions": "The process was surprisingly short and simple. I received an email to schedule a phone interview, which lasted about 30 minutes. A few days later I received another email asking for a follow-up phone interview, which lasted about the same. I spoke to the same person both times, and after the second interview I got an email offering me the position. This process was very unusual and lax for WWF but it was because they quickly had to fill the job.", "Interview Questions": "Why do you want to work for WWF?"}, {"date": "2 Oct 2014", "title": "Program Associate/Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at World Wildlife Fund (Bozeman, MT) in Apr 2014", "Interview Descriptions": "I applied online and received an email from the Human Resources Department about a month later saying that I had made it to the next pool of applicants. First there was a phone interview with an HR rep who asked me pretty standard interview questions as well as a couple on my interest in this particular job. Her questions, however, did not get into the nitty gritty of the position or my skills/background. In other words it was a pretty basic HR interview to make sure I wasn't crazy.\r\n\r\nI then had a Skype interview with three higher level people based where the job would be, and they asked much more in depth questions related to my expertise and the position.\r\n\r\nThis interview was followed by a writing sample and an in person interview with someone from the local WWF office. A day after the in person interview I was offered the position.\r\n\r\nOverall, I thought it was a good interview process. They did put me through the ropes a bit, but considering how many people want to work for WWF that was no surprise. And despite the many steps involved, the process was rather quick from when I had the first interview with the HR rep to when I was offered the position (~10 days).", "Interview Questions": "There were several questions specific to the region I work on that were certainly not unexpected but were difficult to answer. "}, {"date": "25 Nov 2013", "title": "Development Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at World Wildlife Fund", "Interview Descriptions": "Phone interview with a recruiter and then an in person meeting with the hiring managers and members of the team.", "Interview Questions": "Nothing unexpected. "}, {"date": "19 Sept 2013", "title": "Field Programs Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Wildlife Fund", "Interview Descriptions": "I sent in my resume for the position and had a phone interview with the program associate. The interview was short with basic, straightforward questions.", "Interview Questions": "Nothing difficult or unexpected"}, {"date": "12 Nov 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 months. I interviewed at World Wildlife Fund (China, NY) in Jul 2013", "Interview Descriptions": "Phone/skype interview.  WWF was always at least 15 minutes late for the interview.  I had to send emails asking if the interview would take place as scheduled.  There was a lot of focus on one's background rather than on applicant's ideas for the job which would have been more appropriate for a director position.", "Interview Questions": "Expected salary"}], [{"date": "9 Mar 2017", "title": "Finance Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at World Wildlife Fund (Geneva) in Jun 2013", "Interview Descriptions": "First, I sent the application, then I got called up for interview by a nive american woman called Mary-ann. Then I had a panel inteview with three women intervieweing me, the head of project management, head of fince dep and the woman that would be in charge of me and I got the job.  The interview process lasted for a few weeks, but this was essentially only a summer finaance assistance job to help out before the publishing of the annual report. After the interview I was called a few days later and they told me I had gotten the job.  Prior to getting there I had to sign a bunch of papers for regulations etc. Since I was already based in Switzerland I had all the numbers and social security stuff that was required, but it should be quite straight forward.", "Interview Questions": "Why I had written a story and if I liked stories?"}, {"date": "2 May 2013", "title": "Senior Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at World Wildlife Fund", "Interview Descriptions": "ordinary hiring process: online job post; submit resume; 2~3 round interviews. \r\nEnglish proficiency is a must, while many new employees have internal reference. \r\nHR will go through all resumes and select 1/3 of them, this might be the most uncertain part of the recruiting process. Therefore, try to get in touch with some existing staff and get his email reference to HR will be very helpful. \r\nInterviews will be conducted by line managers of the position. Prepare well for WWF's brand, its brief history, what it's doing in China and globally. Managers do not expect you to have NGO background, but English, Biology, Energy, Marine or related major will be preferred depending on different positions. Be passionate about non-profit work and show your love for nature.", "Interview Questions": "no big question during interview. However, you may want to think clear about your own career track. NGO job market in China is far from mature, WWF can be the best employers you will meet in this field for next 5 years. Be prepared. "}, {"date": "9 Feb 2013", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Wildlife Fund (Washington, DC)", "Interview Descriptions": "I submitted a cover letter and resume for the position online after viewing postings on the WWF website. I heard back about a week later from my prospective supervisor asking if I was available for a phone interview. The questions were pretty simple - why did I want to work for WWF, how would the internship fit into my career plans, could I elaborate on my resume and relate it to the job description...\r\n\r\nWWF is also very careful to try to hire interns who receive credit and, when possible, funding from their school. The double checked on this after my interview, asking me to send confirmation that I would receive academic credit for my internship. \r\n\r\nI was offered the position a week later.", "Interview Questions": "Why do you think you will be successful at this job?"}, {"date": "19 Mar 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Wildlife Fund (Cali, Valle del Cauca) in Jan 2013", "Interview Descriptions": "Interviw panel 5 persons, each one with 2 questions about my work expirience and some behavioural questions. The interview process was very ease, people were kind and also attentive to the answers.", "Interview Questions": "What values dou you think are important in a job?; What will you bring to this job?; What makes you a chosen candidate?; Where are your short term goals?\r\n"}, {"date": "12 Apr 2016", "title": "Development Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at World Wildlife Fund (Washington, DC) in Jul 2012", "Interview Descriptions": "The process was very fast (less than 2 months) but that's relatively rare. It included meetings with the hiring managers, the team, and HR; writing sample; background check and references.", "Interview Questions": "I was asked to share experience of working with international field offices and managing difficult discussions."}, {"date": "19 Jul 2012", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at World Wildlife Fund in Jul 2012", "Interview Descriptions": "the process is  very simple. all you have to do is take forms and fill them with your correct bio data, then the applicant sends in his entry and then waits for approx 2 months. the organization itself allows for conveying its methods and activities around the world. all you hav to do then is to attend the internship", "Interview Questions": "about the choices you make"}, {"date": "1 May 2014", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at World Wildlife Fund (Washington, DC) in May 2012", "Interview Descriptions": "I had four interview for this position: one phone interview with a HR representative, one in-person interview with the employees who I would work with (who would train me), one with the manager I would be supporting, and then one final interview with my manager (since he had a difficult decision between me and the runner-up).", "Interview Questions": "The most difficult decision was to explain why I would be more qualified and better than other candidates."}, {"date": "24 Jul 2015", "title": "Senior Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Wildlife Fund (Washington, DC) in Feb 2012", "Interview Descriptions": "1. First interview with HR assistant to check overall fit with position. \r\n2. Interviews with topical experts and program lead to have a more focussed discussion. Deep-dive on previous professional experience, technical knowledge for the job, related fields of expertise.\r\n3. Interview with international program lead to finalize fit for position.", "Interview Questions": "Why did you choose to apply at our organization?\r\nWhy are you passionate about this job?\r\nHow will your contribution to this job make a measurable difference?"}, {"date": "31 Aug 2011", "title": "Web Content Editor and Web Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at World Wildlife Fund (Reston, VA) in Aug 2011", "Interview Descriptions": "I submitted my resume via their website and didn't hear anything for about a month.  I then got a call from a very excited WWF HR staffer who gave me a 20 minute phone interview.  She arranged an in-person interview between the hiring manager and me for that same week.  \r\n\r\nI interviewed on a Friday, and the workplace definitely seemed both casual and quiet.  The Reston campus is beautiful, which is part of the reason I was interested in a position with WWF.  The hiring manager explained that the resume review and interview process was taking so long because she was covering the tasks of three positions until she could fill two of them.  \r\n\r\nThe hiring manager/webmaster was very friendly and seemed knowledgeable about web development and web content in general, and about the weaknesses of the WWF website and web content generation and review process in particular.  The interview itself took about an hour, during which she asked me numerous questions about programming languages and tools I've worked with, my writing and editing style, research and content development, and work and management styles I liked or disliked.   I felt that she was very honest about what would be expected of a new hire in the position and what WWF offers its employees.  \r\n\r\nAs interested as I was in the position itself and in the work the WWF does, the salary offered for the job seemed very low for the region and for the level of experience and knowledge they were looking for.  The job would have required me to take a sizable pay cut--and I do mean sizable--the top of the salary range offered was about $30,000 less than I currently make a year.   They were shooting for a web content manager/web developer with about 10 years of experience and with university training and certifications in the field.  I understand and non-profits pay less on average than for-profit corporations, but the salary range seemed inordinately low for the sort of person they wanted to hire.", "Interview Questions": "How will you gather, edit, build, and post content from such a large variety of content providers without a solid style guide or content review process in place.  "}, {"date": "21 Aug 2015", "title": "U S Government Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Wildlife Fund (Washington, DC) in Apr 2011", "Interview Descriptions": "I applied online and was emailed within a few weeks about scheduling a interview. The interview consisted of basic questions about why I wanted the position, why I chose to apply to WWF, what I wanted to do post-graduation.", "Interview Questions": "What interests you about this position?"}], [{"date": "13 Dec 2010", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at World Wildlife Fund (Toronto, ON) in Jun 2009", "Interview Descriptions": "typical hiring process - questions geared towards explaining how my past experience directly would benefit their current organization. They really wanted to know if I would fit into their organization culture. They also drilled me extensively on my knowledge of medium and long term goals that the organization was involved with, so I had know a lot about the organization and their developed plans.", "Interview Questions": "How did you creatively solve a problem?"}]]