[[{"date": "25 May 2023", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "It went well for the first time just like other academic interviews. Formal but not very strick. Had a chance to discuss my papers. And had some time to provide q and a", "Interview Questions": "Future plan, skills, teaching plan"}, {"date": "13 May 2023", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "You will speak with potential advisors and current students regarding fit, skills, research interests, etc. in both casual and formal settings. There are no set questions, just determining the right fit.", "Interview Questions": "What are you research interests?"}, {"date": "8 Apr 2023", "title": "Writing Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "Met with the director for a 20-25 minutes interview. Everyone there was really nice, and the interview was not bad. You have to prepare to edit and give feedback on a sample paper for the interview", "Interview Questions": "Tell us about your interest/experiences in tutoring"}, {"date": "2 Mar 2023", "title": "Graduate Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "There was no interview process. Just have good grades and apply. Sometimes the offer is given to people who enter the phd program with funding, and sometimes it is given to people who apply and have a strong academic record.", "Interview Questions": "There were no interview questions"}, {"date": "27 Mar 2023", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at George Mason University in Mar 2023", "Interview Descriptions": "Was sent an email asking for a 45-minute panel interview. They asked me about eight in-depth questions about my job history and my values. They then asked me if I had any questions for them and the interview wrapped up in about 30 mins.", "Interview Questions": "How would you promote diversity in a college setting?"}, {"date": "11 Jan 2023", "title": "Research Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "The interview was thorough and required the applicant to do a performance assessment. If the applicant performed at the top of the rest s/he was pushed forward to the final interview.", "Interview Questions": "What made me want to work with them and for this position"}, {"date": "8 Jan 2023", "title": "Asst. director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "Very behavioral questions asked. Often interviews in rounds and by panels. Practice beforehand. I have nothing else to add here. Very behavioral questions asked. Often interviews in rounds and by panels. Practice beforehand. I have nothing else to add here.", "Interview Questions": "Tell us about a time"}, {"date": "5 Jan 2023", "title": "Senior Resident Advisor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "I applied for the Senior Resident Advisor position at my university by submitting a resume and cover letter. A few days later, I received an email inviting me to participate in a phone interview with a member of the residence life staff. During the phone interview, I was asked questions about my previous leadership and customer service experience, as well as my reasons for wanting to be an SRA. A few days after the phone interview, I was invited to participate in a group interview with other candidates for the position. The group interview involved a discussion about a hypothetical scenario and how we would handle it as SRAs. We were also asked questions by the interviewers about our past experiences and how they prepared us for the SRA role. After the group interview, I was invited to participate in a one-on-one interview with a member of the residence life staff. This interview was more traditional, with questions about my strengths and weaknesses, my approach to problem-solving, and my communication skills.", "Interview Questions": "Describe a time when you had to handle a difficult situation with a resident. How did you approach the situation and what was the outcome?"}, {"date": "17 Feb 2023", "title": "Career Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at George Mason University in Jan 2023", "Interview Descriptions": "My interview was over Zoom. I first met with the search committee of 3 people for about 45 minutes, then the direct supervisor of the position for another 45 minutes. Overall, the questions are pretty typical of what you would expect of a student affairs job interview.", "Interview Questions": "How would you describe your ideal working environment?"}, {"date": "16 Dec 2022", "title": "Access Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at George Mason University (Chesapeake, VA) in Nov 2022", "Interview Descriptions": "I was selected for a first round interview via zoom. I prepared and made sure I was in a suitable environment for an interview. The interview started 20 minutes late, was immediately turned from a video interview to voice/phone only and one member was extremely late. I received no feedback when I answered or asked questions. I believe that a candidate was already chosen, prior to my interview. I pulled my application the same day.", "Interview Questions": "How do you communicate with others?"}], [{"date": "10 Feb 2023", "title": "Disability Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at George Mason University (Fairfax, VA) in Nov 2022", "Interview Descriptions": "The application process was easy through their online platform where I uploaded my resume and cover letter. Approximately one month after submission, I received and email from their Search Coordinator notifying me that I had been selected as a candidate. In the email I was given several times and dates for a first round interview via Zoom. The email also included the pay range for the position. It was below my expectations, but I scheduled the interview to see if the position was a good fit for me.", "Interview Questions": "Although I logged into the Zoom meeting on time, the interview started about 20 minutes late with several GM team members still missing. The Coordinator immediately informed me that the zoom session would be conducted like a phone interview and that I should turn my camera off. The other interview panel members joined several minutes later and each began asking me questions relevant to the position and my experience. The questions were vague and open ended. When I asked for clarification of a question, I was told to answer it any way I like. I could not see their faces, so I had no idea if I was responding appropriately. Their questions were generic and did not touch upon my professional experience or strengths."}, {"date": "27 Sept 2022", "title": "Summer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at George Mason University", "Interview Descriptions": "I had a 30 minute interview over zoom with two of the professors heading the research. There were only a few questions and the rest was casual conversation.  I received an acceptance maybe a week later.", "Interview Questions": "What type of marketing do you see regarding the subject of the research?"}, {"date": "19 Sept 2022", "title": "Student Part time worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at George Mason University", "Interview Descriptions": "Interview was very relaxed. They were direct, asked about experience, asked about goals, student involvement on campus. It's more of a personality interview to make sure you're not lazy/crazy. You apply for the job on Handshake, they email you, you schedule an interview in person/Zoom, they email you back.", "Interview Questions": "What is one area on campus that you're involved in?"}, {"date": "27 Aug 2022", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "Straight forward interview that focuses on the culture fit. Reading and writing comprehension was a must, especially in terms of communicating with other department heads. Some behavioral questions that followed.", "Interview Questions": "I was given a prompt and had to write an email on how I would respond."}, {"date": "24 Aug 2022", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "The interview took place in a face-to-face setting. The hiring personnel consisted of one of the various team leaders. The process began with a formal introduction, background experiences, and skills discussion. Then a series of questions related to handling patron situations to university policy.", "Interview Questions": "How would you handle a patron who is inquiring about checking their current transcripts  in regards to the transfer process? "}, {"date": "7 Mar 2023", "title": "MSW Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at George Mason University in Jun 2022", "Interview Descriptions": "There was one interview, and the interviewer spoke for the majority of the time. There were no no questions directed at the interviewee, and it was clear that the interviewer was desperate to get a candidate. They stated that they required Spanish fluency, but did not check that I had it.", "Interview Questions": "Do you want this position?"}, {"date": "25 Jul 2022", "title": "Video Editor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at George Mason University in Jun 2022", "Interview Descriptions": "1 Phone Screening - quick\nInterview 1 (with 1) - 30 mins\nInterview 3 (with 2) - 30 mins\nInterview 4 ( with 1) - an hour\nGot job offer after 2 weeks", "Interview Questions": "What is your strength?\nHow are you going to deal with ideas or press from outside of the department? \nWhat kinds of software are you comfortable with?\nTell me about your experiences relate to the position.\n"}, {"date": "26 May 2022", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at George Mason University", "Interview Descriptions": "Typical interview process within Higher-Ed: started with a screening call, followed by a phone interview with the search committee, followed then by an in-person interview on campus. Standard request for references.", "Interview Questions": "It was more of a conversation in the screening and final interview than questions. There were basic questions from the search committee that they were required to ask all interviewees based on internal processes. "}, {"date": "17 May 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at George Mason University", "Interview Descriptions": "First interview was a formal interview. They read questions from questionnaires and you answer them. The second one was a bit more informal. They ask questions to get to know you better.", "Interview Questions": "Why do you work at George Mason?"}, {"date": "29 Mar 2022", "title": "Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at George Mason University", "Interview Descriptions": "2 Rounds of Interviews. One phone interview and one in-person/virtual interview where I met with the search committee, other employees, and the department director. The second interview took half a day.", "Interview Questions": "Q: Why is diversity important to you?"}], [{"date": "6 Mar 2022", "title": "Undergraduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at George Mason University", "Interview Descriptions": "Once submitted the application, they gave me 2 finance questions and asked me to solve and go over those as I am helping students. I should record the videos while explaining.", "Interview Questions": "Solve these questions and explain your work"}, {"date": "7 Dec 2022", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at George Mason University (Fairfax, VA) in Mar 2022", "Interview Descriptions": "I applied online with a cover letter and resume. The interview was done through zoom. I met with a couple of people on the admin team. The interview was about 30 minutes long and felt more like a lengthy conversation rather than a standard intimidating interview.", "Interview Questions": "What skills can you contribute to this company?"}, {"date": "26 Feb 2022", "title": "Events Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "Short, informal, causal. Very relaxed, depending on your interviewer though. Hard to prepare for but just be ready to talk about yourself, you previous experience and ask questions. Be attentive and engaged and you will be okay.", "Interview Questions": "Why are you interested in events and special operations?"}, {"date": "7 Feb 2022", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "There was a panel of five different faculty advisors that asked a standard set of questions. The interviewers asked questions for about 15 minutes and then gave me time to ask them questions and to specify what areas of research I was interested in.", "Interview Questions": "What previous research experience do you have?"}, {"date": "7 Jan 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "It was really simple and straightforward, talked a lot about points on my resume. Would recommend reading up on specific departments. I really enjoyed my interview process, it was quick.", "Interview Questions": "What was your most recent position?"}, {"date": "15 Dec 2021", "title": "Director of Development Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "a very structured process that included phone calls, face to face and a final face to face with nearly everyone in the college.  Mason is a state entity and must follow state protocols", "Interview Questions": "Can you explain your approach to fundraising."}, {"date": "15 Nov 2021", "title": "Video Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "Asked questions regarding Adobe suite to measure your capabilities. Some questions regarding your work ethics and personality but for the most part just questions about how to navigate different Adobe softwares", "Interview Questions": "How do you export a psd as a pdf?"}, {"date": "18 Dec 2021", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at George Mason University (Fairfax, VA) in Aug 2021", "Interview Descriptions": "Was invited to a zoom interview which was actually a panel interview! The committee did not appear to have read my resume because the chair gave me an \"introduction\" to Mason (I'm an alum).  I was surprised when I was contacted initially I wasn't informed my first interview would be with four people on a committee.\n\nI was then invited to participate in: 1 meeting with an unrelated supervisor, 1 meeting with the actual supervisor, 1 meeting with the department's staff, an \"editing exercise\" and another interview with the same committee. Oh and I had to give a presentation to \"various stakeholders across campus\" which felt to me like free consultation for the University.\n\nI'm selecting \"Very Difficult\" for the interviews--because I had five interviews and a presentation for an AD job at a University! (This is not Apple!) I had to put in so much work over two days  (interviews were back to back)--which did not even result in a final decision from GMU. \n \n That's right, they never sent me a final decision after all of the work I put in (as well as giving them free ideas on how to shore up a specific pool for their diversity goals).  Found out they hired someone with way less experience through LinkedIn. Why would you treat a finalist for a job like that?", "Interview Questions": "General questions with no specifics related to my resume or skills. One person in the committee actually left the interview early, which was pretty insulting. They were definitely keen on finding out about how I met successes at my current job and again, felt like they were seeking out free consultation. Just all around incredibly disappointing!"}, {"date": "1 Sept 2021", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at George Mason University (Fairfax, VA) in Aug 2021", "Interview Descriptions": "Informative, semi-informal atmosphere but still really friendly. The interview style was flexible, and it was easy to communicate with the Professors and staff.  Like most institutions the contract paperwork will take a few weeks.", "Interview Questions": "How do you feel about teaching adults?"}, {"date": "11 Jul 2022", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at George Mason University (Washington, DC) in Aug 2021", "Interview Descriptions": "The process took several weeks, included requirement of preparing a presentation for second round interview (fine) but did not inform ahead of presentation that an open invitation was sent to department members to attend. More than 20 unexpected attendees for presentation. No follow up call to inform me that offer would not be issued. Rude, disorganized, and a waste of time.", "Interview Questions": "Standard questions related to strengths and weaknesses, student affairs, etc."}], [{"date": "8 Sept 2021", "title": "Database Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at George Mason University (Fairfax, VA) in Jul 2021", "Interview Descriptions": "There is an interview panel including the supervisor and a current employee. The questions range from relevant job experience to personality. They provide an overall welcoming environment and allow you the opportunity to ask questions as well.", "Interview Questions": "Strengths, Example of attention to detail and accuracy, Definition of responsibility"}, {"date": "25 Jun 2021", "title": "Graduate Teaching Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at George Mason University", "Interview Descriptions": "Interviewed for IT 109 and 209.\nThe interviewers are pretty chill, They asked questions about lists, dictionaries, how to create classes and objects. A question was asked on list comprehension and one question was on to create a list using the keys in dictionary. It was all basic python questions.", "Interview Questions": "Create class, object. class the class using the object and create a constructor. \n"}, {"date": "8 Apr 2021", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at George Mason University", "Interview Descriptions": "Very friendly, professional individuals. Ask you REAL questions and show interests in who you are as a person. They respond in a timely manner and provide you with as much information as possible about the position.", "Interview Questions": "What are you hoping to accomplish/be at within the next 5 years?"}, {"date": "11 Mar 2021", "title": "Community Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "Choose a position you want to apply for, whether that be a CA or an RA. Then you need to be selected for an interview. After you have an interview you then will be instructed if you receive an offer or not.", "Interview Questions": "What is the proper protocol when calling up for an incident? "}, {"date": "28 Jan 2021", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "the interviewer was very kind and friendly. first, always, tell me about yourself. and then the interviewer would like to know more about my past working experiences and any takeaways from certain job.", "Interview Questions": "tell me about a time when you failed. "}, {"date": "13 Jan 2021", "title": "UTA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "There was no interview to become an undergraduate teaching assistant. If you got an A in the class, and you have a good recommendation from a professor you should be good to go.", "Interview Questions": "No interview for this position"}, {"date": "12 Jan 2021", "title": "Social Media Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "I can't say enough good things about the people I interviewed with. They all appeared to genuinely enjoy their jobs and were all very friendly to me. The review as fully remote due to COVID-19, so I only met them via video call (my video was required to be turned off to avoid any sort of bias), but they were all very easy to talk to and interact with. Kudos to GMU to hiring what appeared to be a solid staff.\n\nI think my biggest disappointment in the interview was the fact that all of the questions were very scripted and \"by the book\" as far as interviews go. I don't mind a few of the cliché questions every now and then, but everything felt like they were just reading canned questions rather than trying to get to know me as a person.", "Interview Questions": "Why do you want to work at George Mason University?\n"}, {"date": "8 Jan 2021", "title": "Records Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "There was only 1 interview, I didn't get a call back for almost 3 weeks, I had to follow up repeatedly. Even after accepting the offer it took almost 4 months to get hired", "Interview Questions": "How do you balance cooperation with others and independent thinking? Share an example.\n"}, {"date": "14 Jun 2022", "title": "COVID-19 Response Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at George Mason University (Fairfax, VA) in Jan 2021", "Interview Descriptions": "Went back and fourth through e-mail with HR before they scheduled me for a phone interview. Took about a month to get an email after I first applied. Talked for 30 minutes. The process can take awhile. There are a lot of steps for the on-boarding and hiring process.", "Interview Questions": "Why am I interested in this job? Do I work well with others? What are my thoughts on teamwork? Am I flexible with hours if they change?"}, {"date": "10 Jul 2021", "title": "Senior Video Producer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at George Mason University (Fairfax, VA) in Jan 2021", "Interview Descriptions": "Overall, an odd process. Two months after applying, I get an interview and during that interview they tell me that if I make it to the second round, then that round would probably start two months from that date. Luckily, the second round ended up taking place about 2 weeks later. As part of the process they had you create a presentation showing how you'd pursue a video project. Afterward there was radio silence until an automated rejection email two weeks after that. From when I applied to when I was rejected was 3.5 months.", "Interview Questions": "Explain your process when producing a video. "}], [{"date": "29 Sept 2020", "title": "Senior Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at George Mason University (Fairfax, VA)", "Interview Descriptions": "Two virtual interviews. Both were panel interviews. The second interview involved a case study and I was only given 45 minutes to complete it which was impossible given the amount of data and a slide presentation was expected. I thought I did ok given the time constraints but I had to fight everything in my being not to redo the case study the next day so that I could accurately reflect what I bring to the table. I was told I would hear back in a week but got an email two weeks later saying decision was coming soon. I then waited another month and when I emailed to check in, I was informed the position had been filled. It still shows as pending in their system and no feed back was given. I spent three hours over two interviews and waited nearly 6 weeks and I had to follow up to find out I had been rejected. It’s incredibly frustrating to the job seeker when there is no communication and while I understand covid makes things difficult, it is also difficult and stressful on the applicants end. I just thought the whole thing was not handled well and I encourage the university to improve their process so no one else has to endure this level of stress. I am disappointed, but what makes rejection harder is the not knowing because of lack of communication.", "Interview Questions": "Describe a situation where you implemented a business process improvement."}, {"date": "18 Aug 2020", "title": "Executive Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "Zoom interview with the other administrative staff in the office. Questions revolved around direct experience with the work, soft skills. Interview was on the shorter side and did not leave time for questions from interviewee", "Interview Questions": "What skills are important for working with senior leadership?"}, {"date": "6 Jun 2021", "title": "Project Management Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at George Mason University (New York, NY) in Aug 2020", "Interview Descriptions": "Full day. Lunch provided, a lot of interesting people. Met with potential coworkers as well as client departments for campus planning services.  Met with several panels for questions and answers.", "Interview Questions": "Asked about past project experience. Approaches for project management. Familiarity with campus."}, {"date": "22 Feb 2021", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at George Mason University (Fairfax, VA) in May 2020", "Interview Descriptions": "The interview began with the question \"tell me about yourself\" and asked traditional interview questions. Because the assistantship had a well-being focus, the interviewer asked me about my definition of well-being and work ethic.  The interviewer also asked me to go into greater detail about my resume.", "Interview Questions": "What did you learn from your previous student wage jobs at the university?"}, {"date": "12 Mar 2020", "title": "Tech Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at George Mason University", "Interview Descriptions": "It was mostly easy fro me, 2 rounds and hardware round too. 1st round on phone. 2nd round was in person and i.e. when they also took the hardware round.", "Interview Questions": "tcp\r\nip config\r\nmake the computer work\r\n"}, {"date": "4 Feb 2020", "title": "Speech Instructor, Summer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at George Mason University", "Interview Descriptions": "speedy process, phone interview and acceptance. Think they were short on time and needed to make decisions fast which contributed to my fast hire. A Title IX scandal encouraged them to they to lock up talent without making it too difficult for us to commit for the program.", "Interview Questions": "How do you see this relating to your long term goals."}, {"date": "12 Sept 2020", "title": "Assistant Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at George Mason University in Feb 2020", "Interview Descriptions": "Lots of detailed questions about previous employment. Strengths and weaknesses. The interviewers were very nice. I would recommend this company to others looking to work in the education field", "Interview Questions": "Why did you leave your previous job? "}, {"date": "8 Aug 2020", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at George Mason University (Fairfax, VA) in Jan 2020", "Interview Descriptions": "Emailed back and forth to make an arrangement for an in person portfolio presentation. After the portfolio presentation, I got an email within the next week to accept the position.", "Interview Questions": "Describe your work and your process"}, {"date": "13 Apr 2021", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at George Mason University in Jan 2020", "Interview Descriptions": "They asked several questions based on my resume. It was questions you would expect to be asked, nothing too out of the ballpark. They look for research interests aligning with your department's focus.", "Interview Questions": "What research experience do yo uhave?"}, {"date": "14 Mar 2022", "title": "Resident Advisor (RA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at George Mason University (Fairfax, VA) in Dec 2019", "Interview Descriptions": "It is a panel interview so making sure to keep your attention to everyone on the panel is important. Eye contact can speak volumes and having a positive attitude seems to be a great way to keep the conversation light.", "Interview Questions": "Describe a conflict and how you resolved it."}], [{"date": "5 Sept 2019", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at George Mason University", "Interview Descriptions": "I applied through the university's online job portal and received an email. I was contacted by the supervisor of the lab and came in for a chat to their office. Overall, it was a relaxed and talkative environment. The supervisor briefly described the goal of the lab and the responsibilities that a hired candidate would have.", "Interview Questions": "Tell me about yourself"}, {"date": "19 Mar 2022", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at George Mason University in Sept 2019", "Interview Descriptions": "After submitting the online application, qualified candidates will be invited for an in-person interview. It depends on the department but qualified candidates will be interviewed by the search committee (3-4 individuals) and then interviewed by the department head.", "Interview Questions": "What is your role when working in a team?\r\nHow do you define your leadership and supervisory style?\r\nWhat new ideas or initiatives would you bring to the organization?"}, {"date": "12 Mar 2021", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at George Mason University (Fairfax, VA) in Aug 2019", "Interview Descriptions": "It was very Easy for me. First, I had a Phone Interview, where I was asked all Technical questions, once that was all clear then I had a Presentation where my vocab, English fluency was tested.", "Interview Questions": "All related to Technology and handling students "}, {"date": "18 Apr 2023", "title": "Classroom Technician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at George Mason University (Fairfax, VA) in Aug 2019", "Interview Descriptions": "Applied for interview through GMU's hiring site. Was contacted within a week and the interview was set up for the week after. The interview took place in a small office with one team member conducting the interview.", "Interview Questions": "Do you know what these different types of cables are and what they do?"}, {"date": "15 May 2019", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "Easy. No major problems. First phone call interview then a panel interview that takes about 30 minutes. Its a piece of cake for anyone who does it. Good luck to all who go through it!", "Interview Questions": "Why do you see yourself working here?"}, {"date": "9 Jan 2023", "title": "Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at George Mason University (Fairfax, VA) in Feb 2019", "Interview Descriptions": "Apply and if seelcted face a committee after hiring manager. Process is alaways through the HR site, got a call from them and was given a couple of time windows for interviews.", "Interview Questions": "Have you ever been in the situation where you have to report a coworker for some wrong doing?"}, {"date": "24 Feb 2021", "title": "Child Development Center Teacher Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at George Mason University (Fairfax, VA) in Jan 2019", "Interview Descriptions": "Just asked some very basic interview questions such as your experience with kids, how did you get along with your previous co-workers, your value about early childhood education, and your future plans.", "Interview Questions": "Do you have any experience with working with kids from 3 to 5?"}, {"date": "7 Dec 2018", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at George Mason University", "Interview Descriptions": "Read interview questions ahead of time so you can prep with confidence. Did you recently interview? Share what it was like. We review and approve every  submission against our Community Guidelines before it is published to the site. Share your interview experience insights with job seekers so that they can know what to expect from the hiring process", "Interview Questions": "Any weaknesses?  Share your interview experience insights with job seekers so that they can know what to expect from the hiring process?"}, {"date": "26 Sept 2022", "title": "Communications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at George Mason University in Nov 2018", "Interview Descriptions": "Very organized. The interviewers all have to take notes so it was like 5 people writing at the same time. They had an organized list of questions. It went by smoothly.", "Interview Questions": "Experience connected or not to the role."}, {"date": "1 Dec 2021", "title": "Event Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at George Mason University (Fairfax, VA) in Oct 2018", "Interview Descriptions": "Applied online, Interviewed with manager and student lead, answered questions about work ethic, resume, etc. Very friendly and professional environment. Difficult to find the main office in the Johnson center.", "Interview Questions": "Can you manage working in under a hurry up and wait fashion?"}], [{"date": "11 Sept 2018", "title": "Resident Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at George Mason University", "Interview Descriptions": "Group interview for team building, phone interview, interview with students, and one on one interview. Phone interview talked about past experiences in different roles in student life. Interview with students was about how you would be as a resident assistant. Team building was with other resident assistants and how you would work in a team.", "Interview Questions": "What was one moment you changed a student's life?"}, {"date": "26 May 2019", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at George Mason University (Fairfax, VA) in Aug 2018", "Interview Descriptions": "Applied Online. After the basic screening process. I got called for an interview wherein I was questions based on my resume and python. Was asked about my prior teaching experience.", "Interview Questions": "Basics of Python."}, {"date": "26 Nov 2018", "title": "Living Learning Community Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at George Mason University (Fairfax, VA) in Jul 2018", "Interview Descriptions": "I found the job on their HR site and applied online. I then had a phone interview and an on campus interview. I was one of 4 candidates invited to campus to interview and was 1 of 2 internal candidates.", "Interview Questions": "Tell us about your experience working with Living Learning Communities."}, {"date": "7 Jun 2018", "title": "TA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at George Mason University", "Interview Descriptions": "i had to go and apply on the university website. After my resume was picked i was called for an interview with the concerned faculty member. My interview lasted about half hour and got the offer the same day.", "Interview Questions": "Why do you want to work here ?"}, {"date": "15 Jul 2018", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at George Mason University in Jun 2018", "Interview Descriptions": "Web interview screening was conducted first then in-person interview followed two weeks later.  The in person interview was full day on campus was the search committee and two other panels.", "Interview Questions": "Typical interview questions regarding systems, supervision, and leadership."}, {"date": "12 May 2018", "title": "Graduate Professional Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at George Mason University (Fairfax, VA) in May 2018", "Interview Descriptions": "I met with the director and assistant director for the department I was interviewing for. The director was great, but the assistant was fairly rude and I felt that she was mocking some of the answers I provided during the interview. For a graduate professional assistant interview, I had expected more tact and professionalism than I experienced. The questions were very common behavioral questions; nothing situational and nothing technical.", "Interview Questions": "Describe a time when you set a goal for yourself and the steps you took to achieve it"}, {"date": "19 Apr 2018", "title": "GTA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at George Mason University", "Interview Descriptions": "I interviewed in person at the university and had to bring in my laptop to demonstrate how to use the three different program for the course that I applied for. Also, explain experiences and projects I did in the past.", "Interview Questions": "In specific case scenario, can you use the software to address this issue."}, {"date": "8 Dec 2020", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at George Mason University (Fairfax, VA) in Apr 2018", "Interview Descriptions": "2 part process: 1 seeing how you interact in a group with other candidates and leadership capabilities, 2 a personal interview with Resident Directors. 2nd interview was a lot of behavioral interview questions. How would you respond to a certain situation, etc.", "Interview Questions": "How would you explain the RA position to a family member or person who was unaware of what it was?\r\nHow can you be more inclusive as a RA?"}, {"date": "25 Feb 2021", "title": "Manager On Duty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at George Mason University (Fairfax, VA) in Apr 2018", "Interview Descriptions": "The interview process at the RAC was amazing and so fun! We played lots of games to determine your type of leadership style and it was even more fun when I got to be on the other side!", "Interview Questions": "1 minute speech on any topic!"}, {"date": "11 Mar 2018", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at George Mason University", "Interview Descriptions": "Asked about previous research experiences. What research interests you have. Why you want to do research. Prepare general questions about your resume and what your long term goals are. Questions are as expected.", "Interview Questions": "Why research"}], [{"date": "11 Jan 2018", "title": "Administrative and Office Specialist III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at George Mason University (Fairfax, VA)", "Interview Descriptions": "I heard from hr about a week after applying. Interviewed a week after that and heard back about a month later. (I interviewed right before their winter break) The interview process was standard for government jobs: panel interview, standard questions about customer service, administrative experience, etc.", "Interview Questions": "Tell us about a time you had to deal with a difficult customer."}, {"date": "20 Mar 2019", "title": "Event Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at George Mason University in Jan 2018", "Interview Descriptions": "It is straight forward. Completing the application online, then there is the process of phone interview, once you are selected.  After the initial phone call there are in depth interview, where skills were discussed.", "Interview Questions": "they asked about my experience"}, {"date": "17 Nov 2017", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at George Mason University", "Interview Descriptions": "Questions were simple and mostly centered around long term goals. Professors are looking more to mentor and teach you, and will appreciate it if you have the desire to learn.", "Interview Questions": "What interests you in becoming an undergraduate research assistant?"}, {"date": "10 Jun 2021", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 6 weeks. I interviewed at George Mason University (Fairfax, VA) in Aug 2017", "Interview Descriptions": "The interview process was conducted virtually and was super friendly. It is highly recommend that you show interest in pursuing your Ph.D. to get the job. The professor with the funding is conducting the interview.", "Interview Questions": "Are you interested in pursuing your Ph.D. ? "}, {"date": "5 May 2019", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at George Mason University (Fairfax, VA) in Aug 2017", "Interview Descriptions": "first step of the interview process is calling for a 1 on 1 questioning, second step is they will run screening on  you, to check your background and thats it", "Interview Questions": "how can you help students perform better?"}, {"date": "24 Jul 2017", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at George Mason University (Fairfax, VA)", "Interview Descriptions": "Applied through the website and got a phone interview. Afterwards, I was invited to campus for an all day interview where I met with the search committee, office staff, students, and did a presentation for other administrators on campus.", "Interview Questions": "Received a triple barreled question around student identities and how I would advise a student."}, {"date": "14 Dec 2017", "title": "PR Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at George Mason University (Fairfax, VA) in Jul 2017", "Interview Descriptions": "Very quick in person interview. It was a really nice campus and the office was very clean. Once I was inside I was less nervous because there were not a lot of students around. Very professional.", "Interview Questions": "How do you take criticism?"}, {"date": "27 Jan 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at George Mason University (Fairfax, VA) in Jun 2017", "Interview Descriptions": "It was great -- I was able to ask many questions of the interviewers. They also seemed very interested in my work and did an accurate job in describing what the work would be like. I'm very happy that I took a research assistant position -- It has been one of the best decisions I've made as an adult.", "Interview Questions": "What do you hope to tell people you'll miss about this job once its time to leave?"}, {"date": "26 Jul 2021", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at George Mason University (Fairfax, VA) in Jun 2017", "Interview Descriptions": "Interview process was very smooth. I gave my availability and they were very accommodating to my schedule. Interview was with two supervisors. Intimidating at first, but they are extremely friendly and helpful. Interview was more casual than expected, and seemed like more of a formality than an intensive vetting. Just be yourself.", "Interview Questions": "Why do you think you are a good fit for the position?"}, {"date": "17 Oct 2017", "title": "Personnel Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at George Mason University (Fairfax, VA) in Jun 2017", "Interview Descriptions": "I applied online through the university's website. They require the application (obviously), if you are an interest, they will contact you by email for an in-person interview. I was interviewed by three interviewers. Once you are acceptable and they find favor in you, they will contact you again via e-mail for a second interview to meet the supervisor. Afterwards, it's just a waiting game of few days until they contact you through e-mail whether or not you have been offered the job.", "Interview Questions": "In your past experiences, how have you overcome any difficult trials and what measures did you take in order to achieve those?"}], [{"date": "14 Mar 2019", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at George Mason University (Fairfax, VA) in Jun 2017", "Interview Descriptions": "Wonderful detailed interview process where I met with my supervisor several times and then received scholarship and stipend and GTAship.  We went over work history, my motivations for teaching, what made me passionate about education, my goals as a professor and educator and researcher, and I got a wonderful mentor out of the process.", "Interview Questions": "What is your teaching philosophy?"}, {"date": "13 May 2017", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at George Mason University", "Interview Descriptions": "Three parts - phone, in person, and presentation. \r\nThe phone part was a panel of people, so it was difficult to get an idea of who was speaking. \r\nThe in person and presentation parts were also multiple people.", "Interview Questions": "They made sure to ask if I was willing to accept the salary range in the in person interview, before the presentation, and long before the part where I'd expect to discuss salary. "}, {"date": "31 Jul 2019", "title": "Graduate Resident Assist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at George Mason University (Manassas, VA) in Apr 2017", "Interview Descriptions": "The interview was on skype, but some people had in-person interviews. I received an offer within the same week of the interview. the questions were basic and easy to answer", "Interview Questions": "you conflict resolution style, ability o work in a team and independently, working with different personalities, programming ideas, past experiences, and skillsets?"}, {"date": "30 Oct 2018", "title": "Land Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at George Mason University (Fairfax, VA) in Apr 2017", "Interview Descriptions": "Interviewed with three people they were very kind they asked me about my experiences listed on my resume it was a casual conversation they were really nice. It lasted about 40 minutes and I felt really good and thought I got the job coming out.", "Interview Questions": "What is your proudest accomplishment?"}, {"date": "30 Jul 2021", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at George Mason University (Fairfax, VA) in Apr 2017", "Interview Descriptions": "The interview was multiple parts over multiple days. Candidates were assessed individually in a variety of group activities. Scores were given in different categories at the end and a subset of folks moved onto the next round, individual interviews. The individual interviews weren't too long and were relaxed.", "Interview Questions": "How would you handle a conflict where you witness one of your residents stealing?"}, {"date": "10 Feb 2017", "title": "Administrative and Office Specialist III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at George Mason University (Fairfax, VA)", "Interview Descriptions": "Brief phone interview with chair of search committee. Was called a few days later for an in-person interview with the search committee. Interview atmosphere was calm and comfortable. Committee was formed of peers in similar positions across campus.", "Interview Questions": "What experience do you have with administration?"}, {"date": "22 May 2017", "title": "GTA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at George Mason University (Fairfax, VA) in Jan 2017", "Interview Descriptions": "The process is pretty straight forward, phone screen, face to face round, sometimes one round, other times may be two. The process is pretty straight forward, phone screen, face to face round, sometimes one round, other times may be two.", "Interview Questions": "Why are you a good fit for this role?"}, {"date": "4 Jun 2018", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at George Mason University (Fairfax, VA) in Jan 2017", "Interview Descriptions": "A candidate for the position is selected based on Grade Point Average, The interview was mostly based on the communication skills and background in teaching courses to a large number of students.", "Interview Questions": "How are your teaching abilities"}, {"date": "3 Nov 2016", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at George Mason University", "Interview Descriptions": "Formal phone interview by committee followed by two week waiting period. Then was emailed to confirm that the salary would be enough before completing a all-day onsite visit with presentation.\n\nAfter going through the entire process which took about a month, they called and said they were pulling the position to make changes to the requirements of the job.", "Interview Questions": "Why do you want to work here?"}, {"date": "15 Jul 2016", "title": "Associate Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at George Mason University", "Interview Descriptions": "Applied online and called the day the position was closed. Scheduled a phone interview, not clear what they wanted during the conversation. Have a lot of experience but it seems like they knew who they wanted and were just going through the process for a formality. VERY COMMON.", "Interview Questions": "How is your experience relatable to this?"}], [{"date": "12 Oct 2020", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at George Mason University (Fairfax, VA) in Jul 2016", "Interview Descriptions": "There wasn't one to speak of. PhD students get these positions handed to them upon entry. Masters students have to work harder to get them. I would recommend teaching higher level courses as there is more freedom and the students (on average) become slightly more competent", "Interview Questions": "There were no questions asked to me."}, {"date": "9 Jun 2018", "title": "Yoga Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at George Mason University in Jun 2016", "Interview Descriptions": "This interview process was simple. They have a place to submit your application online. I also knew someone teaching with them at the time so I was able to make a connection with the management before submitting my application. I then exchanged a few emails and was asked in for an interview. The interviewer was kind and creative with her questions. We talked about detail and salary and I heard back with an offer within a few days time.", "Interview Questions": "What does hiring you bring to the table that no other instructor has before? "}, {"date": "8 Feb 2017", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at George Mason University (Fairfax, VA) in Jun 2016", "Interview Descriptions": "I mailed professor asking for a Graduate teaching assistant position for her course and then she took a Skype interview for 20 mins and asked some questions about my Major and about the course for which i had applied. Interview was very easy and I think she liked my profile.", "Interview Questions": "Questions regarding my Major, and regarding the course."}, {"date": "11 Aug 2016", "title": "Associate Director of Career Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at George Mason University in May 2016", "Interview Descriptions": "The interview process required a phone screening first, which lasted about 30 minutes. Then there was an in-person interview. First, I met with career development staff and then I met with other university employees like admissions counselors and academic advisors. Overall, I met with about 10 people in a panel format for the second round interview.", "Interview Questions": "What is your experience working with multicultural populations? "}, {"date": "6 May 2016", "title": "Collection Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at George Mason University (Fairfax, VA) in Apr 2016", "Interview Descriptions": "I applied online last February 2016 and got a call from the hiring manager for person interview last April 2016. I arrived at the university 10 mins before the interview time. There are 3 interviewers in the room, one is the hiring manager and 2 others from the department. There are 10 list of questions that you need to answer and explain briefly.", "Interview Questions": "How did your supervisor describe you?"}, {"date": "17 May 2016", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at George Mason University in Apr 2016", "Interview Descriptions": "I applied online and got a phone interview. Four admissions members were on the phone, asking me my background in admissions, why George Mason, my strengths and weaknesses, my favorite part of admissions/why admissions, and then some Q&A. pretty straightforward", "Interview Questions": "why GMU"}, {"date": "14 Apr 2017", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at George Mason University (Fairfax, VA) in Apr 2016", "Interview Descriptions": "Be confident, and don't undersell yourself. Experience is good, but values potential and enthusiasm, so do not be intimidated if many of the other candidates seem to be older or have more experience than you.", "Interview Questions": "N/A"}, {"date": "3 Mar 2016", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at George Mason University", "Interview Descriptions": "Phone screen, then in-person. Both were pretty brief and asked standard questions. Informal. Mostly what was on your resume. Met with a few of the analysts where they asked me questions about my background.", "Interview Questions": "What is your experience with handling large volumes of data?"}, {"date": "19 Feb 2017", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at George Mason University (Fairfax, VA) in Mar 2016", "Interview Descriptions": "It was a nice interaction with my professor. He asked about my experience in that particular field. We spoke about the projects I have worked on. Did not have a technical interview.", "Interview Questions": "About my previous work experince"}, {"date": "14 Jul 2016", "title": "Administrative and Office Specialist III Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at George Mason University (Fairfax, VA) in Feb 2016", "Interview Descriptions": "Overall, not a bad experience. The whole process took three months and communication was bad on their part. I got a phone interview one month after applying, then heard nothing for three weeks. Was sent an email to schedule an in person interview, no response from them for two weeks. By the time they got back to me I had accepted another offer at another company. Everyone I, eventually, spoke to was very nice, but they didn't seem to be in any hurry to move forward with the interview process. I would recommend applying if you have a job that you can stay with for the three month hiring process.", "Interview Questions": "What previous administration experience do you have?"}], [{"date": "23 Feb 2017", "title": "Library Desk Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at George Mason University (Fairfax, VA) in Jan 2016", "Interview Descriptions": "The process was fairly easy, normal questions about personality and character. For e.g. situations  dealing with multiple customers, experience with library services, multitasking, attending to responsibilities , etc. The decision was made in 2 week. This was a part time job.", "Interview Questions": "Experience with teaching and research?"}, {"date": "1 Apr 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at George Mason University (Fairfax, VA) in Dec 2015", "Interview Descriptions": "Interview was good ,initially they took my lab exam which was 2 hours long,it is a online exam and asked me to Packet tracer to create a lab.Lab exam was consist of three routers and two switches.I needed to configure RIP routing protocol after assigning a proper IP address to each and every interface.After passing the lab exam they called me for interview.In the interview they asked me about my work experience.", "Interview Questions": "What is RIP"}, {"date": "27 Jan 2016", "title": "Admissions Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at George Mason University in Nov 2015", "Interview Descriptions": "I got a call one fine morning calling for an interview in the school. There was the Manager and the team lead present when I was interviewed and was asked basic questions about my experiences in previous college, any administrative works, volunteering and some technical stuff. They were very friendly and asked about my interests and how did I feel taking classes in the school. The Interview went fine and I was told I would be contacted soon about my decision and I got a mail from the Manager in 2 days saying I was selected and they wanted to give me this offer at Mason as Admissions Assistant in the Administrative Department.", "Interview Questions": "What kind of experience have you had in your previous college"}, {"date": "22 Oct 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "Had to fill up a form in my department for GTA. The TA co-ordinator for the department looked at my application and grades for the previous semesters, and emailed me for the available position", "Interview Questions": "What courses have you taken so far and your availability for the semester"}, {"date": "19 Oct 2015", "title": "Peer Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at George Mason University (Fairfax, VA)", "Interview Descriptions": "First you have to have a professor recommendation for the position. Then you have to apply, including a writing sample of yours. For the interview, you're asked a few questions based on your resume, while the rest of the interview is an example tutoring sessions. Be prepared to talk about issues in an example paper, and how you might help the writer fix them.", "Interview Questions": "Tell me about your writing experience"}, {"date": "12 Oct 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "introduce yourself\r\ntell them about your goals\r\ntell them why you are interested in the company\r\nwhy do they should hire you\r\nwhat is your personal goals\r\nwhat skills do you have\r\nwhat experience do you have", "Interview Questions": "what skills do you have"}, {"date": "27 Oct 2017", "title": "Off-Campus Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at George Mason University (Fairfax, VA) in Sept 2015", "Interview Descriptions": "It was mainly a behavioral interview to make sure you would work well with the other students.  Questions revolved around being able to balance school and work and determine whether you're a people person or not.", "Interview Questions": "Describe a time when you had to resolve an issue between someone. "}, {"date": "26 Aug 2015", "title": "CSA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at George Mason University", "Interview Descriptions": "Same interviews for any job that you'd apply for. same questions, or questions you'd always expect to hear at a job interview. make sure you dress up and make sure you know a little bit of background information about them before you go.", "Interview Questions": "tell me about a time you had to work as a team to over come a difficult task."}, {"date": "26 Feb 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at George Mason University (Fairfax, VA) in Jun 2015", "Interview Descriptions": "I received an email saying that they are looking for to consider me for the position. Then I had a phone interview asking general behavioral questions and very basic technical questions.", "Interview Questions": "General questions and questions based on my resume."}, {"date": "23 Jan 2018", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at George Mason University (Fairfax, VA) in Apr 2015", "Interview Descriptions": "5 panel interview process, followed by a presentation on a college, one on one meeting with the undergraduate director of admissions and potential supervisor - senior assistant director of undergraduate admissions.", "Interview Questions": "In one word, how would you describe George Mason University"}], [{"date": "2 Nov 2016", "title": "Client Services Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at George Mason University (Fairfax, VA) in Apr 2015", "Interview Descriptions": "Very comfortable and easy.You sit with about 3 interviewers and they describe the tasks you are expected to do if hired.They ask mostly about how you deal with other people and focus on customer service.", "Interview Questions": "Describe how you handled a conflict within a work environment.\r\n\r\nWhat are your strengths and weaknesses?\r\n\r\nAre you able to think of solutions to problem on our own if everyone in the office may be working on something?How would you handle that situation?"}, {"date": "10 Mar 2015", "title": "Administrative and Office Specialist III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at George Mason University", "Interview Descriptions": "You must submit an online resume through the HR website to be considered, period. After my resume made the cut, they emailed me to do a phone screening. Once I passed that hurdle, I was called in for an in-person interview. Classified positions at Mason are always interviewed by committee, which can be intimidating if you've never done it before. But I enjoyed it, because it gave me a good feel for the group and culture.", "Interview Questions": "They phrased a potential difficult situation with a student, and asked how I would handle it."}, {"date": "20 Nov 2019", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at George Mason University (Manassas, VA) in Mar 2015", "Interview Descriptions": "Typical State government process: panel interview with standard questions asked of all candidates. There are usually 10 questions, and each person on the panel takes a turn asking a question and time is given to the other panel members to ask follow up questions.", "Interview Questions": "Experience working with the demographic that the department mainly served"}, {"date": "17 Jul 2017", "title": "Cta Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at George Mason University (Fairfax, VA) in Mar 2015", "Interview Descriptions": "It's a pretty relaxed interview with the standard questions. I feel as if what really matters is the availability you have to work there. If you are available when they need people, they will more than likely hire you.", "Interview Questions": "Why do you think you're suitable for the job?"}, {"date": "2 Jan 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at George Mason University in Jan 2015", "Interview Descriptions": "Good it was good experience, while doing my master. It is great job and good pay. \r\nstudent can get RA very easily to get job. professor are good and experience. I have enjoyed my RA. \r\nIt is learning process. simple and fair. \r\nNumber of interviews rounds are 3\r\ntechnical\r\nverbal\r\nintellectual\r\nbehavioral\r\n\r\nfinally you can get this job very easily.\r\nNo need to prepare before hand\r\nand you must have some connections with hydrabadis\r\nAlso with professor", "Interview Questions": "what is your name"}, {"date": "13 Jun 2019", "title": "Art Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at George Mason University in Jan 2015", "Interview Descriptions": "Like all other robot HR departments, Mason loves the \"behavioral,\" \"tell us of a time...\" interview. In the Office of Communications and Marketing, they've become addicted to the \"presentation\" interview. Which is flawed at its core, as how would you dare to make suggestions without any deeper knowledge of the inherent challenges.", "Interview Questions": "All behavioral. \"Can you tell us of a time when you had to...\""}, {"date": "24 Dec 2014", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at George Mason University", "Interview Descriptions": "I interviewed as a software developer with the Krasnow Institute for Advanced Study. There were several interviewers involved in the process. I spent approximately 15 minutes with each of them separately. General questions were asked about PHP development as well as basic MySQL syntax.", "Interview Questions": "N/A"}, {"date": "16 Nov 2017", "title": "Client Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at George Mason University (Fairfax, VA) in Dec 2014", "Interview Descriptions": "Very simple interview question with a panel of people. Basic questions were asked and nothing out the ordinary. I suggest making sure you know your resume well because they will go off that and your personality.", "Interview Questions": "Tell me about yourseld"}, {"date": "10 Jul 2017", "title": "Residential Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at George Mason University (Fairfax, VA) in Nov 2014", "Interview Descriptions": "There are two interviews on solo and one group after the initial application. The group interview has 3 rounds where you are judged while doing activities based on how you interact with others.", "Interview Questions": "Why do you want to work for housing?"}, {"date": "4 Oct 2014", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "The interview wasn't too formal, I was asked the generic interview questions. Interviewer was friendly and informative and answered all the questions I had. She was easy to talk to and she walked me thru the office and met everyone that worked there", "Interview Questions": "N/A"}], [{"date": "18 Oct 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at George Mason University (Richmond, VA) in Aug 2014", "Interview Descriptions": "I was emailed by the University about a Teaching Assistant requirement followed by an interview about my resume.Basic questions on electronics were asked and the courses I wished to teach.", "Interview Questions": "What is a Filter"}, {"date": "29 Dec 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at George Mason University (Fairfax, VA) in Aug 2014", "Interview Descriptions": "There was no interview, I was hired out of necessity. The department is under staffed and under funded, however this is due to the tenured faculty or the majority of them not having any current funding. So GTA stipends are paid by the college of science rather than by the department which is more of the norm.", "Interview Questions": "What labs would I be most comfortable teaching."}, {"date": "22 Jul 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at George Mason University (Fairfax, VA) in Aug 2014", "Interview Descriptions": "one on one. A screening interview is a type of job interview that is conducted to determine if the applicant has the qualifications needed to do the job for which the company is hiring. A screening interview is typically the first interview in the hiring process.\r\n\r\nA screening interview can be conducted over the phone or in-person. In both cases, the results of the screening interview will determine if the candidate moves to the next round of the interview process.", "Interview Questions": "About my staticstical knowledge"}, {"date": "12 Jul 2015", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at George Mason University (Fairfax, VA) in Aug 2014", "Interview Descriptions": "Over the phone assessment of the overall qualifications for the job description and how it would match to the required post in addition to the details of the proposed job and highlights of the specific tasks assosciated \r\nWhy I applied for that job ? where I see myself 5 years from now and the reason why it would be a value to hire me for the job", "Interview Questions": "Years of experience and the tasks related to the past job"}, {"date": "22 Feb 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at George Mason University in Aug 2014", "Interview Descriptions": "Interview process was standard. I just met the professor and director to discuss expectations.The courses taken and my expertise had to be displayed. Most of the responsibilities were outlined early on so I was clear what my responsibilities were. Very easy process.", "Interview Questions": "Straight forward questions regarding previous courses taken. Nothing too difficult."}, {"date": "2 Jul 2014", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "Contact by department, apply online. very smooth, no hard time. You have to be a full time student to get hired. They call you first to check your availability and background. One interview is from gta coordinator", "Interview Questions": "no difficult questions"}, {"date": "28 May 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at George Mason University (Fairfax, VA) in Jun 2014", "Interview Descriptions": "The interview process was relaxed and very informative about the position. I was interviewed on the phone, and then in person at the university. The interview consisted of normal strengths and weaknesses questions as well as working habits and professional abilities. It was ultimately a quick interview process and was generally responsive to my questions and concerns.", "Interview Questions": "What is your greatest strength?"}, {"date": "23 Mar 2014", "title": "Summer Instructor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at George Mason University", "Interview Descriptions": "Submit name and courses you want to teach to the department, and find two professors who are willing to recommend you. People with more teaching experience generally get what they want to teach and those with less experience may not get their desired class.", "Interview Questions": "As long as you have good support from the professor, they would give you a summer class to teach."}, {"date": "14 Mar 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at George Mason University", "Interview Descriptions": "Simple mention in the application for PhD program", "Interview Questions": "All was just fine."}, {"date": "18 Feb 2014", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "There are always two steps: The phone interview and the in-person interview. The most difficult part is that usually the in-person interview requires a presentation, even for some entry-level positions. \r\n\r\nEach department varies in the amount of time it takes to go through the process, but there isn't a ton of red-tape, so it can go very quickly.", "Interview Questions": "GMU lives by it's stated values, so stick to those. Also, you're going to want to practice for the presentation--I've seen too many top candidate bomb it and not get an offer."}], [{"date": "11 Apr 2014", "title": "Assistant & Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at George Mason University in Feb 2014", "Interview Descriptions": "I have had two experiences applying for two different positions with GMU, and neither in my opinion have been very professional.  The first position was posted on my graduate program's listserv, and I responded directly to the hiring individual whose e-mail was provided on the posting about a question I had regarding the position.  He answered my question so I then submitted my materials directly to the individual per his request.  I received no confirmation of  receipt. I followed up a week later and still no response.  I eventually just gave up and decided the person had hired someone else. \r\n\r\nSecond position I applied for, I applied online through the online system and went in for an in-person interview (panel). After the interview, they told me that they would be in touch after in a few weeks. I realized I didn't get the position after following up with them after the interview and receiving no response, not even a \"we've extended the offer to someone else e-mail\". I eventually found that the offer was extended to someone else after I went on LinkedIn and saw someone's profile with that title.  According to the online application system, however, my application is still \"in process,\" which still puzzles me.", "Interview Questions": "Why specifically do you want to work at George Mason?  I mentioned my reasons on my cover letter and even during the \"chit chat\" time before the interview so the question kind of stumped me because it was repetitive. "}, {"date": "21 Apr 2018", "title": "Art Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at George Mason University (Fairfax, VA) in Feb 2014", "Interview Descriptions": "Mine consisted of a single phone interview, followed by a final, in-person interview on campus in a large tech room with an off-campus interviewer. As it IS higher-ed, the process is insanely slow, so don't worry if you've not 'heard anything' for a minimum of a number of weeks... potentially, literally MONTHS.", "Interview Questions": "Again, the all-too-predictable  \"Behavioral\" questions... \"Tell us of a time when you...\" Usually something related to coping/dealing with problematic co-workers, clients etc."}, {"date": "24 Jul 2015", "title": "Immigration Processing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 days. I interviewed at George Mason University (Fairfax, VA) in Dec 2013", "Interview Descriptions": "I met with two members of the staff. It was a little intimidating, but mostly because of one member's personality so that wasn't an issue. They were quick to call for the second interview. Then I met with a larger group of the staff, in a more casual setting. This was my favorite interview thus far! Everyone was kind and open, made me feel very welcome immediately.", "Interview Questions": "What type of management style do you like?"}, {"date": "6 Sept 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at George Mason University", "Interview Descriptions": "The professor, liked my work in his class and hence hired me for this position, no questions or formal interview, only research interest.", "Interview Questions": "No question was asked"}, {"date": "16 Jan 2014", "title": "Principal Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at George Mason University (Manassas, VA) in Aug 2013", "Interview Descriptions": "I was given a choice of either coming to the office for an interview or being interviewed on the phone. I choose to come down because I live close by.", "Interview Questions": "What I want to accomplish in my future."}, {"date": "10 Feb 2014", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at George Mason University (Fairfax, VA) in Aug 2013", "Interview Descriptions": "very easy interview. Just asked me basic questions on Networking since my GTA was for Networking.", "Interview Questions": "Was told to build network on packet tracer. Hadn't used packet tracer that much before."}, {"date": "17 Nov 2015", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at George Mason University (Fairfax, VA) in Jul 2013", "Interview Descriptions": "All day, panel interview process. A 30 minute presentation was required as well as a role play. I interviewed individually with 2 people and 4 different panels.It was an extremely long day but fairly typical expectations in a higher ed setting.", "Interview Questions": "Tell me about a time you had to engage multiple stakeholders with conflicting priorities. What were the issues and how did you handle it?"}, {"date": "12 Jun 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at George Mason University (Fairfax, VA) in May 2013", "Interview Descriptions": "This process was not difficult at all. I Applied online, then had a phone interview and then an in-person interview.", "Interview Questions": "Within 3 weeks of submitting my online application, I was given a 15 minute phone screening by the hiring manager. This was not a difficult process at all. In fact, they were probably under-prepared. I would venture to say that I “turned the tables” on them because I had more questions than they did. A day later, I had the in-person interview. The next day, I got the offer via the phone."}, {"date": "28 Sept 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at George Mason University (Fairfax, VA) in May 2013", "Interview Descriptions": "Application process happens the term prior to the one you start working (i.e. a couple of months in advance). One on one interview with a procedural programming professor and supervisor. Questions about past experience, undergraduate coursework, basic procedural programming. Lasted max 30 minutes. He emailed me back a week or two later saying I'm hired, however, when I received the roster I found out that I was passed over to work for two different professors who were teaching information security classes. I was very happy about that because it was my area of choice to begin with.", "Interview Questions": "What is an array."}, {"date": "29 Feb 2016", "title": "Lab Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at George Mason University (Washington, DC) in May 2013", "Interview Descriptions": "the interview was very inefficient and boring, interviewers didn't ask professional questions, this job is more like a administrative assistant job than a lab manager job. as you can tell, lab manager needs to program and code but this job requires prepare paperwork and clean the lab.", "Interview Questions": "are you able to life heavy things"}], [{"date": "30 Nov 2013", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at George Mason University (Fairfax, VA) in Apr 2013", "Interview Descriptions": "This was for a part-time staff position. All applications go through Mason's HR group. I like the website they have and use. Applied through the main HR website in December 2012. Got an email in March from the department I applied to work for letting me know they were interested. Had a 30 minute phone interview with two folks; then met with a team of folks in person about a week later and a one-on-one interview with the head of the department. They got back to me by phone with an offer within a week of the in-person interviews, as promised.", "Interview Questions": "All questions were reasonable and as expected."}, {"date": "17 Jun 2014", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at George Mason University (Fairfax, VA) in Apr 2013", "Interview Descriptions": "Very simple--if you have the education and the desire, it's likely that George Mason University will hire you. Make sure that you are ready for teaching a lo of students as you're likely to be thrown a 100-level course unless you have some major expertise.", "Interview Questions": "Your teaching philosophy. A lot of schools still  use this outdated protocol. "}, {"date": "5 Mar 2013", "title": "Information Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at George Mason University (Arlington, VA)", "Interview Descriptions": "Very basic - asked for my résumé and the past work experiences", "Interview Questions": "None"}, {"date": "10 Mar 2016", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at George Mason University (Fairfax, VA) in Mar 2013", "Interview Descriptions": "Interview Process is lengthy and  Challenging if you are going for  technical position. The First Interview will probably be among 5 members  and if you are lucky for a 2nd interview probably just the Director or Supervisor.", "Interview Questions": "Do you have any experience (college or professional) with SQL or HTML"}, {"date": "7 Oct 2015", "title": "Services Concierge Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at George Mason University (Fairfield, OH) in Jan 2013", "Interview Descriptions": "After submitting the online forms and such through the GMU career website, we were called in for a group interview then an individual interview. Both interviews were conducted by panels of 4 or so people. The group interview involved some \"group process\" type activities to show how you problem solved in a group. The one-on-one interview was incredibly straightforward and was more about getting to know you than what you brought to the table as a candidate.", "Interview Questions": "What do you like about living on or off campus?"}, {"date": "11 Apr 2013", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at George Mason University (Fairfax, VA) in Jan 2013", "Interview Descriptions": "Interview is not much, asked about algorithms and how you deal with students in regard to homework solutions and previous experience", "Interview Questions": "N/A"}, {"date": "23 Aug 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at George Mason University (Fairfax, VA) in Sept 2012", "Interview Descriptions": "I applied for an available position post on HireMason at GMU portal. The course coordinator obtained my resume from HireMason at GMU portal and sent me an email to schedule an interview", "Interview Questions": "I was questions about my knowledge and experience in digital multimedia and the software. I was also asked to demonstrate my experience in the software"}, {"date": "25 Apr 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at George Mason University (Fairfax, VA) in Aug 2012", "Interview Descriptions": "My academic advisor helped me get this job but before that, he and I had 2 sessions talking about my previous jobs. Because he wanted to make sure I have required skills to work in a large group project.", "Interview Questions": "Did you ever have a large group experience working with Java?"}, {"date": "10 Jun 2013", "title": "Operations Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at George Mason University (Fairfax, VA) in Jun 2012", "Interview Descriptions": "Clean, quick, and professional. They did a good job of staying in touch with me throughout the process.", "Interview Questions": "If you were to manage an inter-racial conflict, how would you handle it?"}, {"date": "30 Mar 2013", "title": "Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at George Mason University (Fairfax, VA) in Apr 2012", "Interview Descriptions": "Submitted my resume through hire mason. Got an email couple of weeks later to schedule an interview. Interview was conducted by a RD (Residence Director) who asked basic behavioural interview questions (included customer service, why I'd like to work with the company, etc.). Didn't really ask about previous jobs. The interview lasted about 20-30 mins.", "Interview Questions": "How good am I with technology; most are easy if you have been in a customer service position before"}], [{"date": "5 May 2016", "title": "Graduate Research Assistant Neuroscience Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at George Mason University in Feb 2012", "Interview Descriptions": "it was easy with the principal investigator. He said \"you can do it\" We used PC-based psychological test batteries assessing attention, short-term memory  and questionnaries It was an awesome time to work for the department of psychology in outreach program overseas", "Interview Questions": "The university professor just said I need data from  minimum of hundred participants to draw inferences from the ageing study. Now I understand the trend towards big data because the variants are enormous and it requires statistical methods to understand what is going on in ageing brain and mind"}, {"date": "1 Dec 2015", "title": "Operations Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at George Mason University (Fairfax, VA) in Feb 2012", "Interview Descriptions": "Initially, I Interviewed with a search committee via a remote video connection.  This was friendly, not terribly stressful.  One search committee member was not present so I had a follow-up phone interview separately.  Followed up with several one on one interviews.  In addition, I met with prospective staff / direct reports.", "Interview Questions": "N/A"}, {"date": "7 Jul 2016", "title": "Information Technology Specialist I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at George Mason University (Fairfax, VA) in Jan 2012", "Interview Descriptions": "I applied online and received an email back within the following week. They asked if I could come in to interview and met three people that held different positions for the college (one of them was my current boss). The interview was very standard with general interview questions that everyone can answer. They then looked at my portfolio website and I walked them through it. Didn't take long at all.", "Interview Questions": "Strengths vs Weaknesses"}, {"date": "15 Aug 2015", "title": "GTA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at George Mason University (Fairfax, VA) in Nov 2011", "Interview Descriptions": "I took a tour of the university.  I spoke to the Graduate Advisor and two potential research advisors.  I had lunch in the cafeteria.  The interview was optional.  So, it was as much about seeing if the Mason community was a good fit for me, as it was about obtaining the position.", "Interview Questions": "What kind of research are you interested in?"}, {"date": "18 Sept 2012", "title": "Desk Assistant - Office of Housing and Residence Life Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at George Mason University (Fairfax, VA) in Aug 2011", "Interview Descriptions": "I submitted an application to OHRL and within 48 hours, Clair Shields contacted me with an interview. The interview was conducted in about 30 minutes, and were general questions.", "Interview Questions": "What makes you qualified for this NEW position?"}, {"date": "4 Apr 2013", "title": "Classroom SUpport Wage Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at George Mason University in Aug 2011", "Interview Descriptions": "Phone call for scheduling an interview and then one on one interview", "Interview Questions": "N/A"}, {"date": "6 May 2012", "title": "Web Development Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at George Mason University (Fairfax, VA) in Jul 2011", "Interview Descriptions": "previous experience in web development and then asked me if I have experience in php. The interviewer also asked of the tools i used for developing website.", "Interview Questions": "Do you have experience in scripting languages specifically in php?"}, {"date": "16 Jan 2013", "title": "Assistant Webmaster Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at George Mason University (Fairfax, VA) in May 2011", "Interview Descriptions": "one onsite interview", "Interview Questions": "simple interview asked about my strength weakness and checked if I can learn new technologies"}, {"date": "26 Apr 2012", "title": "Multimedia Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at George Mason University (Fairfax, VA) in Feb 2011", "Interview Descriptions": "The supervisors asked me about my experience in terms of technical skills. They asked me if I knew 2d Animation in Flash and understood keyframing. They ask about customer service questions. One of the questions was how did I deal a difficult situation where the other person was unable to understand what I was trying to tell them. For example, the customer does not understand how keyframing works even though I tried explained how it works in Flash. How would you get your idea across?", "Interview Questions": "The customer does not understand what you're trying to say and is getting frustrated because their project is due soon. What do you do?"}, {"date": "16 Jan 2014", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at George Mason University (Fairfax, VA) in May 2010", "Interview Descriptions": "Was contacted through a friend who worked at the university. Department was looking to fill a vacated spot on the staff. After phone interview and forwarding of transcripts to verigy educational qualifications, appeared for an in person interview.", "Interview Questions": "Went over experience on resume with other staff members. Answered questions on technical background. There were any overly difficult questions, just coverage of all items mentioned on resume."}], [{"date": "5 Aug 2010", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at George Mason University (Fairfax, VA) in Jan 2010", "Interview Descriptions": "It was at a time of transition an so it took a while longer than I would have thought.", "Interview Questions": "How would you describe good customer service?"}, {"date": "18 Feb 2010", "title": "Engineering Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at George Mason University (Fairfax, VA) in Aug 2009", "Interview Descriptions": "Panel Interview after phone interview", "Interview Questions": "The interview was a list of questions and then a few behavioral questions"}]]