[[{"date": "2 Dec 2022", "title": "Ayudante - Ayudante General Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Fauna & Flora International", "Interview Descriptions": "Sencillo y agil. Una conversació promedio donde se habla de cosas generales como todas las entevistas en particilar no tiene nada de dificil o especial asi que recomiendo sin nervios", "Interview Questions": "Donde vivis Que te gusta hacer Expectativas"}, {"date": "24 Nov 2022", "title": "Technical Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fauna & Flora International", "Interview Descriptions": "The interview itself was well structured and followed guidelines. However, communication was not delivered when responding to applicants about their decision. I was left waiting two weeks to hear back with no explanation and then left another two weeks for feedback which was written poorly and inapropriate.", "Interview Questions": "Skills, Experiences, Behaviour, and all sorts of generic questions that are scenario based."}, {"date": "6 Sept 2022", "title": "Programme Officer, Conservation Science & Design Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fauna & Flora International in Aug 2022", "Interview Descriptions": "The interview was around 1 h long with two workers of the department. They were very friendly and the questions they asked all related to the competences needed for the job.\nAdditionally I was sent a project proposal and had to answer the person who wrote it with comments on the strengths of the application and  suggestions on improvements", "Interview Questions": "How would you approach x situation\nTell me about a situation in which you had to work in a team and your role in the group\nWhat do you think are the challenges conservation organisations face currently\nWhat do they have to focus on\nWhich of the values of our organisation do you identify with the most and why"}, {"date": "26 Sept 2020", "title": "Programmer Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Fauna & Flora International", "Interview Descriptions": "HR don't even acknowledge receipt of your application, let alone get back to you about the result. This is such a shame as the company appears really excellent and I have applied to multiple roles within FFI, yet the experience is always the same.\r\n\r\nI understand when applying to positions at small companies this may be the case, however each application has its own member of HR assigned, it's really not difficult to send a generic 'we received your application'.\r\n\r\nThis feels particularly demotivating in the current jobs market, shame on you FFI.", "Interview Questions": "N/A"}, {"date": "12 Feb 2023", "title": "Operations Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fauna & Flora International in Jun 2019", "Interview Descriptions": "Very easy and lovely approach from the interviewers. Apparent that FFI values were very important. Were open to internal training and add it comfortable and not scary, everyone i met was really lovely", "Interview Questions": "How my experience would impact the organisation"}, {"date": "9 Apr 2015", "title": "Green Knowledge Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Fauna & Flora International (Jakarta) in Mar 2015", "Interview Descriptions": "Interview session via phone but not sufficent interview time. interview question to general. need more deep elaboration to get better interview. intangible strengths and soft skills not explored enough. good environment and condition from interviewer. the interview did not have a good idea\r\nof the core of my strengths  would bring to the job, and then take the chance\r\nto highlight those skills with my answer. For example, if i want to\r\nemphasize my organizational skills in a particular interview, i might tell\r\na story of how i organized an elaborate fundraiser at my child’s school,\r\nor how i were the president of a particular club at university.", "Interview Questions": "what do you reckon/know for the vacant position"}]]