[[{"date": "11 Jan 2023", "title": "Project Support Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Counterpart International", "Interview Descriptions": "standard and friendly not too formal. first interview with a recruiter and second one with a panel and then final interview with the recruiter who told me I was selected for the position and then communicated the benefits package and offer through email", "Interview Questions": "stabdard interview question about experience and responsibilities"}, {"date": "14 Nov 2022", "title": "Security Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Counterpart International", "Interview Descriptions": "Interview process was not objective. The interviewees were not objective and the HR was very rude she asked me very irrelevant questions. Also the job offered was done in a hurried manner with no proper engagement and time to consult", "Interview Questions": "How old are you today? When can star"}, {"date": "27 Apr 2022", "title": "Senior Director, Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Counterpart International", "Interview Descriptions": "The first step was to apply online via a portal. I was asked to come in for an in-person interview to meet with three people from separate departments. The second interview consisted of a presentation on strategy prepared by me for the organization and another panel.", "Interview Questions": "What would you recommend for our communications strategy?"}, {"date": "5 Mar 2022", "title": "Chief of Party Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Counterpart International", "Interview Descriptions": "It happened in 3 rounds and it was magical, like in a movie. I was just so happy to take an interview with them, it was just a blast and you need to try too", "Interview Questions": "Do you believe in you? "}, {"date": "18 Dec 2018", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Counterpart International", "Interview Descriptions": "Short phone screen with a recruiter followed by an in-person interview partially in person and partially over Skype. Received several emails saying they were interviewing other candidates and would get back followed by nothing from the recruiter, no follow-up and no response to my inquiries. First job application process where I have ever been \"ghosted.\"", "Interview Questions": "Basic background questions, experience in international development"}, {"date": "12 Jul 2018", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Counterpart International (Arlington, VA)", "Interview Descriptions": "Received HR call to schedule interview after a call from the program manager.. Then had in person interview followed by written test.. The whole process took around a month", "Interview Questions": "How did you hear about the job? "}, {"date": "29 May 2018", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Counterpart International", "Interview Descriptions": "Phone screening followed by an in-person interview. A second in-person is required before the final decision. However, I didn't make it to this point in the process.\r\n\r\nThe interviewers were personable and made the conversation fun. My main issue is that I was promised follow-up from HR - regardless of outcome - that never came. This is one of my ultimate pet peeves. If I hadn't emailed to check on the status of my application (two weeks after the interview) I wouldn't have heard anything at all. Follow-up was promised within 3 days of the initial in-person.", "Interview Questions": "What is your experience with USAID rules and regulations?"}, {"date": "8 Dec 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Counterpart International", "Interview Descriptions": "very straight forwards interview, all questions you would expect a hiring manager to ask. They asked about school, job experience.  They basically just wanted to get to know the interviewee", "Interview Questions": "asked about job experiences "}, {"date": "14 Nov 2016", "title": "Business Development Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Counterpart International (Washington, DC) in Jul 2016", "Interview Descriptions": "I had a screening interview with a recruiter, a written test, and another interview with the development team. I then was told I was moving forward with a second interview with management and to prepare a 15 minute presentation about a hypothetical project. However, despite being told I would be contacted the following week to set up a time to present, they never contacted me again.  I emailed all the contacts I had been given (three by that point) several weeks later, and no one bothered to even return the emails. I could not believe how unprofessional and inconsiderate this hiring team was, and would absolutely never work for this organization or recommend that someone waste their time interviewing with them.", "Interview Questions": "What grant applications have you worked on?"}, {"date": "26 Jun 2016", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Counterpart International", "Interview Descriptions": "I first interviewed with the HR person in the field and then the COP. Both interviews went really well. Then I had a phone interview with the home office, which I also thought went well. I sent thank-you emails every time, followed up with the home office, and never heard back from them. Not even a form letter saying \"thanks for your interest; we decided to go with someone else.\"", "Interview Questions": "What is your greatest weakness? Why do you want this job?"}], [{"date": "30 Apr 2016", "title": "Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Counterpart International in Apr 2016", "Interview Descriptions": "Negative experince,  bulish discussion, all with the end agenda to make me lower my salary expectations. \r\n\r\nOff course I decline there offers. \r\n\r\nA place to be avoided in the future! \r\n\r\nLack of seriousness in there preparation for the interview,  no previous background checks not even an eye drop on my CV and qualifications. \r\nOnly one terrible issue : my wage demands!", "Interview Questions": "Why I have such high salary expectations?"}, {"date": "6 May 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Counterpart International (Arlington, VA) in Feb 2015", "Interview Descriptions": "Applied online and received invite for an interview 2 weeks later. Due to schedules interview was scheduled much later. Very flexible and offered to do a Skype interview since I wasn't living in the area (although I was willing to travel for the interview). Asked general/predictable questions about my qualifications for the job. Interviewers were not highly practiced but personable and made me feel comfortable with the company. Heard back within 2 business days and started the next week.", "Interview Questions": "Describe your experience [relevant to the position]?"}, {"date": "2 Mar 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Counterpart International (Arlington, VA) in Mar 2012", "Interview Descriptions": "I applied through the online system. I had one interview with two manager-level people who vetted me more for technical knowledge, and then a second interview with the program officers/assistants and the team director that seemed to be more about personality meshing. I heard back within a week that I had gotten the job and I started right away.", "Interview Questions": "Interview was focused on international development knowledge, language abilities, career aspirations - this was for an internship after all."}, {"date": "2 May 2013", "title": "Senior Program Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Counterpart International (Arlington, VA) in Sept 2011", "Interview Descriptions": "My resume was submitted for a grant proposal. After it was accepted, I was interviewed by phone by the business development team and group manager. The process was mainly a formality. About a month later I was contacted and given hiring information. They never requested an in-person meeting before asking me to sign a commitment letter, which I thought was odd.", "Interview Questions": "There was nothing unexpected or difficult."}, {"date": "24 Aug 2012", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Counterpart International (Arlington, VA) in Feb 2011", "Interview Descriptions": "only one interview and no phone screening !!", "Interview Questions": "None. "}, {"date": "27 Jun 2012", "title": "Program Management Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Counterpart International in Mar 2010", "Interview Descriptions": "Overall the interview process was good. Professional and the impression the interviewers gave was positive.", "Interview Questions": "What is your management style?"}, {"date": "7 Nov 2013", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Counterpart International (Arlington, VA) in Jan 2009", "Interview Descriptions": "2 months long, interrupted and then re-started before finally being hired.", "Interview Questions": "Future direction of the firm (Strategic Vision)"}]]